{"1999_ACM_SIGMOD_Workshop_on_Res":[{"venue":"1999 ACM SIGMOD Workshop on Research Issues in Data Mining and Knowledge Discovery","id":"b58f47161b4d64571655a79b2243bb2a581df0d2","venue_1":"1999 ACM SIGMOD Workshop on Research Issues in Data Mining and Knowledge Discovery","year":"1999","title":"Scalable Spreadsheets for Interactive Data Analysis","authors":"Vijayshankar Raman, Andy Chou, Joseph M. Hellerstein","author_ids":"1731987, 2882783, 1695576","abstract":"Interactive responses and natural, intuitive controls are important for data analysis. We are building ABC, a scal-able spreadsheet for data analysis that combines exploration , grouping, and aggregation. We focus on interactive responses in place of long delays, and intuitive, direct-manipulation operations in place of complex queries. ABC allows analysts to interactively explore the data at varying granularities of detail using a spreadsheet. Hypotheses that arise during the exploration can be checked by dynamically computing aggregates on interactively chosen groups of data items. In this paper we describe our vision for ABC. We give examples that illustrate the need for interactivity in query processing and query formulation, the advantages of dynamic group formulation, and the usefulness of exploration in discovering hypotheses about data that can then be veriied by aggregation. We brieey discuss the systems issues involved in building ABC, and mention our progress so far.","cites":"12","conferencePercentile":"85.71428571"},{"venue":"1999 ACM SIGMOD Workshop on Research Issues in Data Mining and Knowledge Discovery","id":"3aa8317aa996e23127d3fcf003de0acfd65f9ba3","venue_1":"1999 ACM SIGMOD Workshop on Research Issues in Data Mining and Knowledge Discovery","year":"1999","title":"Plan Mining by Divide-and-Conquer","authors":"Jiawei Han, Qiang Yang, Edward Kim","author_ids":"1722175, 1733090, 1904114","abstract":"Plans or sequences of actions are an important form of data. With the proliferation of database technology, plan databases (or planbases) are increasingly common. EEcient discovery of important patterns of actions in plan databases presents a challenge to data mining. In this paper, we present a method for mining signiicant patterns of successful actions in a large planbase using a divide-and-conquer strategy. The method exploits multi-dimensional generalization of sequences of actions and extracts the inherent hierarchical structure and sequential patterns of plans at diierent levels of abstraction. These patterns are used in turn to subsequently narrow down the search for more speciic patterns. The process is analogous to the use of divide-and-conquer methods in hierarchical planning. We illustrate our approach using a travel planning database.","cites":"9","conferencePercentile":"64.28571429"}]}