{"3DIC.csv":[{"venue":"3DIC","id":"2a7bb4627bc22e2a53dfab8a850f683444f7fad6","venue_1":"3DIC","year":"2010","title":"Real-time thermal management of 3D multi-core system with fine-grained cooling control","authors":"Hanhua Qian, Xiwei Huang, Hao Yu, Chip-Hong Chang","author_ids":"3185793, 3033516, 1745355, 1725939","abstract":"— This paper presents a cyber-physical (real-time sense-predict-adjust) thermal management for 3D multi-core system by micro-fluidic cooling. Auto Regressive (AR) model is used to predict future workload and the prediction is furnished by Kalman filtering to get rid of noises due to system variation. A thermal model is developed to sense thermal behaviour of the 3D system including micro-fluidic channels and estimate future thermal demand. The use of fine-grained, or non-uniform, flow-rate control with channel clustering is then incorporated to adjust flow-rates based on the predicted future thermal demand in a real-time fashion. Experiment results show that under this cyber-physical scheme, the temperature of 3D multi-core cache-processor system is well maintained below threshold and a more even temperature distribution is achieved with lower fluid-pump power or total flow-rate overhead. For example, the total flow-rate has a significant reduction of 72.1% under the fine-grained flow rate control 1. I. INTRODUCTION Multi-processor system-on-chip (MPSoC) [1-2] has become an attractive alternative to meet the performance needs of emerging applications, while limiting the power consumption through the use of multiple processors with specific functionalities. However, design challenges remain if the number of cores increases to tens or hundreds of microprocessors due to the limited bandwidth and integration density in 2D. By dividing the multiple processors onto smaller dies and then stacking them together with short vertical interconnects, 3D integration technology [3-9] breaks down the bandwidth limitation such as the \"memory wall\" problem seen in conventional 2D cache-processor designs. Due to the extremely high power density together with the prolonged heat-removal path, thermal management becomes the dominant hurdle when designing for the many-core system. Hence, there is an urgent need to provide effective heat removal method and real-time thermal control scheme for 3D MPSoC design. Previous thermal managements [10-12] of 2D microprocessors mainly assume one temperature demand based on the static power consumption. Due to the use of the dynamic power management and real-time workloads, the temperature demand is time-varying. To aid real-time","cites":"1","conferencePercentile":"37.5"},{"venue":"3DIC","id":"3232c868b4835674bf351829edab5526f6e46a83","venue_1":"3DIC","year":"2009","title":"3-D memory organization and performance analysis for multi-processor network-on-chip architecture","authors":"Awet Yemane Weldezion, Zhonghai Lu, Roshan Weerasekera, Hannu Tenhunen","author_ids":"2492056, 1713782, 2185172, 1680588","abstract":"Several forms of processor memory organizations have been in use to optimally access off-chip memory systems mainly the Hard disk drives (HDD). Recent trends show that the solid state drives – (SSD) such as flash memories replacing HDDs and multi-processor memory system realized in a single 3-D structure with network-on-chip (NOC) architecture as a communication medium. This paper discusses high level memory organization and architectural modeling and simulation based on 3-D NOC. A comparative analysis among several models including Dance-hall, Sandwich, Terminal, Per-layer and mixed architectures is done. Simulations in cycle accurate 3-D NOC VHDL model are done to evaluate the performance each architecture in uniform and local traffic patterns.","cites":"5","conferencePercentile":"55.26315789"},{"venue":"3DIC","id":"24d8e4d84e19ad7fe7396a8205eea618b6de1465","venue_1":"3DIC","year":"2011","title":"Using NEM relay to improve 3DIC cost efficiency","authors":"Tao Zhang, Guangyu Sun","author_ids":"1743147, 1695860","abstract":"—This paper investigates the integration of Nanoelec-tromechanical (NEM) relays on top of TSVs, to reduce area overhead and also enable possible novel architecture design. NEM relay is used in this work to reduce the cost due to the removal of area overhead caused by TSV redundancy logic and the improvement of TSV reliability. Furthermore, novel memory architecture design with NEM relay is proposed to improve the cost efficiency by leveraging the switch made by NEM relay. The general-purpose memory can be reused in different designs, which allows the memory to be massively produced and thus amortizes the NRE cost. The experimental results show that the 3DIC chip can achieve 13.5% cost reduction with NEM relay integration.","cites":"0","conferencePercentile":"17.85714286"},{"venue":"3DIC","id":"c0a4c4837a1b1ca47c3b79eb6680a629fa25b851","venue_1":"3DIC","year":"2009","title":"Investigation and comparison of thermal distribution in synchronous and asynchronous 3D ICs","authors":"Brent Hollosi, Tao Zhang, Ravi Sankar Parameswaran Nair, Yuan Xie, Jia Di, Scott C. Smith","author_ids":"3283601, 1743147, 2299597, 1679374, 8488301, 5019982","abstract":"This paper presents an analysis and comparison between synchronous and delay-insensitive asynchronous logic circuits on thermal distributions for investigating novel solutions to the heat dissipation problem in three-dimensional ICs. Due to the spatial and temporal distribution of switching activities in delay-insensitive asynchronous circuits, the thermal density as well as the temperature is largely reduced. Results show that the sample delay-insensitive asynchronous circuit exhibits lower average temperature and more uniform thermal distribution compared to it's synchronous counterpart.","cites":"1","conferencePercentile":"13.15789474"},{"venue":"3DIC","id":"5df3daac3e8679c890d953ee3eb2ae83295de90a","venue_1":"3DIC","year":"2011","title":"Global Built-In Self-Repair for 3D memories with redundancy sharing and parallel testing","authors":"Xiaodong Wang, Dilip P. Vasudevan, Hsien-Hsin S. Lee","author_ids":"7136549, 1754036, 1752397","abstract":"3D integration is a promising technology that provides high memory bandwidth, reduced power, shortened latency, and smaller form factor. Among many issues in 3D IC design and production, testing remains one of the major challenges. This paper introduces a new design-for-test technique called 3D-GESP, an efficient Built-In-Self-Repair (BISR) algorithm to fulfill the test and reliability needs for 3D-stacked memories. Instead of the local testing and redundancy allocation method as most current BISR techniques employed, we introduce a global 3D BISR scheme, which not only enables redundancy sharing, but also parallelizes the BISR procedure among all the stacked layers of a 3D memory. Our simulation results show that our proposed technique will significantly increase the memory repair rate and reduce the test time.","cites":"2","conferencePercentile":"82.14285714"},{"venue":"3DIC","id":"1fec81f8dc47e0c28a37c147fee974d752ac63fc","venue_1":"3DIC","year":"2009","title":"Compact modelling of Through-Silicon Vias (TSVs) in three-dimensional (3-D) integrated circuits","authors":"Roshan Weerasekera, Matt Grange, Dinesh Pamunuwa, Hannu Tenhunen, Li-Rong Zheng","author_ids":"2185172, 3238557, 3159829, 1680588, 1717008","abstract":"—Modeling parasitic parameters of Through-Silicon-Via (TSV) structures is essential in exploring electrical characteristics such as delay and signal integrity (SI) of circuits and interconnections in three-dimensional (3-D) Integrated Circuits (ICs). This paper presents a complete set of self-consistent equations including self and coupling terms for resistance, capacitance and inductance of various TSV structures. Further, a reduced-order electrical circuit model is proposed for isolated TSVs as well as bundled structures for delay and SI analysis, and extracted TSV parasitics are employed in Spectre simulations for performance evaluations. Critical issues in the performance modeling for design space exploration of 3-D ICs such as cross-talk induced switching pattern dependent delay variation and cross-talk on noise are discussed. The error in these metrics when using the proposed models as compared to a field solver is contained to a few percentage points. I. INTRODUCTION An exciting new paradigm in VLSI technology is 3-D integration based on die or chip stacking, providing opportunities for integration of heterogeneous technologies, reduction of form factor, improvements in performance and power and energy consumption through reduction in average intercon-nection length, as well as a host of other potential advantages [1], [2]. The 3-D integration technologies that hold out the most potential involve stacking at the wafer or die level, with interlayer interconnections established through wafers. From a system designer's point of view, the electrical characteristics of the TSVs dictate many aspects of the communication architecture of an IC laid out in a 3-D topology. In order to analyze electrical behavior including delay, SI, and PI of a 3-D stacked chip, it is desirable to mirror well established practices in electronic design automation, and model the physical TSV structure as a collection of parasitic components in an equivalent circuit. The wealth of models and methodologies available for planar on-chip wires do not however exist for TSVs, and simulating the entire interconnect structure in a field solver for parasitic extraction would take an unacceptably high amount of computational time and limit design space exploration. Therefore, compact models to obtain TSV parasitic components as a function of the physical geometry and material properties are essential in reducing run time in 3-D IC design. This work reports closed-form models for resistive, capac-itive and inductive parameters of TSVs including coupling","cites":"15","conferencePercentile":"89.47368421"},{"venue":"3DIC","id":"43e459227b9c3add7e47d5b1a12f6da56bee44d2","venue_1":"3DIC","year":"2009","title":"Arithmetic unit design using 180nm TSV-based 3D stacking technology","authors":"Jin Ouyang, Guangyu Sun, Yibo Chen, Lian Duan, Tao Zhang, Yuan Xie, Mary Jane Irwin","author_ids":"1732122, 1695860, 3021291, 1740786, 1743147, 1679374, 1748258","abstract":"— We describe the design of two three dimensional arithmetic units (a 3D adder and a 3D multiplier) that are implemented using through-silicon-via 3D stacking technology. Compared to their 2D counterparts, our 3D adder incurs 10.6– 34.3% less delay and 11.0–46.1% less energy when the width increases from 12-bit to 72-bit; the 32×32 3D multiplier incurs 14.4% less delay and 6.8% less energy, according to the post place and route results. The prototype chip including the implementations of a 3D adder, a 3D multiplier, and simple test interface has been delivered for fabrication in MIT Lincoln Laboratory, using their 3-tier SOI based 3D technology.","cites":"7","conferencePercentile":"65.78947368"},{"venue":"3DIC","id":"f8e4a282fec36edbe3c62740e6e2a73256ae32ea","venue_1":"3DIC","year":"2013","title":"A scalable multi-dimensional NoC simulation model for diverse spatio-temporal traffic patterns","authors":"Awet Yemane Weldezion, Matt Grange, Dinesh Pamunuwa, Axel Jantsch, Hannu Tenhunen","author_ids":"2492056, 3238557, 3159829, 8322060, 1680588","abstract":"—This paper describes a powerful simulation platform that enables accurate simulations of numerous network configurations under realistic traffic patterns to predict the performance and power needs of a 3-D integrated system early in the design flow. The simulation platform can model virtually any sized 2-D or 3-D network configuration, providing low-cost and fast trade-off evaluations of various systems architectures. The network simulator uses scalable RTL-level models that can be used for accurate power and timing analyses. We demonstrate the capability of our simulation model by analyzing the performance of various network topologies under spatio-temporal traffic patterns to show how the network topology can be adjusted to meet the performance requirements of a design before it is manufactured. The simulation results can be used to optimize the placement of cores and communication buses early in the flow. By using the model, standard applications such as mobile application processor, femto-cell base-stations on-chip and wide-IO TSV memory stacking can be simulated.","cites":"2","conferencePercentile":"68.42105263"},{"venue":"3DIC","id":"23cabfc6a3580024d38ead030d68419b60966731","venue_1":"3DIC","year":"2010","title":"3D memory stacking for fast checkpointing/restore applications","authors":"Jing Xie, Xiangyu Dong, Yuan Xie","author_ids":"5035226, 2552898, 1679374","abstract":"—As technology scales, modern massive parallel processing (MPP) systems are facing large system overhead caused by high failure rates. To provide the system-level fault tolerance, the traditional in-disk checkpointing/restart schemes are usually adopted by periodically dumping system states and memory contents to hard disk drives (HDDs). When errors occur, the system can be restored by reading checkpoints from HDDs. The low bandwidth and slow speed of HDDs are now becoming the major bottleneck for the MPP system performance. Consequently , novel checkpointing schemes are need to facilitate the move from Petascale computing to Exascale computing. We have proposed a 3D memory stacking method [1] that leverage the massive number of TSVs between memory layers to help high-bandwidth checkpointing/restore. To validate the proposed scheme, we design a 2-layer TSV-based SRAM/SRAM 3D-stacked chip to mimic the high-bandwidth and fast data transfer from one memory layer to another memory layer, so that the in-memory checkpointing/restartrestore scheme can be enabled for the future exascale computing. The capacity of each SRAM layer is 1Mbit. Each layer contains 64 banks, with each bank contains 256 words and the word length is 64-bit. The final footprint including I/O pad is 2.9mm × 2mm. The SRAM dies were taped out in GlobalFoundries using its 130nm low power process, and the 3D stacking was done by using Tezzaron's TSV technology. The prototyping chip can perform checkpointing/restart at the speed of 4K/cycle with 1Ghz clock.","cites":"3","conferencePercentile":"65.625"},{"venue":"3DIC","id":"a423ce8e7e76e11294859ddcfdeae60747203a3e","venue_1":"3DIC","year":"2011","title":"Design exploration of 3D stacked non-volatile memory by conductive bridge based crossbar","authors":"Yuhao Wang, Chun Zhang, Revanth Nadipalli, Hao Yu, Roshan Weerasekera","author_ids":"6776608, 7138072, 2005662, 1745355, 2185172","abstract":"—Non-volatile memory (NVM) is one recent promising solution to build the next generation of memory system. Compared to other non-volatile devices such as flash, phase-change random-access-memory (PCRAM), memristor and etc., the emerging conductive-bridge random-access-memory (CBRAM) has shown advantages in accessing speed, power and endurance. In this paper, design of 3D-stacked NVM is explored with the use of CBRAM-crossbar. Specifically, accurate performance modeling of CBRAM-crossbar structure is studied within the corresponding design platform developed at device and system levels. Experiments show that, compared to PCRAM, the proposed CBRAM-crossbar based memory achieves 10x∼100x faster accessing time, at least 100x less operation power, and 100x longer endurance.","cites":"0","conferencePercentile":"17.85714286"},{"venue":"3DIC","id":"3acb831e9f8899d61e86f5802ad479b4032faef2","venue_1":"3DIC","year":"2013","title":"High-speed and low-power 2.5D I/O circuits for memory-logic-integration by through-silicon interposer","authors":"Jiacheng Wang, Shunli Ma, Sai Manoj Pudukotai Dinakarrao, Mingbin Yu, Roshan Weerasekera, Hao Yu","author_ids":"1797174, 2945312, 2389278, 1830762, 2185172, 1745355","abstract":"—In this paper, two high-speed and low-power I/O circuits are developed using through-silicon-interposer (TSI) for 2.5D integration of multi-core processor and memory in 65nm CMOS process. For a 3mm TSI interconnection of transmission line (T-line), the first I/O circuit is a low-voltage-differential-signal (LVDS) buffer and the second one is a current-mode-logic (CML) buffer. To compensate the high-frequency loss from T-line, a pre-emphasis circuit is deployed in the LVDS buffer, and a wide-band inductor-matching is deployed in the CML buffer. Based on the post layout simulation results, the LVDS buffer can achieve 360mV peak-to-peak differential output signal swing and 563fs cycle-to-cycle jitter with 10Gb/s bandwidth and 4.8mW power consumption. The CML buffer can achieve 240mV peak-to-peak differential output signal swing and 453fs jitter with 12.8Gb/s data-rate and 1.6mA current consumption under 0.6V ultra low-power supply.","cites":"3","conferencePercentile":"84.21052632"},{"venue":"3DIC","id":"0a99a0cc0b4362522997bcb2f370c029997fd736","venue_1":"3DIC","year":"2010","title":"A 3D SoC design for H.264 application with on-chip DRAM stacking","authors":"Tao Zhang, Kui Wang, Yi Feng, Yan Chen, Qun Li, Bing Shao, Jing Xie, Xiaodi Song, Lian Duan, Yuan Xie, Xu Cheng, Youn-Long Lin","author_ids":"1743147, 1694384, 1842013, 1700696, 1686663, 2622069, 5035226, 3084263, 1740786, 1679374, 5712296, 1736899","abstract":"—Three-dimensional (3D) on-chip memory stacking has been proposed as a promising solution to the \" memory wall \" challenge with the benefits of low access latency, high data bandwidth, and low power consumption. The stacked memory tiers leverage through-silicon-vias (TSVs) to communicate with logic tiers, and thus dramatically reduce the access latency and improve the data bandwidth without the constraint of I/O pin count. To demonstrate the feasibility of 3D memory stacking, this paper introduces a 3D System-on-Chip (SoC) for H.264 applications that can make use of multiple memory channels offered by 3D integration. Two logic tiers are stacked together with each having an area of 2.5×5.0mm 2 , with a 3-layer 8-channel 3D DRAM stacked on the top. The design flow for this 3D SoC is also presented. The prototype chip has been fabricated with GlobalFoundries' 130nm low-power process and Tezzaron's 3D TSV technology. The 3D implementation shows that the 3D ICs can alleviate the pressure from I/O pin count and allow parallel memory accesses through multiple channels.","cites":"11","conferencePercentile":"93.75"},{"venue":"3DIC","id":"0bc0a4d99317b40316784b7cb642634c5929062a","venue_1":"3DIC","year":"2009","title":"Electrical-thermal co-analysis for power delivery networks in 3D system integration","authors":"Jianyong Xie, Daehyun Chung, Madhavan Swaminathan, Michael McAllister, Alina Deutsch, Lijun Jiang, Barry J. Rubin","author_ids":"1806661, 2793228, 1787265, 1733398, 2140326, 5640231, 2582401","abstract":"In this paper, an electrical-thermal co-analysis method for power delivery networks in 3D system integration is proposed. For electrical analysis, temperature-dependent electrical resistivity of conductors is taken into account. For thermal analysis, Joule heating effect due to the current flowing through conductors is considered. The proposed co-analysis method is carried out using Rgen and ChipJoule of IBM EIP Tool Suite. An example of 3D integration system including stacked chips, power delivery network, glass-ceramic substrate, through-silicon vias, controlled collapse chip connections (C4s), underfill material, and TIM is analyzed using the proposed method. The simulation results show that the temperature effect on IR drop can not be neglected. The error of not considering thermal effect on IR drop is about 20% in the example.","cites":"2","conferencePercentile":"26.31578947"}]}