{"3DIM.csv":[{"venue":"3DIM","id":"6f0430211147ddb8514e6d8fdcd9eba19d5d69b4","venue_1":"3DIM","year":"2001","title":"3D Capture for Computer Graphics","authors":"Holly E. Rushmeier","author_ids":"1690595","abstract":"We examine the use of 3D scanned objects in computer graphics applications. We consider the requirements for the types and resolution of data required. We also identify some outstanding research issues in this area.","cites":"4","conferencePercentile":"20.37037037"},{"venue":"3DIM","id":"96083824c8ccefce8e92771080da6bc941476acc","venue_1":"3DIM","year":"2005","title":"Shape Reconstruction of Human Foot from Multi-Camera Images Based on PCA of Human Shape Database","authors":"Jiahui Wang, Hideo Saito, Makoto Kimura, Masaaki Mochimaru, Takeo Kanade","author_ids":"3067121, 1724105, 8525518, 1793121, 7642093","abstract":"Recently, researches and developments for measuring and modeling of human body are taking much attention. Our aim is to capture accurate shape of human foot, using 2D images acquired by multiple cameras, which can capture dynamic behavior of the object. In this paper, 3D active shape models is used for accurate reconstruction of surface shape of human foot. We apply Principal Component Analysis (PCA) of human shape database, so that we can represent human's foot shape by approximately 12 principal component shapes. Because of the reduction of dimensions for representing the object shape, we can efficiently recover the object shape from multi-camera images, even though the object shape is partially occluded in some of input views. To demonstrate the proposed method, two kinds of experiments are presented: high accuracy reconstruction of human foot in a virtual reality environment with CG multi-camera images and in real world with eight CCD cameras. In those experiments, the recovered shape error with our method is around 2mm, while the error is around 4mm with volume intersection method.","cites":"2","conferencePercentile":"34.54545455"},{"venue":"3DIM","id":"0cb522e5eddb0db6d03ee21f5e05819317f92226","venue_1":"3DIM","year":"2007","title":"Predetermination of ICP Registration Errors And Its Application to View Planning","authors":"Kok-Lim Low, Anselmo Lastra","author_ids":"2924341, 2535203","abstract":"We present an analytical method to estimate the absolute registration error bounds if two surfaces were to be aligned using the ICP (Iterative Closest Point) algorithm. The estimation takes into account (1) the amount of overlap between the surfaces, (2) the noise in the surface points' positions, and (3) the geometric constraint on the 3D rigid-body transformation between the two surfaces. Given a required confidence level, the method of estimation enables us to predetermine the registration accuracy of two overlapping surfaces. This is very useful for automated range acquisition planning where it is important to ensure that the next scan to be acquired can be registered to the previous scans within the desired accuracy. We demonstrate a view-planning system that incorporates our estimation method in the selection of good candidate views for the range acquisition of indoor environments .","cites":"4","conferencePercentile":"38.88888889"},{"venue":"3DIM","id":"25d90f6b7031fe7bf83a415f7e49a5544a48ed57","venue_1":"3DIM","year":"2003","title":"Reliable and Rapidly-Converging ICP Algorithm Using Multiresolution Smoothing","authors":"Kok-Lim Low, Anselmo Lastra","author_ids":"2924341, 2535203","abstract":"Autonomous range acquisition for 3D modeling requires reliable range registration, for both the precise localization of the sensor and combining the data from multiple scans for view-planning computation. We introduce and present a novel approach to improve the reliability and robustness of the ICP (Iterative Closest Point) 3D shape registration algorithm by smoothing the shape's surface into multiple resolutions. These smoothed surfaces are used in place of the original surface in a coarse-to-fine manner during registration, which allows the algorithm to avoid being trapped at local minima close to the global optimal solution. We used the technique of multiresolution analysis to create the smoothed surfaces efficiently. Besides being more robust, convergence is generally much faster, especially when combined with the point-to-plane error metric of Chen and Medioni. Since the point-to-plane error metric has no closed-form solution, solving it can be slow. We introduce a variant of the ICP algorithm that has convergence rate close to it but still uses the closed-form solution techniques (SVD or unit quaternion methods) of the original ICP algorithm.","cites":"4","conferencePercentile":"20.83333333"},{"venue":"3DIM","id":"5204826f6cc12945d833a1d706256d89bf3c4197","venue_1":"3DIM","year":"2003","title":"Scanning and Processing 3D Objects for Web Display","authors":"Mohamed Farouk, Ibrahim El-Rifai, Shady El-Tayar, Hisham El-Shishiny, Mohamed Hosny, Mohamed El-Rayes, José Gomes, Frank Giordano, Holly E. Rushmeier, Fausto Bernardini, Karen A. Magerlein","author_ids":"8371378, 2023392, 2535651, 1848577, 8093929, 3052443, 2459337, 7565031, 1690595, 1699532, 2505072","abstract":"We present a case study of scanning 3D objects for the purposes of education and public information. We begin by describing the original design of a 3D scanning system now in use in Cairo's Egyptian Museum. The system captures both the geometry and surface color and detail of museum artifacts. We report on the experience using the system in the museum setting, and how practical problems with the system were addressed. We present samples of how the processed 3D data will be used on a web site designed to communicate Egyptian culture.","cites":"16","conferencePercentile":"65.625"},{"venue":"3DIM","id":"79da5df57d0846b9f93c84184b1714ae7aa1f830","venue_1":"3DIM","year":"2003","title":"Image-Based Object Editing","authors":"Holly E. Rushmeier, José Gomes, Laurent Balmelli, Fausto Bernardini, Gabriel Taubin","author_ids":"1690595, 2459337, 3132893, 1699532, 1690237","abstract":"We examine the problem of editing complex 3D objects. We convert the problem of editing a 3D object of arbitrary size and surface properties to a problem of editing a 2D image. We allow the user to specify edits in both geometry and surface properties from any view and at any resolution they find convenient, regardless of the interactive rendering capability of their computer. We use specially-constrained shape from shading algorithms to convert a shaded image specified by the user into a 3D geometry.","cites":"9","conferencePercentile":"48.95833333"},{"venue":"3DIM","id":"74454f79abc1f67132e1f425c33647628e4b1280","venue_1":"3DIM","year":"2003","title":"Stable Real-Time Interaction Between Virtual Humans And Real Scenes","authors":"Luca Vacchetti, Vincent Lepetit, George Papagiannakis, Michal Ponder, Pascal Fua, Daniel Thalmann, Nadia Magnenat-Thalmann","author_ids":"3065784, 1689738, 2896538, 1785968, 1717736, 1689760, 1695679","abstract":"We present an Augmented Reality system that relies on purely passive techniques to solve the real-time registration problem. It can run on a portable PC and does not require engineering of the environment, for example by adding markers. To achieve this result, we have integrated robust Computer Vision techniques into a powerful VR framework. The resulting AR system allows us to produce complex rendering and animation of virtual human characters, and to blend them into the real world. The system tracks the 3D camera position by means of a natural features tracker, which, given a rough CAD model, can deal with complex 3D objects. The tracking method can handle both large camera displacements and aspect changes. We will show that our system works in the cluttered environment of a real industrial facility and can, therefore , be used to enhance manufacturing and industrial processes. The video sequences can be seen at","cites":"13","conferencePercentile":"60.41666667"},{"venue":"3DIM","id":"d396e8b3173ce0529e2564c6f744b4aadad892df","venue_1":"3DIM","year":"1999","title":"Computing Consistent Normals and Colors from Photometric Data","authors":"Holly E. Rushmeier, Fausto Bernardini","author_ids":"1690595, 1699532","abstract":"We present a method for computing normals and colors from multiple sets of photometric data, that are consistent with each other and an underlying lower resolution mesh. Normals are computed by locally adjusting the light source intensities using data from the underlying mesh. Colors are derived from the photometric calculations, and are adjusted by a global color registration analogous to global geometric registration.","cites":"48","conferencePercentile":"88.46153846"},{"venue":"3DIM","id":"516cec07e3615012c0a6804e616ba112053cfda1","venue_1":"3DIM","year":"2005","title":"An Adaptive Dandelion Model for Reconstructing Spherical Terrain-Like Visual Hull Surfaces","authors":"Xin Liu, Hongxun Yao, Wen Gao","author_ids":"1749705, 1720100, 3406319","abstract":"In this paper we present an adaptive Dandelion Model for reconstructing spherical terrain-like Visual Hull (VH) surfaces. The Dandelion Model represents a solid by a pencil of organized line segments emitted from a common point. The directions and the topology of the line segments are derived from the triangle facets of a geodesic sphere, which are recursively subdivided until the desired precision is achieved. The initial lines are cut by silhouettes in 2D and then lifted back to 3D to determine the ending points of the line segments defining sampling points on the spherical terrain-like VH surface. A mesh model can be easily constructed from the Dandelion Model. Our algorithm has the advantages of Fontrollable precision, Ddaptive resolution, Vimplicity and speediness. We validate our algorithm by theories and experiments.","cites":"1","conferencePercentile":"20"},{"venue":"3DIM","id":"ff5eb1078a43dbe60b22c768034b85983a17d26d","venue_1":"3DIM","year":"2005","title":"Fast Alignment of 3D Geometrical Models and 2D Color Images Using 2D Distance Maps","authors":"Yumi Iwashita, Ryo Kurazume, Tsutomu Hasegawa, Kenji Hara","author_ids":"1795530, 1801213, 2660298, 7998055","abstract":"This paper presents a fast pose estimation algorithm of a 3D free form object in 2D images using 2D distance maps. One of the popular techniques of the pose estimation of 3D object in 2D image is the point-based method such as the ICP algorithm. However, the calculation cost for determining point correspondences is expensive. To overcome this problem, the proposed method utilizes a distance map on the 2D image plane, which is constructed quite rapidly by the Fast Marching Method. For pose estimation of the object , contour lines of the 2D image and the projection of the 3D object are aligned using the distance map iteratively by the robust M-estimator. Some experimental results with simulated models and actual images of the endoscopic operation are successfully carried out.","cites":"4","conferencePercentile":"50.90909091"},{"venue":"3DIM","id":"7872e72e1527057d7e977941ed3646268497df59","venue_1":"3DIM","year":"2005","title":"Bootstrapped Real-Time Ego Motion Estimation and Scene Modeling","authors":"Xiang Zhang, Yakup Genc","author_ids":"1686870, 2534129","abstract":"Estimating the motion of a moving camera in an unknown environment is essential for a number of applications ranging from as-built reconstruction to augmented reality. It is a challenging problem especially when real-time performance is required. Our approach is to estimate the camera motion while reconstructing the shape and appearance of the most salient visual features in the scene. In our 3D reconstruction process, correspondences are obtained by tracking the visual features from frame to frame with optical flow tracking. Optical-flow-based tracking methods have limitations in tracking the salient features. Often larger translational motions and even moderate rotational motions can result in drifts. We propose to augment flow-based tracking by building a landmark representation around reliably reconstructed features. A planar patch around the reconstructed feature point provides matching information that prevents drifts in flow-based feature tracking and allows establishment of correspondences across the frames with large baselines. Selective and periodic such correspondence mappings drastically improve scene and motion reconstruction while adhering to the real-time requirements. The method is experimentally tested to be both accurate and computational efficient.","cites":"1","conferencePercentile":"20"},{"venue":"3DIM","id":"4ad4dfa89e682d93ae6c05ac3df24125ffb5660c","venue_1":"3DIM","year":"2005","title":"Automatic Registration of Range Images Based on Correspondence of Complete Plane Patches","authors":"Wenfeng He, Wei Ma, Hongbin Zha","author_ids":"8650265, 1762574, 1687248","abstract":"One of the difficulties in registering two range images scanned by 3D laser scanners is how to get a correct correspondence over the two images automatically. In this paper, we propose an automatic registration method based on matching of extracted planes. First, we introduce a new class of features: complete plane patches (CPP) on the basis of analysis of properties of real scenes. Then we generate a compact interpretation tree for these features. Finally, the image registration is accomplished automatically by searching the interpretation tree.","cites":"11","conferencePercentile":"81.81818182"},{"venue":"3DIM","id":"01240d70419088492d197763bfa7e89afe548380","venue_1":"3DIM","year":"2005","title":"Efficient Photometric Stereo Technique for Three-Dimensional Surfaces with Unknown BRDF","authors":"Li Shen, Takashi Machida, Haruo Takemura","author_ids":"3054034, 3047842, 1748743","abstract":"The present paper focuses on efficient inverse rendering using a Photometric Stereo technique for realistic surfaces. The technique primarily assumes the Lambertian reflection model only. For non-Lambertian surfaces, application of the technique to real surfaces in order to estimate 3-D shape and spatially varying reflectance from sparse images remains difficult. In the present paper, we propose a new Photometric Stereo technique by which to efficiently recover a full surface model, starting from a small set of photographs. The proposed technique allows diffuse albedo to vary arbitrarily over surfaces while non-diffuse characteristics remain constant for a material. Specifically, the basic approach is to first recover the specular reflectance parameters of the surfaces by a novel optimization procedure. These parameters are then used to estimate the diffuse reflectance and surface normal for each point. As a result, a lighting-independent model of the geometry and reflectance properties of the surface is established using the proposed method, which can be used to re-render the images under novel lighting via traditional rendering methods.","cites":"5","conferencePercentile":"59.09090909"},{"venue":"3DIM","id":"d595ab812de67443336309bd01669e85d661966d","venue_1":"3DIM","year":"2001","title":"Reconstructing Urban 3D Model Using Vehicle-Borne Laser Range Scanners","authors":"Huijing Zhao, Ryosuke Shibasaki","author_ids":"1685737, 1721111","abstract":"In this research, a novel method of reconstructing 3D urban scene using vehicle-borne laser range scanners is proposed. Two one-dimensional laser range scanners are mounted on the roof of a vehicle, doing horizontal and vertical profiling respectively. As the vehicle moves ahead, a horizontal and vertical range profile of the surroundings is captured at each odometer trigger. The freedom of vehicle motion is reduced from six to three by assuming that the ground surface is flat and smooth so resulting in the vehicle moving on almost the same horizontal plane. Horizontal range profiles, which have an overwhelming overlay between successive ones, are registered to trace vehicle location and attitude. Vertical range profiles are aligned to the coordinate system of the horizontal one according to the physical geometry between the pair of laser range scanners, and subsequently to a global coordinate system to generate a 3D model. An experiment is conducted where a 3D model is reconstructed by registering and integrating 2412 horizontal and vertical range profiles. Two ground truths are used in examination. They are the outputs of a GPS/INS/Odometer based positioning system and a 1:500 digital map of the test site. Accuracy and efficiency of the method in reconstructing 3D urban scene is demonstrated.","cites":"32","conferencePercentile":"88.88888889"},{"venue":"3DIM","id":"35a33b6c9d03a64b3cf5dfbe5b6ff8b81dba6aef","venue_1":"3DIM","year":"1997","title":"Extracting Surface Patches from Complete Range Descriptions","authors":"Robert B. Fisher, Andrew W. Fitzgibbon, David W. Eggert","author_ids":"1843592, 1708974, 1996470","abstract":"Constructing a full CAD model of a part requires feature descriptions from all sides; in this case we consider surface patches as the geometric primitives. Most previous research in surface patch extraction has concentrated on extracting patches from a single view. This leads to several problems with aligning and combining partial patch fragments in order to produce complete part models. We have avoided these problems by adapting our single view, range data segmentation program to extract patches, and thus models, directly from fully merged range datasets.","cites":"21","conferencePercentile":"43.75"},{"venue":"3DIM","id":"0ccf6738cb9590b74c309e12ba81c19bdf36030e","venue_1":"3DIM","year":"1997","title":"Robust Meshes from Multiple Range Maps","authors":"Kari Pulli, Tom Duchamp, Hugues Hoppe, John Alan McDonald, Linda G. Shapiro, Werner Stuetzle","author_ids":"1704409, 1744813, 1688461, 2490986, 1809809, 1684300","abstract":"This paper presents a method for modeling the surface of an object from a sequence of range maps. Our method is based on a volumetric approach that produces a compact surface without boundary. It provides robustness through the use of interval analysis techniques and computational efficiency through hierarchical processing using octrees.","cites":"55","conferencePercentile":"75"},{"venue":"3DIM","id":"636cbde3e8c7a636ddf3960793a98fd92658ea8f","venue_1":"3DIM","year":"2005","title":"Virtual Clay Modeling System Using Multi-Viewpoint Images","authors":"Etsuko Ueda, Yoshio Matsumoto, Tsukasa Ogasawara","author_ids":"2477921, 1778544, 1785194","abstract":"This paper proposes a \" non-contact virtual clay modeling system. \" We developed a prototype of a three-dimensional modeling system that allows users to shape \" virtual clay \" with their hand movements. In our proposed method, the users hand movements are observed with multiple cameras to estimate their positions. The human hand surface and the virtual clay are modeled by using subdivision surface. Using the estimated hand posisions, the virtual clay is shaped based on a direct free-form deformation technique. To achieve faster processing speed, we implemented the proposed system on a PC cluster. This implemented system proves the feasibility of an intuitive virtual clay modeling system.","cites":"1","conferencePercentile":"20"},{"venue":"3DIM","id":"fc358fd04343be7e8664a04f802c8150b1a02d6f","venue_1":"3DIM","year":"2003","title":"Exploiting Mirrors for Laser Stripe 3D Scanning","authors":"Andrea Fasano, Marco Callieri, Paolo Cignoni, Roberto Scopigno","author_ids":"3209739, 1787254, 1738697, 7980724","abstract":"This paper proposes and evaluates the use of a mirror for improving the scanning process when using laser-stripe acquisition devices. We propose to exploit mirrors for two different purposes: automatizing the 3D acquisition process and allowing the scanning of hard-to-reach parts. The combined use of a flat mirror and a rotary table allows to scan, in a completely automatic and unattended manner, small complex objects with an high level of completeness. Moreover we show how the use of a small hand-held mirror can to be effective for scanning parts that are difficult to be reached or scanned because the physical dimension of the scanner device.","cites":"4","conferencePercentile":"20.83333333"},{"venue":"3DIM","id":"7148a94c4f9b7bb5a046094801d1004c8bf09922","venue_1":"3DIM","year":"2007","title":"Two-frame frequency-based estimation of local motion parallax direction in 3D cluttered scenes","authors":"Vincent Chapdelaine-Couture, Michael S. Langer, Allan Caine, Richard Mann","author_ids":"2617671, 1825455, 1906056, 4814403","abstract":"When an observer moves in a 3D static scene, the resulting motion field depends on the depth of the visible objects and on the observer's instantaneous translation and rotation. It is well-known that the vector difference – or motion parallax – between nearby image motion field vectors points toward the direction of heading and so computing this vector difference can help in estimating the heading direction. For 3D cluttered scenes that contain many objects at many different depths, it can be difficult to compute local image motion vectors because these scenes have many depth discontinuities which corrupt local motion estimates and thus it is unclear how to estimate local motion paral-lax. Recently a frequency domain method was proposed to address this problem which uses the space-time power spectrum of a sequence of images. The method requires a large number of frames, however, and assumes the observer's motion is constant within these frames. Here we present a frequency-based method which uses two frames only and hence does not suffer from the limitations of the previously proposed method. We demonstrate the effectiveness of the new method using both synthetic and natural images.","cites":"1","conferencePercentile":"19.44444444"},{"venue":"3DIM","id":"8917672b9777ffd2b68fb0c258346c04fa417ad8","venue_1":"3DIM","year":"2007","title":"Automatic Pose Estimation for Range Images on the GPU","authors":"Marcel Germann, Michael D. Breitenstein, Hanspeter Pfister, In Kyu Park","author_ids":"1975614, 1869177, 1701371, 1690728","abstract":"Object pose (location and orientation) estimation is a common task in many computer vision applications. Although many methods exist, most algorithms need manual initialization and lack robustness to illumination variation, appearance change, and partial occlusions. We propose a fast method for automatic pose estimation without manual initialization based on shape matching of a 3D model to a range image of the scene. We developed a new error function to compare the input range image to pre-computed range maps of the 3D model. We use the tremendous data-parallel processing performance of modern graphics hardware to evaluate and minimize the error function on many range images in parallel. Our algorithm is simple and accurately estimates the pose of partially occluded objects in cluttered scenes in about one second.","cites":"13","conferencePercentile":"86.11111111"},{"venue":"3DIM","id":"feb9133423abba80bbf146afff7180af2572fd55","venue_1":"3DIM","year":"2005","title":"Uncalibrated Multiple Image Stereo System with Arbitrarily Movable Camera and Projector for Wide Range Scanning","authors":"Ryo Furukawa, Hiroshi Kawasaki","author_ids":"1697820, 1710962","abstract":"In this paper, we propose an uncalibrated, multi-image 3D reconstruction, using coded structured light. Normally, a conventional coded structured light system consists of a camera and a projector and needs precalibration before scanning. Since the camera and the projector have to be fixed after calibration, reconstruction of a wide area of the scene or reducing occlusions by multiple scanning are difficult and sometimes impossible. In the proposed method, multiple scanning while moving the camera or the projector is possible by applying the uncalibrated stereo method, thereby achieving a multi-image 3D reconstruction. As compared to the conventional coded structured light method, our system does not require calibration of ex-trinsic camera parameters, occlusions are reduced, and a wide area of the scene can be acquired. As compared to image-based multi-image reconstruction, the proposed system can obtain dense shape data with higher precision. As a result of these advantages, users can freely move either the cameras or projectors to scan a wide range of objects, but not if both the camera and the projector are moved at the same time.","cites":"15","conferencePercentile":"87.27272727"},{"venue":"3DIM","id":"a31ab96d3a8a0ceadb57bb1071d14bf9690b4048","venue_1":"3DIM","year":"2007","title":"Generalized MPU Implicits Using Belief Propagation","authors":"Yi-Ling Chen, Shang-Hong Lai, Tung-Ying Lee","author_ids":"5014321, 1696527, 3005341","abstract":"In this paper, we present a new algorithm to reconstruct 3D surfaces from an unorganized point cloud based on generalizing the MPU implicit algorithm through introducing a powerful orientation inference scheme via Belief Propagation. Instead of using orientation information like surface normals, local data distribution analysis is performed to identify the local surface property so as to guide the selection of local fitting models. We formulate the determination of the globally consistent orientation as a graph optimization problem. Local belief networks are constructed by treating the local shape functions as their nodes. The consistency of adjacent nodes linked by an edge is checked by evaluating the functions and an energy is thus defined. By minimizing the total energy over the graph, we can obtain an optimal assignment of labels indicating the orientation of each local shape function. The local inference result is propagated over the model in a front-propagation fashion to obtain the global solution. We demonstrate the performance of the proposed algorithm by showing experimental results on some real-world 3D data sets.","cites":"0","conferencePercentile":"6.944444444"},{"venue":"3DIM","id":"f6583f952ff35b868f374b1450b6d2c910d204e4","venue_1":"3DIM","year":"2007","title":"Robust 2D-3D alignment based on geometrical consistency","authors":"Kenji Hara, Yuuki Kabashima, Yumi Iwashita, Ryo Kurazume, Tsutomu Hasegawa","author_ids":"7998055, 2266015, 1795530, 1801213, 2660298","abstract":"This paper presents a new registration algorithm of a 2D image and a 3D geometrical model, which is robust for initial registration errors, for reconstructing a realistic 3D model of indoor scene settings. One of the typical techniques of pose estimation of a 3D model in a 2D image is the method based on the correspondences between 2D pho-tometrical edges and 3D geometrical edges projected on the 2D image. However, for indoor settings, features extracted on the 2D image and jump edges of the geometrical model, which can be extracted robustly, are limited. Therefore, it is difficult to find corresponding edges between the 2D image and the 3D model correctly. For this reason, in most cases, the relative position has to be manually set close to correct position beforehand. To overcome this problem, in the proposed method, firstly the relative pose is roughly estimated by utilizing geometrical consistencies of back-projected 2D photometrical edges on a 3D model. Next, the edge-based method is applied for the precise pose estimation after the above estimation procedure is converged. The performance of the proposed method is successfully demonstrated with some experiments using simulated models of indoor scene settings and actual environments measured by range and image sensors.","cites":"0","conferencePercentile":"6.944444444"},{"venue":"3DIM","id":"42e7ae5b9c691cf4325727bfb693fd310b4d7cdc","venue_1":"3DIM","year":"2005","title":"Realistic Human Head Modeling with Multi-View Hairstyle Reconstruction","authors":"Xiaolan Li, Hongbin Zha","author_ids":"2313653, 1687248","abstract":"We present a method for constructing photorealistic 3D head models from color images and a geometric head model of a specific person. With a simple experimental setup, we employ a user-assisted technique to register the uncalibrated images with the geometric model. A weighted averaging method is then used to extract a panoramic texture map from the input images. To recover the hairstyle of the specified person, a virtual photo plane is defined, according to a corresponding true photo plane, on which one input image is recorded. It provides hints to compute the 3D positions of the visual contour points of the hair from the images taken at different viewpoints. Finally, more hairs are grown to cover the whole region of the scalp using an interpolation method on the 3D scalp mesh surfaces.","cites":"1","conferencePercentile":"20"},{"venue":"3DIM","id":"d17b1a69fed58fce8b67026ad1c04ff9bb17a9bd","venue_1":"3DIM","year":"2007","title":"Dense Depth and Color Acquisition of Repetitive Motions","authors":"Yi Xu, Daniel G. Aliaga","author_ids":"1734114, 1698910","abstract":"Modeling dynamic scenes is a challenging problem faced by applications such as digital content generation and motion analysis. Fast single-frame methods obtain sparse depth samples while multiple-frame methods often reply on the rigidity of the object to correspond a small number of consecutive shots for decoding the pattern by feature tracking. We present a novel structured-light acquisition method which can obtain dense depth and color samples for moving and deformable surfaces undergoing repetitive motions. Our key observation is that for repetitive motion, different views of the same motion state under different structured-light patterns can be corresponded together by image matching. These images densely encode an effectively \" static \" scene with time-multiplexed patterns that we can use for reconstruction of the time-varying scene. At the same time, color samples are reconstructed by matching images illuminated using white light to those using structured-light patterns. We demonstrate our approach using several real-world scenes.","cites":"6","conferencePercentile":"55.55555556"},{"venue":"3DIM","id":"f122e88dbf19d45e220f33cf3ac1765ec93f0f82","venue_1":"3DIM","year":"1999","title":"Is Appearance-Based Structure from Motion Viable?","authors":"David DiFranco, Sing Bing Kang","author_ids":"3215631, 1738740","abstract":"Most structure from motion work assume that tracking is a separate issue from recovery of structure and motion. This paper argues that in certain cases, it helps to use the original images to refine the tracks in the course of estimating structure and motion. We illustrate this by presenting two algorithms: one for appearance-based structure from complete rotation, and another for 3-D face modeling from three images. We come to the following conclusion: use appearance prediction only if the gross shape or type of shape deformation is known. Otherwise, one is very likely better off just using the currently known tracks.","cites":"5","conferencePercentile":"30.76923077"},{"venue":"3DIM","id":"c49e117a20cf9b1be5eceb7c9513e0ff94b9c6ff","venue_1":"3DIM","year":"2001","title":"Planar Patch Extraction with Noisy Depth Data","authors":"Dana Cobzas, Hong Zhang","author_ids":"2505506, 1734058","abstract":"This paper presents an algorithm for extracting planar patches by integrating both intensity and range data provided by a stereo system. For dealing with noisy and sparse range data, the initial segmentation is based on intensity information, and then the resulted regions are thresholded using depth data. This new algorithm, different from the existing ones that use only range data in the segmentation process, produces accurate planar patches that are then used for building a panoramic image-based model for mobile robot navigation.","cites":"10","conferencePercentile":"46.2962963"},{"venue":"3DIM","id":"d65ed3614a3b50b76e5a19866b4b919c4f374d42","venue_1":"3DIM","year":"1999","title":"Efficient and Reliable Template Set Matching for 3D Object Recognition","authors":"Michael A. Greenspan, Pierre Boulanger","author_ids":"1680747, 1798278","abstract":"Object recognition in range image data is formulated as template set matching. The object model is represented as a set of voxel templates, one for each possible pose. The set of all templates is composed into a binary decision tree. Each leaf node references a small number of templates. Each internal node references a single voxel, and has two branches, T and F. The subtree b r anching from the T branch contains the subset of templates which contain the node voxel. Conversely, the subtree b r anching from F branch contains the subset of templates which do not contain the node voxel. Traversing the tree at any image location executes a point probe strategy. It eeciently determines a g o od match with the template set by interrogating only those elements which discriminate between the remaining possible interpretations. The method has been implemented for a number of diierent heuristic tree design and traversal methods. Results are presented of extensive tests for two objects under isolated, cluttered, and occluded s c ene conditions. It is shown that there exist traversalldesign combinations which are b oth eecient and reliable, and that the method i s r obust.","cites":"7","conferencePercentile":"34.61538462"},{"venue":"3DIM","id":"dc81a5a0b6503a3f9ec4cfd5ceaba0e187f8f0b6","venue_1":"3DIM","year":"2003","title":"Streaming Transmission of Point-Sampled Geometry Based on View-Dependent Level-of-Detail","authors":"Fang Meng, Hongbin Zha","author_ids":"5863723, 1687248","abstract":"Streaming transmission of 3D data sets is a key technology for remote rendering and visualization of huge geometrical models or complex scenes. In this paper, we propose an efficient point-based progressive transmission method with gaze-guided control of the level-of-detail (LOD) of the data samples. The efficiency results from a multiresolution simplification scheme based on hierarchical clustering and a compact data structure for organizing the LOD hierarchy. After the data rearrangement, we can transmit the data for rendering with selective LODs by enhancing regions of interest (ROIs) around the gaze point of a viewer. The LOD distribution is continuous over the ROI and the whole scene can be updated dynamically as the gaze moves on the model surfaces. The method is fast and easy to implement, and experimental results demonstrate that it is effective even for some very large models.","cites":"6","conferencePercentile":"34.375"},{"venue":"3DIM","id":"a0181cef580b8b61c00b7652389aff4a2e9bb329","venue_1":"3DIM","year":"2005","title":"Hierarchical Segmentation of Range Images with Contour Constraints","authors":"Pierre Boulanger, Gustavo Osorio, Flavio Prieto","author_ids":"1798278, 2621203, 1762438","abstract":"This paper describes a new algorithm to segment in continuous parametric regions range images. The algorithm starts with an initial partition of small first order regions using a robust fitting algorithm constrained by the detection of depth and orientation discontinuities. The algorithm then optimally group these regions into larger and larger regions using parametric functions until an approximation limit is reached. The algorithm uses Bayesian decision theory to determine the local optimal grouping and the complexity of the parametric model used to represent the range signal. After the segmentation process an exact description of the boundary of each region is computed from the mutual intersections of the extracted surfaces. Experimental results show significant improvement of region boundary localiza-tion. A systematic comparison of our algorithm to the most well known algorithm in the literature is presented to highlight the contributions of this paper.","cites":"1","conferencePercentile":"20"},{"venue":"3DIM","id":"418e93914b54a16a7a3c4118613989b5bea961b1","venue_1":"3DIM","year":"1999","title":"Appearance-Based Virtual View Generation of Temporally-Varying Events from Multi-Camera Images in the 3D Room","authors":"Hideo Saito, Shigeyuki Baba, Makoto Kimura, Sundar Vedula, Takeo Kanade","author_ids":"1724105, 2713232, 8525518, 3073266, 7642093","abstract":"In this paper, we present an \" appearance-based \" virtual view generation method for temporally-varying events taken by multiple cameras of the \" 3D Room \" , developed by our group. With this method, we can generate images from any virtual view point between two selected real views. The virtual appearance view generation method is based on simple interpolation between two selected views. The correspondence between the views are automatically generated from the multiple images by use of the volumetric model shape reconstruction framework. Since the correspondences are obtained by the recovered volumetric model, even occluded regions in the views can be correctly interpolated in the virtual view images. The virtual view image sequences are presented for demonstrating the performance of the virtual view image generation in the 3D Room.","cites":"35","conferencePercentile":"80.76923077"},{"venue":"3DIM","id":"6f2f23029be40c7130503b6b88757caafde957c9","venue_1":"3DIM","year":"1999","title":"PALM: Portable Sensor-Augmented Vision System for Large-Scene Modeling","authors":"Teck Khim Ng, Takeo Kanade","author_ids":"3082766, 7642093","abstract":"Acknowledgements It is a privilege to have had the opportunity t o w ork with my advisor, Dr. Takeo Kanade. I w ould like to thank him for his guidance and patience throughout the course of this project. His perseverance in research and his ability to look at things from a global perspective while attending to critical details will continue to have positive impact on me even after I leave CMU. I w ould also like to thank Dr. Jos e Moura, Dr. Martial H ebert and Dr. Paul Heck-bert for serving as my committee members. Their insightful comments helped to improve the thesis signiicantly. P aul read my thesis more carefully than I did and I am thankful for his suggestions. I am extremely fortunate to have had the opportunity t o w ork with Dave LaRose and Mei Han. The friendship that I have established with Dave and Mei is the best thing that has happened to me at CMU. Dave and Mei's help in many critical points in this project has been indispensable. They have also been the best ooce-mates in the world. I am grateful to Toshihiko Suzuki for teaching me the design of the hardware circuit for encoding sensor readings as analog audio signals. I will also treasure my friendship with him. Mei Chen has been a very mature, encouraging and understanding friend. Wei Hua has never failed to help me in solving PC-related problems. They have added fond memories t o m y stay at the Robotics Institute. I w ould also like to thank Dave Duggins for his assistance in GPS measurements. I am also grateful to Marie Elm for her editorial help in improving my writing. Cheng-Yi has been a source of joy and encouragement, and has made my stay i n Pittsburgh more lively. She taught m e h o w to enjoy a fuller life. My family is my most important source of moral support. My mother, my sister Sharon, brother-in-law Soon, brother Hean, sister-in-law Ling, nephews Kai and Yang, and niece Sheen Yi, have given me the encouragement needed during diicult times in the project. Most of all, I thank my beloved parent s s m y father, who laid the groundwork for our wonderful family, and my mother, who picked up the torch and encouraged us to fullll their dreams for us. ii Abstract We propose PA L …","cites":"2","conferencePercentile":"13.46153846"},{"venue":"3DIM","id":"71054cf4fcb7d1221e86b6268218b5d915115d8d","venue_1":"3DIM","year":"1999","title":"CAD-Based Range Sensor Placement for Optimum 3D Data Acquisitio","authors":"Flavio Prieto, Tanneguy Redarce, Pierre Boulanger, Richard Lepage","author_ids":"1762438, 2847797, 1798278, 1776309","abstract":"The use of laser range sensor allows very significant improvement in acquisition speed but does not equal the accuracy obtained with a coordinate measuring machine. In order to obtain a quality control close to that obtained in metrology, we suggest to improve the accuracy of the depth measurements by positioning the sensor's head according to a strategy for optimum 3D data acquisition. We propose in this paper such a strategy to automatically produce a sensing plan for completely and accurately acquiring the geometry of a surface or of the whole piece whenever possible. The system requires the exact position and orientation of the part and its CAD model in IGES format. There is no limitation regarding the shape of the part to be digitized. An auto-synchronized range sensor developed at the NRCC was used, and for this sensor, the accuracy of the 3D measured points is a function of the distance and of the incident angle relative to the surface. Our strategy guaranties that the viewpoints found meet the best accuracy conditions in the scanning process.","cites":"13","conferencePercentile":"51.92307692"}]}