{"3DOR.csv":[{"venue":"3DOR","id":"d24544f5aa6d1d9195929fc56f5969c2ca13f11f","venue_1":"3DOR","year":"2011","title":"Local Shape Descriptors, a Survey and Evaluation","authors":"Paul Heider, Alain Pierre-Pierre, Ruosi Li, Cindy Grimm","author_ids":"2673078, 3003785, 2051057, 1805157","abstract":"Local shape descriptors can be used for a variety of tasks, from registration to comparison to shape analysis and retrieval. There have been a variety of local shape descriptors developed for these tasks, which have been evaluated in isolation or in pairs, but not against each other. We provide a survey of existing descriptors and a framework for comparing them. We perform a detailed evaluation of the descriptors using real data sets from a variety of sources. We first evaluate how stable these metrics are under changes in mesh resolution, noise, and smoothing. We then analyze the discriminatory ability of the descriptors for the task of shape matching. Our conclusion is that sampling the normal distribution and the mean curvature, using 25 samples, and reducing this data to 5-10 samples via Principal Components Analysis provides robustness to noise and the best shape discrimination results.","cites":"14","conferencePercentile":"80"},{"venue":"3DOR","id":"023921509564dc49d1ffc8aab92f231459e8399e","venue_1":"3DOR","year":"2011","title":"Refining Shape Correspondence for Similar Objects Using Strain","authors":"Ly Phan, Andrew K. Knutsen, Philip V. Bayly, Sandra Rugonyi, Cindy Grimm","author_ids":"2602557, 2834416, 7909242, 2070786, 1805157","abstract":"Several applications-for example, study of biological tissue movement and organ growth-require shape correspondence with a physical basis, especially for shapes or regions lacking distinctive features. For this purpose, we propose the adaptation of mechanical strain, a well-established physical measure for deformation, to the problem of constructing shape correspondence and measuring similarity between non-rigid shapes. In this paper, we demonstrate how to calculate strain for a 2D surface embedded in 3D. We then adjust the correspondence between two surfaces so that the strain varies smoothly across the deformed surface (by minimizing the change in strain). The final strain on the deformed surface can be used as a measure of shape similarity.","cites":"5","conferencePercentile":"50"},{"venue":"3DOR","id":"e0c4aa7d4cc2545fc85a3fd6e9c7a2701274ef80","venue_1":"3DOR","year":"2015","title":"Canonical Forms for Non-Rigid 3D Shape Retrieval","authors":"David Pickup, Xianfang Sun, Paul L. Rosin, Ralph R. Martin, Zhi-Quan Cheng, Sipin Nie, Longcun Jin","author_ids":"2694326, 2303260, 1734823, 4326042, 1729485, 2077872, 2088784","abstract":"We present a new benchmark for testing algorithms that create canonical forms for use in non-rigid 3D shape retrieval. We have combined two existing datasets to create a varied collection of models for testing. Canonical forms attempt to factor out a shape's pose, giving a pose-neutral shape. This opens up the possibility of using methods originally designed for rigid retrieval for the task of non-rigid shape retrieval. We demonstrate the benchmark by using it to compare the performance of nine canonical form methods, using three different retrieval algorithms.","cites":"1","conferencePercentile":"78.57142857"},{"venue":"3DOR","id":"1078cf8735c82ede7f758eb759039baa45c3f327","venue_1":"3DOR","year":"2008","title":"Part Analogies in Sets of Objects","authors":"Shy Shalom, Lior Shapira, Ariel Shamir, Daniel Cohen-Or","author_ids":"2544662, 2717456, 2947946, 1701009","abstract":"Shape retrieval can benefit from analogies among similar shapes and parts of different objects. By partitioning an object to meaningful parts and finding analogous parts in other objects, sub-parts and partial match queries can be utilized. First by searching for similar parts in the context of their shape, and second by finding similarities even among objects that differ in their general shape and topology. Moreover, analogies can create the basis for semantic text-based searches: for instance, in this paper we demonstrate a simple annotation tool that carries tags of object parts from one model to many others using analogies. We partition 3D objects based on the shape-diameter function (SDF), and use it to find corresponding parts in other objects. We present results on finding analogies among numerous objects from shape repositories, and demonstrate sub-part queries using an implementation of a simple search and retrieval application.","cites":"24","conferencePercentile":"75"},{"venue":"3DOR","id":"660e4e84f8123801b8ebb474d0cf19f71f10a0da","venue_1":"3DOR","year":"2014","title":"Extended Large Scale Sketch-Based 3D Shape Retrieval","authors":"Bo Li, Y. Lu, C. Li, Afzal Godil, Tobias Schreck, Masaki Aono, Martin Burtscher, Hongbo Fu, Takahiko Furuya, Henry Johan, Jianzhuang Liu, Ryutarou Ohbuchi, Atsushi Tatsuma, Changqing Zou","author_ids":"2714576, 4797054, 4110681, 1781968, 1706471, 1783161, 2081501, 1691065, 1701565, 3004687, 7137861, 1740817, 1760352, 2876552","abstract":"Large scale sketch-based 3D shape retrieval has received more and more attentions in the community of content-based 3D object retrieval. The objective of this track is to evaluate the performance of different sketch-based 3D model retrieval algorithms using a large scale hand-drawn sketch query dataset on a comprehensive 3D model dataset. The benchmark contains 12,680 sketches and 8,987 3D models, divided into 171 distinct classes. In this track, 12 runs were submitted by 4 groups and their retrieval performance was evaluated using 7 commonly used retrieval performance metrics. We hope that this benchmark, the comparative evaluation results and the corresponding evaluation code will further promote the progress of this research direction for the 3D model retrieval community.","cites":"2","conferencePercentile":"100"},{"venue":"3DOR","id":"685a4a70f9c751bf30d721550cf2820688b01758","venue_1":"3DOR","year":"2012","title":"SHREC'12 Track: Sketch-Based 3D Shape Retrieval","authors":"Bo Li, Tobias Schreck, Afzal Godil, Marc Alexa, Tamy Boubekeur, Benjamin Bustos, J. Chen, Mathias Eitz, Takahiko Furuya, Kristian Hildebrand, S. Huang, Henry Johan, Arjan Kuijper, Ryutarou Ohbuchi, Ronald Richter, Jose M. Saavedra, Maximilian Scherer, Tomohiro Yanagimachi, Gang-Joon Yoon, Sang Min Yoon","author_ids":"2714576, 1706471, 1781968, 1751554, 1747280, 1691646, 4692440, 2165937, 1701565, 2881445, 6637754, 3004687, 1738151, 1740817, 2581563, 2072596, 1741561, 2334432, 2538322, 1758071","abstract":"Sketch-based 3D shape retrieval has become an important research topic in content-based 3D object retrieval. The aim of this track is to measure and compare the performance of sketch-based 3D shape retrieval methods implemented by different participants over the world. The track is based on a new sketch-based 3D shape benchmark, which contains two types of sketch queries and two versions of target 3D models. In this track, 7 runs have been submitted by 5 groups and their retrieval accuracies were evaluated using 7 commonly used retrieval performance metrics. We hope that the benchmark, its corresponding evaluation code, and the comparative evaluation results of the state-of-the-art sketch-based 3D model retrieval algorithms will contribute to the progress of this research direction for the 3D model retrieval community.","cites":"19","conferencePercentile":"92.85714286"}]}