{"3DPH.csv":[{"venue":"3DPH","id":"176244d5c89d102f9a458cfa5a84a4820412cd4f","venue_1":"3DPH","year":"2009","title":"Predicting Missing Markers in Real-Time Optical Motion Capture","authors":"Tommaso Piazza, Johan Lundström, Andreas Kunz, Morten Fjeld","author_ids":"2260287, 3036870, 3703438, 1685537","abstract":"A common problem in optical motion capture of human-body movement is the so-called missing marker problem. The occlusion of markers can lead to significant problems in tracking accuracy unless a continuous flow of data is guaranteed by interpolation or extrapolation algorithms. Since interpolation algorithms require data sampled before and after an occlusion, they cannot be used for real-time applications. Extrapolation algorithms only require data sampled before an occlusion. Other algorithms require statistical data and are designed for post-processing. In order to bridge sampling gaps caused by occluded markers and hence to improve 3D real-time motion capture, we suggest a computationally cost-efficient extrapolation algorithm partly combined with a so-called constraint matrix. The realization of this prediction algorithm does not require statistical data nor does it rely on an underlying kinematic human model with pre-defined marker distances. Under the assumption that human motion can be linear, circular, or a linear combination of both, a prediction method is realized. The paper presents measurements of a circular movement wherein a marker is briefly lost. The suggested extrapolation method behaves well for a reasonable number of frames, not exceeding around two seconds of time.","cites":"2","conferencePercentile":"39.28571429"},{"venue":"3DPH","id":"8c1de002dad981b273c5a67c713b9bdae56c3ad5","venue_1":"3DPH","year":"2009","title":"WAPA: A Wearable Framework for Aerobatic Pilot Aid","authors":"Xavier Righetti, Sylvain Cardin, Daniel Thalmann","author_ids":"2406897, 2119730, 1689760","abstract":"Disorientation induced by G-forces during aerobatic flight generates difficulties for the pilots to perfectly align their aerobatic maneuver. This paper presents a modular wearable system for enhancing training of aerobatic pilots. A combination of accelerometers and a gyroscope is used to detect possible deviations compared to the optimum trajectory. The wearable system informs the user in real time about the corrections to apply via vibrotactile actuators and speech synthesis. This publication presents a work in progress in order to validate the system in simulation.","cites":"0","conferencePercentile":"10.71428571"},{"venue":"3DPH","id":"c7e34ef6520ced97d1a4566f2eeb7551817003ab","venue_1":"3DPH","year":"2009","title":"MotionLab: A Matlab Toolbox for Extracting and Processing Experimental Motion Capture Data for Neuromuscular Simulations","authors":"Anders Sandholm, Nicolas Pronost, Daniel Thalmann","author_ids":"2735031, 3309983, 1689760","abstract":"During the last years several neuromuscular simulation platforms have been developed, from commercial tools to open-source based solutions to pure in-house solutions which are not public available. A major problem in running neuromuscular simulations in any of these tools are that there exist an infinitive number of motion capture laboratory setups. In this paper, the authors present a Matlab toolbox that provides a solution for this problem. The toolbox can easily be setup for any new experiment with minimal changes to the simulation environment. The toolbox provides powerful pre-simulation features such as filtering, markers evaluations and calculations of new marker setups. After that a simulation has been performed, results can be read back and several post-simulation features are available to validate the simulation.","cites":"4","conferencePercentile":"82.14285714"},{"venue":"3DPH","id":"7c3d578ac020aed049a7046da9bc17ca6e9472cb","venue_1":"3DPH","year":"2009","title":"Context Preserving Focal Probes for Exploration of Volumetric Medical Datasets","authors":"Yanlin Luo, José Antonio Iglesias Guitián, Enrico Gobbetti, Fabio Marton","author_ids":"3331652, 1852961, 1708999, 1685719","abstract":"During real-time medical data exploration using volume rendering, it is often difficult to enhance a particular region of interest without losing context information. In this paper, we present a new illustrative technique for focusing on a user-driven region of interest while preserving context information. Our focal probes define a region of interest using a distance function which controls the opacity of the voxels within the probe, exploit silhouette enhancement and use non-photorealistic shading techniques to improve shape depiction.","cites":"1","conferencePercentile":"21.42857143"}]}