{"3GSE.csv":[{"venue":"3GSE","id":"8b65dd0f62d133bcadaef81b1fd737cbf95a8026","venue_1":"3GSE","year":"2014","title":"Class Capture-the-Flag Exercises","authors":"Jelena Mirkovic, Peter Peterson","author_ids":"1725213, 3222814","abstract":"The field of cybersecurity is adversarial – the real challenge lies in outsmarting motivated and knowledgeable human attackers. Sadly, this aspect is missing from current cybersecurity classes, which are often taught through lectures and occasionally through \" get your feet wet \" practical exercises. We propose Class Capture-the-Flag exercises (CCTFs) to revitalize cybersecurity education. These are small-scoped competitions that pit teams of students against each other in realistic attack-defense scenarios. We describe how to design these exercises to be easy for teachers to conduct and grade, easy for students to prepare for and a lot of fun for everyone involved. We also provide descriptions of CCTFs we have developed and recount our experiences of using them in class.","cites":"2","conferencePercentile":"45"},{"venue":"3GSE","id":"8202daa7f035cd38956e370d8a811e9221e27de1","venue_1":"3GSE","year":"2014","title":"Practical Lessons from Creating the Control-Alt-Hack Card Game and Research Challenges for Games In Education and Research","authors":"Tamara Denning, Adam Shostack, Tadayoshi Kohno","author_ids":"1752418, 1995986, 1769675","abstract":"We designed, produced, distributed, and evaluated Control -Alt-Hack™: a recreational tabletop card game intended to promote a casual awareness of high-level computer security concepts. Our experiences throughout this process gave us insights and opinions regarding the creation of games, their role in educational or out-reach contexts, and opportunities and challenges for the research community. In particular, we: (1) provide a logistics-oriented reflection on our experiences, including a list of the work roles that were involved in producing the game and a timeline of the creation process; and (2) step back to consider higher-level issues for the community, including the role of games in the classroom and the challenges behind conducting and publishing evaluations of game-based learning.","cites":"1","conferencePercentile":"30"},{"venue":"3GSE","id":"3280210c1170b6014ebd6d208694425964191d39","venue_1":"3GSE","year":"2014","title":"SecurityEmpire: Development and Evaluation of a Digital Game to Promote Cybersecurity Education","authors":"Marc Olano, Alan T. Sherman, Linda Oliva, Ryan Cox, Deborah Firestone, Oliver Kubik, Milind Patil, John Seymour, Isaac S. Kohane, Donna Thomas","author_ids":"2513270, 1732347, 3183814, 8115652, 2295136, 2587973, 2472057, 7599597, 1740538, 2767641","abstract":"SecurityEmpire is a new multiplayer computer game to teach cybersecurity concepts to high school students. We describe the design and implementation of SecurityEmpire, explain how it teaches security concepts, share preliminary evaluative data from students and teachers, and describe our experiences with developing, fielding, and evaluating this educational game. SecurityEmpire challenges each user to build a green energy company while engaging in sound information assurance practices and avoiding security missteps. Sound information assurance practices include: not clicking on unsafe links, encrypting auction bids, authenticating software downloads, performing integrity checks of system software, keeping antivirus protection up-to-date, and choosing strong passwords. In contrast with traditional teaching methods, educational games hold promise for greater student engagement and learning. We pilot tested an initial version of the game in computer science classes at partner high schools and in an undergraduate gaming class at our university. The preliminary data suggest that the game is engaging and increases awareness of cybersecurity practices.","cites":"3","conferencePercentile":"65"}]}