{"3PGCIC.csv":[{"venue":"3PGCIC","id":"c297926c9997b29176d01ac69a5a4198b4994dbd","venue_1":"3PGCIC","year":"2012","title":"Performance Evaluation of Yahoo! S4: A First Look","authors":"Jagmohan Chauhan, Shaiful Alam Chowdhury, Dwight J. Makaroff","author_ids":"2120037, 2993604, 2678854","abstract":"—Processing large data sets has been dominated recently by the map/reduce programming model [3], originally proposed by Google and widely adopted through the Apache Hadoop 1 implementation. Over the years, developers have identified weaknesses of processing data sets in batches as in MapReduce and have proposed alternatives. One such alternative is continuous processing of data streams. This is particularly suitable for applications in online analytics, monitoring, financial data processing and fraud detection that require timely processing of data, making the delay introduced by batch processing highly undesirable. This processing paradigm has led to the development of systems such as Yahoo! S4 [1] and Twitter Storm. 2 Yahoo! S4 is a general-purpose, distributed and scalable platform that allows programmers to easily develop applications for processing continuous unbounded streams of data. As these frameworks are quite young and new, there is a need to understand their performance for real time applications and find out the existing issues in terms of scalability, execution time and fault tolerance. We did an empirical evaluation of one application on Yahoo! S4 and focused on the performance in terms of scalability, lost events and fault tolerance. Findings of our analyses can be helpful towards understanding the challenges in developing stream-based data intensive computing tools and thus providing a guideline for the future development.","cites":"4","conferencePercentile":"87.5"},{"venue":"3PGCIC","id":"d63c37e280832086850c39163d634275a026d123","venue_1":"3PGCIC","year":"2010","title":"User-controlled Privacy Protection with Attribute-filter Mechanism for a Federated SSO Environment Using Shibboleth","authors":"Tananun Orawiwattanakul, Kazutsuna Yamaji, Motonori Nakamura, Toshiyuki Kataoka, Noboru Sonehara","author_ids":"2026869, 1879832, 3195697, 8505915, 1691871","abstract":"the release of his/her personal information from an identity provider (IdP) to a service provider (SP) and allows him/her to determine which attributes will be sent. uApprove.jp is an extension of uApprove, a UCAS for Shibboleth. Our development is for universities participating in GakuNin (a Japanese academic federation), but it can be utilized in other Shibboleth-based federations.","cites":"1","conferencePercentile":"50"}]}