{"50_Years_of_Artificial_Intellig":[{"venue":"50 Years of Artificial Intelligence","id":"8f6912d55a6d822ee26922d25d0165b6cf344347","venue_1":"50 Years of Artificial Intelligence","year":"2006","title":"Intrinsically Motivated Machines","authors":"Frédéric Kaplan, Pierre-Yves Oudeyer","author_ids":"1797772, 1720664","abstract":"Children seem intrinsically motivated to manipulate, to explore , to test, to learn and they look for activities and situations that provide such learning opportunities. Inspired by research in developmental psychology and neuroscience, some researchers have started to address the problem of designing intrinsic motivation systems. A robot controlled by such systems is able to autonomously explore its environment not to fulfil predefined tasks but driven by an incentive to search for situations where learning happens efficiently. In this paper, we present the origins of these intrinsically motivated machines, our own research in this novel field and we argue that intrinsic motivation might be a crucial step towards machines capable of lifelong learning and open-ended development .","cites":"9","conferencePercentile":"69.44444444"},{"venue":"50 Years of Artificial Intelligence","id":"6d4e097c718a334609909fc855d023fc0fdafde4","venue_1":"50 Years of Artificial Intelligence","year":"2006","title":"Computer-Supported Human-Human Multilingual Communication","authors":"Alexander H. Waibel, Keni Bernardin, Matthias Wölfel","author_ids":"4500589, 1701229, 1732212","abstract":"Computers have become an essential part of modern life, providing services in a multiplicity of ways. Access to these services, however, comes at a price: human attention is bound and directed toward a technical artifact in a human-machine interaction setting at the expense of time and attention for other humans. This paper explores a new class of computer services that support human-human interaction and communication implicitly and transparently. Computers in the Human Interaction Loop (CHIL), require consideration of all communication modalities, multimodal integration and more robust performance. We review the technologies and several CHIL services providing human-human support. Among them, we specifically highlight advanced computer services for cross-lingual communication.","cites":"2","conferencePercentile":"27.77777778"}]}