{"5GU.csv":[{"venue":"5GU","id":"4cbd27cc081c9ecd00a07dffc003b012e843a3c2","venue_1":"5GU","year":"2014","title":"Softwarized 5G Networks Resiliency with Selfhealing","authors":"José Manuel Sánchez-Vílchez, Imen Grida Ben Yahia, Noël Crespi, Tinku Mohamed Rasheed, Domenico Siracusa","author_ids":"2066388, 2761526, 1737867, 1728665, 1989382","abstract":"— The meaning of 5G is still a subject of discussion in the industry. However, the softwarization of networks is expected to shape the design, operation and management of 5G networks. The opportunity is then crucial for Telcos, vendors and IT players to consider the management of 5G networks during its design time and avoid the \" build it first, manage it later \" paradigm. However, network softwarization comes with its own set of challenges, including robustness, scalability and resilience. In this paper, we analyze the vulnerabilities of SDN (Software-Defined Networks) and NFV (Network Function Virtualization) from a fault management perspective, while taking into account the autonomic principles. In particular, we focus on resiliency and we propose a Self-Healing based framework for 5G networks to ensure services and resources availability.","cites":"3","conferencePercentile":"76.92307692"},{"venue":"5GU","id":"3db7717f24d1038473290805a1424d78b6dbf633","venue_1":"5GU","year":"2014","title":"Software Defined 5G Mobile Backhaul","authors":"José Costa-Requena, Raimo Kantola, Aaron Yi Ding, Jukka Manner, Yanhe Liu, Sasu Tarkoma","author_ids":"2003732, 2749404, 1934437, 1895757, 2668536, 1759241","abstract":"—A major challenge of future mobile networks is providing the needed elastic scaling to the increased traffic demand, number of users and applications with acceptable cost. Another challenge is suitability for numerous communications applications while curbing unwanted traffic on the air interface and the mobile devices. This paper proposes a vision of how these challenges can be met by applying the concept of Software Defined Networking (SDN) to mobile networks. We also discuss the needed migration path that minimizes unnecessary replacement investments. While we have verified some key parts of the vision with experiments, we realize that the effectiveness of the proposed approach depends on the adoption of SDN technology for other purposes so that mass production of SDN switches leads to significant economies of scale. The paper shows how we can model mobile networks using SDN concepts and migrate the 3GPP mobile architecture to SDN. The resulting control plane of the mobile architecture consists of a group of SDN applications starting from the base stations i. consists of simplified access points and SDN and Carrier Grade Ethernet switches. Our experiments are based on using OpenFlow as the interface between the planes.","cites":"3","conferencePercentile":"76.92307692"}]}