{"AAAI_Spring_Symposium_Distribut":[{"venue":"AAAI Spring Symposium: Distributed Plan and Schedule Management","id":"3235660cea43c2588942111ff884b632eac6a042","venue_1":"AAAI Spring Symposium: Distributed Plan and Schedule Management","year":"2006","title":"An Examination of Criticality-Sensitive Approaches to Coordination","authors":"Pedro A. Szekely, Rajiv T. Maheswaran, Robert Neches, Craig Milo Rogers, Romeo Sanchez Nigenda, Marcel Becker, Stephen Fitzpatrick, Gergely Gati, Dávid Hanák, Gabor Karsai, Christopher P. van Buskirk","author_ids":"2628881, 1747887, 1736655, 2206470, 2690701, 5433847, 3232371, 2462570, 2715649, 1698771, 2804872","abstract":"In this work, we address the problem of coordinating the distributed execution of plans and schedules by multiple agents subject to a number of different execution uncertainties. The coordination of multi-agent teams in uncertain, dynamic domains is a challenging problem requiring the fusion of techniques from many disciplines. We describe an approach based on the dynamic and selective use of a family of different problem-solving strategies that combine stochastic state estimation with repair-based and heuristic-guided planning and scheduling techniques. This approach is implemented as a cognitive problem-solving architecture that combines (i) a deliberative scheduler, which performs partially-centralized solution repair, (ii) an opportunistic scheduler, which locally optimizes resource utilization for plan enhancement, and (iii) a downgrader, which proactively guides the execution into regions of higher likelihood of success. This paper characterizes the complexity of the problem through examples and experiments, and discusses the advantages and effectiveness of the implemented solution.","cites":"2","conferencePercentile":"60.41666667"},{"venue":"AAAI Spring Symposium: Distributed Plan and Schedule Management","id":"45d811d5bb099dc37ff0c45bba46ddd1c916b4b6","venue_1":"AAAI Spring Symposium: Distributed Plan and Schedule Management","year":"2006","title":"Adaptive Robotic Communication using Coordination Costs for Improved Trajectory Planning","authors":"Avi Rosenfeld, Gal A. Kaminka, Sarit Kraus","author_ids":"1955991, 1725049, 1691597","abstract":"Designers of robotic groups are faced with the formidable task of creating effective coordination architectures that can plan and replan trajectories even when faced with changing environment conditions and hardware failures. Communication between robots is one mechanism that can at times be helpful in such systems, but can also create a time and energy overhead that reduces performance. In dealing with this issue, various communication schemes have been proposed ranging from centralized and localized algorithms, to non-communicative methods. In this paper we argue that using a coordination cost measure can be useful for selecting the appropriate level of communication within such groups. We show that this measure can be used to create adaptive communication methods that switch between various communication approaches. Robotic team members that implemented these approaches were able to increase their productivity in a statistically significant fashion over methods that only used one type of communication scheme.","cites":"1","conferencePercentile":"37.5"},{"venue":"AAAI Spring Symposium: Distributed Plan and Schedule Management","id":"14758386dfa8afc5e06b14e9e45dd5f58e16bf42","venue_1":"AAAI Spring Symposium: Distributed Plan and Schedule Management","year":"2006","title":"Planning to Explore: Using a Coordinated Multisource Infrastructure to Overcome Present and Future Space Flight Planning Challenges","authors":"Edward Balaban, Michael D. Orosz, Tatiana Kichkaylo, Andre Goforth, Adam Sweet, Robert Neches","author_ids":"3277975, 3216289, 1790662, 2552695, 2739289, 1736655","abstract":"Few human endeavors present as much of a planning and scheduling challenge as space flight, particularly manned space flight. Just on the operational side of it, efforts of thousands of people across hundreds of organizations need to be coordinated. Numerous tasks of varying complexity and nature, from scientific to construction, need to be accomplished within limited mission time frames. Resources need to be carefully managed and contingencies worked out, often on a very short notice. From the beginning of the NASA space program, planning has been done by large teams of domain experts working months, sometimes years, to put together a single mission. This approach, while proven very reliable up to now, is becoming increasingly harder to sustain. Elevated levels of NASA space activities, from deployment of the new Crew Exploration Vehicle (CEV) and completion of the International Space Station (ISS), to the planned lunar missions and permanent lunar bases, will put an even greater strain on this largely manual process. While several attempts to automate it have been made in the past, none have fully succeeded. In this paper we describe the current NASA planning methods, outline their advantages and disadvantages, discuss the planning challenges of upcoming missions and propose a distributed planning/scheduling framework (CMMD) aimed at unifying and optimizing the planning effort. CMMD will not attempt to make the process completely automated, but rather serve in a decision support capacity for human managers and planners. It will help manage information gathering, creation of partial and consolidated schedules, inter-team negotiations, contingencies investigation, and rapid re-planning when the situation demands it. The first area of CMMD application will be planning for Extravehicular Activities (EVA) and associated logistics. Other potential applications, not only in the space flight domain, and future research efforts will be discussed as well.","cites":"1","conferencePercentile":"37.5"}]}