{"Parallel_Algorithms_Appl..csv":[{"venue":"Parallel Algorithms Appl.","id":"af03aedbe40569b17ad808e1f28ff46ba6eae782","venue_1":"Parallel Algorithms Appl.","year":"2005","title":"Journeys in non-classical computation I: A grand challenge for computing research","authors":"Susan Stepney, Samuel L. Braunstein, John A. Clark, Andrew M. Tyrrell, Andrew Adamatzky, Robert Elliott Smith, Tom Addis, Colin G. Johnson, Jonathan Timmis, Peter H. Welch, Robin Milner, Derek Partridge","author_ids":"1731741, 2854182, 2591945, 1725707, 1704645, 4668997, 2424636, 1796927, 4611009, 7989350, 1685127, 1904519","abstract":"1. The challenge A gateway event [35] is a change to a system that leads to the possibility of huge increases in kinds and levels of complexity. It opens up a whole new kind of phase space to the system's dynamics. Gateway events during evolution of life on earth include the appearance of eukaryotes (organisms with a cell nucleus), an oxygen atmosphere, multi-cellular organisms and grass. Gateway events during the development of mathematics include each invention of a new class of numbers (negative, irrational, imaginary,. . .), and dropping Euclid's parallel postulate. A gateway event produces a profound and fundamental change to the system: Once through the gateway, life is never the same again. We are currently poised on the threshold of a significant gateway event in computation: That of breaking free from many of our current \" classical computational \" assumptions. Our Grand Challenge for computer science is to journey through the gateway event obtained by breaking our current classical computational assumptions, and thereby develop a mature science of Non-Classical Computation 2. Journeys versus goals To travel hopefully is a better thing than to arrive.","cites":"33","conferencePercentile":"100"},{"venue":"Parallel Algorithms Appl.","id":"77378320449222538583a19b2e037eb0049d874c","venue_1":"Parallel Algorithms Appl.","year":"1993","title":"A Modal Logic Formalism for Distributed and Parallel Knowledge Bases","authors":"Mark Levene, George Loizou","author_ids":"1722499, 7641561","abstract":"Knowledge bases are currently being investigated by database researchers in order to extend the expressiveness of the relational model to include deductive capabilities in the form of rules. The motivation behind this paper is to present a formalism which extends the relational approach to homogeneous distributed databases to the knowledge base paradigm. The basis of our formalism of distributed knowledge bases is the S5 modal logic system. We define an extensional distributed database as a modal structure and an intentional distributed database as a Datalog K logic program. We interpret a modal structure, (W, V), as a network of user sites, W, together with a valuation function, V, which assigns a database to each site w ∈ W. Datalog K extends Datalog + negation by incorporating into it the modal knowledge operator, K. Knowing in our context can be viewed as data replication, and possibility can be viewed as data fragmentation. We define the model-theoretic semantics of Datalog K via implication in a proper subset of first-order modal logic and its operational semantics in terms of two inflationary fixpoint operators, the local fixpoint and the global fixpoint operators. It is shown that the operational semantics of Datalog K coincides with its model-theoretic semantics and that Datalog K queries are computable in polynomial time. We also demonstrate that Datalog K can be implemented in a parallel knowledge base environment over a shared-nothing architecture for a multiprocessor database.","cites":"2","conferencePercentile":"83.33333333"}]}