{"Scandinavian_journal_of_psychol":[{"venue":"Scandinavian journal of psychology","id":"0273dc90883329124a4086bd9b393ec874505695","venue_1":"Scandinavian journal of psychology","year":"2014","title":"The APOE ε4 allele in relation to brain white-matter microstructure in adulthood and aging.","authors":"Lars Nyberg, Alireza Salami","author_ids":"1748969, 1825234","abstract":"The Apolipoprotein E (ApoE) ε4 allele is a major genetic risk factor for sporadic Alzheimer's disease and has been associated with structural and functional brain alterations across the adult life span. Recent studies have presented evidence that ε4 affects microstructural properties of brain white matter (WM) in non-demented carriers of the ε4 allele, but conflicting evidence has been presented as well. The main purpose of the present study was therefore to examine ApoE effects on WM in a large sample of middle-aged and older adults (N = 273). Diffusion tensor imaging (DTI) data was acquired, and tract-based as well as voxel-wise analyses were conducted. The tract-based analyses revealed no significant ApoE effects, and no significant interactions between genotype and age were observed. Taken together, the findings of the present study suggest that ApoE effects on white-matter microstructure are less abundant than has been suggested in some previous studies.","cites":"5","conferencePercentile":"93.03797468"},{"venue":"Scandinavian journal of psychology","id":"e9a5178dc608ad1e4641142fe609570ea8ef7a87","venue_1":"Scandinavian journal of psychology","year":"2015","title":"When death is not a problem: Regulating implicit negative affect under mortality salience.","authors":"Christina Lüdecke, Nicola Baumann","author_ids":"6481284, 3397029","abstract":"Terror management theory assumes that death arouses existential anxiety in humans which is suppressed in focal attention. Whereas most studies provide indirect evidence for negative affect under mortality salience by showing cultural worldview defenses and self-esteem strivings, there is only little direct evidence for implicit negative affect under mortality salience. In the present study, we assume that this implicit affective reaction towards death depends on people's ability to self-regulate negative affect as assessed by the personality dimension of action versus state orientation. Consistent with our expectations, action-oriented participants judged artificial words to express less negative affect under mortality salience compared to control conditions whereas state-oriented participants showed the reversed pattern.","cites":"0","conferencePercentile":"35.79545455"},{"venue":"Scandinavian journal of psychology","id":"ef02890adea93e1cab8ea52c856337f377f7a849","venue_1":"Scandinavian journal of psychology","year":"1995","title":"Dissociative effects of elaboration on memory of enacted and non-enacted events: a case of a negative effect.","authors":"L G Nilsson, L Nyberg, R K Nouri, M Rönnlund","author_ids":"2876663, 1748969, 7176296, 4899009","abstract":"One experiment compared the effect of elaboration on enacted and non-enacted events. The commands were either presented in a basic form (e.g., \"wave your hands\") or in an enriched form. The commands were enriched by adding statements to the commands of how to perform the actions (e.g., \"wave your hands as a conductor\"). Free- and cued-recall data showed elaboration to have a dissociative effect on enacted and non-enacted events. Memory for the non-enacted events benefited from enrichment, whereas simple enacted events were remembered to a higher extent than complex enacted events. Lack of benefit from elaboration on memory of enacted events is suggested to be due to enactment leading to a sufficient degree of item-specific processing, and a negative effect of elaboration is suggested to occur when the way of manipulating item complexity decreases the familiarity of the actions. Familiarity ratings of the items by two independent groups of subjects supported this interpretation.","cites":"0","conferencePercentile":"15.2173913"},{"venue":"Scandinavian journal of psychology","id":"f258d2c8d93c52a4cc69109b31e7724eb268ccfe","venue_1":"Scandinavian journal of psychology","year":"2001","title":"Functional neuroimaging of cognition: state-of-the-art.","authors":"L Nyberg","author_ids":"1748969","abstract":"This paper presents a brief overview of functional neuroimaging studies of cognitive processes. A \"publication profile\" is identified for PET and fMRI studies of cognitive functions. It is shown that the number of publications has increased exponentially over the last ten years, and that a set of ten journals accounts for the vast majority of publications. It is argued that the field has moved from a state of explorative character to a state of high theoretical sophistication. With special reference to the contributions in this issue of Scandinavian Journal of Psychology, methodological, topical, regional, and clinical implications of cognitive neuroscientific studies are discussed.","cites":"2","conferencePercentile":"34"},{"venue":"Scandinavian journal of psychology","id":"01432982f50c95bb1988b4bd613c46177eb0f986","venue_1":"Scandinavian journal of psychology","year":"2005","title":"Treatment of chronic stress in employees: subjective, cognitive and neural correlates.","authors":"Jan Bergdahl, Anne Larsson, Lars-Göran Nilsson, Katrine Riklund Ahlström, Lars Nyberg","author_ids":"7028885, 1874533, 7717023, 4938268, 1748969","abstract":"This study reports the effect of an affect-focused intervention program, the Affect School, on stress, psychological symptoms, cognitive functioning and neural activity. Fifty employees in social service and education, with high levels of chronic stress, were randomly divided into a treatment (N=27) and control (N=23) group. Complete sets of data were available in 20 participants in the treatment group and 17 in the control group. The Perceived Stress Questionnaire assessed stress and the Symptom Check List-90 psychological symptoms before and after treatment. Episodic-memory functioning under focused and divided attention conditions was also assessed. Prior and after the Affect School, seven participants in the treatment group were studied with functional magnetic resonance imaging (fMRI) during episodic memory processing. After the Affect School there was a reduction in stress and psychological symptoms for the treatment group but not in the control group. The controls showed a reduction in episodic memory functioning whereas the performance of the treatment group remained intact. The fMRI scanning indicated a qualitative change in the neural network subserving episodic memory. These preliminary results suggest that the Affect School is effective on individuals with high stress.","cites":"6","conferencePercentile":"82.14285714"},{"venue":"Scandinavian journal of psychology","id":"94f9a2ee85f21d1a84fba4c1cf4aeab370b13b1c","venue_1":"Scandinavian journal of psychology","year":"2001","title":"What do computer models of cognition explain: a reply to Gobet.","authors":"P Saariluoma, T Laine","author_ids":"7328452, 7729475","abstract":"The differences between Gobet's views and ours call attention to some points concerning the argumentative status of computational models. If we have two fundamentally different models which reasonably accurately simulate a phenomenon, we must ask, what is the argumentative status of the models in psychological terms. Moreover, if it is possible to present different models of same phenomena, what is the general argumentative power of models in psychology? As the kind of differences between our views and the ones of Gobet's are common in modelling, we briefly call attention to these foundational issues in our paper.","cites":"0","conferencePercentile":"9"},{"venue":"Scandinavian journal of psychology","id":"1df6627cad56909166d4863bf381452e0eab33bd","venue_1":"Scandinavian journal of psychology","year":"2001","title":"Novice construction of chess memory.","authors":"P Saariluoma, T Laine","author_ids":"7328452, 7729475","abstract":"Novice acquisition of skilled recall of chess positions was studied in an experiment in which two novices studied a series of five hundred chess positions during a period of several months. They spent fifteen minutes to half an hour a day teaching themselves these positions. As a result their skill in recalling chess positions rose from sixteen percent to somewhere between forty to fifty percent. The learning curve proved to have a shape which indicates that in the beginning learning is very fast but after some 100-150 studied positions the speed of learning decreases substantially. A computer simulation was used to model the results and analyse alternative explanations. Two alternative ways of thinking were tested. In the first, chunk construction was assumed to be based on the neighbourhood of associated pieces. The second model assumed a frequency-based correlative association process. Although the learning curves of the two models are very similar in shape to those of the subjects, the frequency-based associative model gave a better explanation for the data. This is why it is natural to suggest that common co-occurrence in addition to easily recognizable chess-specific characteristics, like colour and type of pieces, guide associative processes during chess players' learning of chess-specific chunks.","cites":"9","conferencePercentile":"75"},{"venue":"Scandinavian journal of psychology","id":"a1b1f47f3d4d4aa82f82a7954d089f9d325ce8cd","venue_1":"Scandinavian journal of psychology","year":"2007","title":"Natural teeth and cognitive function in humans.","authors":"Maud Bergdahl, Reza Habib, Jan Bergdahl, Lars Nyberg, Lars-Göran Nilsson","author_ids":"5422616, 2299691, 7028885, 1748969, 7717023","abstract":"A number of neurobiological, psychological and social factors may account for cognitive impairment. In animal studies a relation between dental status and cognitive performance has been found. It is unclear whether such a relation exists for humans. In a first step we compared the performance of 1,351 participants (53% women, 47% men; age M = 54.0) with natural teeth to 487 edentulous participants (59% women, 41% men; age M = 71.3) on 12 cognitive tests. The natural teeth group had a lower mean age, fewer women, more years of education, higher mini-mental state (MMSE), and performed significantly higher on several cognitive tests. In a subsequent analysis, the cognitive performance of a subset of the participants (50-85 years) was examined. In this analysis, 211 had natural dentition and 188 were edentulous. The groups were matched for gender, age, social variables, diseases, stress and MMSE. The cognitive disadvantage of the edentulous group was still apparent. The results suggest that functional natural teeth relate to relatively preserved cognitive functioning in older age.","cites":"7","conferencePercentile":"81.4516129"},{"venue":"Scandinavian journal of psychology","id":"757c2cdd3ce8ab1ada8e3fb41c6347a1e2d71aab","venue_1":"Scandinavian journal of psychology","year":"2007","title":"Quantitative and qualitative sex differences in spatial navigation.","authors":"Martin Lövdén, Agneta Herlitz, Michael Schellenbach, Barbara Grossman-Hutter, Antonio Krüger, Ulman Lindenberger","author_ids":"2869333, 2310645, 2221773, 5027369, 1790548, 1687669","abstract":"We examined sex differences in spatial navigation performance using an ecologically relevant experimental paradigm in which virtual maze-like museums are projected in front of a treadmill. Thirty-two 20-30-year-old adults (16 women/16 men) performed a way-finding task in city-block (straight corridors) or variable (irregular corridors) topographies while walking on the treadmill. Sex differences in spatial navigation performance were reduced in variable topographies, suggesting less reliance on spatial relational learning among women. Also, spatial geometric knowledge of the mazes continued to be higher in men after all participants had attained perfect place-finding performance. Results indicate that sex differences in spatial navigation performance are modulated by interactions between environmental demands and sex differences in spatial processing.","cites":"8","conferencePercentile":"87.09677419"},{"venue":"Scandinavian journal of psychology","id":"26202138c1ef0fcfc93cf487f60c0c73243e0700","venue_1":"Scandinavian journal of psychology","year":"2008","title":"Internal imagery training in active high jumpers.","authors":"C-J Olsson, Bert Jonsson, Lars Nyberg","author_ids":"4039816, 4930380, 1748969","abstract":"The main purpose of this study was to examine whether the use of internal imagery would affect high jumping performance for active high jumping athletes. Over a period of six weeks, a group of active high jumpers were trained with an internal imagery program for a total of 72 minutes. This group was compared to a control group consisting of active high jumpers that only maintained their regular work-outs during the same time period. Four variables were measured; jumping height, number of failed attempts, take-off angle, and bar clearance. There was a significant improvement on bar clearance for the group that trained imagery (p < 0.05) but not for the control group. No other differences were found. The results suggest that internal imagery training may be used to improve a component of a complex motor skill. Possible explanations and future recommendations are discussed.","cites":"11","conferencePercentile":"93.93939394"},{"venue":"Scandinavian journal of psychology","id":"b107facff9c1a2696e9e34ce89bb85f6094a55a7","venue_1":"Scandinavian journal of psychology","year":"2005","title":"Influence of seasonally adjusted exposure to cold and darkness on cognitive performance in circumpolar residents.","authors":"Lawrence A Palinkas, Tiina M Mäkinen, Tiina Pääkkönen, Hannu Rintamäki, Juhani Leppäluoto, Juhani Hassi","author_ids":"5072950, 6454076, 5166380, 3455307, 2105154, 3822555","abstract":"The effects of seasonally adjusted 24-h exposure to cold and darkness on cognitive performance in urban circumpolar residents was assessed in 15 male subjects who spent three 24-h periods in a climatic chamber at 65 degrees latitude during the winter (January-March) and/or summer (August-September). Each subject was exposed to three different environmental conditions in random order: (1) 22 degrees C temperature and 500 lx lighting; (2) 10 degrees C temperature and 500 lx lighting; and (3) 10 degrees C temperature and 0.5-l lx lighting. Accuracy on an addition-subtraction task was significantly greater in the summer than in the winter (p= 0.038), while accuracy on a repeated acquisition task was significantly greater in the winter than in the summer (p < 0.001). Independent of season, exposure to cold and darkness was significantly associated with a decline in response time on five cognitive tests, an improvement in accuracy on three tests measuring complex cognitive tasks, and a decline in accuracy on two tests measuring simple tasks. Increased performance on complex tasks may result from increased arousal in response to the combination of cold temperatures and dim light characteristic of the winter in urban circumpolar settings.","cites":"4","conferencePercentile":"71.42857143"},{"venue":"Scandinavian journal of psychology","id":"8a80fb700919cb07f9c40f2a7d54cff0cd6fff9a","venue_1":"Scandinavian journal of psychology","year":"2009","title":"Neural correlates of variable working memory load across adult age and skill: dissociative patterns within the fronto-parietal network.","authors":"Lars Nyberg, Erika Dahlin, Anna Stigsdotter Neely, Lars Bäckman","author_ids":"1748969, 5392483, 8464392, 1706433","abstract":"We examined neural changes related to variations in working memory load by using an n-back task with three levels and functional magnetic resonance imaging. Younger adults were divided into high- and low-performing groups (Young-High; Young-Low) and compared with older adults. Relative to Young-High, capacity-constraints in working memory were apparent between load 1-2 for the elderly and between load 2-3 for Young-Low. Capacity-constraints in neural activity followed this pattern by showing a monotonically increasing response in parietal cortex and thalamus for Young-High, whereas activity leveled off at 1-back for the elderly and at 2-back for Young-Low. The response in dorsal frontal cortex followed a similar pattern with the addition that the magnitude of activation differed within capacity limitations (Old > Young at 1-back; Young-Low > Young-High at 2-back). These findings indicate that an important determinant of WM capacity is the ability to keep the frontal cortex adequately engaged in relation to current task demands.","cites":"5","conferencePercentile":"60.95890411"},{"venue":"Scandinavian journal of psychology","id":"db603ede4a406abd7110ad8da4ddf77db800ea19","venue_1":"Scandinavian journal of psychology","year":"2015","title":"The mental health of children of migrant workers in Beijing: the protective role of public school attendance.","authors":"Qin Gao, Hong Li, Hong Zou, Wendi Cross, Ran Bian, Yan Liu","author_ids":"2885754, 8613500, 7348153, 5687436, 8116513, 1681842","abstract":"The present study aims to understand the mental health status of an understudied group of migrant children - children of migrant workers in China. A total of 1,466 children from Beijing participated in the study that compared migrant children (n = 1,019) to their local peers (n = 447) in public and private school settings. Results showed that overall, migrant children reported more internalizing and externalizing mental health problems and lower life satisfaction than local peers. However, public school attendance served as a protective factor for migrant children's mental health. The mental health status of migrant children attending public schools, including externalizing problems as well as friend and school satisfaction, was not different from local children. In addition, our data indicates that the protective effect of public school attendance for migrant children may be even more salient among girls than boys, and for younger children than older children.","cites":"2","conferencePercentile":"92.61363636"},{"venue":"Scandinavian journal of psychology","id":"282037e3c736376c8d01ae30c3eeea73b2a9e7cb","venue_1":"Scandinavian journal of psychology","year":"2011","title":"Cognitive deficits in relation to personality type and hypothalamic-pituitary-adrenal (HPA) axis dysfunction in women with stress-related exhaustion.","authors":"Agneta Sandström, Jonas Peterson, Erik Sandström, Mattias Lundberg, Inga-Lill Rhodin Nystrom, Lars Nyberg, Tommy Olsson","author_ids":"4136997, 6910915, 6107986, 8712021, 5413874, 1748969, 5657622","abstract":"Exhaustion caused by long-term work-related stress may cause cognitive dysfunction. We explored factors that may link chronic stress and cognitive impairment. Personality, psychiatric screening, and behavior were assessed by self-reporting measures in 20 female patients (mean age 39.3 years; range 26-53) with a preliminary diagnosis of stress-related exhaustion and in 16 healthy matched controls. Cognitive performance was investigated with a detailed neuropsychological test battery. Cortisol axis function was assessed by urinary and saliva collections of cortisol, dexamethasone suppression, Synacthen response, and corticotropin-releasing hormone (CRH) tests. Proinflammatory cytokines were measured. Hippocampal volumes were estimated by magnetic resonance imaging. Multivariate and univariate statistical methods were used to explore putative differences between groups and factors linked to cognitive impairment. Cognitive function clearly differed between groups, with decreased attention and visuospatial memory in the patient group, suggesting frontal cortex/medial temporal cortex-network dysfunction. Increased harm avoidance and persistence was present among patients, with lowered self-directedness linked to lower quality of life, increased anxious and depressive tendencies, and experiences of psychosocial stress. Attention was decreased with concomitantly impaired visuospatial memory. The pituitary (adrenocorticotropic hormone, ACTH) response to CRH was decreased in patients, with an increased cortisol/ACTH response to CRH. However, cortisol production rates, diurnal or dexamethasone-suppressed saliva cortisol levels, and the cortisol response to Synacthen were unaltered. Hippocampal volumes did not differ between groups. These findings suggest that cognitive dysfunction in stress-related exhaustion is linked to distinct personality traits, low quality of life, and a decreased ACTH response to CRH.","cites":"8","conferencePercentile":"98.68421053"},{"venue":"Scandinavian journal of psychology","id":"851a54b83f4255ec2334192ec8c614ccebd40875","venue_1":"Scandinavian journal of psychology","year":"2012","title":"Multigroup Confirmatory Factor Analysis of the Cognitive Dysfunction Questionnaire: instrument refinement and measurement invariance across age and sex.","authors":"Peter Vestergren, Michael Rönnlund, Lars Nyberg, Lars-Göran Nilsson","author_ids":"3559770, 4899009, 1748969, 7717023","abstract":"The study adopted Confirmatory Factor Analysis (CFA) to investigate the factorial structure and reduce the number of items of the Cognitive Dysfunction Questionnaire (CDQ). The analyses were based on data for a total of 1,115 participants from population based samples (mean age: 63.0 ± 14.5 years, range: 25-95) randomly split into a refinement (N = 569) and a cross-validation (N = 546) sample. Equivalence of the measurement and structural portions of the refined model was demonstrated across the refinement and cross-validation samples. Among competing models the best fitting and parsimonious model had a hierarchical factor structure with five first-order and one second-order general factor. For the final version of the CDQ, 20 items within five domains were selected (Procedural actions, Semantic word knowledge, Face recognition, Temporal orientation, and Spatial navigation). Internal consistency reliabilities were adequate for the total scale and for the subscales. Multigroup CFAs indicated measurement invariance across age and sex up to the scalar level. Finally, higher levels of cognitive dysfunction as reflected by CDQ scores were predicted by advancing age, fewer years of education, and with deficits in general cognitive functioning as reflected by scores on the Mini-Mental State Examination. In conclusion, the CDQ appears to be psychometrically sound and shows the expected relationships with variables known to be associated with cognitive dysfunction and dementia. Future studies should apply it among clinical groups to further test its usefulness.","cites":"0","conferencePercentile":"25"},{"venue":"Scandinavian journal of psychology","id":"d202c600e2aef5d72e89e606329164a656b8aa68","venue_1":"Scandinavian journal of psychology","year":"2015","title":"Counterfactual comparison modulates fairness consideration in the mini-ultimatum game: an event-related potentials study.","authors":"Jiafeng Liang, Huiyan Lin, Jing Xiang, Hao Wu, Xu Li, Hongyu Liang, Xue Zheng","author_ids":"6978904, 5914160, 8393840, 1739602, 7824108, 3222767, 2045356","abstract":"Existing literature on the mini-ultimatum game indicates that counterfactual comparison between chosen and unchosen alternatives is of great importance for individual's fairness consideration. However, it is still unclear how counterfactual comparison influences the electrophysiological responses to unfair chosen offers. In conjunction with event-related potentials' (ERPs) technique, the current study aimed to explore the issue by employing a modified version of the mini-ultimatum game where a fixed set of two alternatives (unfair offer vs. fair alternative, unfair vs. hyperfair alternative, unfair offer vs. hyperunfair alternative) was presented before the chosen offer. The behavioral results showed that participants were more likely to accept unfair chosen offers when the unchosen alternative was hyperunfair than when the unchosen alternative was fair or hyperfair. The ERPs results showed that the feedback-related negativity (FRN) elicited by unfair chosen offers was insensitive to the type of unchosen alternative when correcting for possible overlap with other components. In contrast, unfair chosen offers elicited larger P300 amplitudes when the unchosen alternative was hyperunfair than when the unchosen alternative was fair or hyperfair. These findings suggest that counterfactual comparison may take effect at later stages of fairness consideration as reflected by the P300.","cites":"1","conferencePercentile":"80.11363636"},{"venue":"Scandinavian journal of psychology","id":"8957f391168479fcd0c35a5d8301f619638fc412","venue_1":"Scandinavian journal of psychology","year":"2006","title":"Experiencing positive affect and negative affect during stress: relationships to cardiac reactivity and to facial expressions.","authors":"Tarja Heponiemi, Niklas Ravaja, Marko Elovainio, Petri Näätänen, Liisa Keltikangas-Järvinen","author_ids":"4943523, 1751008, 6540544, 4940337, 7642019","abstract":"We examined the relationship between experienced positive/negative affect and cardiac reactivity and facial muscle movements during laboratory tasks with different demands. Heart rate, respiratory sinus arrhythmia, pre-ejection period, and facial electromyography were measured during startle, mental arithmetic, reaction time task, and speech task. The results revealed that individuals experiencing high levels of positive affect exhibited more pronounced parasympathetic, heart rate, and orbicularis oculi reactivity than others. Individuals who experienced high levels of negative affects during the tasks showed higher corrugator supercilii responses. Men and women showed slightly different response patterns. To conclude, cardiac reactivity may be associated with positive involvement and enthusiasm in some situations and all reactivity should not automatically be considered as potentially pathological.","cites":"2","conferencePercentile":"52.54237288"},{"venue":"Scandinavian journal of psychology","id":"48a6a05925fe1fa2e10c6aa022b101b12c8f3f47","venue_1":"Scandinavian journal of psychology","year":"2014","title":"Strengthening concept learning by repeated testing","authors":"Carola Wiklund-Hörnqvist, Bert Jonsson, Lars Nyberg","author_ids":"4652992, 4930380, 1748969","abstract":"The aim of this study was to examine whether repeated testing with feedback benefits learning compared to rereading of introductory psychology key-concepts in an educational context. The testing effect was examined immediately after practice, after 18 days, and at a five-week delay in a sample of undergraduate students (n = 83). The results revealed that repeated testing with feedback significantly enhanced learning compared to rereading at all delays, demonstrating that repeated retrieval enhances retention compared to repeated encoding in the short- and the long-term. In addition, the effect of repeated testing was beneficial for students irrespectively of working memory capacity. It is argued that teaching methods involving repeated retrieval are important to consider by the educational system.","cites":"4","conferencePercentile":"88.60759494"},{"venue":"Scandinavian journal of psychology","id":"934cec5f1fa8224f70d4fcdc0d3fa2447ba420a5","venue_1":"Scandinavian journal of psychology","year":"1996","title":"Semantic distance and single cue use in category search.","authors":"P Saariluoma, S Kujala","author_ids":"7328452, 7936736","abstract":"Perceptual classification may be based either on the physical features of target and background items or on the semantic attributes of the presented items. In this paper we used enumeration tasks to study the role of semantic features in a categorial classification task. This means that subjects were asked to count the number of target words in a display belonging to one semantic category among a number of background items of other categories. Our goal was to study the decision logic in category search by manipulating target background conditions and the semantic distance between target and background classes. In the first experiment we found that the larger the semantic distance between targets and background words, the easier it was to find the targets. In the second experiment we found a \"pop-out\" effect, in which subjects could use and benefit from a single distinctive semantic feature, \"part-likeness\", in categorial classification. The results of the two experiments imply that the categorization decision logic is basically the same in physical and semantic perceptual classification.","cites":"0","conferencePercentile":"19.35483871"},{"venue":"Scandinavian journal of psychology","id":"8c7f3a13966c40fd37d09f65e56a260ce657d067","venue_1":"Scandinavian journal of psychology","year":"2013","title":"Poly-victimization and executive functions in junior college students.","authors":"Yang Li, Fanghong Dong, Fenglin Cao, Naixue Cui, Jie Li, Zhouting Long","author_ids":"1678662, 4573138, 6536590, 3783431, 1684133, 4283906","abstract":"This study sought to characterize executive dysfunctions in poly-victimized students without posttraumatic stress disorder (PTSD) symptoms and the relationship between neuropsychological and behavioral rating measures of executive functions (EFs). Based on self-report data of exposure to victimization and PTSD symptoms, 259 junior college students aged 18-21 years were classified into four groups: poly-victimization with PTSD symptoms (PVP), poly-victimization without PTSD symptoms (PVnP), non-poly-victimization (nPV), and non-victimization (nV). Respondents also completed the Behavior Rating Inventory of Executive Function-Adult Version (BRIEF-A). Of the 259 participants, 131 were administered a battery of neuropsychological tests from the Cambridge Neuropsychological Testing Automated Battery (CANTAB). The PVP group and the PVnP group performed worse than the nV group on most BRIEF-A scales. When compared with the nPV group, the PVP group demonstrated poorer performance on the scales of Inhibit, Shift, Emotional Control, Initiate, and Working Memory, while the PVnP group performed more poorly on the Working Memory scale and the Task Monitor scale. For all BRIEF-A scales, no significant differences were detected between the PVP group and the PVnP group. This study showed no between-group differences for most of the neuropsychological tests except for the Stop Signal Task (SST), and no correlations between these two measures of EFs. Overall, we found evidence of an association between deficits in EFs and poly-victimization. Although our study raises questions about the relationship between these two measures of EFs, it suggests that the use of the BRIEF-A in conjunction with the CANTAB provides a more complete assessment of the executive dysfunctions.","cites":"0","conferencePercentile":"21.23287671"},{"venue":"Scandinavian journal of psychology","id":"a155e5fce8c363694e2054609a7e58809566a4f3","venue_1":"Scandinavian journal of psychology","year":"2016","title":"The rich get richer, the poor get even: Perceived socioeconomic position influences micro-social distributions of wealth.","authors":"Boyka Bratanova, Steve Loughnan, Olivier Klein, Robert Wood","author_ids":"6100939, 2409902, 2596342, 2588326","abstract":"Economic inequality has a robust negative effect on a range of important societal outcomes, including health, wellbeing, and education. Yet, it remains insufficiently understood why, how, and by whom unequal systems tend to be perpetuated. In two studies we examine whether psychological mindsets adopted by the wealthy and the poor in their micro-social transactions act to perpetuate or challenge inequality. We hypothesized that occupying a wealthier socioeconomic position promotes the pursuit of self-interest and contributes to inequality maintenance; poorer socioeconomic position, on the other hand, should promote the pursuit of fairness and equality restoration. In Study 1, participants completed an ultimatum game as proposers after being primed to believe they are wealthier or poorer, offering money to either poor or wealthy responders. As expected, the wealthy pursued their self-interest and the net effect of this behavior contributes to the maintenance of inequality. Conversely, the poor pursued fairness and the net effect of this behavior challenges inequality. In Study 2, participants were responders deciding whether to accept or reject unfair distributions. Compared to the wealthier, the poorer challenged inequality by rejecting unequal offers. The links between micro-social processes and macro-societal inequality are discussed.","cites":"0","conferencePercentile":"48.64864865"},{"venue":"Scandinavian journal of psychology","id":"8a145f916db6edb98ec1a4fe2116c68e2878d49b","venue_1":"Scandinavian journal of psychology","year":"2013","title":"Prevalence and associated factors of poly-victimization in Chinese adolescents.","authors":"Fanghong Dong, Fenglin Cao, Peixia Cheng, Naixue Cui, Yang Li","author_ids":"4573138, 6536590, 7143818, 3783431, 1678662","abstract":"Multiple types of victimization or poly-victimization (PV) can occur simultaneously during childhood, resulting in outcomes that are detrimental and difficult to reverse. Very few studies have focused on PV in Chinese adolescents. The present study is based on information collected from a stratified cluster sample of 1,561 females and 1,594 males aged 12-18 years living in Shandong Province, China. A self-administered questionnaire was used to assess background information, the Juvenile Victimization Questionnaire was used to measure the extent of victimization and PV, the Screen for Child Anxiety Related Emotional Disorders was used to measure anxiety levels, and a Depression Self-rating Scale for Children was used to ascertain depression. A majority of the study sample (66.2%) had experienced at least one form of victimization over the past year. Prevalence of PV was 16.9%, and was significantly higher among males (21.1%) than females (12.5%). Younger ages, one-child families, and lower socioeconomic status were positively associated with PV. Logistic regression analysis indicated that smoking, alcohol consumption, exposure to pornography, and anxiety- and depression-like symptoms were risk factors of PV. Results of this study highlight the need for further exploration of factors related to the PV of Chinese adolescents.","cites":"1","conferencePercentile":"55.47945205"},{"venue":"Scandinavian journal of psychology","id":"2b867f534935cb4e6384900cd5046c04f24838ad","venue_1":"Scandinavian journal of psychology","year":"2011","title":"Development of the Cognitive Dysfunction Questionnaire (CDQ) in a population based sample.","authors":"Peter Vestergren, Michael Rönnlund, Lars Nyberg, Lars-Göran Nilsson","author_ids":"3559770, 4899009, 1748969, 7717023","abstract":"The study reports on the development of a questionnaire for assessment of adult cognitive dysfunction (CDQ). Participants in a population-based sample (65±15 years, N=370) responded to a 90-item pilot version covering multiple aspects of memory/cognition. Based on exploratory principal components analyses and correlations with criterion measures of cognitive functioning (MMSE, Block Design, semantic/episodic memory), 20 items loading on 6 components were selected for the final version of the questionnaire. Cronbach's α for the total score was 0.90. There was evidence of construct validity as judged by correlations between CDQ scores, objective cognitive measures, and a subjective memory measure (PRMQ). Discriminant validity was demonstrated by a low and non-significant correlation with depressive symptoms. Further evidence of construct validity was provided by correlations with age and educational attainment. In conclusion, the CDQ is promising as a self-rating screening tool for cognitive dysfunction, and will be the subject of further development and validation.","cites":"0","conferencePercentile":"18.42105263"},{"venue":"Scandinavian journal of psychology","id":"003374d75065ef91a6782a4aba36d2e2276fd8e3","venue_1":"Scandinavian journal of psychology","year":"2004","title":"Emotional effects of startling background music during reading news reports: The moderating influence of dispositional BIS and BAS sensitivities.","authors":"Niklas Ravaja, Kari Kallinen","author_ids":"1751008, 1769521","abstract":"We examined the moderating influence of dispositional behavioral inhibition system (BIS) and behavioral activation system (BAS) sensitivities on the relationship of startling background music with emotion-related subjective and physiological responses elicited during reading news reports, and with memory performance among 26 adult men and women. Physiological parameters measured were respiratory sinus arrhythmia (RSA), electrodermal activity (EDA), and facial electromyography (EMG). The results showed that, among high BAS individuals, news stories with startling background music were rated as more interesting and elicited higher zygomatic EMG activity and RSA than news stories with non-startling music. Among low BAS individuals, news stories with startling background music were rated as less pleasant and more arousing and prompted higher EDA. No BIS-related effects or effects on memory were found. Startling background music may have adverse (e.g., negative arousal) or beneficial effects (e.g., a positive emotional state and stronger positive engagement) depending on dispositional BAS sensitivity of an individual. Actual or potential applications of this research include the personalization of media presentations when using modern media and communications technologies.","cites":"5","conferencePercentile":"78.43137255"}]}