{"SM_04.csv":[{"venue":"SM '04","id":"31801d0995e75c3d88dbcdceb764a22dca2b9347","venue_1":"SM '04","year":"2004","title":"Multiresolution heterogeneous solid modeling and visualization using trivariate simplex splines","authors":"Jing Hua, Ying He, Hong Qin","author_ids":"1695197, 1734129, 1695999","abstract":"This paper presents a new and powerful heterogeneous solid modeling paradigm for representing, modeling, and rendering of multi-dimensional, physical attributes across any volumetric objects. The modeled solid can be of complicated geometry and arbitrary topology. It is formulated using a trivariate simplex spline defined over a tetrahedral decomposition of any 3D domain. Heterogeneous material attributes associated with solid geometry can be modeled and edited by manipulating the control vectors and/or associated knots of trivariate simplex splines easily. The multiresolution capability is achieved by interactively subdividing any regions of interest and allocating more knots and control vectors accordingly. We also develop a feature-sensitive fitting algorithm that can reconstruct a more compact, continuous trivariate simplex spline from structured or unstructured volumetric grids. This multiresolution representation results from the adaptive and progressive tetrahedralization of the 3D domain. In addition, based on the simplex spline theory, we derive several theoretical formula and propose a fast direct rendering algorithm for interactive data analysis and visualization of the simplex spline volumes. Our experiments demonstrate that the proposed paradigm augments the current modeling and visualization techniques with the new and unique advantages.","cites":"18","conferencePercentile":"92.30769231"},{"venue":"SM '04","id":"a04d3d32b2aff7682c35b7300acc9ae11186b413","venue_1":"SM '04","year":"2004","title":"Medial axis based solid representation","authors":"Amir Shaham, Ariel Shamir, Daniel Cohen-Or","author_ids":"2777843, 2947946, 1701009","abstract":"The medial axis (MA) of an object and medial axis transform (MAT) have many applications in solid modeling, computer graphics and other areas. Exact computation of MA is complex and various medial axis approximation algorithms were studied. One of the most successful is based on the computation of the Voronoi diagram of a set of sample points on the boundary of the object. Based on this method we present a novel representation of solids, which we call a pair-mesh. The pair-mesh is a deformable manifold surface triangulation where each node deforms between a pair of vertices one on the MA approximation and one on the boundary. Consequently, it provides a continuous map between the inner Voronoi based structure and the boundary of the shape, encompassing the topological structures of them both. This representation can also be seen as a partitioning of the volume between the two, where each element in the partition is either a tetrahedron or a pyramid and includes vertices from both the MA approximation and the reconstructed boundary.","cites":"6","conferencePercentile":"56.41025641"},{"venue":"SM '04","id":"0d41c9690d8ae4098161ad68b57138ff5ff99633","venue_1":"SM '04","year":"2004","title":"Optimization techniques for approximation with subdivision surfaces","authors":"M. Marinov, L. Kobbelt","author_ids":"8734538, 1763010","abstract":"We present a method for scattered data approximation with subdivision surfaces which actually uses the true representation of the limit surface as a linear combination of smooth basis functions associated with the control vertices. This is unlike previous techniques which used only piecewise linear approximations of the limit surface. By this we can assign arbitrary parameterizations to the given sample points, including those generated by parameter correction. We present a robust and fast algorithm for exact closest point search on Loop surfaces by combining Newton iteration and non-linear minimization. Based on this we perform unconditionally convergent parameter correction to optimize the approximation with respect to the L<sup>2</sup> metric and thus we make a well-established scattered data fitting technique which has been available before only for B-spline surfaces, applicable to subdivision surfaces. Further we exploit the fact that the control mesh of a subdivision surface can have arbitrary connectivity to reduce the L&#8734; error up to a certain user-defined tolerance by adaptively restructuring the control mesh. By employing iterative least squares solvers, we achieve acceptable running times even for large amounts of data and we obtain high quality approximations by surfaces with relatively low control mesh complexity compared to the number of sample points. Since we are using plain subdivision surfaces, there is no need for multiresolution detail coefficients and we do not have to deal with the additional overhead in data and computational complexity associated with them.","cites":"14","conferencePercentile":"85.8974359"},{"venue":"SM '04","id":"45c680c4e4c2187ea54d28ef6793d8eaebf1f919","venue_1":"SM '04","year":"2004","title":"Topological and geometric beautification of reverse engineered geometric models","authors":"F. C. Langbein, C. H. Gao, B. I. Mills, A. D. Marshall, R. R. Martin","author_ids":"2300848, 2339407, 1852979, 1761605, 4326042","abstract":"Boundary representation models reverse engineered from 3D range data suffer from various inaccuracies caused by noise in the measured data and the model building software. Beautification aims to improve such models in a post-processing step solely working with the boundary representation model. The improved model should exhibit topological and geometric regularities representing the original, ideal design intent. This paper gives an overview of algorithms for a complete beautification system suitable for improving the topology and the geometry of low to medium complexity reverse engineered models.","cites":"1","conferencePercentile":"12.82051282"},{"venue":"SM '04","id":"428dc462b49e3bfc0ac5d5170ceeec7749020b1b","venue_1":"SM '04","year":"2004","title":"Image based bio-cad modeling and its applications to biomedical and tissue engineering","authors":"B. Starly, A. Darling, C. Gomez, J. Nam, W. Sun, A. Shokoufandeh, W. Regli","author_ids":"3214162, 2478008, 5868209, 3188440, , 1740078, 1732225","abstract":"CAD has been traditionally used to assist in engineering design and modeling for representation, analysis and manufacturing. Advances in Information Technology and in Biomedicine have created new uses for CAD with many novel and important biomedical applications, particularly in tissue engineering in which the CAD based bio-tissue informatics model provides critical information of tissue biological, biophysical, and biochemical properties for modeling, design, and fabrication of complex tissue substitutes. This paper will present some salient advances of bio-CAD modeling and application in computer-aided tissue engineering, including biomimetic design, analysis, simulation and freeform fabrication of tissue engineered substitutes. Overview of computer-aided tissue engineering will be given. Methodology to generate bio-CAD modeling from high resolution non-invasive imaging, the medical imaging process and the 3D reconstruction technique will be described. Enabling state-of-the-art computer program in assisting the 3D reconstruction and in bio-modeling development will be introduced. Utilization of the bio-CAD model for the description and representation of the morphology, heterogeneity, and organizational structure of tissue anatomy will also be presented.","cites":"0","conferencePercentile":"5.128205128"},{"venue":"SM '04","id":"ac34e07db9a970ab0b4817670aba36a9173c2242","venue_1":"SM '04","year":"2004","title":"Using Cayley-Menger determinants for geometric constraint solving","authors":"Dominique Michelucci, Sebti Foufou","author_ids":"3168094, 1784025","abstract":"We use Cayley-Menger Determinants (CMDs) to obtain an intrinsic formulation of geometric constraints. First, we show that classical CMDs are very convenient to solve the Stewart platform problem. Second, issues like distances between points, distances between spheres, cocyclicity and cosphericity of points are also addressed. Third, we extend CMDs to deal with asymmetric problems. In 2D, the following configurations are considered: 3 points and a line; 2 points and 2 lines; 3 lines. In 3D, we consider: 4 points and a plane; 2 points and 3 planes; 4 planes.","cites":"11","conferencePercentile":"74.35897436"},{"venue":"SM '04","id":"51a20c861a038ea044c0b1e3c6834614ed1a9ab8","venue_1":"SM '04","year":"2004","title":"Actual morphing: a physics-based approach to blending","authors":"Shi-Min Hu, Chen-Feng Li, Hui Zhang","author_ids":"1686809, 7431679, 1688592","abstract":"When two topologically identical shapes are blended, various possible transformation paths exist from the source shape to the target shape. Which one is the most plausible? Here we propose that the transformation process should obey a quasi-physical law. This paper combines morphing with deformation theory from continuum mechanics. By using strain energy, which reflects the magnitude of deformation, as an objective function, we convert the problem of path interpolation into an unconstrained optimization problem. To reduce the number of variables in the optimization we adopt shape functions, as used in the finite element method (FEM). A point-to-point correspondence between the source and target shapes is naturally established using these polynomial functions plus a distance map.","cites":"10","conferencePercentile":"69.23076923"},{"venue":"SM '04","id":"9b311f305a2df51fbeb7fa32e426ed5c0ff7b8cd","venue_1":"SM '04","year":"2004","title":"Making the most of using depth reasoning to label line drawings of engineering objects","authors":"P. A. C. Varley, R. R. Martin, H. Suzuki","author_ids":", 4326042, 1726356","abstract":"Automatic creation of B-rep models of engineering objects from freehand sketches would benefit designers. A subgoal is to take a single line drawing (with hidden lines removed), and from it deduce an initial 3D geometric realisation of the visible part of the object. Junction and line labels, and provisional depth coordinates, are important components of this frontal geometry. Most methods for producing frontal geometry use line labelling, but this takes little or no account of geometry. As a result, the line labels produced can be unreliable.Previously, we proposed an approach which inflates a drawing to produce provisional depth coordinates, and uses these to make deductions about line labels. Even a na&#239;ve implementation can outperform previous line labelling methods in certain cases. In this paper, we further enhance this approach. We extend the algorithm to non-isometric-projection drawings, consider improved ways of realising some of the concepts, and also consider how to combine this approach with other labelling techniques to gain the benefits of each.We test our approach using to be drawings of what we consider representative samples of engineering objects; these exemplify difficulties not considered in many previous papers on line labelling. Our results, based on this test set, show that the enhancements result in significant benefits.","cites":"13","conferencePercentile":"80.76923077"}]}