{"W2GIS.csv":[{"venue":"W2GIS","id":"f4ce7ca16383c88c5b664cc9895e6e89723b9db8","venue_1":"W2GIS","year":"2011","title":"HYDROSYS - A Mixed Reality Platform for On-Site Visualization of Environmental Data","authors":"Antti Nurminen, Ernst Kruijff, Eduardo E. Veas","author_ids":"1914398, 2339768, 1759075","abstract":"Modern mobile devices and networks facilitate the development of increasingly graphical mobile GIS applications. We advance the field with the HYDROSYS system, a heterogeneous platform integrating multiple data sources and components. Our key contributions are 1) scalable on-the-fly streaming of environmental sensor data, 2) highly graphical mixed reality representations, 3) access to near real time simulations and other physically-based computations, 4) support for semantically meaningful public participation and 5) integration of the heterogeneous system, balancing the use of standardized formats and optimized mobile transmissions. Our complex system builds on use cases ranging from hydrological professionals and municipal authorities to the environmentally-aware public. We present the challenges, solutions and implementation of the system, providing observations on potential bottlenecks and other issues.","cites":"4","conferencePercentile":"75"},{"venue":"W2GIS","id":"b48690d646013136a4c198db4b5e9f33f964406e","venue_1":"W2GIS","year":"2013","title":"Grounding Linked Open Data in WordNet: The Case of the OSM Semantic Network","authors":"Andrea Ballatore, Michela Bertolotto, David C. Wilson","author_ids":"1745451, 1679887, 1691025","abstract":"In recent years, the linked open data (LOD) paradigm has emerged as a promising approach to structuring, publishing, and sharing data online, using Semantic Web standards. From a geospatial perspective , one of the key challenges consists of bridging the gap between the vast amount of crowdsourced, semi-structured or unstructured geo-information and the Semantic Web. Notably, OpenStreetMap (OSM) has gathered billions of objects from its contributors in a spatial folkson-omy. The contribution of this paper is twofold. First, we add a piece to the LOD jigsaw, the OSM Semantic Network, structuring it as a W3C Simple Knowledge Organization System (SKOS) vocabulary, and discussing its role in the constellation of geo-knowledge bases. Second, we devise Voc2WordNet, a mapping approach between a given vocabulary and WordNet, a pivotal component in the LOD cloud. Our approach is evaluated on the OSM Semantic Network against a human-generated alignment, obtaining high precision and recall.","cites":"2","conferencePercentile":"50"},{"venue":"W2GIS","id":"af390edcb424b05fddb29e78c183ed2b9993a26e","venue_1":"W2GIS","year":"2012","title":"A Holistic Semantic Similarity Measure for Viewports in Interactive Maps","authors":"Andrea Ballatore, David C. Wilson, Michela Bertolotto","author_ids":"1745451, 1691025, 1679887","abstract":"In recent years, geographic information has entered the mainstream , deeply altering the pre-existing patterns of its production, distribution , and consumption. Through web mapping, millions of online users utilise spatial data in interactive digital maps. The typical unit of visualisation of geo-data is a viewport, defined as a bi-dimensional image of a map, fixed at a given scale, in a rectangular frame. In a viewport, the user performs analytical tasks, observing individual map features, or drawing high-level judgements about the objects in the viewport as a whole. Current geographic information retrieval (GIR) systems aim at facilitating analytical tasks, and little emphasis is put on the retrieval and indexing of visualised units, i.e. viewports. In this paper we outline a holistic, viewport-based GIR system, offering an alternative approach to feature-based GIR. Such a system indexes viewports, rather than individual map features, extracting descriptors of their high-level, overall semantics in a vector space model. This approach allows for efficient comparison, classification, clustering, and indexing of viewports. A case study describes in detail how our GIR system models viewports representing geographical locations in Ireland. The results indicate advantages and limitations of the viewport-based approach, which allows for a novel exploration of geographic data, using holistic semantics.","cites":"3","conferencePercentile":"57.14285714"},{"venue":"W2GIS","id":"88290594f4a3f3c39326f49e550de2264b365ab9","venue_1":"W2GIS","year":"2005","title":"Resource Discovery Using Spatio-temporal Information in Mobile Ad-Hoc Networks","authors":"Ouri Wolfson, Bo Xu, Huabei Yin, Naphtali Rishe","author_ids":"3903003, 1749224, 1722338, 1719172","abstract":"In this paper we examine the benefit of reports about resources in mobile ad-hoc networks. Each disseminated report represents information about a spatio-temporal event, such as the availability of a parking slot or a cab request. Reports are disseminated by a peer-to-peer broadcast paradigm, in which an object periodically broadcasts the reports it carries to encountered objects. We evaluate the value of resource information in terms of how much time is saved when using the information to discover resources, compared to the case when the information is not used.","cites":"10","conferencePercentile":"100"},{"venue":"W2GIS","id":"4f9fcc85b8599e7da1dbd2c2f284eaf032b9546f","venue_1":"W2GIS","year":"2006","title":"Putting Location-Based Services on the Map","authors":"Michael Grossniklaus, Moira C. Norrie, Beat Signer, Nadir Weibel","author_ids":"1786155, 1685670, 1725701, 1752711","abstract":"Location-based services for users on the move provide a convenient means of filtering information based on current geographical position. However users also often want to retrieve or capture information associated with past or future locations. We show how new technologies for interactive paper can be used to augment conventional paper maps with location-based services using a combination of user tracking and pointing to the map to specify location.","cites":"7","conferencePercentile":"62.5"},{"venue":"W2GIS","id":"39494abb96b3a230513d166ae524d2605b94f9c9","venue_1":"W2GIS","year":"2008","title":"A Design Process for the Development of an Interactive and Adaptive GIS","authors":"Mathieu Petit, Christophe Claramunt, Cyril Ray, Gaëlle Calvary","author_ids":"2298077, 1680502, 2573275, 1686758","abstract":"Geographical Information Systems (GIS) have long bridged the gap between geo-information databases and applications. Although conceptual modelling approaches for GIS have been particularly successful in the representation of the specific properties of geographical information, there is still a need for a better integration of user intentions and usage. This paper introduces a conceptual framework applied to GIS and defined not only as a \" Geographic Information System \" , but also as a \" Geographic Interactive System \". This approach extends the conceptual framework of a general purpose mobile interactive system to the geographical context. Beside a description of user tasks and the domain data layout, the proposed framework considers the geographical environment as an additional component to the design approach. The role of the spatial dimension in the design of such an interactive system is illustrated all along the conception of a real-time ship tracking system.","cites":"6","conferencePercentile":"100"}]}