{"W4A.csv":[{"venue":"W4A","id":"ab93f64db8b8af46581d8f290915bd9dfac71fa4","venue_1":"W4A","year":"2010","title":"The spoken web application framework: user generated content and service creation through low-end mobiles","authors":"Arun Kumar, Sheetal K. Agarwal, Priyanka Manwani","author_ids":"1750615, 2005527, 2160908","abstract":"While the word 'accessibility' seems to require a new definition in the context of making Web available in developing regions, we propose to expand the definition of 'Web' itself in the same context. The prevalent definition of Web as a system of interlinked textual documents available on the Internet and accessed through a web browser, needs to be modified to include new types of hyperlinked content and new access mechanisms.\n Spoken Web is emerging as an alternate web for the underprivileged by breaking barriers of illiteracy, affordability and local languages. It is envisioned as being complementary to the existing Web and navigable entirely through a voice based interface using an ordinary telephone. In this paper, we present Spoken Web Application Framework (SWAF) -- a framework for enabling creation of sites in Spoken Web through a simple voice interaction over an ordinary phone call. This unique novelty of SWAF provides an extremely simplified service creation ability using voice interaction rather than through programming by IT experts thus enabling a new software development paradigm. It is meant to be a platform for making the power of Web technologies become accessible to the next billion IT users of the world.\n We present the architecture, design and implementation of the SWAF framework.","cites":"19","conferencePercentile":"92.42424242"},{"venue":"W4A","id":"bb8e85d4c1d55dca44c89d7ecd8cf11cd2cd4613","venue_1":"W4A","year":"2016","title":"Dytective: towards detecting dyslexia across languages using an online game","authors":"Luz Rello, Kristin Williams, Abdullah Ali, Nancy Cushen White, Jeffrey P. Bigham","author_ids":"1680197, 2384451, 5764601, 3445541, 1744846","abstract":"At least 10% of the global population has dyslexia. In the United States and Spain, dyslexia is associated with a large percentage of school drop out. Current methods to detect risk of dyslexia are language specific, expensive, or do not scale well because they require a professional or extensive equipment. A central challenge to detecting dyslexia is handling its differing manifestations across languages. To address this, we designed a browser-based game, <i>Dytective</i>, to detect risk of dyslexia across the English and Spanish languages. <i>Dytective</i> consists of linguistic tasks informed by analysis of common errors made by persons with dyslexia. To evaluate <i>Dytective</i>, we conducted a user study with 60 English and Spanish speaking children between 7 and 12 years old. We found children with and without dyslexia differed significantly in their performance on the game. Our results suggest that <i>Dytective</i> is able to differentiate school age children with and without dyslexia in both English and Spanish speakers.","cites":"1","conferencePercentile":"93.75"},{"venue":"W4A","id":"7fcf003165c3506bdf1bf4ddfaf84ffefa0f9eca","venue_1":"W4A","year":"2009","title":"Age and web access: the next generation","authors":"Vicki L. Hanson","author_ids":"1730685","abstract":"When today's young adults become 'older adults' will they exhibit difficulties with technology that appear to characterize the current older generation? This paper is intended to begin a discussion of technology experience as related to aging. The goal is to challenge some existing characterizations of older Web users and consider the implications for the future. Are technology difficulties an inescapable fact of aging? Or are there factors that will serve to equip future generations of older adults with skills that will erase or lessen these difficulties?","cites":"21","conferencePercentile":"100"},{"venue":"W4A","id":"919eba4ea24c29ef48d98f2dcd0109e1d68618b8","venue_1":"W4A","year":"2003","title":"The user experience: designs and adaptations","authors":"Vicki L. Hanson","author_ids":"1730685","abstract":"Specifications for accessibility of Web pages do not necessarily guarantee a usable or satisfying Web experience for persons with disabilities. The needs of many of these individuals fall outside guidelines for accessible content. Many of these users, for example, wish that they simply could \"enlarge\" what is on a Web page. They also express the wish that pages would be \"less confusing\". To meet these needs, Web browsers and various software applications provide for a variety of ways in which page presentations can be altered. The effects of these alterations often have unexpected consequences. Some designs accommodate these alterations better than others. This paper discusses one such application that allows users to control features of Web page presentation and explores design features that facilitate such control.","cites":"24","conferencePercentile":"88.88888889"},{"venue":"W4A","id":"71e0f02c25d6561617410135a53a003c28996f65","venue_1":"W4A","year":"2010","title":"(Voice) website creation and access using phones","authors":"Arun Kumar, Sheetal K. Agarwal, Priyanka Manwani, Ketki Dhanesha","author_ids":"1750615, 2005527, 2160908, 2493241","abstract":"Several attempts have been made and many more are underway to make the existing Web content accessible to all. Such systems, by definition, follow the <i>adapter approach</i> where a legacy system is adapted to meet unforeseen and unplanned requirements. Given the approach, it most often results in solutions that are either non-natural or solve part of the problem. Second, while lot of efforts have gone into making content accessible, relatively less efforts have been put into enabling currently incapable people to create and generate their own accessible content.\n In this challenge paper, we present demonstration of creation of (voice) websites through simple voice interaction system over a phone call. Such an easy interaction enables even non-literate people to be able to generate and make available their own content, in their local language.","cites":"0","conferencePercentile":"6.060606061"},{"venue":"W4A","id":"5af755687981e60ab1c76a0a19cd23d969cddd17","venue_1":"W4A","year":"2006","title":"Mobile phones may be the right devices for supporting developing world accessibility, but is the WWW the right service delivery model?","authors":"Tapan S. Parikh","author_ids":"1755518","abstract":"In this paper we detail the synergies we have observed between the features and limitations of mobile phones, and the usability and accessibility requirements of rural developing world users. This includes support for sequential interaction, multimedia input and output, asynchronous messaging and a universally familiar numeric keypad. However, we argue that the WWW as currently conceived may be an inappropriate model for delivering mobile information services in this context. We highlight a number of tensions we have observed between the traditional web model, and the design synergies that we have uncovered. To demonstrate an alternative framework, we describe CAM --- a platform for delivering mobile information services in the rural developing world. Supporting scripted execution, media-driven, tangible interaction as well as an offline usage model, CAM is uniquely adapted both to rural accessibility requirements and the inherent capabilities of mobile phones. By learning from the CAM design, we can either improve the design of existing mobile web standards and services, or implement a more appropriate framework altogether.","cites":"4","conferencePercentile":"52.94117647"},{"venue":"W4A","id":"2d91b2ef59e28c6b85d3b47006b1393db0b89422","venue_1":"W4A","year":"2013","title":"Crowdsourcing platform for workplace accessibility","authors":"Hironobu Takagi, Akihiro Kosugi, Shin Saito, Masayoshi Teraguchi","author_ids":"3086992, 2948956, 7136789, 2961233","abstract":"Our modern workplace is filled with information sources such as the Web, videos, documents and images. Each employee is required to learn from these sources to work effectively and to contribute to the company's business. Crowdsourcing services have a great potential to improve workplace accessibility by providing captions for meeting videos, describing key diagrams, and converting scanned materials into text files. However, it is risky to expose confidential materials in a public crowd. Crowdsourcing to employees who have knowledge and expertise may solve the issue of confidentiality, but it is difficult to reach them to access their \"niche\" spare time for tasks given their busy work schedules. Therefore, we propose a crowdsourcing platform to securely disseminate tasks to employees by inviting them to do microtasks. The basic strategy is akin to Web advertising. The system automatically suggests tasks to employees as a part of intranet webpages and in e-mail clients by considering work contexts, employee interests and expertise, and the security of the materials. We will first discuss the pros and cons of intraorganizational crowdsourcing and then propose the new crowdsourcing platform.","cites":"0","conferencePercentile":"21.21212121"},{"venue":"W4A","id":"3f0f4f61812103e1ecdbd1a2ec01b4d923c147c9","venue_1":"W4A","year":"2015","title":"Understanding design considerations for adaptive user interfaces for accessible pointing with older and younger adults","authors":"Aqueasha Martin-Hammond, Abdullah Ali, Catherine Hornback, Amy Hurst","author_ids":"1841125, 5764601, 1828611, 1759649","abstract":"The Internet has become an important tool for many aspects of modern life. However, some individuals may experience challenges accessing the Internet if they have difficulty accurately controlling a pointing device. These pointing problems can vary in severity and frequency and may be caused by a motor impairment, limited hand dexterity, or fatigue. We believe that adaptive user interfaces (AUIs) offer a unique solution to detect and accommodate an individual's current pointing behavior. While past work has explored the implementation of detecting pointing challenges and designing adaptations, little has been done to understand how this population would like to interact with this software. In this paper, we present the results from participatory design sessions with older and younger adults that highlight their preferences for novel AUIs. We found diverse preferences and attitudes towards how AUIs notify a user of their current performance, and how they should adapt to pointing behavior. We present these diverse opinions as three personas that can be applied to future design of any AUI.","cites":"1","conferencePercentile":"66.66666667"},{"venue":"W4A","id":"57aaf75b0e7a5e1ab0a96b153599eda8b0d86a8f","venue_1":"W4A","year":"2013","title":"Captions versus transcripts for online video content","authors":"Raja S. Kushalnagar, Walter S. Lasecki, Jeffrey P. Bigham","author_ids":"1683550, 2598433, 1744846","abstract":"Captions provide deaf and hard of hearing (DHH) users access to the audio component of web videos and television. While hearing consumers can watch and listen simultaneously, the transformation of audio to text requires deaf viewers to watch two simultaneous visual streams: the video and the textual representation of the audio. This can be a problem when the video has a lot of text or the content is dense, e.g., in Massively Open Online Courses. We explore the effect of providing caption history on users' ability to follow captions and be more engaged. We compare traditional on-video captions that display a few words at a time to off-video transcripts that can display many more words at once, and investigate the trade off of requiring more effort to switch between the transcript and visuals versus being able to review more content history. We find significant difference in users' preferences for viewing video with on-screen captions over off-screen transcripts in terms of readability, but no significant difference in users' preferences in following and understanding the video and narration content. We attribute this to viewers' perceived understanding significantly improving when using transcripts over captions, even if they were less easy to track. We then discuss the implications of these results for on-line education, and conclude with an overview of potential methods for combining the benefits of both onscreen captions and transcripts.","cites":"9","conferencePercentile":"90.90909091"},{"venue":"W4A","id":"6bbb8c9b58664e8a42d48fbafad78dbcf0e6234d","venue_1":"W4A","year":"2015","title":"An optimal sampling method for web accessibility quantitative metric","authors":"Mengni Zhang, Can Wang, Jiajun Bu, Zhi Yu, Yi Lu, Ruijie Zhang, Chun Chen","author_ids":"8657568, 1804563, 8475311, 2125223, 1699219, 7265734, 5371645","abstract":"When evaluating the accessibility of a website, we usually resort to sampling methods to reduce the cost of evaluation. In this kind of approaches, a small subset of pages in a website are chosen for evaluating the accessibility value of the whole website. Good sampling quality means the selected subset can represent well the accessibility level of the whole website, i.e. minimizing the accessibility evaluation difference between the whole site and the sampled subset. As existing studies show the accuracy of sampling methods depends heavily on the metric, we propose in this paper a specific sampling method OPS-WAQM that is optimized for Web Accessibility Quantitative Metric (WAQM). OPS-WAQM minimizes the sampling error by choosing the optimal sample numbers in different page depth layers. A greedy algorithm is proposed to approximately solve the optimization problem in an efficient way. We use a dataset of 20 websites, 365780 web pages to validate our method. Experimental results show that our sampling method is effective for web accessibility evaluation.","cites":"0","conferencePercentile":"30.95238095"},{"venue":"W4A","id":"5ab45761da21ae30427e0c8b2270a04fa6c68604","venue_1":"W4A","year":"2006","title":"2005 accessibility diagnosis on the government web sites in Taiwan, R.O.C","authors":"Yui-Liang Chen, Yen-Yu Chen, Monica Shao","author_ids":"2465055, 3002155, 2818387","abstract":"Improvement in web technology and services alone with diversity development has caused a high demand of Internet usage. New web technologies and equipment have opened infinite possibilities for global communication, but these possibilities are limited by various factors such as setting the browser version too high, causing limitations to lower version holders, or making faster speed hard-drives producing delays in lower speed hard-drives. However, the most severe factor limiting web communication's performing at full potential is accessibility for the both physically and mentally disabled.The Executive Yuan of the Taiwanese Government has recently pushed forward the idea of Web accessibility in Governments' websites. Assessment of 35 websites has shown to pass Priority 1 Level Validation (machine recognition/machine review), of which 28 reached the Conformance Level \"A+.\" Apart from the checkpoint numbered 1.8 of machine recognition/machine review that had an increase in failed website percentage, the rest presented a decline in the number of failed websites, which suggested improvements in Web accessibility development in the year 2005. The most commonly seen checkpoint errors were similar in 2004 and 2005, and included checkpoint error numbered 5.5 (Provide summaries for tables), 10.6 (Do not use space to separate adjacent links), 4.3 (Identify the language of the text), 3.5 (Use relative sizing and positioning (% values) rather than absolute (pixels)), 3.3 (Use a public text identifier in a DOCTYPE statement), 1.1 (Provide a text equivalent for every image), and 9.3 (Make sure that event handlers do not require use of a mouse).Comparison between Freego and Bobby validation tools using the 58 checkpoints listed in the Web Accessibility Regulations have shown six checkpoints need to be revised. Five checkpoints were different in Priority Level setup, and one checkpoint numbered 9.3 (Make sure that event handlers do not require use of a mouse) was different in the calculation of number of errors. Apart from that, the 90 checkpoints listed in the Web Accessibility Regulations in Freego, none can be compared with checkpoint number 13.1 (Create link phrases that make sense when read out of context) in Bobby. With these results, it was clear that the Freego Validation Tool needs to be improved, and that Web Accessibility Regulations needs to be discussed further.","cites":"5","conferencePercentile":"67.64705882"},{"venue":"W4A","id":"149167bd7266655ad7e28dab1e0ba2ea8bb434fe","venue_1":"W4A","year":"2015","title":"The effects of automatic speech recognition quality on human transcription latency","authors":"Yashesh Gaur, Walter S. Lasecki, Florian Metze, Jeffrey P. Bigham","author_ids":"2977049, 2598433, 1740721, 1744846","abstract":"Transcription makes speech accessible to deaf and hard of hearing people. This conversion of speech to text is still done manually by humans, despite high cost, because the quality of automated speech recognition (ASR) is still too low in real-world settings. Manual conversion can require more than 5 times the original audio time, which also introduces significant latency. Giving transcriptionists ASR output as a starting point seems like a reasonable approach to making humans more efficient and thereby reducing this cost, but the effectiveness of this approach is clearly related to the quality of the speech recognition output. At high error rates, fixing inaccurate speech recognition output may take longer than producing the transcription from scratch, and transcriptionists may not realize when transcription output is too inaccurate to be useful. In this paper, we empirically explore how the latency of transcriptions created by participants recruited on Amazon Mechanical Turk vary based on the accuracy of speech recognition output. We present results from 2 studies which indicate that starting with the ASR output is worse unless it is sufficiently accurate (Word Error Rate of under 30%).","cites":"0","conferencePercentile":"30.95238095"},{"venue":"W4A","id":"705ead1ec8d34a2cb4b14d26349ff3b29f0468ac","venue_1":"W4A","year":"2013","title":"Legion scribe: real-time captioning by the non-experts","authors":"Walter S. Lasecki, Christopher D. Miller, Raja S. Kushalnagar, Jeffrey P. Bigham","author_ids":"2598433, 2598184, 1683550, 1744846","abstract":"Real-time captioning provides people who are deaf or hard of hearing access to aural speech in the classroom and at live events. The only reliable approach currently is to recruit a local or remote expert stenographer who is able to type at natural speaking rates, who charge more than $100 USD per hour and must be scheduled in advance. We introduce Legion Scribe (Scribe) that allows 3-5 ordinary people who can hear and type to collectively caption speech in real-time together. Each individual is unable to type at natural speaking rates, and so each is only asked to type part of what they hear. Scribe computationally stitches the partial captions together to form a final caption stream. We have shown that the accuracy of Scribe captions approaches those of a professional stenographer, while its latency and cost is dramatically lower.","cites":"5","conferencePercentile":"74.24242424"},{"venue":"W4A","id":"d3f7f2c9d25a3ed7330f70590e3d10bebd2653d7","venue_1":"W4A","year":"2015","title":"CAN: composable accessibility infrastructure via data-driven crowdsourcing","authors":"Yun Huang, Brian Dobreski, Bijay Bhaskar Deo, Jiahang Xin, Natã Miccael Barbosa, Yang Wang, Jeffrey P. Bigham","author_ids":"1777347, 3300352, 2022892, 3082999, 3165212, 1803426, 1744846","abstract":"Despite persistent effort, many web pages are still not accessible to everyone. Fixing web accessibility problems can be complicated. Developers need to have extensive knowledge not only of possible accessibility problems but also of approaches for fixing them. This paper is about using the large number of accessibility issues on real websites and crowd-sourced fixes for them as a unique source of learning materials for web developers to learn how to build accessible components in a cost-efficient manner. In this paper, we present the design, development and study of CAN (Composable Accessibility Infrastructure), a crowdsourcing infrastructure that collects web accessibility issues and their fixes, dynamically composes solutions on-the-fly, and delivers the crowd-sourced content as teaching materials. Our unique CAN user interaction and system design enables end users with disabilities to both benefit from and contribute to the system without additional effort in their daily web browsing, and allows web developers to experience real accessibility issues and initiate a learning process with first-hand materials. CAN also provides an opportunity for data-driven discovery of the common implementation practices that cause accessibility issues. We show how CAN addresses a set of accessibility issues on the top 100 popular websites. We also present our user study results where web developers who had varying knowledge of web accessibility all found our system an effective and interesting platform to learning web accessibility.","cites":"0","conferencePercentile":"30.95238095"},{"venue":"W4A","id":"7e00ac165d2842bdb033f5a4719b24392e3778c9","venue_1":"W4A","year":"2006","title":"Use of RSS feeds for content adaptation in mobile web browsing","authors":"Alexander Blekas, John D. Garofalakis, Vasilios Stefanis","author_ids":"1791163, 1680221, 1767233","abstract":"While mobile phones are becoming more popular, wireless communication vendors and device manufacturers are seeking new applications for their products. Access to the large corpus of Internet information is a very prominent field, however the technical limitations of mobile devices pose many challenges. Browsing the Internet using a mobile phone is a large scientific and cultural challenge. Web content must be adapted before it can be accessed by a mobile browser. In this work we build on the proxy server solution to present a new technique that uses Really Simple Syndication (RSS) feeds for the adaptation of web content for use in mobile phones. This technique is based in concrete design guidelines and supports different viewing modes. Experimentation shows a significant decrease in the transformed content of about 80% in size facilitating cost-effective web browsing.","cites":"16","conferencePercentile":"94.11764706"},{"venue":"W4A","id":"508253502b0397e2668e7bd009f9782ba0bc817f","venue_1":"W4A","year":"2007","title":"The HearSay non-visual web browser","authors":"Yevgen Borodin, Jalal Mahmud, I. V. Ramakrishnan, Amanda Stent","author_ids":"2133004, 1748477, 1762197, 1760622","abstract":"This paper describes HearSay, a non-visual Web browser, featuring context-directed browsing, a unique and innovative Web accessibility feature, and an extensible VoiceXML dialog interface. The browser provides most of the standard browsing functionalities, including flexible navigation and form-filling. The paper also outlines future work aiming to make the Web more accessible for individuals with visual impairments.","cites":"26","conferencePercentile":"84.61538462"},{"venue":"W4A","id":"69bf593b497a7793bc3f35fbe8e91d28bff99933","venue_1":"W4A","year":"2006","title":"A web browsing system based on adaptive presentation of web contents for cellular phones","authors":"Yuki Arase, Takuya Maekawa, Takahiro Hara, Toshiaki Uemukai, Shojiro Nishio","author_ids":"3043844, 1749254, 1697569, 1765553, 1717916","abstract":"Cellular phones have already been widely used to access the Web. However, most existing Web pages are designed for desktop PCs, and thus, it is inconvenient to browse these large Web pages on a cellular phone with a small screen and poor interfaces. Users who browse a Web page on a cellular phone have to scroll the whole page to find an objective content, and then, have to scroll within the content in detail to get useful information. In this paper, we propose a novel browsing system to break off these burdensome operations by adaptively presenting Web contents according to their characteristics.","cites":"2","conferencePercentile":"26.47058824"},{"venue":"W4A","id":"0ee20b71f300c1acb9632439bb6f50e20490ffe2","venue_1":"W4A","year":"2014","title":"Introducing game elements in crowdsourced video captioning by non-experts","authors":"Hernisa Kacorri, Kaoru Shinkawa, Shin Saito","author_ids":"1745229, 3109137, 7136789","abstract":"Video captioning can increase the accessibility of information for people who are deaf or hard-of-hearing and benefit second language learners and reading-deficient students. We propose a caption editing system that harvests crowdsourced work for the useful task of video captioning. To make the task an engaging activity, its interface incorporates game-like elements. Non-expert users submit their transcriptions for short video segments against a countdown timer, either in a \"type\" or \"fix\" mode, to score points. Transcriptions from multiple users are aligned and merged to form the final captions. Preliminary results with 42 participants and 578 short video segments show that the Word Error Rate of the merged captions with two users per segment improved from 20.7% in ASR to 16%. Finally, we discuss our work in progress to improve both the accuracy of the collected data and to increase the crowd engagement.","cites":"1","conferencePercentile":"56.06060606"},{"venue":"W4A","id":"2c366167275635b3a90bf18d31ab6953c695e6c8","venue_1":"W4A","year":"2011","title":"Estimating dyslexia in the web","authors":"Ricardo A. Baeza-Yates, Luz Rello","author_ids":"1747635, 1680197","abstract":"In this study we present an estimation of texts containing English dyslexic errors in the Web. A classification of lexical errors is proposed and unique dyslexic errors are distinguished from other kind of errors due to spelling and grammatical errors, typos, OCR errors and errors produced when English is used as a foreign language. A representative sample of each kind of error is used to calculate a lower bound for the prevalence of dyslexia in the English Web. Although dyslexia has been studied in the context of Web accessibility, to the best of our knowledge, an estimation of Web texts containing dyslexic errors was unknown. Our results are useful to tackle future work in Web accessibility among dyslexic users focusing not only in the interface but also in the text content.","cites":"12","conferencePercentile":"100"},{"venue":"W4A","id":"53878e28a5b77bc7c4e071a8294782906cea04b6","venue_1":"W4A","year":"2008","title":"MokE: a tool for Mobile-ok evaluation of web content","authors":"John D. Garofalakis, Vasilios Stefanis","author_ids":"1680221, 1767233","abstract":"The ever-growing corpus of web content is now accessible from mobile devices. But is web content ready for mobile access? Which characteristics provide an acceptable user experience when using a mobile device? Based on W3C's MobileOK best practices and tests we present MokE (Mobile OK Evaluator), a tool that helps creators of web content, webmasters and site administrators to evaluate how a mobile user will experience browsing of their content. By making use of W3C's basic tests this tool is comprised of a set of modules that crawl a web site, analyze its content (including a hidden web capability) and provide an evaluation of its appropriateness for mobile access.","cites":"1","conferencePercentile":"22.91666667"},{"venue":"W4A","id":"d4230daceda0fbc7d95cfc46e2f247380b70a5e6","venue_1":"W4A","year":"2016","title":"LMS weds WhatsApp: bridging digital divide using MIMs","authors":"Jyotirmaya Mahapatra, Saurabh Srivastava, Kuldeep Yadav, Kundan Srivastava, Om Deshmukh","author_ids":"3357319, 3222927, 1741710, 3068571, 2116262","abstract":"Recently, Mobile Instant Messaging Services (MIMs) such as WhatsApp have shown tremendous potential in enabling communication among diverse set of people. Such services have an even more critical role to play in developing regions. Due to the digital divide, a much higher prevalence of mobile-only internet connection has been reported, where millions of users leapfrogged to mobile-internet entirely skipping the desktop-based internet phase. In this paper, we report findings from a longitudinal field study conducted in a private higher education institution in India. The aim of the study was to explore the potential of an integrated blended learning setup which combines WhatsApp with a Learning Management System (LMS). The study was performed in a class of 20 final year engineering students over a period of three months. Our findings suggest that there is a systematic bias in the usage of WhatsApp vs. LMS based on several factors, including specifics of the learning activity, student behavior, and status of the course in the semester, and the time of the day. Synchronous and asynchronous interaction on WhatsApp are perceived to be engaging, support collaboration and aid learning by complementing LMS-based and face-to-face learning.","cites":"0","conferencePercentile":"45"},{"venue":"W4A","id":"428f72658844e808928aaffa39885f03e05d6557","venue_1":"W4A","year":"2012","title":"Universal and ubiquitous web access with Capti","authors":"Yevgen Borodin, Andrii Sovyak, Alexander Dimitriyadi, Yury Puzis, Valentyn Melnyk, Faisal Ahmed, Glenn Dausch, I. V. Ramakrishnan","author_ids":"2133004, 2087620, 2055113, 2620033, 2704365, 1898452, 2307755, 1762197","abstract":"In this paper we present Capti -- a universally and ubiquitously accessible web browsing application enabling intuitive and usable web access for people with and w/o vision impairments. Capti provides a usable screen-reader interface for web browsing and an accessible listen-to-it-later Playlist (charmtechlabs.com).","cites":"0","conferencePercentile":"17.24137931"},{"venue":"W4A","id":"01a928e33263352dd3c3a01d3ae9e946021115c0","venue_1":"W4A","year":"2012","title":"An intuitive accessible web automation user interface","authors":"Yury Puzis, Yevgen Borodin, Faisal Ahmed, I. V. Ramakrishnan","author_ids":"2620033, 2133004, 1898452, 1762197","abstract":"In recent years, the Web has become an ever more sophisticated and irreplaceable tool in our daily lives. While the visual Web has advanced at a rapid pace, assistive technology has not been able to keep up, increasingly putting visually impaired users at a disadvantage. Web automation has the potential to bridge the accessibility divide between the ways blind and sighted people access the Web; specifically, it can enable blind people to accomplish web browsing tasks that were previously slow, hard, or even impossible to achieve. In this paper, we propose and evaluate an intuitive and accessible web automation interface. We validate the design in a Wizard-of-Oz user study with visually-impaired subjects and show that the proposed approach has the potential to significantly increase accessibility and usability of web pages, reduce interaction time, and increase user satisfaction. Our findings demonstrate the feasibility of and emphasize the pressing need for truly accessible web automation technologies.","cites":"5","conferencePercentile":"81.03448276"},{"venue":"W4A","id":"6187b6599b7677d5a53f46c45e47188652c43938","venue_1":"W4A","year":"2012","title":"Why read if you can skim: towards enabling faster screen reading","authors":"Faisal Ahmed, Yevgen Borodin, Yury Puzis, I. V. Ramakrishnan","author_ids":"1898452, 2133004, 2620033, 1762197","abstract":"<i>Skimming</i> broadly refers to different speed-reading methods that aim to enhance the rate of reading without unduly compromising on comprehension and retention of information. Skimming of content could be particularly useful for people with vision impairments, who frequently experience information overload when listening to reams of digital content online. Support for usable and useful skimming in modern screen readers remains very poor. This paper explores the user requirements for a usable non-visual skimming interface, informed by a large-scale human-subject experiment with blind individuals. Specifically, the study has: (1) helped identify the type of skimming that can be useful in screen reading main content in web pages; (2) led to the development of a usable interface for accessible online skimming; (3) demonstrated the utility of the accessible skimming interface in two realistic use scenarios; (4) identified automatic summarization techniques that could \"closely\" approximate skimming methods used by sighted people.","cites":"9","conferencePercentile":"93.10344828"},{"venue":"W4A","id":"124da15b0f30a114f9d845a1c528eb70f8e51062","venue_1":"W4A","year":"2014","title":"Predictive, accessible web automation: a longitudinal study","authors":"Yury Puzis, Yevgen Borodin, I. V. Ramakrishnan","author_ids":"2620033, 2133004, 1762197","abstract":"The problem of efficient, usable non-visual web access remains inadequately solved, despite its critical importance to a significant number of visually-impaired existing and potential Web users. Web automation, a process of automating browsing actions on behalf of the user, has the potential to significantly improve the usability and accessibility of non-visual web browsing. Automation Assistant is an accessible web automation system designed specifically for this purpose. Until now, however, Automation Assistant was only evaluated in a short-term, controlled experiment. In this paper we report preliminary results on a longitudinal study designed to explore the long term practicality of the approach to accessible web automation taken by Automation Assistant. The study involves a single participant and can be considered a pilot of a future experiment involving a large number of participants and benefiting from the lessons learned during the pilot.","cites":"0","conferencePercentile":"22.72727273"},{"venue":"W4A","id":"1c02732887049aea12eeec005fcf8ebc50f0cc8f","venue_1":"W4A","year":"2015","title":"What not to wearable: using participatory workshops to explore wearable device form factors for blind users","authors":"Michele A. Williams, Erin Buehler, Amy Hurst, Shaun K. Kane","author_ids":"1760659, 2595526, 1759649, 2893996","abstract":"In this paper we document two participatory design workshops conducted with a team of eight visually impaired adults that explored features and form factors for a wearable navigation technology. We compare and contrast our experiences conducting a low-fidelity prototyping activity using office supplies and a medium-fidelity prototyping activity using electronic components and a scenario-based approach. While both sessions produced designs with similar features and form factors, participant engagement was much higher during the medium-fidelity session primarily due to the tangible materials used and the more directed structure of the activity. We present the resulting designs as well as recommendations for participatory design prototyping methods for wearable technology development, particularly for people with vision impairments.","cites":"3","conferencePercentile":"91.66666667"},{"venue":"W4A","id":"697ff5ddfe0f4ff25e0d020fe4d08c3896c7ddf4","venue_1":"W4A","year":"2016","title":"An empirical investigation of the situationally-induced impairments experienced by blind mobile device users","authors":"Ali Abdolrahmani, Ravi Kuber, Amy Hurst","author_ids":"3254502, 1712686, 1759649","abstract":"In this paper, we describe a study specifically focusing on the situationally-induced impairments and disabilities (SIIDs) which individuals who are blind encounter when interacting with mobile devices. We conducted semi-structured interviews with eight legally-blind participants, and presented them with three scenarios to inspire discussion relating to SIIDs. Nine main themes emerged from analysis of the participant interviews, including the challenges faced when using a mobile device one-handed while using a cane to detect obstacles along the intended path, the impact of using a mobile device under inhospitable conditions, and concerns associated with using a mobile device in environments where privacy and safety may be compromised (e.g. when using public transport). These were found to reduce the quality of the subjective interaction experience, and in some cases limiting use of mobile technologies in public venues. Insights from our research can be used to guide the design of future mobile interfaces to better meet the needs of users whose needs are often excluded from the design process.","cites":"0","conferencePercentile":"45"},{"venue":"W4A","id":"635e8e0255787e6162746a360da53e82a92f15c6","venue_1":"W4A","year":"2016","title":"Accessibility barriers to online education for young adults with intellectual disabilities","authors":"Erin Buehler, William Easley, Amy Poole, Amy Hurst","author_ids":"2595526, 2751607, 3445756, 1759649","abstract":"In postsecondary education, technology and online resources have become a pervasive component of learning, but they are not always accessible. For students with intellectual disabilities, completing technology-dependent tasks may pose unique challenges that are not always addressed by the disability support services offered at the university level. During our fieldwork, we have observed several barriers to online education tools in a postsecondary environment for students with intellectual disabilities. For example, a student with an intellectual disability submitting an assignment via email to an instructor may encounter difficulties recalling and navigating to the location of their attachment file.\n In this paper, we describe core skills and common interfaces that we have identified as problematic for this population through an emic ethnography. We offer emic (perceptions from within a given environment) experience accounts to highlight the obstacles we have observed in a) information retrieval, b) navigation and information architecture c) file management, and d) password management. As researchers and educators involved in a postsecondary program for young adults with intellectual disability (ID), we have spent considerable time working with this population. For each scenario, we offer examples from our own experience of the techniques and technologies that did or did not help students accomplish these tasks. Based on these experiences, we provide recommendations for mitigating these barriers including education and training for students and developers and the use of existing interventions and tools. We also discuss future directions for this work. We believe that heightened awareness and communication between educators, designers, and students with disabilities will help address these problems and generate solutions which provide more accessible education experiences for learners with diverse needs.","cites":"0","conferencePercentile":"45"},{"venue":"W4A","id":"11e99b23a6617599cfc7bb34f59a4ff2e07918cd","venue_1":"W4A","year":"2012","title":"Usability, demography, and directions for W4A","authors":"Alan F. Newell","author_ids":"1731857","abstract":"W4A has made tremendous strides in increasing the accessibility of web sites, and raising the profile of this activity, by researching into and producing web accessibility technologies and guidelines for this process. To a great extent, the literature has focused on how to ensure that data on web sites, and other aspects of the digital landscape, are accessible people with disabilities - but are there other goals that W4A should be pursuing?\n The introduction to this conference reads: \"The World Wide Web has changed the way we search, access, consume and produce information\". Roberts [4] however, reports that older people's use of the Internet remains lower than that of younger adults (64% of those 65 and older have never used the Internet, and, although the usage by older people is growing, it is at a slow rate). The situation in the USA is not dissimilar. In the UK, and possibly the rest of the world, this lack of usage of the Internet is also the case for those younger people who have few or no educational qualifications. There is also growing evidence that members of these groups are more likely to become \"digitally disengaged\" as their characteristics and capabilities change with time.\n Thus, unless the \"us\" only refers to conference delegates, the above quote should have read \"The World Wide Web has changed the way <b>some of us</b> search, access, consume and produce information\". This is not an isolated error -- the literature is full of \"everyone\" as a short hand for \"the people I know\" or \"over 50% of the population - probably\". What about the others?\n The theme of the 2009 W4A in Madrid was Web Accessibility for Older Users. Are We There Yet? Clearly we are not there yet! The web is still not \"accessible\" to all older and uneducated or technophobic people nor to many people from a different technological generation or different cultures. It was argued in Madrid that these issues should be a greater priority for W4A researchers. Appropriate ways of addressing them, however, were likely to be different from the task of increasing \"accessibility\" for (young) people with (mainly) sensory and motor disabilities [1].\n This is a different war and W4A needs to develop different weapons. We need to investigate why these users are or <b>choose</b>, to be digitally excluded? What do they need and want in terms of digital information? That is: how can technology be made which is \"acceptable\" as well as \"accessible\"? This leads to questions, including:\n What does the evidence of \"accessible\" but \"unusable\" sites tell us about current guidelines and methods? Why do many designers seem to ignore current guidelines? How does this reflect on the acceptability and usability of these guidelines?\n Should there be a greater focus on \"usability\" of information and marginalized users' experience of the technology? How can we facilitate users' \"delight\"?\n Should we focus more on the design of web sites and other sources of digital data, and less on options to cope with inaccessible digital data? Should we be focusing on methods for improving design or coping with bad design?\n What are the most effective ways of communicating our research to the mainstream web community? How do we influence content developers or those developing tools for content developers?\n How can and should we contribute to the education of software engineers and web developers? How do we make our recommendations seem a challenge rather than a chore?\n In 2011, I discussed methodologies for design of artifacts for older and disabled people. These concepts could play a part in assisting this community to address the challenges suggested above. I have also used inter-active live theatre and narrative film techniques to raise awareness of the issues older people can have with new technologies [2 &amp; 3]. This can be an exciting and effective way to communicate important messages about the design of accessible and usable web resources to the wider world of the web.\n Everyone is growing older -- including delegates at W4A -- and, given the rate of change of both people and technology with time, these challenges are unlikely to go away.","cites":"0","conferencePercentile":"17.24137931"},{"venue":"W4A","id":"210f1143b0177c26e58112b01d871c3ec1b88a32","venue_1":"W4A","year":"2016","title":"Contextual language learning with Capti ESL Assistant","authors":"Yevgen Borodin, Yury Puzis, Andrii Sovyak, Vikas Ashok, Andrii Melnyk, I. V. Ramakrishnan","author_ids":"2133004, 2620033, 2087620, 3042658, 3144335, 1762197","abstract":"In this paper, we present <i>Capti ESL Assistant</i>, a novel <i>universally accessible</i> web application that facilitates acquisition of English by helping language learners develop their reading and listening skills simultaneously. It features built-in translation and the Word Challenge game that enables users to learn the language in the <i>context</i>. It is also accessible to users with print disabilities.","cites":"0","conferencePercentile":"45"},{"venue":"W4A","id":"22c4cfc73102c9bd5cd3464a7fc16925c3af2f52","venue_1":"W4A","year":"2008","title":"Towards one world web with HearSay3","authors":"Yevgen Borodin, Jeffrey P. Bigham, Amanda Stent, I. V. Ramakrishnan","author_ids":"2133004, 1744846, 1760622, 1762197","abstract":"In this paper, we present the key functionalities of <i>HearSay 3, a non-visual web browser</i> designed with the goal of improving web accessibility across the world. The featured functionalities include transparent support for multiple languages, collaborative labeling that harnesses the power of the social web, and a usable interface for handling dynamic web content.","cites":"12","conferencePercentile":"93.75"},{"venue":"W4A","id":"92ef79e6d434570993ce142c07597ab9acb56b0e","venue_1":"W4A","year":"2016","title":"Wearables for all: development of guidelines to stimulate accessible wearable technology design","authors":"Jobke Wentzel, Eric Velleman, Thea van der Geest","author_ids":"3059225, 2921779, 2454424","abstract":"In this paper, we present the rationale and approach for establishing guidelines for the development of accessible wearables. Wearable technology is increasingly integrated in our everyday lives. Therefore, ensuring accessibility is pivotal to prevent a digital divide between persons who have and persons who lack access to these devices, caused by their abilities. We present a project in which guidelines are created that enable developers to design accessible wearable apps and technologies. These guidelines will be created with developers who have experience with designing accessible technology and/or wearables. In addition, users who (potentially) experience problems with accessibility of wearables (persons who have a disability) are involved in the development of the guideline, to ensure their validity from an end-user perspective.","cites":"0","conferencePercentile":"45"},{"venue":"W4A","id":"62e66dfa55f7ff47553e5c55f4659548eccbf0c3","venue_1":"W4A","year":"2009","title":"TeleWeb: accessible service for web browsing via phone","authors":"Yevgen Borodin, Glenn Dausch, I. V. Ramakrishnan","author_ids":"2133004, 2307755, 1762197","abstract":"In this paper, we present <i>TeleWeb</i> -- a telephony service for web browsing via the most ubiquitous communication device, the Phone. TeleWeb integrates a simple and usable phone interface with the intelligent features such as context-directed browsing, template-detection, and macro-replaying. We expect that TeleWeb will equally appeal to people with vision impairments, older adults who may not be comfortable using computers, and anyone who wants to access the Web on the move.","cites":"4","conferencePercentile":"59.61538462"},{"venue":"W4A","id":"73bcda25f57785b637720f25b1d9f0505e46d9d8","venue_1":"W4A","year":"2015","title":"Capti-speak: a speech-enabled web screen reader","authors":"Vikas Ashok, Yevgen Borodin, Yury Puzis, I. V. Ramakrishnan","author_ids":"3042658, 2133004, 2620033, 1762197","abstract":"People with vision impairments interact with web pages via screen readers that provide keyboard shortcuts for navigating through the content. However, web browsing with screen readers can be a frustrating experience mainly due to time and effort spent on locating the desired content through the extensive use of keyboard shortcuts. This gets even worse if users have limited shortcut vocabulary or are not familiar with the structure of a particular webpage. Augmenting screen readers with a speech input interface has the potential to alleviate the above limitations.\n This paper describes the design, implementation, and evaluation of <i>Capti-Speak</i>, a speech-enabled screen reader for web browsing, capable of translating speech utterances into browsing actions, executing the actions, and providing audio feedback. The novelty of <i>Capti-Speak</i> is that it leverages a custom dialog model, designed exclusively for non-visual web access, for interpreting speech utterances. A user study with 20 blind subjects showed that Capti-Speak was significantly more usable and efficient compared to the regular screen reader, especially for ad-hoc browsing, searching, and navigating to the content of interest.","cites":"0","conferencePercentile":"30.95238095"},{"venue":"W4A","id":"569ae941d96dff60cfdca9b52d40bbab14a66a85","venue_1":"W4A","year":"2015","title":"Look Ma, no ARIA: generic accessible interfaces for web widgets","authors":"Valentyn Melnyk, Vikas Ashok, Yury Puzis, Yevgen Borodin, Andrii Sovyak, I. V. Ramakrishnan","author_ids":"2704365, 3042658, 2620033, 2133004, 2087620, 1762197","abstract":"Once simple and static, many web pages have now evolved into complex web applications. Hundreds of web development libraries provide ready-to-use custom widgets, which can be further customized to fit the needs of individual web applications. Web developers are supposed to use ARIA specifications to make widgets accessible to screen readers; however, ARIA markup is often used incorrectly and inconsistently, and sometimes even missing in webpages altogether. Given a wide selection of widgets and a lack of proper ARIA support, accessing content of custom widgets in web pages with screen readers has been a challenge for blind users. As a result, blind users cannot benefit from the convenience of using these widgets or, even worse, get stuck on inaccessible content. In our previous work, we showed that custom dynamic widgets could be automatically detected and classified as soon as they appear in web pages. In this paper, we propose to make such widgets accessible by providing generic interfaces for widgets of a particular class. We show how this can be accomplished on the example of Web Chat widget. To demonstrate the usability of the resulting chat interface, we report on the results of a user study with 18 blind screen-reader users.","cites":"0","conferencePercentile":"30.95238095"},{"venue":"W4A","id":"d05295bc65605d1c4f25367c0b3b6cf03b6a41d8","venue_1":"W4A","year":"2015","title":"Affordable web accessibility: a case for cheaper ARIA","authors":"Yury Puzis, Yevgen Borodin, Andrii Sovyak, Valentyn Melnyk, I. V. Ramakrishnan","author_ids":"2620033, 2133004, 2087620, 2704365, 1762197","abstract":"When a commercial entity designs a product, one of the major considerations is the cost of production. No matter how amazing a product idea is, how many features the product has, or how noble the cause is, most products will fail if they are too expensive for the target market or too expensive to compete in the market. Any website is, of course, a product; and web accessibility is often perceived as an added feature that costs extra money to develop. In this paper, we make an argument that the greatest weakness of WAI-ARIA, an accessibility specification for web developers, is the cost of its implementation. We argue that this cost, rather than specific technical constraints, may be the main culprit of the poor accessibility of many websites, except for the most popular ones, and of the slow progress in WAI-ARIA support in screen readers. We contend that the accessibility of the Web could be greatly improved if an <i>affordable</i> version of WAI-ARIA were to emerge. This can be achieved by: (a) extending the specification to increase its utility for a wider range of potential users, which will allow for economies of scale, and (b) refining the specification to make it both more cost effective for web development and more open to innovation in user-agent development. In this paper, we discuss accessible web development in the context of cost and identify potential areas of improvement.","cites":"0","conferencePercentile":"30.95238095"},{"venue":"W4A","id":"5c1e6ea4b06c61ea0e85c6072d93b7a74da6599b","venue_1":"W4A","year":"2015","title":"Complexities of practical web automation","authors":"Yury Puzis, Yevgen Borodin, I. V. Ramakrishnan","author_ids":"2620033, 2133004, 1762197","abstract":"Web automation, a process of automating browsing actions on behalf of the user, has the potential to bridge the divide between the ways visually-impaired and sighted people access the Web. The proliferation of portable small-screen devices (smartphones, smart watches, etc.) presents both an opportunity and a challenge for the development of a new generation of automated non-visual user interfaces for sighted users. The goal of this paper is to provide guidance for the designers of future user interface automation systems. In this paper, we systematize and analyze the complexities involved in building a practical, usable, and accessible system for web automation. We review the published literature and present lessons learned from the authors' own years of experience in developing novel approaches to web automation for visually-impaired Web users.","cites":"0","conferencePercentile":"30.95238095"},{"venue":"W4A","id":"02acd02660e04cfbe9b07f7d4f0c5b23b6301334","venue_1":"W4A","year":"2014","title":"Wizard-of-Oz evaluation of speech-driven web browsing interface for people with vision impairments","authors":"Vikas Ashok, Yevgen Borodin, Svetlana Stoyanchev, Yury Puzis, I. V. Ramakrishnan","author_ids":"3042658, 2133004, 2346574, 2620033, 1762197","abstract":"People with visual impairments typically interact with the Web using screen readers that perform serial text-to-speech narration of the content. Although they rely on keyboard shortcuts to navigate through the content quickly, browsing fatigue caused by too many keyboard presses and clicks, increased cognitive load caused by having to remember many shortcuts, and information overload from having to listen to irrelevant content, are all too common. Speech-based interaction modality has the potential to address these shortcomings by allowing users to engage in a dialog with an intelligent agent capable of translating user commands/requests to system actions and generating appropriate responses to them.\n This paper presents empirical findings of a Wizard-of-Oz user study conducted with 24 blind subjects to provide a baseline for gauging the usability and effectiveness of speech interfaces for non-visual web access. Specifically, study participants were required to complete a set of typical web browsing tasks using unrestricted speech commands ranging from simple commands such as \"click the search button\", to complex commands such as \"buy this product\". Unknown to the participants, these commands were executed by the wizard and appropriate responses were generated with the help of a screen reader. An important byproduct emerging from the study is a new dialog corpus for non-visual web access that will provide pivotal reference data for exploring the design space underlying the development of high performance dialog systems for web accessibility.","cites":"2","conferencePercentile":"74.24242424"},{"venue":"W4A","id":"2b694e1c70f761d818065412fe4f7ca5638204c7","venue_1":"W4A","year":"2014","title":"Listen to everything you want to read with Capti narrator","authors":"Yevgen Borodin, Yury Puzis, Andrii Sovyak, James Bouker, Bo Feng, Richard Sicoli, Andrii Melnyk, Valentyn Melnyk, Vikas Ashok, Glenn Dausch, I. V. Ramakrishnan","author_ids":"2133004, 2620033, 2087620, 3320667, 1808612, 1826900, 3144335, 2704365, 3042658, 2307755, 1762197","abstract":"Capti Narrator is a new cross-platform application for convenient, hands-free consumption of digital content, enabling users to listen to news, blogs, documents, unprotected e-books, and more while commuting, cooking, working out, anywhere, anytime. Capti will improve the productivity of students, busy professionals, language learners, people with print disabilities, and anyone else who wants to listen to content instead of reading it from the screen.","cites":"2","conferencePercentile":"74.24242424"},{"venue":"W4A","id":"647a78a69e3f922bcf238f02318242e5c0e57a7f","venue_1":"W4A","year":"2010","title":"More than meets the eye: a survey of screen-reader browsing strategies","authors":"Yevgen Borodin, Jeffrey P. Bigham, Glenn Dausch, I. V. Ramakrishnan","author_ids":"2133004, 1744846, 2307755, 1762197","abstract":"Browsing the Web with screen readers can be difficult and frustrating. Web pages often contain inaccessible content that is expressed only visually or that can be accessed only with the mouse. Screen-reader users must also contend with usability challenges encountered when the reading content is designed with built-in assumptions of how it will be accessed -- generally by a sighted person on a standard display. Far from passive consumers of content who simply accept web content as accessible or not, many screen-reader users are adept at developing, discovering, and employing browsing strategies that help them overcome the accessibility and usability problems they encounter. In this paper, we overview the browsing strategies that we have observed screen-reader users employ when faced with challenges, ranging from unfamiliar web sites and complex web pages to dynamic and automatically-refreshing content. A better understanding of existing browsing strategies can inform the design of accessible websites, development of new tools that make experienced users more effective, and help overcome the initial learning curve for users who have not yet acquired effective browsing strategies.","cites":"42","conferencePercentile":"96.96969697"},{"venue":"W4A","id":"ef0170d221f35fa2d1caf9558b19c78c1ce9db1d","venue_1":"W4A","year":"2012","title":"Layout guidelines for web text and a web service to improve accessibility for dyslexics","authors":"Luz Rello, Gaurang Kanvinde, Ricardo A. Baeza-Yates","author_ids":"1680197, 1715159, 1747635","abstract":"In this paper, we offer set of guidelines and a web service that presents Web texts in a more more accessible way to people with dyslexia. The layout guidelines for developing this service are based on a user study with a group of twenty two dyslexic users. The data collected from our study combines qualitative data from interviews and questionnaires and quantitative data from tests carried out using eye tracking. We analyze and compare both kinds of data and present a set of layout guidelines for making the text Web more readable for dyslexic users. To the best of our knowledge, our methodology for defining dyslexic-friendly guidelines and our web service are novel.","cites":"25","conferencePercentile":"100"},{"venue":"W4A","id":"749cdedd19857d6ce822c4755039f239a4c908d9","venue_1":"W4A","year":"2014","title":"Towards making mathematics a first class citizen in general screen readers","authors":"Volker Sorge, Charles L. Chen, T. V. Raman, David Tseng","author_ids":"1772094, 1713526, 1718755, 2592802","abstract":"The text to speech translation of mathematical expressions has always been a challenging problem, which has not diminished by more and more content moving to the web. In this paper we present our efforts of making the speech translation of mathematical formulas a first class citizen in ChromeVox, a general screen reader for the Chrome browser. We exploit ChromeVox's ability to handle alternative representations of DOM elements for translation of mathematical content given in a variety of web formats into uniform utterances. We present a format of flexible and adaptable speech rules that support the customization of aural rendering of mathematics and introduce a specially semantically enriched representation of expressions that allows for a more natural reading experience. To further aid understanding of the math we exploit ChromeVox's idea of letting users engage with content on different levels of granularity to enable interactive exploration of complex mathematical formulas.","cites":"6","conferencePercentile":"92.42424242"},{"venue":"W4A","id":"2f15f48136d4eda199e970e9afc18c3487f06014","venue_1":"W4A","year":"2013","title":"Dyslexia exercises on my tablet are more fun","authors":"Luz Rello, Clara Bayarri, Azuki Gorriz","author_ids":"1680197, 1830227, 3233895","abstract":"Worldwide, around 10% of the children have dyslexia, a learning disability characterised by difficulties with accurate word recognition and poor spelling. These difficulties can be overcome by language exercises. Typically, they come in the form of books. Hence, they are static and do not adapt to a child's specific needs. We present <i>Dyseggxia</i>, a game for mobile devices for children with dyslexia. It features five different exercises, which were derived from previous research on dyslexic errors. A study with 12 children with dyslexia confirmed that the game is fun and more attractive than traditional exercises. When playing, the exercises adapt to the specific difficulties of the individual player. The game is available for free for iOS and Android and it has been adopted into the program of institutions which support children with dyslexia. This is the first time English and Spanish reinforcement exercises are presented in an adaptive and fun-to-do way.","cites":"1","conferencePercentile":"48.48484848"},{"venue":"W4A","id":"983db1489e460e233cfcde578a5b62d96db4725b","venue_1":"W4A","year":"2011","title":"Accessibility approach to adopting web technologies","authors":"Neil King, Damien McCormack","author_ids":"2921114, 2954888","abstract":"As new web-based technologies emerge the challenge to make them accessible to people with disabilities intensifies. This communication paper discusses the findings of an Australian assessment of the technical accessibility of the Portable Document Format (PDF), and the user experience by 23 people with a disability. The questions posed and answered by this research in relation to PDF are the same questions that are asked of any web technology, and the same challenges will apply. This paper puts forward a number of recommendations based on the research to enable governments to take an inclusive approach towards the adoption of web-based technologies in the future.","cites":"0","conferencePercentile":"17.24137931"},{"venue":"W4A","id":"38ebf793685f86d2546c5c4d9fe700f4a2113a29","venue_1":"W4A","year":"2008","title":"The impact of accessibility assessment in macro scale universal usability studies of the web","authors":"Rui Lopes, Luís Carriço","author_ids":"1786757, 1805677","abstract":"This paper presents a modelling framework, <i>Web Interaction Environments</i>, to express the synergies and differences of audiences, in order to study universal usability of the Web. Based on this framework, we have expressed the implicit model of WCAG and developed an experimental study to assess the Web accessibility quality of Wikipedia at a macro scale. This has resulted on finding out that template mechanisms such as those provided by Wikipedia lower the burden of producing accessible contents, but provide no guarantee that hyperlinking to external websites maintain accessibility quality. We discuss the black-boxed nature of guidelines such as WCAG and how formalising audiences helps leveraging universal usability studies of the Web at macro scales.","cites":"8","conferencePercentile":"60.41666667"},{"venue":"W4A","id":"e0162c0f2070f041e208eabad34a6cb9bb0b3aa1","venue_1":"W4A","year":"2010","title":"Web not for all: a large scale study of web accessibility","authors":"Rui Lopes, Daniel Gomes, Luís Carriço","author_ids":"1786757, 8558719, 1805677","abstract":"The Web accessibility discipline strives for the study and improvement of front-end Web design towards people with disabilities. Best practices such as WCAG dictate how Web pages should be created accordingly. On top of WCAG, several evaluation procedures enable the measurement of the quality level of a Web page. We leverage these procedures in an automated evaluation of a nearly 30 million Web page collection provided by the Portuguese Web Archive. Our study shows that there is high variability regarding the accessibility level of Web pages, and that few pages reach high accessibility levels. The obtained results show that there is a correlation between accessibility and complexity (i.e., number of HTML elements) of a Web page. We have also verified the effect of the interpretation of evaluation <i>warnings</i> towards the perception of accessibility.","cites":"15","conferencePercentile":"87.87878788"},{"venue":"W4A","id":"fd313b3611296b2dce4f24e2beffc9dea28cbcd4","venue_1":"W4A","year":"2011","title":"Crosschecking the mobile web for people with visual impairments","authors":"Luís Carriço, Rui Lopes, Rogério Bandeira","author_ids":"1805677, 1786757, 2090064","abstract":"This paper presents a reflection on the assessment of mobile Web content for people with disabilities. It proposes a rationale for an evaluation framework considering: (1) the coherent merge of state of the art guidelines on Web accessibility and mobile best practices; and (2) the usage of current and prospective practices particularly for people with visual impairments. It also presents the preliminary results of a questionnaire that validates that rationale laying the grounds for a coherent evaluation approach.","cites":"2","conferencePercentile":"62.06896552"},{"venue":"W4A","id":"b9da2d7bf08fa11b68c1202345bdf9327524d4bc","venue_1":"W4A","year":"2011","title":"On web accessibility evaluation environments","authors":"Nádia Fernandes, Rui Lopes, Luís Carriço","author_ids":"2034607, 1786757, 1805677","abstract":"Modern Web sites leverage several techniques (e.g. DOM manipulation) that allow for the injection of new content into their Web pages (e.g., AJAX), as well as manipulation of the HTML DOM tree. This has the consequence that the Web pages that are presented to users (i.e., <i>browser</i> environment) are different from the original structure and content that is transmitted through HTTP communication (i.e., <i>command line</i> environment). This poses a series of challenges for Web accessibility evaluation, especially on automated evaluation software.\n This paper details an experimental study designed to understand the differences posed by accessibility evaluation in the Web browser. For that, we implemented a Javascript-based evaluator, <i>QualWeb</i>, that can perform WCAG 2.0 based accessibility evaluations in both <i>browser</i> and <i>command line</i> environments. Our study shows that, in fact, there are deep differences between the HTML DOM tree in both environments, which has the consequence of having distinct evaluation results. Furthermore, we discovered that, for the WCAG 2.0 success criteria evaluation procedures we implemented, 67% of them yield false negative answers on their applicability within the <i>command line</i> environment, whereas more than 13% of them are false positives. We discuss the impact of these results in the light of the potential problems that these differences can pose to designers and developers that use accessibility evaluators that function on <i>command line</i> environments.","cites":"7","conferencePercentile":"91.37931034"},{"venue":"W4A","id":"3525106692405f20d8c6ff8ade0ec1a73793916c","venue_1":"W4A","year":"2005","title":"What's the web like if you can't see it?","authors":"Chieko Asakawa","author_ids":"1851536","abstract":"Awareness of Web accessibility is spreading all over the world among Web designers and developers, due to regulations such as the US law called Section 508 and guidelines like the W3C WCAG. We now see various Web accessibility adaptations on the Web. For example, we see increasing use of alternative texts for images and skip-navigation links for speed.However, we sometimes find inappropriate ALT texts and broken skip-navigation links, even though they are present. These pages may be compliant, but they are not accessible or really usable. We analyzed such problems and found that some sites only try to comply with regulations and guidelines, but without understanding the needs underlying Web accessibility. We concluded that Web designers and developers should experience the real problems faced by people with disabilities so they can create truly accessible and usable pages. There was no practical way for them to experience disabilities.In this paper, after giving an overview of the historical progress of voice browsers, we discuss how much and how well the Web accessibility has progressed by analyzing real world improvements to existing sites. We then describe why the \"disability experience\" helps give a better understanding of the Web accessibility guidelines and regulations. Some tools like Home Page Reader and aDesigner are available to let designers experience blind users' perspective of usability. Finally, we discuss the future direction of our accessibility efforts.","cites":"21","conferencePercentile":"93.33333333"},{"venue":"W4A","id":"1899a889ac0eadc385b839981c55fbf8d06087c4","venue_1":"W4A","year":"2014","title":"Can a blind person understand your world?","authors":"Chieko Asakawa","author_ids":"1851536","abstract":"Computers have changed the lives of blind people by allowing us to access vast amounts of information on the net. Now we can read daily newspapers, hear digital textbooks, shop for goods online, and join online social networks. However, \"sensing the surrounding real world\" is still challenging for such tasks as checking the colors of merchandise, responding to street signs, or recognizing smiling faces. Driving a car is still one of the largest challenges, but technology is continually breaking new ground. The expansion of online data is now pushing machine learning techniques and crowd sourcing methods, which together enable blind people to understand ever more about the real world. Just as importantly, these same technologies can help sighted people better understand the world, too. We have entered an era of assisted cognition, not only for persons with disabilities, but for everyone. In this talk, I will offer predictions about near-future possibilities and discuss how these technologies can change our lives.","cites":"0","conferencePercentile":"22.72727273"},{"venue":"W4A","id":"31a20e64616684c6c88eed290f1af9a510e8db97","venue_1":"W4A","year":"2012","title":"Increasing access to the web of \"broad data\"","authors":"James A. Hendler","author_ids":"1701341","abstract":"Due to a problem with my wrists, hopefully temporary, I am writing this short article using voice recognition software. As this is the first time I've used this software, I'm actually relatively pleased with how well it works. I am able to write e-mails, send twitter and Facebook updates, and do many routine tasks using my voice. Modulo a few typos, I can even write this document (although putting this into ACM format required help). However, a significant portion of my life nowadays involves interacting with data, and when it comes to data interaction, \"web for all\" may as well just be a slogan. Even without accessibility problems, whether your goal is to enter, discover, or integrate data, or to try to understand what some particular data is telling you, it isn't easy. Add in disability, and the problem is made much worse.\n In this keynote, I will discuss some of the issues that arise as people try to use the \"broad data\" that can be found on the World Wide Web. The modern combination of \"lightweight\" semantics, based to a large degree on the rapidly maturing products of early semantic Web research, coupled with the \"big data\" tools that have moved away from traditional relational databases, provides an area of exploration that is pushing research in new and interesting directions. Tim Berners--Lee's call for \"Raw Data Now\" is being heeded in many quarters, and other forces, including those of transparency and innovation, are creating vast repositories of data that are available without restriction.\n As an example, governments around the world have been posting data sets on the web at a really amazing rate. In the past year and a half, my research group has identified and indexed the metadata for well over 700,000 open government datasets from around the world. This includes, at the time of this writing, datasets from more than thirty countries and international organizations in 16 different languages (we currently anticipate having more than 1 million data sets by the end of this calendar year). Our research has explored how to create, index and search metadata from this immense Federated catalog space. We have also been developing tools for helping users to create linked data from these data sets and to use that link data in the development of visualizations and other presentations that make the data more accessible. We are also working with the US government on bringing these techniques to the US Data.gov project.\n In this talk, which I admit includes parts that are far more speculative than practical at this point in time, I will explore how the <i>link spaces</i> among the data provide the underpinnings of potential new applications that will help bring data analytics into our personal lives. By making data more personalized, we may be able to achieve new possibilities in data integration that could provide capabilities by which all of us would be able to more fully interact with the important data that affects us in our everyday lives (such as health and well-being), and not just in our professional careers. I contend that similar techniques could be used to help increase the accessibility of data on the web. Linked-data approaches have been helping to some degree in this arena, but still leave a lot to be desired. In short, I will explore some exciting things happening on the web of data, but bemoan the challenges that still remain in providing scalable access to the Web of Data.","cites":"1","conferencePercentile":"41.37931034"},{"venue":"W4A","id":"d6e8fb9ac7588fd2db2fc649c7fdd4660b5b38bf","venue_1":"W4A","year":"2016","title":"NavCog: turn-by-turn smartphone navigation assistant for people with visual impairments or blindness","authors":"Dragan Ahmetovic, Cole Gleason, Kris M. Kitani, Hironobu Takagi, Chieko Asakawa","author_ids":"2351819, 3396943, 2908542, 3086992, 1851536","abstract":"NavCog is a novel smartphone navigation system for people with visual impairments or blindness, capable of assisting the users during autonomous mobility in complex and unfamiliar indoor/outdoor environments.\n The accurate localization achieved by NavCog is used for precise turn-by-turn way-finding assistance as the first step, but the ultimate goal is to present a variety of location based information to the user, such as points of interest gathered from social media and online geografic information services.","cites":"2","conferencePercentile":"100"},{"venue":"W4A","id":"3964947a4ae602f989940b6f60abb440f1f4b4c0","venue_1":"W4A","year":"2003","title":"Tension, what tension?: Website accessibility and visual design","authors":"Helen Petrie, Fraser Hamilton, Neil King","author_ids":"1719946, 3021486, 2921114","abstract":"There appears to be a widespread belief within the web design community -- and possibly amongst website commissioners - that accessible sites cannot be visually pleasing. We present the results of accessibility testing of 100 websites with 51 disabled users that should dispel this belief. While there are aspects of accessibility that do affect visual design, such as visual structure, colour contrast and text size, these are aspects of design that can affect all users, not only disabled users. These design concerns must be considered if both the users' experience and business objectives are to be met.","cites":"35","conferencePercentile":"100"},{"venue":"W4A","id":"906969bb4322a73a8350bb7c862e84451dca6d03","venue_1":"W4A","year":"2013","title":"The false dichotomy between accessibility and usability","authors":"Ed Huai-hsin Chi","author_ids":"1730922","abstract":"Traditionally, accessibility researchers have focused on the barrier-free designs that make information available to a diverse set of user abilities and constraints. Usability practitioners and researchers have focused their efforts on making information interfaces usable by the average abled-bodied user.\n The problem in this dichotomy is the myth of two assumptions. First, there is the myth of the \"average\" user. The first rule about psychology experiments is that often the individual subject variations in an experiment often overwhelm any effects that you're attempting to observe. We use the \"average user\" as a concept so that we have a prototypical user to design for, when in fact, often we're designing for a set of different user persona, use cases, and skill levels. Second, there is the myth of \"barrier-free\" design. Design is inherently an exercise in which we optimize for a certain set of use cases, while de-emphasizing other less important use cases. As a result, a design can never be entirely \"barrier-free\".\n If we treat this dichotomy as false, we start to realize that a whole set of problems between the two fields are one and the same. If we reject the dichotomy, then we see that many accessibility problems are also usability problems, and vice versa. For example, language barriers in social media, mobile devices and their ease of use while walking, and the ability to input text using voice rather than typing are all accessibility and usability problems. To emphasize, usability and accessibility are both fundamentally about the ability to get at information resources and knowledge. Broadly, I see many opportunities to bridge this false dichotomy and will attempt to give examples during this talk.","cites":"0","conferencePercentile":"21.21212121"},{"venue":"W4A","id":"b4f328c1b0600176701ecd5d1485a4c4c29cb203","venue_1":"W4A","year":"2013","title":"Understanding users in the wild","authors":"Aitor Apaolaza, Simon Harper, Caroline Jay","author_ids":"2884921, 3739189, 1728418","abstract":"Laboratory studies are a well established practice that present disadvantages in terms of data collection. One of these disadvantages is that laboratories are controlled environments that do not account for unpredicted factors from the real world. Laboratory studies are also obtrusive and therefore possibly biased. The Human-Computer Interaction (HCI) community has acknowledged these problems and has started exploring in-situ observation techniques. These observation techniques allow for bigger participant pools and their environments can conform to the real world. Such real-world observations are particularly important to the accessibility community who has coined the concept accessibility-in-use to differentiate real world from laboratory studies. Real-world observations provide low-level interaction data therefore making a bottom-up analysis possible. This way behaviours emerge from the obtained data instead of looking for predefined models. Some in-situ techniques employ Web logs in which the data is too coarse to infer meaningful user interaction. In some other cases an exhaustive manual modification is required to capture interaction data from a Web application. We describe a tool which is easily deployable in any Web application and captures longitudinal interaction data unobtrusively. It enables the observation of accessibility-in-use and guides the detection of emerging tasks.","cites":"6","conferencePercentile":"80.3030303"},{"venue":"W4A","id":"2424a2e796e0f6079fa21326400c73e00cf4b7a9","venue_1":"W4A","year":"2010","title":"Tailored presentation of dynamic content","authors":"Andy Brown, Caroline Jay, Simon Harper","author_ids":"2539120, 1728418, 3739189","abstract":"The advent of 'Web 2.0' and Web applications means that documents often are not static, but update, either automatically or as a result of user interaction. This development poses a difficult question for screen reader designers: how should users be notified of page changes? The SASWAT Web browser is a self-voicing screen reading extension to the Firefox Web browser, based upon Fire Vox. It uses a set of rules, derived from studies of how sighted users interact with such content, that allow the presentation of updates to be tailored according to the way in which they were initiated, the effect they have on the page, and their content. These should allow users to deal with page changes in a more natural and more efficient manner.","cites":"0","conferencePercentile":"6.060606061"},{"venue":"W4A","id":"4f6b81fe899b755ecd4565c74be98b92665128c1","venue_1":"W4A","year":"2010","title":"Audio access to calendars","authors":"Andy Brown, Caroline Jay, Simon Harper","author_ids":"2539120, 1728418, 3739189","abstract":"The rise of 'Web 2.0' has brought a much more interactive aspect to the Web: users are no longer just reading pages, but creating them, modifying them, and interacting with them. The Web is increasingly becoming the preferred means of communication, and particularly booking events and appointments; online personal and corporate diaries allow friends and colleagues to arrange meetings and coordinate activities. Many of these types of online activities require users to perform the apparently simple task of entering a date. For sighted people who have access to pop-up calendars, selecting a date is quick and easy. Unfortunately, this facility is not currently available to people with visual impairments, for whom entering a correctly formatted date can be a difficult and time-consuming task, with mistakes having potentially serious consequences. Here we describe the process by which we designed and evaluated an audio interface for entering dates. An eye-tracking study gave insight into how tabular calendars help sighted people enter dates, This understanding was used to design an audio interface that used the cognitive advantages of the visual design, rather than mimicking the visual representation. Iterative testing was followed by an evaluation using participants with visual impairments that highlighted the problems with manual date entry, and which showed the audio system to be effective and popular.","cites":"8","conferencePercentile":"69.6969697"},{"venue":"W4A","id":"875c16e8a3db2a2f1e98592eed5ffcb96fd169f6","venue_1":"W4A","year":"2009","title":"Audio presentation of auto-suggest lists","authors":"Andy Brown, Caroline Jay, Simon Harper","author_ids":"2539120, 1728418, 3739189","abstract":"One of the most significant advances behind World Wide Web (Web) 2.0 is the ability to allow parts of a Web page to be updated independently. This can provide an exciting, interactive experience for sighted users, who are used to dealing with complex visual information. For visually impaired users, however, these pages may be confusing: updates are sometimes not recognised by screen readers, while in other cases they may interrupt the user inappropriately. The SASWAT project aims to develop a model of how <i>sighted</i> users interact with dynamic updates, and use this to identify the most effective ways of presenting updates through an audio information stream. Here, we describe a 'thin slice' through this project, focusing on one form of update --- the auto-suggest list. These provide the user with suggestions for entry into an input text field, updating with each character typed. Experiments with sighted users suggest that the suggestions receive considerable attention, and appear to offer reassurance that the input is reasonable. Suggestions that are further down the list are less likely to be viewed, and receive fewer and shorter fixations than those at the top. We therefore propose an implementation which presents the first 3 suggestions immediately and allows browsing of the rest.","cites":"5","conferencePercentile":"71.15384615"},{"venue":"W4A","id":"d90da53b42d6847d21fc0b955ce54e3399939496","venue_1":"W4A","year":"2008","title":"A syntactic analysis of accessibility to a corpus of statistical graphs","authors":"Leo Ferres, Petro Verkhogliad, Livia Sumegi, Louis Boucher, Martin Lachance, Gitte Lindgaard","author_ids":"1752967, 1804612, 3010569, 1771894, 2334374, 1796956","abstract":"Designing graphs and charts visually by means of graphing applications such as OpenOffice or MS Excel is extremely efficient and cost-effective. However, one of the drawbacks of such approach is that graphs are sometimes involuntarily made less accessible by, for instance, using a text box as title. In this paper we evaluate a corpus of 120 ecologically-valid statistical graphs for accessibility problems, discuss possible algorithms to solve these problems and finally propose the OM (Object Model) Principle, which states that any digital object is made more accessible by simply using the application's model for that object: for instance, the TITLE field for the title text.","cites":"1","conferencePercentile":"22.91666667"},{"venue":"W4A","id":"02465d2032f1420dce536762d170933bfee54e75","venue_1":"W4A","year":"2014","title":"Remote IT education for senior citizens","authors":"Hironobu Takagi, Akihiro Kosugi, Tatsuya Ishihara, Kentarou Fukuda","author_ids":"3086992, 2948956, 3053828, 3110160","abstract":"Information technologies (IT) have great potential to improve the everyday lives of senior citizens, but their lack of skills prevents them from exploiting the possibilities. Skilled seniors can effectively teach unskilled seniors based on their deep understanding of the barriers and needs of their generation, but skilled seniors are scarce. Distant learning methods could be a solution, but their unfamiliarity with IT and strong preference for face-to-face learning are challenges. To make the distant course closer to the face-to-face experience, we developed a remote education system with real-time gesture visualization integrated with multiple audio and video streams between the teachers and learners. In this paper, we will introduce our remote course system and the course design, and then report results of the trial remote course approach.","cites":"1","conferencePercentile":"56.06060606"},{"venue":"W4A","id":"818041edb714b46e4e299deac2efa9fa67b29c80","venue_1":"W4A","year":"2013","title":"Simplify or help?: text simplification strategies for people with dyslexia","authors":"Luz Rello, Ricardo A. Baeza-Yates, Stefan Bott, Horacio Saggion","author_ids":"1680197, 1747635, 2736946, 3014320","abstract":"We present a user study for two different automatic strategies that simplify text content for people with dyslexia. The strategies considered are the standard one (replacing a complex word with the most simpler synonym) and a new one that presents several synonyms for a complex word if the user requests them. We compare texts transformed by both strategies with the original text and to a gold standard manually built. The study was undertook by 96 participants, 47 with dyslexia plus a control group of 49 people without dyslexia. To show device independence, for the new strategy we used three different reading devices. Overall, participants with dyslexia found texts presented with the new strategy significantly more readable and comprehensible. To the best of our knowledge, this is the largest user study of its kind.","cites":"21","conferencePercentile":"100"},{"venue":"W4A","id":"f84310de55dc5b57889792874c1566cdbdc52ef3","venue_1":"W4A","year":"2012","title":"Evaluating the accessibility of rich internet applications","authors":"Nádia Fernandes, Daniel Costa, Sergio Neves, Carlos Duarte, Luís Carriço","author_ids":"2034607, 3801340, 2853252, 2289512, 1805677","abstract":"The Web has been growing in size and complexity and is used for the most diverse activities in our every day life, becoming almost indispensable. Besides, Web applications are becoming more popular, and consequently used by a wide range of people. Thus, it is important to evaluate the accessibility of the new Rich Internet Applications (RIA) to guarantee that everyone can access the information.\n Currently, there are some tools to evaluate the accessibility of classical Web pages, which use WCAG guidelines. However, Web applications impose different challenges, so it is mandatory to find a way to automatically obtain the dynamically introduced HTML code, in order to evaluate what users really experience.\n This paper details a new process of accessibility evaluation of Web applications, which evaluates the content by triggering possible events that partially change the Web page. It also presents an experimental study with several Web applications, demonstrating the potential of this framework in evaluating Web applications.","cites":"9","conferencePercentile":"93.10344828"},{"venue":"W4A","id":"29b9070b418b62a523ed742ae9b1567308ab8d56","venue_1":"W4A","year":"2012","title":"A macroscopic web accessibility evaluation at different processing phases","authors":"Nádia Fernandes, Luís Carriço","author_ids":"2034607, 1805677","abstract":"This paper details a comparative experimental study to understand the difference of the Web's accessibility properties regarding two different evaluation approaches: using WCAG 2.0 techniques and targeting the pages as they reach the browser; using WCAG 2.0, but evaluating the pages after the browser processing, thus as they will be delivered to the end-user. For that, we evaluated over 20000 Web pages using already established accessibility metrics. We then compared the results obtained from the WCAG 2.0 evaluation of the two processing phases. We observed some changes in the macroscopic properties of the evaluation. Regarding the comparison between the two phases, we observed a narrower distribution of quality, i.e., the worst pages are in fact not that bad, and the best ones not that good.","cites":"3","conferencePercentile":"65.51724138"},{"venue":"W4A","id":"88341d915083dc33771c02e008bf033578f81c26","venue_1":"W4A","year":"2016","title":"Widening access to online health education for lung cancer: a feasibility study","authors":"Julia Müller, Alan Davies, Simon Harper, Caroline Jay, Chris Todd","author_ids":"2622318, 5684356, 3739189, 1728418, 4243987","abstract":"Having lung cancer is associated with accessibility issues because people afflicted with lung cancer tend to be older and less familiar with technology, and have low education levels and low health literacy. Fear, embarrassment and stigmatization also play a role. This makes it difficult for people to access the information they need to understand and manage their illness, particularly in the time before the diagnosis. We can mitigate these disadvantages and bridge the accessibility gap by ensuring people at risk for lung cancer are informed about symptoms and when to seek medical advice. The Web is uniquely placed to fulfill this role. We therefore developed an online lung cancer symptom appraisal tool tailored towards people with low education levels and health literacy and based on psychological theory to target barriers like fear and embarrassment. At present we are conducting a feasibility study to assess whether it is possible to reach the high risk population and encourage early help-seeking. So far, 97 users have participated, 97.9% of which report symptoms and risk factors that indicate they should seek medical help. 34% report education levels below school leaving qualification. Our tool led to a significantly higher intention to seek medical help than the same information without theory-based components (<i>p</i> = 0.01). Our initial analyses suggest this is a suitable approach to widening health education to excluded groups.","cites":"0","conferencePercentile":"45"},{"venue":"W4A","id":"6518171d77d680349082bc07a538b4224bd05b7e","venue_1":"W4A","year":"2016","title":"AudioDraw: user preferences in non-visual diagram drawing for touchscreens","authors":"William Grussenmeyer, Eelke Folmer","author_ids":"3446282, 3267671","abstract":"It can be very difficult and sometimes impossible for people who are blind to create visual diagrams on their own. Even with sighted assistance, it can be difficult to verbally convey the visual image in one's mind. We conducted a survey to determine the need of people who are blind to create their own diagrams. Based on this survey, we created a preliminary design probe app on a tablet and revised the prototype through preliminary user feedback. Then, using this second app, we conducted a design probe study with 8 participants who are visually impaired and interviewed them about the potential of using touchscreens to create diagrams. Our results show that most participants were enthusiastic about the possibility of creating their own diagrams via a touchscreen and felt that this also makes touchscreens more accessible to them, creating more inclusion for them in the use of touchscreens.","cites":"1","conferencePercentile":"93.75"},{"venue":"W4A","id":"085be7f65cdf883dee7fada4bba80c80e2bcac91","venue_1":"W4A","year":"2007","title":"Accessibility in non-professional web authoring tools: a missed web 2.0 opportunity?","authors":"Christopher Power, Helen Petrie","author_ids":"6234503, 1719946","abstract":"The advent of Web 2.0 technologies, and the increased participation of users in personalized web experiences, has created a need for new web authoring tools intended for use by non-professional web authors. These tools represent a prime opportunity for including accessibility features early in the tool design process. The results from an accessibility evaluation of one of these tools demonstrates that such opportunities could be easily missed.","cites":"4","conferencePercentile":"40.38461538"},{"venue":"W4A","id":"6f7b9f43363c96589b59bf20be7cdbcb71ee55d0","venue_1":"W4A","year":"2015","title":"Towards a unified definition of web accessibility","authors":"Helen Petrie, Andreas Savva, Christopher Power","author_ids":"1719946, 1728187, 6234503","abstract":"To better understand what researchers and practitioners consider to be the key components of the definition of web accessibility and to propose a unified definition of web accessibility, we conducted an analysis of 50 definitions of web accessibility. The definitions were drawn from a range of books, papers, standards, guidelines and online sources, aimed at both practitioners and researchers, from the across the time period of web accessibility work, from 1996 to 2014 and from authors in 21 different countries. The analysis extracted six core concepts that are used in many definitions, which are incorporated into a unified definition of web accessibility as \"all people, particularly disabled and older people, can use websites in a range of contexts of use, including mainstream and assistive technologies; to achieve this, websites need to be designed and developed to support usability across these contexts\".","cites":"3","conferencePercentile":"91.66666667"},{"venue":"W4A","id":"eece029eeb2a4e34c90b30e237b45f01abf767e8","venue_1":"W4A","year":"2008","title":"A survey on the accessibility awareness of people involved in web development projects in Brazil","authors":"André Pimenta Freire, Cibele M. Russo, Renata Pontin de Mattos Fortes","author_ids":"1721856, 2143030, 1727815","abstract":"Accessibility has become a very important issue to promote inclusion in the Information Society, and people involved in Web development projects have a very important role to contribute with the development of a more inclusive Web. In this paper, we propose an investigation on the accessibility awareness of people involved in Web development in Brazil. We have conducted the research by means of an exploratory survey with a Web based questionnaire and a sample with subjects from academy, industry and government. The study had 613 valid answers and involved representatives from all of the 27 states of Brazil. The results show that accessibility is still far from being actually considered in Web development projects in Brazil, as only 19.9% of the participants have stated that accessibility is considered in their projects. The lack of education on accessibility, as well as the poor spread of the Brazilian accessibility law are important issues to be dealt with to boost a stronger accessibility awareness among people involved in Web development.","cites":"9","conferencePercentile":"70.83333333"},{"venue":"W4A","id":"1da10e8b7f01a900547ace7c5c5268129847821a","venue_1":"W4A","year":"2007","title":"Making multimedia content accessible for screen reader users","authors":"Hisashi Miyashita, Daisuke Sato, Hironobu Takagi, Chieko Asakawa","author_ids":"1739055, 7137022, 3086992, 1851536","abstract":"Rich and multimedia content is increasing rapidly on the Web. It is very attractive for sighted people, but it brings severe problems to screen reader users. Once the audio starts playing, it becomes hard for blind users to listen to the screen reader because there is physically only one volume control that cannot control the separate audio streams. Though there are often software-controlled buttons to control the audio, they are often controllable only with a mouse and are not associated with alternative text. Because of the audio conflicts and inaccessible control buttons, the multimedia content is often inaccessible to blind users. In addition, the use of dynamically changing interactive user interfaces is also a critical issue, since existing screen readers cannot detect such dynamic content changes.\n We developed an accessible Internet browser for multimedia to address these problems and offer multimedia content as an information resource for the blind. It is characterized by three major features. First, it allows users to control the audio, such as the volume, play/stop, pause, and even the speed. Second, a dynamically adaptable metadata function is added to simplify complicated multimedia pages and to track dynamic changes and effectively inform users about the changes. Third, an audio description function supports Internet movies with a text format described by the metadata. In this paper, after briefly discussing the existing accessibility problems of multimedia content, we describe our accessible Internet browser for multimedia.","cites":"7","conferencePercentile":"53.84615385"},{"venue":"W4A","id":"7555f2f4def22042f3099742d632c88f0a9d47f6","venue_1":"W4A","year":"2015","title":"SmartWrap: seeing datasets with the crowd's eyes","authors":"Steven Gardiner, Anthony Tomasic, John Zimmerman","author_ids":"2252262, 1693125, 7137890","abstract":"The web contains many datasets presented visually, whose lack of semantic markup renders them difficult to understand and navigate using a screen reader. In this work, we explore the possibility of understanding the semantics of web datasets by asking sighted web users to manually scrape web pages into spreadsheets. Web users constitute a huge population of potential workers, but most are not programmers and may have difficulty understanding and communicating the abstractions involved in labeling web datasets. We present the design of a tool we call SmartWrap that directs the manual scraping work of everyday end users, explicitly including nonprogrammers, towards the construction of reusable programs, called wrappers, that map the scraped website into a structured dataset. To engage with nontechnical end users, we designed the tool to use very simple interactions. We present a user study validating that users with a variety of technical backgrounds were able to use it to construct wrappers. We also validate the SmartWrap approach to acquiring wrappers for a large part of the web by evaluating wrappers contributed by MTurk users using the tool. From the MTurk work we derive estimates for the costs of eliciting wrappers from the crowdworkers for a large proportion of the sampled datasets, and an estimate of what proportion of web datasets can be wrapped by crowdworkers using the tool. We also report some evidence that web users will contribute dataset semantics to the system without pay, motivated either to improve web accessibility or to expedite their own scraping tasks.","cites":"2","conferencePercentile":"80.95238095"},{"venue":"W4A","id":"15d6412fe0f075e89e58f234cdc279f387a01aeb","venue_1":"W4A","year":"2005","title":"Automatic accessibility evaluation of dynamic web pages generated through XSLT","authors":"André Pimenta Freire, Renata Pontin de Mattos Fortes","author_ids":"1721856, 1727815","abstract":"Much effort has been dedicated to develop software aids for authoring and evaluating Web pages using accessibility guidelines and standards. The evaluation of dynamic Web pages is a problem still unsolved in the field of automatic evaluation tools, since the current evaluators are only able to evaluate static Web pages. Stone and Dhiensa have addressed this problem, and proposed a method for evaluating the accessibility of dynamic Web pages using a generalized page which contains all possible outputs that can be generated by a script. In this paper, we present another approach for evaluating the accessibility of dynamic Web pages generated using XML and XSLT. The approach consists of analysing an XSLT using a structure descriptor such as DTD or XSD to determine the different types of XML documents that can be generated. The strength of the presented approach is given by the fact that the use of XML features enhances the results gathered from automatic accesibility evaluation of dynamic Web pages.","cites":"5","conferencePercentile":"43.33333333"},{"venue":"W4A","id":"3b5c9f3b6efbde464cd76800b00637ad937a9e8e","venue_1":"W4A","year":"2013","title":"Towards web accessibility repair","authors":"Nádia Fernandes","author_ids":"2034607","abstract":"Rich Internet Applications (RIAs) are becoming a new trend on the Web. Despite that, current evaluators and repairing tools do not access all the possible variation of RIAs producing incomplete results. Thus, it is important to fully understand the impact of RIAs in accessibility, identify development and repair patterns. We perform that using an extended version of QualWeb evaluator, which allows to simultaneously understand, evaluate and propose repairing practices to some accessibility problems of RIAs.","cites":"0","conferencePercentile":"21.21212121"},{"venue":"W4A","id":"2222cbb735f1ad3e420972c853ccaff53ae12498","venue_1":"W4A","year":"2015","title":"Evaluation of real-time captioning by machine recognition with human support","authors":"Hironobu Takagi, Takashi Itoh, Kaoru Shinkawa","author_ids":"3086992, 2406907, 3109137","abstract":"Verbal meetings are important at work, but employees who are deaf or hard of hearing (DHH) find it difficult to participate. Manual real-time captioning is a solution, but professional stenographers are too expensive for routine use. We are exploring the possibilities of real-time captioning that combines Automated Speech Recognition (ASR) and human capabilities, which can dramatically decrease these costs and thus improve the lives of DHH employees. We developed a flexible ASR-based real-time captioning tool that can be used by non-expert captioners to correct the recognized text in practical workplace situations. In this paper, we will report on our early results, focusing on accuracy and latency.","cites":"0","conferencePercentile":"30.95238095"},{"venue":"W4A","id":"c100224487ec6db9409fbb7f4921b698320d9d3e","venue_1":"W4A","year":"2016","title":"A usability evaluation of two virtual aids to enhance cursor accessibility for people with motor impairments","authors":"J. Eduardo Pérez, Xabier Valencia, Myriam Arrue, Julio Abascal","author_ids":"2068730, 2532144, 1738900, 1747952","abstract":"Basic actions in the context of Web browsing, such as pointing at and clicking on links, can be seriously hindered by dexterity impairments affecting the use of hands and arms. In this paper, we present two different virtual aids for assisting motor-impaired users when pointing at and clicking on links. One of them, the \"circular cursor\", aims at reducing the level of accuracy required for clicking on links, whereas the other one, the \"cross cursor\", aims at reducing target distance for pointing at them. We conducted a web-based usability testing for both cursors with 9 motor-impaired and 6 able-bodied users applying their usual pointing device (4 keyboard, 4 joystick, 1 trackball and 6 mouse). The results show that motor-impaired participants mainly preferred one of either of the two variants proposed to the traditional cursor without any virtual aid for Web browsing.","cites":"1","conferencePercentile":"93.75"},{"venue":"W4A","id":"1a5194b8e925839baaaac417ee6d3cc61a6f4372","venue_1":"W4A","year":"2014","title":"W4A camp report: \"2013 edition\"","authors":"Markel Vigo, Julio Abascal","author_ids":"1727424, 1747952","abstract":"We provide pointers to the issues that are going to be hot topics in the following years according to our community. First, engineering accessibility through sound methodologies and sampling methods remains a challenge. Secondly, analysing behavioural data to infer barriers and emergent task models is a game changer that switches the paradigm from top-down to a bottom-up approach where users are not grouped by their abilities, but by their individual differences in an accessibility continuum. Finally, tackling the access needs in the developing regions will allow the explosion of crowdsourced applications that can potentially improve the living conditions of many. We argue that these issues should not be missed in a broader accessibility research agenda.","cites":"0","conferencePercentile":"22.72727273"},{"venue":"W4A","id":"208c6de982bda71802bbc21fd2365918c026270d","venue_1":"W4A","year":"2013","title":"User individuality management in websites based on WAI-ARIA annotations and ontologies","authors":"Xabier Valencia, Myriam Arrue, J. Eduardo Pérez, Julio Abascal","author_ids":"2532144, 1738900, 2068730, 1747952","abstract":"In this paper, we describe a system for adapting websites based on an annotation approach. The system adapts annotated websites according to the user characteristics. The core of the system is composed of a repository containing a comprehensive set of adaptation techniques. 99 techniques have been identified and classified, 48 of them have been fully implemented in the system. This wide range of implemented techniques provides the system with the necessary mechanisms for adapting diverse aspects of website interfaces, such as the content to display, the layout and the structure. The techniques to apply for a given user are inferred according to the information stored in an ontology. This defines the bases for associating user characteristics with the adaptation techniques to apply for specific interaction elements annotated in a website. An annotation language based on the roles and properties of WAI-ARIA has been elaborated. Therefore, any website annotated in this language can be adapted. This adaptation system has been applied to two different websites and adapted interfaces have been obtained for three different user groups.","cites":"0","conferencePercentile":"21.21212121"},{"venue":"W4A","id":"34c4eb478e2fd6a378ba20402dafe645ed6ff230","venue_1":"W4A","year":"2012","title":"Developing a semantic user and device modeling framework that supports UI adaptability of web 2.0 applications for people with special needs","authors":"Philip Ackermann, Carlos A. Velasco, Christopher Power","author_ids":"3074082, 2764813, 6234503","abstract":"The introduction of user and device models to customize applications has been the subject of research for decades. This paper presents a modeling framework that supports dynamic adaptation of the UI of web 2.0 applications. This work builds upon previous efforts of the authors [22] leveraged with the use of the semantic framework for Composite Capability/Preference Profiles (CC/PP), which allows the matching of device capabilities and user preferences arising because of functional restrictions. The combination of these models with those of the corresponding web applications, enables an adaptive transformation process that facilitates access to users with special needs derived of their functional restrictions or because of context-related handicapping situations. We argue that this approach will enable a user-centric access to the web, including mobile and ubiquitous delivery of services and applications.","cites":"5","conferencePercentile":"81.03448276"},{"venue":"W4A","id":"b0306b7b955b8e19706d85dec46f831e7ec63f7f","venue_1":"W4A","year":"2009","title":"Transition of accessibility evaluation tools to new standards","authors":"Amaia Aizpurua, Myriam Arrue, Markel Vigo, Julio Abascal","author_ids":"1726287, 1738900, 1727424, 1747952","abstract":"While automatic tools are not intended to replace human judgement they are crucial in order to develop accessible web sites. The release of WCAG 2.0 entails that the existing plethora of accessibility review tools will have to be updated. This paper presents an evaluation framework for making the transition from WCAG 1.0 to WCAG 2.0 in a less painful way. A framework is thus proposed that allows developers to create new guidelines, and update or reuse the existing ones. A case study to test its feasibility has been carried out by incorporating WCAG 2.0 guidelines into the framework. The results are satisfactory, since 55% of the automatic and 16% of the semi-automatic ones could be expressed using the framework. Therefore, it is demonstrated that even if the framework does not fully support the transition process, at least it makes it less burdensome. Moreover, by analyzing WCAG 2.0 we have learnt how to extend the existing tools in order to provide greater coverage and thus increase their effectiveness.","cites":"4","conferencePercentile":"59.61538462"},{"venue":"W4A","id":"27fcb2cd4b07e5c907d22770d86cb7c9baf68088","venue_1":"W4A","year":"2007","title":"Quantitative metrics for measuring web accessibility","authors":"Markel Vigo, Myriam Arrue, Giorgio Brajnik, Raffaella Lomuscio, Julio Abascal","author_ids":"1727424, 1738900, 1732821, 1737763, 1747952","abstract":"This paper raises the need for quantitative accessibility measurement and proposes three different application scenarios where quantitative accessibility metrics are useful: Quality Assurance within Web Engineering, Information Retrieval and accessibility monitoring. We propose a quantitative metric which is automatically calculated from reports of automatic evaluation tools. In order to prove the <i>reliability</i> of the metric, 15 websites (1363 web pages) are measured based on results yielded by 2 evaluation tools: EvalAccess and LIFT. Statistical analysis of results shows that the metric is dependent on the evaluation tool. However, Spearman's test produces high correlation between results of different tools. Therefore, we conclude that the metric is reliable for ranking purposes in Information Retrieval and accessibility monitoring scenarios and can also be partially applied in a Web Engineering scenario.","cites":"41","conferencePercentile":"100"},{"venue":"W4A","id":"1696f981e70961ee4e98450443cff35f8cccad06","venue_1":"W4A","year":"2009","title":"User requirement analysis for a railway ticketing portal with emphasis on semantic accessibility for older users","authors":"Michael Leitner, Özge Subasi, Norman Höller, Arjan Geven, Manfred Tscheligi","author_ids":"1681869, 2658331, 2095064, 3002173, 1751253","abstract":"In this paper, we present the results from a survey on user requirements for older users of online ticketing services of a nationwide railway ticket and travel information portal. Our survey shows that older users differentiate in their attitude towards internet according to their experience with internet services and the service provided, not only according to their age. Further, our study indicates that in contrary to common belief advertisement or interactive elements are not perceived as negative all the time. The results of a questionnaire with 1200 responses, focus groups, interviews and qualitative analysis of user feedback also indicate that in order to improve and optimize the usage of the online system for older adults, it is needed to supply the system not only with technical accessibility requirements but also with an understanding of universal accessibility requirements. Universal requirements are defined by real user and usage cases and they consider standardization on not only coding but also predictability of usage and same patterns of interaction for similar websites.","cites":"4","conferencePercentile":"59.61538462"},{"venue":"W4A","id":"71f1b21b75eb8ed6453f3885ba60f65c0aa1c5e6","venue_1":"W4A","year":"2010","title":"Designing for auditory web access: accessibility and cellphone users","authors":"Shari Trewin, Rachel K. E. Bellamy, John C. Thomas, Jonathan P. Brezin, John T. Richards, Calvin Swart, Bonnie E. John","author_ids":"1737606, 1733967, 1682369, 2194741, 1695210, 1734035, 1688844","abstract":"Low-end mobile phones are becoming generally available throughout the world and the main window onto the Web. A large constituency for Web access is being created whose experience Web designers are not familiar with, particularly because of the central role of auditory, rather than visual access. This is analogous to problems faced by visually impaired users, where again Web designers have an audience whose experience they rarely share. One might think that proven design practices of working directly with users or intermediaries would be effective, but we argue that in these situations they are difficult to apply, not least because of the distance geographically and culturally from the users. We therefore present alternative ways for developers to gain insight into the experience of auditory access. We also discuss the potential of tools and resources such as simulations of an auditory interaction with the Web and illustrate how these can help --- particularly with early stage design. Successful simulations can reduce the cost and effort needed to design a usable auditory Web experience, and as a bonus, the insights gained often improve a site for many other users as well.","cites":"1","conferencePercentile":"21.21212121"},{"venue":"W4A","id":"1b85e8ab7aa63814365d095f39455b37254da6b8","venue_1":"W4A","year":"2010","title":"Accessibility challenges and tool features: an IBM Web developer perspective","authors":"Shari Trewin, Brian P. Cragun, Calvin Swart, Jonathan P. Brezin, John T. Richards","author_ids":"1737606, 1855537, 1734035, 2194741, 1695210","abstract":"Using evidence from a survey of 49 IBM Web developers we explore two concerns: barriers to the developers' designing accessible Web-based products, and what value they felt specific features in an \"accessibility\" tool might have. They found designing for accessibility difficult, but more surprisingly, they found using the test tools and finding technology work-arounds equally hard. Testing and finding work-arounds were also the most time consuming aspects of accessibility, while design was not. When asked about tool features, all agreed that a checklist of automatically detected problems and an explanation of each problem were the most important. There were fifteen features in all, and the more experienced the developer, the more they valued the other features, particularly being able to experience a site as someone with a particular disability would, and being able to pinpoint a problem on the rendered view of a page. The survey results suggest existing tools are often unclear, cumbersome, and incomplete with respect to the standards that must be met.","cites":"14","conferencePercentile":"83.33333333"},{"venue":"W4A","id":"1fcc068118132d2503b5d40ec1c65d1b496f44a7","venue_1":"W4A","year":"2007","title":"Accessmonkey: a collaborative scripting framework for web users and developers","authors":"Jeffrey P. Bigham, Richard E. Ladner","author_ids":"1744846, 1762656","abstract":"Efficient access to web content remains elusive for individuals accessing the web using assistive technology. Previous efforts to improve web accessibility have focused on developer awareness, technological improvement, and legislation, but these approaches have left remaining concerns. First, while many tools can help produce accessible content, these tools are generally difficult to integrate into existing developer workflows and rarely offer specific suggestions that developers can implement. Second, tools that automatically improve web content for users generally solve specific problems and are difficult to combine and use on a diversity of existing assistive technology. Finally, although blind web users have proven adept at overcoming the shortcomings of the web and existing tools, they have been only marginally involved in improving the accessibility of their own web experience.\n As a first step toward addressing these concerns, we introduce <i>Accessmonkey</i>, a common scripting framework that web users, web developers and web researchers can use to collaboratively improve accessibility. This framework advances the idea that Javascript and dynamic web content can be used to improve inaccessible content instead of being a cause of it. Using Accessmonkey, web users and developers on different platforms with potentially different goals can collaboratively make the web more accessible. In this paper we first present the Accessmonkey framework, describe three implementations of it that we have created and offer several example scripts that demonstrate its utility. We conclude by discussing future extensions of this work that will provide efficient access to scripts as users browse the web and allow non-technical users be involved in creating scripts.","cites":"38","conferencePercentile":"94.23076923"},{"venue":"W4A","id":"734e5ecf9ffafc73ac24e909da4c9a83564728c3","venue_1":"W4A","year":"2007","title":"A web accessibility report card for top international university web sites","authors":"Shaun K. Kane, Jessie A. Shulman, Timothy J. Shockley, Richard E. Ladner","author_ids":"2893996, 2873547, 3127601, 1762656","abstract":"University web pages play a central role in the activities of current and prospective postsecondary students. University sites that are not accessible may exclude people with disabilities from participation in educational, social and professional activities. In order to assess the current state of university web site accessibility, we performed a multi-method analysis of the home pages of 100 top international universities. Each site was analyzed for compliance with accessibility standards, image accessibility, alternate-language and text-only content, and quality of web accessibility statements. Results showed that many top universities continue to have accessibility problems. University web site accessibility also varies greatly across different countries and geographic regions. Remaining obstacles to universal accessibility for universities include low accessibility in non-English-speaking countries and absent or low-quality accessibility policies.","cites":"16","conferencePercentile":"69.23076923"},{"venue":"W4A","id":"23dc625d9ad8a607068bfad3e96e37fe11a75e99","venue_1":"W4A","year":"2008","title":"WebAnywhere: a screen reading interface for the web on any computer","authors":"Jeffrey P. Bigham, Craig Prince, Sangyun Hahn, Richard E. Ladner","author_ids":"1744846, 1786208, 1792964, 1762656","abstract":"Fulfilling the promise of a web-enabled global community means enabling blind web users to access their information and collaborative web services wherever they happen to be on whatever computer to which they happen to have access. Whether they're checking their email at a local internet caf&#233;, using an airport kiosk to connect with a new business contact on a social networking site, or collaboratively editing a document in a hotel business center, blind web users need to stay connected to be successful. While web-enabled computers are everywhere, screen readers are installed on very few. Downloading and installing new software can take a long time and is difficult without a screen reading interface, and many will not allow users to download and install new software at all. Accessible mobile devices are prohibitively expensive. <i>WebAnywhere</i> is a free screen-reading web application capable of making the web accessible to blind users on any web-enabled computer or device, regardless of platform or browser used, without installing new software.","cites":"4","conferencePercentile":"52.08333333"},{"venue":"W4A","id":"caf8a74fd2cea84ac8de2c88d1c1f79a4a28f3ff","venue_1":"W4A","year":"2010","title":"WebAnywhere: experiences with a new delivery model for access technology","authors":"Jeffrey P. Bigham, Wendy Chisholm, Richard E. Ladner","author_ids":"1744846, 2620972, 1762656","abstract":"In this paper we describe recent developments and our experiences in releasing WebAnywhere. WebAnywhere was originally designed as a web-based alternative to a traditional screen reader. It can be run on any computer without installing new software, making it ideal for use on-the-go or in libraries and schools where the appropriate access technology is unlikely to already be installed and where users do not have permission to install it. Since its initial release nearly two years ago, WebAnywhere has expanded from its original goal of supporting blind web users to become a platform for an array of technologies supporting access for people with disabilities.","cites":"2","conferencePercentile":"37.87878788"},{"venue":"W4A","id":"5221711610c5ee9d4b04cb9863b9d0043e008bb6","venue_1":"W4A","year":"2007","title":"Leveraging rich accessible documents on the web","authors":"Rui Lopes, Luís Carriço","author_ids":"1786757, 1805677","abstract":"This paper presents a new approach on leveraging accessibility for rich document delivery to the Web. The proposal entails a profile modeling task, where multidisciplinary teams can discuss users, devices, and usage scenarios, in order to grasp and synthesise the different document delivery scenarios. A document production framework is presented, which can be configured according to modeled profiles. By using this approach, documents are tailored to users in such a way that rich interaction capabilities are maintained, without sacrificing content accessibility.","cites":"1","conferencePercentile":"7.692307692"},{"venue":"W4A","id":"8fcf2683e22cec2ae5008417e27c48b831e33d20","venue_1":"W4A","year":"2008","title":"Evaluating web accessibility for specific mobile devices","authors":"Markel Vigo, Amaia Aizpurua, Myriam Arrue, Julio Abascal","author_ids":"1727424, 1726287, 1738900, 1747952","abstract":"This paper presents a tool for evaluating web accessibility for mobile devices regardless their software, hardware or user agent characteristics. Taking the mobileOK Basic tests by the W3C as a basis, these tests are extended so that device characteristics can be considered in the evaluation process. A sound tool that takes into account these extended tests has been developed. Device features of a given device are retrieved from heterogeneous device description repositories and CC/PP based profiles are automatically generated. Based on these profiles, evaluation queries are dynamically created obtaining device-tailored evaluation reports. Finally, in order to demonstrate the feasibility of the tool, a case study has been conducted concluding that the tool reduces the number of false positives and false negatives.","cites":"2","conferencePercentile":"41.66666667"},{"venue":"W4A","id":"7c9db2530fba2bb4da18aa161668404e78d6bcca","venue_1":"W4A","year":"2015","title":"Measuring text simplification with the crowd","authors":"Walter S. Lasecki, Luz Rello, Jeffrey P. Bigham","author_ids":"2598433, 1680197, 1744846","abstract":"Text can often be complex and difficult to read, especially for people with cognitive impairments or low literacy skills. Text simplification is a process that reduces the complexity of both wording and structure in a sentence, while retaining its meaning. However, this is currently a challenging task for machines, and thus, providing effective on-demand text simplification to those who need it remains an unsolved problem. Even evaluating the simplicity of text remains a challenging problem for both computers, which cannot understand the meaning of text, and humans, who often struggle to agree on what constitutes a good simplification.\n This paper focuses on the evaluation of English text simplification using the crowd. We show that leveraging crowds can result in a collective decision that is accurate and converges to a consensus rating. Our results from 2,500 crowd annotations show that the crowd can effectively rate levels of simplicity. This may allow simplification systems and system builders to get better feedback about how well content is being simplified, as compared to standard measures which classify content into 'simplified' or 'not simplified' categories. Our study provides evidence that the crowd could be used to evaluate English text simplification, as well as to create simplified text in future work.","cites":"1","conferencePercentile":"66.66666667"},{"venue":"W4A","id":"a57b84ee2486b65c1124fdb2e4ddf7f88944c8e0","venue_1":"W4A","year":"2010","title":"TextSL: a screen reader accessible interface for second life","authors":"Bugra Oktay, Eelke Folmer","author_ids":"2529311, 3267671","abstract":"TextSL is a screen reader accessible interface for the popular virtual world of Second Life that lets the users interact using a command-based interface. Our research identified that it is challenging to make virtual worlds accessible to users with visual impairments as virtual worlds are densely populated with objects while at the same time many virtual world objects lack meta-data.","cites":"1","conferencePercentile":"21.21212121"},{"venue":"W4A","id":"d4586d216681796e13e3809141b6d57aa00cdc24","venue_1":"W4A","year":"2015","title":"Enhancing Android accessibility for users with hand tremor by reducing fine pointing and steady tapping","authors":"Yu Zhong, Astrid Weber, Casey Burkhardt, Phil Weaver, Jeffrey P. Bigham","author_ids":"1781339, 8733835, 1765880, 1854020, 1744846","abstract":"Smartphones and tablets with touchscreen have demonstrated potential to support the needs of individuals with motor impairments such as hand tremor. However, those users still face major challenges with conventional touchscreen gestures. These challenges are mostly caused by the fine precision requirement to disambiguate between targets on small screens. To reduce the difficulty caused by hand tremor in combination with small touch targets on the screen, we developed an experimental system-wide assistive service called <i>Touch Guard</i>. It enables <i>enhanced area touch</i> and a series of complementary features. This service provides the <i>enhanced area touch</i> feature through two possible disambiguation modes: magnification and descriptive targets list. In a laboratory study with motor-impaired users, we compared both modes to conventional tapping and tested <i>Touch Guard</i> with real-world applications. Targets list based disambiguation was more successful, reducing the error rate by 65% compared to conventional tapping. In addition, several challenges and design implications were discovered when presenting new touchscreen interaction techniques to users with motor impairments. As the experimental product of an intern research project at Google, <i>Touch Guard</i> demonstrates broad potential for solving accessibility issues for people with hand tremor using their familiar mobile devices, instead of high-cost hardware.","cites":"4","conferencePercentile":"95.23809524"},{"venue":"W4A","id":"19286fdb15b683b946e7b4bd37316c6961f92621","venue_1":"W4A","year":"2011","title":"Prediction of web page accessibility based on structural and textual features","authors":"Sina Bahram, Debadeep Sen, Robert St. Amant","author_ids":"3196867, 1890363, 1736796","abstract":"In this paper we present an approach to assessing the accessibility of Web pages, based on machine learning techniques. We are interested in the question of whether there are structural and textual features of Web pages, independent of explicit accessibility concerns, that nevertheless influence their usability for people with vision impairment. We describe three datasets, each containing a set of features corresponding to Web pages that are \"Accessible\" or \"Inaccessible\". Three classifiers are used to predict the category of these Web pages. Preliminary results are promising; they suggest the possibility of automated classification of Web pages with respect to accessibility.","cites":"1","conferencePercentile":"44.82758621"},{"venue":"W4A","id":"f5eb7e5bc9ccf2206e8d2a27c45e0a509ef1f8bb","venue_1":"W4A","year":"2013","title":"Three web accessibility evaluation perspectives for RIA","authors":"Nádia Fernandes, Ana Sofia Batista, Daniel Costa, Carlos Duarte, Luís Carriço","author_ids":"2034607, 2373058, 3801340, 2289512, 1805677","abstract":"With the increasing popularity of Rich Internet Applications (RIAs), several challenges arise in the area of web accessibility evaluation. A particular set of challenges emerges from RIAs dynamic nature: original static Web specifications can change dramatically before being presented to the end user; a user triggered event may provide complete new content within the same RIA. Whatever the evaluation alternative, the challenges must be met.\n We focus on automatic evaluation using the current WGAG standards. That enables us to do extensive evaluations in order to grasp the accessibility state of the web eventually pointing new direction for improvement.\n In this paper, we present a comparative study to understand the difference of the accessibility properties of the Web regarding three different evaluation perspectives: 1) before browser processing; 2) after browser processing (dynamic loading); 3) and, also after browser processing, considering the triggering of user interaction events.\n The results clearly show that for a RIA the number of accessibility outcomes varies considerably between those tree perspectives. First of all, this variation shows an increase of the number of assessed elements as well as passes, warnings and errors from perspective 1 to 2, due to dynamically loaded code, and from 2 to 3, due to the new pages reached by the interaction events. This shows that evaluating RIAs without considering its dynamic components provides an erroneous perception of its accessibility. Secondly, the relative growth of the number of fails is bigger than the growth of passes. This signifies that considering pages reached by interaction reveals lower quality for RIAs. Finally, a tendency is shown for the RIAs with higher number of states also exposing differences in accessibility quality.","cites":"4","conferencePercentile":"66.66666667"},{"venue":"W4A","id":"7f1ceb084f50ee80db762c6e763e1e8788db5d3d","venue_1":"W4A","year":"2012","title":"Understanding web accessibility and its drivers","authors":"Yeliz Yesilada, Giorgio Brajnik, Markel Vigo, Simon Harper","author_ids":"1760899, 1732821, 1727424, 3739189","abstract":"Access is what the web is 'about', it is the motivation behind its creation, and it is the rationale behind HTML. The desire to provide all users at CERN with the ability to access all documents was Tim Berners-Lee's primary goal, and this goal must also be carried through to equal access for all users. But this equality of access -- accessibility -- is difficult to quantify, define, or agree upon. In a constantly evolving field, understanding each other can be tricky; indeed, there are many different definitions in the literature, all with a different perspective. This makes it difficult for our community to interact, reach agreement, or share understanding. What is more, it makes it very difficult for those outside the web accessibility community to understand, plan, budget, enact policy, or conform to accessibility requirements and legislation when the community itself has so many, in some cases, conflicting definitions. We asked over 300 people, with an interest in accessibility, to discuss their views and definitions in an attempt to harmonise our understanding and support the expectations of users outside the community. We find that misunderstanding accessibility definitions, language, and terms might cause tension between different groups. That social, and not economic, aspects drive our perspectives of accessibility, and that definitions used by standards and regulatory bodies are most accepted - not those of individual experts. Forcing accessibility adoption does not encourage the acceptance of an accessibility ethos, but providing empirical evidence that accessibility benefits all, does. Finally, realistic and concise language was preferred when attempting to communicate, or define accessibility.","cites":"9","conferencePercentile":"93.10344828"},{"venue":"W4A","id":"a1b3c4568e84de69e83c12b3090da7c1b3017754","venue_1":"W4A","year":"2013","title":"Benchmarking web accessibility evaluation tools: measuring the harm of sole reliance on automated tests","authors":"Markel Vigo, Justin Brown, Vivienne Conway","author_ids":"1727424, 4434050, 2817165","abstract":"The use of web accessibility evaluation tools is a widespread practice. Evaluation tools are heavily employed as they help in reducing the burden of identifying accessibility barriers. However, an over-reliance on automated tests often leads to setting aside further testing that entails expert evaluation and user tests. In this paper we empirically show the capabilities of current automated evaluation tools. To do so, we investigate the effectiveness of 6 state-of-the-art tools by analysing their coverage, completeness and correctness with regard to WCAG 2.0 conformance. We corroborate that relying on automated tests alone has negative effects and can have undesirable consequences. Coverage is very narrow as, at most, 50% of the success criteria are covered. Similarly, completeness ranges between 14% and 38%; however, some of the tools that exhibit higher completeness scores produce lower correctness scores (66-71%) due to the fact that catching as many violations as possible can lead to an increase in false positives. Therefore, relying on just automated tests entails that 1 of 2 success criteria will not even be analysed and among those analysed, only 4 out of 10 will be caught at the further risk of generating false positives.","cites":"13","conferencePercentile":"95.45454545"},{"venue":"W4A","id":"6d518380c00e0a3123998e1e76ab889319fb1e03","venue_1":"W4A","year":"2013","title":"Evaluating accessibility-in-use","authors":"Markel Vigo, Simon Harper","author_ids":"1727424, 3739189","abstract":"Evidence suggests that guidelines employed in conformance testing do not catch all the accessibility barriers encountered by users on the Web. Since accessibility is strongly tied to the users' experience there is a subjective perception of accessibility barriers and their severity. What is more, not only intangible qualities characterise the way in which these barriers are perceived, but also navigation styles, age, onset, expertise and abilities play a key role. In order to overcome the limitations of conformance testing and catch the problems that emerge during the interaction we propose a user-interaction-driven method to automatically report accessibility problems. To do so, we initially isolate the problematic situations faced by users and the tactics employed in such situations. These tactics are considered behavioural markers of cognitive processes that indicate problematic situations; the presence of tactics denotes the presence of problems. Then, we design and deploy algorithms to automatically detect the exhibition of these tactics and consequently detect problematic situations. <i>WebTactics</i>, a tool that unobtrusively detects and reports the problematic situations undergone by visually disabled users illustrates the method we propose.","cites":"3","conferencePercentile":"60.60606061"},{"venue":"W4A","id":"2175e1598dcb8449721c87bcb45e83a3be256776","venue_1":"W4A","year":"2013","title":"W4A camp report: \"2012 edition\"","authors":"Simon Harper, Yeliz Yesilada, Markel Vigo","author_ids":"3739189, 1760899, 1727424","abstract":"The W4A Camp is an all day event set up to discuss accessibility research. Participants decide the topics to be discussed and they also organise the session during morning devoted to the camp. It is an ad-hoc unconference born from the desire for people to share and learn in an open environment. It is an intense event with discussions, demos and interaction from attendees. Anyone with something to contribute or with the desire to learn is welcomed and invited to join. The first edition was organised after the ninth International Cross-Disciplinary Conference on Web Accessibility (W4A 2012) in Lyon, France. There were around 30 attendees and four themes emerged which focused on 1. accessibility body of knowledge; 2. evaluation, conformity and certification; 3. breaking accessibility automation barriers and 4. mobile web and accessibility. This communication paper reports the experiences gained, lessons learnt, research areas discussed and major findings from the first edition of the W4A Camp.","cites":"0","conferencePercentile":"21.21212121"},{"venue":"W4A","id":"4cdbf0cb5ddcd8aafefd80428d8b72963f3f38d0","venue_1":"W4A","year":"2014","title":"Are users the gold standard for accessibility evaluation?","authors":"Amaia Aizpurua, Myriam Arrue, Simon Harper, Markel Vigo","author_ids":"1726287, 1738900, 3739189, 1727424","abstract":"User testing is considered a key part of web accessibility evaluation. However, little is known about how effective is for identifying accessibility problems. Our experience, informed by a series of studies with blind users, corroborates that a website with a significant number of guideline violations can be perceived as accessible, and on the contrary, some participants may not perceive a highly accessible website as accessible. Accessibility guidelines are often criticised by their partial coverage and questionable validity. However, we should be very careful about making categorical statements in this regard as there are a number of variables that may introduce biases in user tests. We identify sources of bias related to user expertise, the experimental setting, employed language and reporting that, if not adequately controlled, may influence on the validity and reliability of the evaluation results. We discuss the limitations and practical implications of user testing with blind users for web accessibility evaluation.","cites":"1","conferencePercentile":"56.06060606"},{"venue":"W4A","id":"afacde9f71a1bec93a780e7769b0c0ddd3b899e4","venue_1":"W4A","year":"2015","title":"DOM block clustering for enhanced sampling and evaluation","authors":"Simon Harper, Anwar Ahmad Moon, Markel Vigo, Giorgio Brajnik, Yeliz Yesilada","author_ids":"3739189, 2735009, 1727424, 1732821, 1760899","abstract":"Large websites are difficult to evaluate for Web Accessibility compliance due to the shear number of pages, the inaccuracy of current Web evaluation engines, and the W3C stated need to include human evaluators within the testing regime. This makes evaluating large websites all-but technically unfeasible. Therefore, sampling of the pages becomes a critical first step in the evaluation process. Current methods rely on drawing random samples, best guess samples, or convenience samples. In all cases the evaluation results cannot be trusted because the underlying structure and nature of the site are not known; they are missing 'website demographics'. By understanding the quantifiable statistics of a given population of pages we are better able to decide on the coverage we need for a full review, as well as the sample we need to draw in order to enact an evaluation. Our solution is to crawl a website comparing, and then clustering, the pages discovered based on Document Object Model block level similarity. This technique can be useful in reducing very large sites to a more manageable size, and allowing an 80% coverage by evaluating between &ap;0.1--4% of pages; additionally, by refining our clustering algorithm, we discuss how this could be reduced further.","cites":"0","conferencePercentile":"30.95238095"},{"venue":"W4A","id":"6a250241424ba0c4b95363434d49ed96b4768a49","venue_1":"W4A","year":"2010","title":"Social accessibility: the challenge of improving web accessibility through collaboration","authors":"Daisuke Sato, Masatomo Kobayashi, Hironobu Takagi, Chieko Asakawa","author_ids":"7137022, 4407679, 3086992, 1851536","abstract":"There are billions of people who face problems in accessing webpages, including people with disabilities, elderly people, and illiterate people in developing countries. The needs for accessible webpages have become too broad to be left only to Web developers. The wisdom of crowds has become part of a key strategy to combine various skills and knowledge into a community that can address the needs for accessibility. Social Accessibility is one such project for visually impaired people, which has been operating for more than a year, producing findings and new challenges. Based on our experiences, the collaborative approach can work well and be expanded for people with other problems such as poor hearing, aged eyes, and reading problems.","cites":"6","conferencePercentile":"63.63636364"},{"venue":"W4A","id":"a1a704be18eff155e29f2272bb5a0d36e4b04be5","venue_1":"W4A","year":"2010","title":"Describing online videos with text-to-speech narration","authors":"Masatomo Kobayashi, Tohru Nagano, Kentarou Fukuda, Hironobu Takagi","author_ids":"4407679, 2181095, 3110160, 3086992","abstract":"Most online videos are inaccessible for blind and visually impaired people. Those who are illiterate or barely literate also face difficulties with many videos. An audio description (AD) can help, but is rarely provided for actual online videos because of the time and trouble required. The technology platform we are developing uses a speech synthesis technology to add ADs to online videos at minimal cost. We are developing an authoring tool for AD scripts, a Web browser for playing the described videos, and a text-based format to handle the AD scripts.","cites":"1","conferencePercentile":"21.21212121"},{"venue":"W4A","id":"b0ae33874dfb64c90461ece41e45ee0500889580","venue_1":"W4A","year":"2008","title":"Cloud computing and equal access for all","authors":"T. V. Raman","author_ids":"1718755","abstract":"Web-2.0 applications use the Web as a platform for delivering end-user applications. This transformation has a profound impact on how applications are authored, deployed and consumed. Software applications in this environment are no longer monolithic --- instead, they are naturally separated into distributed components that implement application and interaction logic. The application logic along with user data resides in the network cloud; the user interface made up of presentation and interaction logic is delivered in a form best suited to the user's needs, <i>e.g.</i>, via a universal client such as a Web browser.\n The advantages of this usage/delivery model for mainstream users has been widely explored in the last 18 months. This keynote focuses on the impact of this transformation on users with special needs. Today, the potential for universal access presented by applications delivered via the Web remains largely unrealized. This is partly due to the impedance mismatch that results from trying to treat interactive Web applications as static Web documents. Eliminating this impedance mismatch requires innovation at all levels of the technology stack with respect to:\n &#8226; How Web applications are authored and deployed,\n &#8226; How Web applications are consumed,\n &#8226; How Web interaction is augmented by adaptive technologies.\n This keynote will describe some of these challenges and the accompanying opportunities.","cites":"9","conferencePercentile":"70.83333333"},{"venue":"W4A","id":"14e96a9fd857285af9cf4de560bca2d0869c6632","venue_1":"W4A","year":"2008","title":"AxsJAX: a talking translation bot using google IM: bringing web-2.0 applications to life","authors":"Charles L. Chen, T. V. Raman","author_ids":"1713526, 1718755","abstract":"Web-2.0 applications turn static Web documents into dynamic user interfaces. They epitomize the final realization of the vision \"The Document <b>Is</b> The Interface!\". This transition from static Web pages to interactive Web applications also requires the introduction of a fresh set of innovations to how such applications are accessed in conjunction with adaptive technologies.\n Asynchronous JavaScript and XML (AJAX) breathes life into static Web pages. ARIA live regions helps bring such interaction to life when used in conjunction with adaptive technologies such as screenreaders and self-voicing browsers. This paper introduces the motivation behind live regions in ARIA, and describes how this support can be used to enhance the user interaction provided by Google Talk --- an instant-messaging client that is integrated into the GMail Web interface. We describe the interaction model as it is surfaced to the end-user, and show how the introduction of <i>live regions</i> makes all aspects of the resulting UI usable with adaptive technologies.\n Web-2.0 applications---especially mashups---excel at creating end-user solutions that are greater than the sum of their individual building blocks. We demonstrate this by bringing together Google Talk, Live Regions and Natural Language translation by demonstrating a multi-lingual talking translation interface that is the result of speech-enabling these applications using the Google AxsJAX framework.","cites":"26","conferencePercentile":"100"},{"venue":"W4A","id":"75146bca5201d7119ca328766c949fd72f4877f9","venue_1":"W4A","year":"2007","title":"Iconic communication system by XML language: (SCILX)","authors":"Nathalie Cindy Kuicheu, Laure Pauline Fotso, François Siewe","author_ids":"2676727, 3333792, 2447809","abstract":"Traditional iconic systems establish direct iconic communication between a user and his environment by translating iconic sentences in sentences of a natural language, or by translating them into SQL (Structured Query Language) queries for relational data bases. This approach is limited because it is not suitable for communicating through the Internet which allows users of diverse background and culture to communicate all over the world. This paper presents SCILX, a XML-based iconic communication system which in addition to the functionalities of existing iconic systems enables communication through the Internet using the World Wide Web and the XML technologies. The approach has a formal foundation based on formal grammars of icons. A case study of an iconic interface for a multi-media database in traditional medicine (MEDITRA) is presented.","cites":"4","conferencePercentile":"40.38461538"},{"venue":"W4A","id":"11ce5b9116e03bf5bdc8b254b812e05a9c61e923","venue_1":"W4A","year":"2006","title":"Evaluating interfaces for intelligent mobile search","authors":"Karen Church, Barry Smyth, Mark T. Keane","author_ids":"7439565, 1701131, 1733913","abstract":"Recent developments in the mobile phone market have led to a significant increase in the number of users accessing the Mobile Internet. Handsets have been improved to support a diverse range of content types (text, graphics, audio, video etc.), infrastructure investments have delivered improved bandwidth, and changes to billing models offer users much greater value for content. Today large numbers of users are moving away from browsing operator portals and towards off-portal search, leading to a growing need for mobile specific search engine technologies. In this paper we argue that existing mobile search engines are unlikely to offer an adequate service for mobile searchers. Most borrow traditional query-based search and list-based result presentation formats from Web search and as such are not well optimised for the input and display features of mobile devices. For example, many simply attempt to <i>translate</i> Web content for the mobile space which is not appropriate. In this paper we evaluate an alternative strategy which replaces the usual result snippet with a more economic alternative that is composed of the keywords used in related queries. We argue that this alternative is better suited to the display characteristics of mobile devices, without compromising the informativeness of result snippets.","cites":"5","conferencePercentile":"67.64705882"},{"venue":"W4A","id":"4d4ba08baab5fb3a7196e2e42b50a7144263ed06","venue_1":"W4A","year":"2016","title":"An online chess game designed for people with dyslexia","authors":"Luz Rello, Sergi Subirats, Jeffrey P. Bigham","author_ids":"1680197, 3446248, 1744846","abstract":"Teaching chess to students with learning disabilities has been shown to benefit their school performance in unrelated domains. At the same time, chess involves skills that are highly correlated with dyslexia, such as visuospatial and calculation abilities. In this paper, we created a online chess game designed for people with dyslexia and seek to understand whether people with dyslexia learn and play chess online in ways that differ from other students and whether such differences may be leveraged to improve classroom performance. To test how people with dyslexia learn to play chess we carried out a within-subject experiment with 62 participants, 31 of them with diagnosed dyslexia. Participants used an instrumented web-based chess learning platform that we developed to <i>(i)</i> complete lessons on how to play chess and about chess theory, <i>(ii)</i> work through exercises designed to test and reaffirm their skills, and <i>(iii)</i> play chess against a computer opponent. We could not find significant differences on four dependent measures out of the twelve measures we collected. Therefore, dyslexia might have an impact on how people learn and play chess using a computer, suggesting that chess may be useful as a fun way to help people with dyslexia improve their abilities.","cites":"0","conferencePercentile":"45"},{"venue":"W4A","id":"eab3d90fba2acb873eb843cf4e7c83f8fceea0b7","venue_1":"W4A","year":"2015","title":"Dyslexia and web accessibility: synergies and challenges","authors":"Luz Rello","author_ids":"1680197","abstract":"This paper reviews the main challenges of studying dyslexia for web accessibility. These are: (1) measuring the impact of dyslexia in the population; (2) the limitations of the up-to-date studies; and (3) including dyslexia in the Web accessibility guidelines. While some aspects are already addressed by the guidelines, we propose the inclusion of simple recommendations for typeface and font size that would benefit both people with and without dyslexia. We also suggest a change in the current methodologies to overcome up-to-date research limitations using larger and more representative datasets.","cites":"0","conferencePercentile":"30.95238095"},{"venue":"W4A","id":"2f93877a1e10ae594846660102c1decabaf33a73","venue_1":"W4A","year":"2015","title":"Detecting readers with dyslexia using machine learning with eye tracking measures","authors":"Luz Rello, Miguel Ballesteros","author_ids":"1680197, 1721717","abstract":"Worldwide, around 10% of the population has dyslexia, a specific learning disorder. Most of previous eye tracking experiments with people with and without dyslexia have found differences between populations suggesting that eye movements reflect the difficulties of individuals with dyslexia. In this paper, we present the first statistical model to predict readers with and without dyslexia using eye tracking measures. The model is trained and evaluated in a 10-fold cross experiment with a dataset composed of 1,135 readings of people with and without dyslexia that were recorded with an eye tracker. Our model, based on a Support Vector Machine binary classifier, reaches 80.18% accuracy using the most informative features. To the best of our knowledge, this is the first time that eye tracking measures are used to predict automatically readers with dyslexia using machine learning.","cites":"6","conferencePercentile":"100"},{"venue":"W4A","id":"c6d3685475559faadfc18dd690299d5f46d3f9ba","venue_1":"W4A","year":"2015","title":"A plug-in to aid online reading in Spanish","authors":"Luz Rello, Roberto Carlini, Ricardo A. Baeza-Yates, Jeffrey P. Bigham","author_ids":"1680197, 3345643, 1747635, 1744846","abstract":"Reading text on the Web is a challenging task for many people, such as those with cognitive impairments, reading difficulties or people who are learning a new language. In this paper we present a web browser plug-in to help with reading Spanish text on the Web. The plug-in is freely available for Chrome and presents definitions and simpler synonyms on demand for the selected web text. The tool was modified following the suggestions of 5 people (2 with diagnosed dyslexia) who tested the tool using the think aloud protocol and undertook a subsequent interview.","cites":"0","conferencePercentile":"30.95238095"},{"venue":"W4A","id":"49ac6ee2801e5c80fbaba665356d5aefc5735774","venue_1":"W4A","year":"2014","title":"Evaluation of DysWebxia: a reading app designed for people with dyslexia","authors":"Luz Rello, Ricardo A. Baeza-Yates","author_ids":"1680197, 1747635","abstract":"In this paper we present the evaluation of DysWebxia, a reading app for iOS devices, specially designed for people with dyslexia. DysWebxia integrates previous results about the best way to present text for people with dyslexia together with a unique feature, the ability to show synonyms on demand for complex words. Although the new algorithm used for this unique feature is language independent, our first prototype is for Spanish. To evaluate DysWebxia we carried out two different user studies. One to evaluate the quality of the synonyms on demand that included 32 participants with dyslexia and 38 strong readers without dyslexia, and another one to evaluate the usability of the app based on 12 participants. Our results show that the quality of the synonyms generated by the new algorithm outperforms a frequency based baseline, and that the participants found DysWebxia very usable. Therefore, we show that this app may have in the future a large impact for people with dyslexia.","cites":"7","conferencePercentile":"98.48484848"},{"venue":"W4A","id":"07eea603462f5f7ff75c8870c22922ec979d5843","venue_1":"W4A","year":"2013","title":"DysWebxia 2.0!: more accessible text for people with dyslexia","authors":"Luz Rello, Clara Bayarri, Azuki Gorriz, Ricardo A. Baeza-Yates, Saurabh Gupta, Gaurang Kanvinde, Horacio Saggion, Stefan Bott, Roberto Carlini, Vasile Topac","author_ids":"1680197, 1830227, 3233895, 1747635, 3523981, 1715159, 3014320, 2736946, 3345643, 3022082","abstract":"Even if dyslexia is neurological in origin, certain text modifications could make texts more accessible for people with dyslexia. We introduce <i>DysWebxia 2.0</i>, a model that integrates our findings from research conducted with this target group. It alters content and presentation of the text to make it more readable. We also present the current integrations of <i>DysWebxia</i> in different reading software applications.","cites":"1","conferencePercentile":"48.48484848"},{"venue":"W4A","id":"28ce72b929e4afab9cc1d6b12f8914273aef430f","venue_1":"W4A","year":"2006","title":"Dialog generation for voice browsing","authors":"Zan Sun, Amanda Stent, I. V. Ramakrishnan","author_ids":"8048393, 1760622, 1762197","abstract":"In this paper we present our voice browser system, <i>HearSay</i>, which provides efficient access to the World Wide Web to people with visual disabilities. HearSay includes content-based segmentation of Web pages and a speech-driven interface to the resulting content. In our latest version of HearSay, we focus on general-purpose browsing. In this paper we describe HearSay's new dialog interface, which includes several different browsing strategies, gives the user control over the amount of information read out, and contains several different methods for summarizing information in part of a Web page. HearSay selects from its collection of presentation strategies at run time using classifiers trained on human-labeled data.","cites":"4","conferencePercentile":"52.94117647"},{"venue":"W4A","id":"8a960ea40fe7b32a1ee702a84f64ec1de5c3e7fe","venue_1":"W4A","year":"2010","title":"VizWiz: nearly real-time answers to visual questions","authors":"Jeffrey P. Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Rob Miller, Aubrey Tatarowicz, Brandyn White, Samuel White, Tom Yeh","author_ids":"1744846, 1712587, 1737220, 1715840, 7691539, 1723785, 1715819, 1688274, 4707811, 1704158","abstract":"The lack of access to visual information like text labels, icons, and colors can cause frustration and decrease independence for blind people. Current access technology uses automatic approaches to address some problems in this space, but the technology is error-prone, limited in scope, and quite expensive. In this paper, we introduce <i>VizWiz</i>, a talking application for mobile phones that offers a new alternative to answering visual questions in nearly real-time - asking multiple people on the web. To support answering questions quickly, we introduce a general approach for intelligently recruiting human workers in advance called <i>quikTurkit</i> so that workers are available when new questions arrive. A field deployment with 11 blind participants illustrates that blind people can effectively use VizWiz to cheaply answer questions in their everyday lives, highlighting issues that automatic approaches will need to address to be useful. Finally, we illustrate the potential of using VizWiz as part of the participatory design of advanced tools by using it to build and evaluate VizWiz::LocateIt, an interactive mobile tool that helps blind people solve general visual search problems.","cites":"263","conferencePercentile":"100"},{"venue":"W4A","id":"0a5a50991c05e2d9284cd918a4d4dc02cd1abc9d","venue_1":"W4A","year":"2007","title":"Accessibility 2.0: people, policies and processes","authors":"Brian Kelly, David Sloan, Stephen Brown, Jane Seale, Helen Petrie, Patrick Lauke, Simon Ball","author_ids":"4690030, 1746921, 7463582, 2721589, 1719946, 2671331, 8688958","abstract":"The work of the Web Accessibility Initiative (WAI) is described in a set of technical guidelines designed to maximise accessibility to digital resources. Further activities continue to focus on technical developments, with current discussions exploring the potential merits of use of Semantic Web and Web 2.0 approaches. In this paper we argue that the focus on technologies can be counter-productive. Rather than seeking to enhance accessibility through technical innovations, the authors argue that the priority should be for a user-focussed approach, which embeds best practices through the development of achievable policies and processes and which includes all stakeholders in the process of maximising accessibility.\n The paper reviews previous work in this area and summarises criticisms of WAI's approach. The paper further develops a tangram model which describes a pluralistic, as opposed to a universal, approach to Web accessibility, which encourages creativity and diversity in developing accessible services. Such diversity will need to reflect the context of usage, including the aims of a service (informational, educational, cultural, etc.), the users' and the services providers' environment.\n The paper describes a stakeholder approach to embedding best practices, which recognises that organisations will encounter difficulties in developing sustainable approaches by addressing only the needs of the end user and the Web developer. The paper describes work which has informed the ideas in this paper and plan for further work, including an approach to advocacy and education which coins the \"Accessibility 2.0\" term to describe a renewed approach to accessibility, which builds on previous work but prioritises the importance of the user. The paper concludes by describing the implications of the ideas described in this paper for WAI and for accessibility practitioner stakeholders.","cites":"38","conferencePercentile":"94.23076923"},{"venue":"W4A","id":"1c039ecfbef9bc19146b87920a0561570ff72732","venue_1":"W4A","year":"2014","title":"Helping students keep up with real-time captions by pausing and highlighting","authors":"Walter S. Lasecki, Raja S. Kushalnagar, Jeffrey P. Bigham","author_ids":"2598433, 1683550, 1744846","abstract":"We explore methods for improving the readability of real- time captions by allowing users to more easily switch their gaze between multiple visual information sources. Real-time captioning provides deaf and hard of hearing (DHH) users with access to spoken content during live events, and the web has allowed these services to be provided via remotely- located captioning services, and for web content itself. However, despite caption benefits, spoken language reading rates often result in DHH users falling behind spoken content, especially when the audio is paired with visual references. This is particularly true in classroom settings, where multi-modal content is the norm, and captions are often poorly positioned in the room, relative to speakers. Additionally, this accommodation can benefit other students who face temporary or \"situational\" disabilities such as listening to unfamiliar speech accents, or if a student is in a location with poor acoustics.\n In this paper, we explore <i>pausing</i> and <i>highlighting</i> as a means of helping DHH students keep up with live classroom content by helping them track their place when reading text involving visual references. Our experiments show that by providing users with a tool to more easily track their place in a transcript while viewing live video, it is possible for them to follow visual content that might otherwise have been missed. Both pausing and highlighting have a positive impact on students' scores on comprehension tests, but highlighting is preferred to pausing, and yields nearly twice as large of an improvement. We then discuss several issues with captioning that we observed during our design process and user study, and then suggest future work that builds on these insights.","cites":"7","conferencePercentile":"98.48484848"},{"venue":"W4A","id":"a2139d436eacb82ec563bef1c49cf4d03d25b929","venue_1":"W4A","year":"2015","title":"HoliBraille: multipoint vibrotactile feedback on mobile devices","authors":"Hugo Nicolau, Kyle Montague, Tiago João Vieira Guerreiro, André Rodrigues, Vicki L. Hanson","author_ids":"2334545, 2414592, 2742146, 3250429, 1730685","abstract":"We propose HoliBraille, a system that enables Braille input and output on current mobile devices. We use vibrotactile motors combined with dampening materials in order to actuate directly on users' fingers. The prototype can be attached to current capacitive touchscreen devices enabling multipoint and localized feedback. HoliBraille can be leveraged in several applications including educational tools for learning Braille, as a communication device for deaf-blind people, and as a tactile feedback system for multitouch Braille input. We conducted a user study with 12 blind participants on Braille character discrimination. Results show that HoliBraille is effective in providing localized feedback; however, character discrimination performance is strongly related with number of simultaneous stimuli. We finish by discussing the obtained results and propose future research avenues to improve multipoint vibrotactile perception.","cites":"2","conferencePercentile":"80.95238095"},{"venue":"W4A","id":"0b5bde267b99ff7c3a72a75eb72fcae22cb12880","venue_1":"W4A","year":"2006","title":"Contextual web accessibility - maximizing the benefit of accessibility guidelines","authors":"David Sloan, Andy Heath, Fraser Hamilton, Brian Kelly, Helen Petrie, Lawrie Phipps","author_ids":"1746921, 1738362, 3021486, 4690030, 1719946, 3277436","abstract":"We argue that while work to optimize the accessibility of the World Wide Web through the publication and dissemination of a range of guidelines is of great importance, there is also the need for a more holistic approach to maximizing the role of the Web in enabling disabled people to access information, services and experiences. The persistently disappointingly low levels of usability of Web content for disabled people indicates that focusing on the adoption of accessibility guidelines by content authors, tool developers and policy makers is not sufficient for a truly inclusive Web. This approach fails to acknowledge the role of the Web as an enabler in a broader context and may stifle creative use of Web content and experiences to enhance social inclusion.Using e-learning as an example, and describing current metadata developments, we present a framework that will guide Web authors and policy makers in addressing accessibility at a higher level, by defining the context in which a Web resource will be used and considering how best existing or new alternatives may be combined to enhance the accessibility of the information and services provided by the site in question. We demonstrate how guidelines such as those produced by the W3C's Web Accessibility Initiative have a role to play within this wider context, along with metadata and user profiling initiatives.","cites":"32","conferencePercentile":"100"},{"venue":"W4A","id":"6ce036d21b596d317e4d6375ad68549c3f469915","venue_1":"W4A","year":"2005","title":"Forcing standardization or accommodating diversity?: a framework for applying the WCAG in the real world","authors":"Brian Kelly, David Sloan, Lawrie Phipps, Helen Petrie, Fraser Hamilton","author_ids":"4690030, 1746921, 3277436, 1719946, 3021486","abstract":"Since 1999 the W3C's Web Content Accessibility Guidelines (WCAG) have provided a solid basis for implementation of accessible Web design. However it is argued that in the context of evaluation and policymaking, inappropriate reference to the WCAG may lead to serious practical difficulties in implementation and monitoring of an effective accessibility policy. There is a pressing need for a framework that guides appropriate application of the WCAG in a holistic way, taking into account the diversity -- or homogeneity -- of factors such as context of use, audience and audience capability, and access environment. In particular, the current promotion of W3C technologies at the expense of widely used and accessible proprietary technologies may be problematic, as is the apparent reliance of the WCAG on compliant browsing technology.In this paper, a holistic application of the WCAG is proposed by the authors, whereby the context of the Web resource in question and other factors surrounding its use are used to shape an approach to accessible design. Its potential application in a real world environment is discussed.","cites":"48","conferencePercentile":"100"},{"venue":"W4A","id":"57819724969c4253c5755d9a1ee164746a5fc988","venue_1":"W4A","year":"2015","title":"Creating accessible PDFs for conference proceedings","authors":"Erin L. Brady, Yu Zhong, Jeffrey P. Bigham","author_ids":"2288778, 1781339, 1744846","abstract":"A responsibility we have as researchers is to disseminate the results of our research widely. A primary way we do this is through research publications. When these publications are not accessible to everyone, some readers will be excluded and the impact of our research limited. In this paper, we explore this problem in two ways. First, we report on the accessibility of 1,811 papers in the technical program of several top conferences related to accessibility and human-computer interaction. Second, we reflect on our experience making papers accessible for any CHI 2015 author who requested it. We offer thoughts on research challenges and future work that may make our community's research more accessible.","cites":"1","conferencePercentile":"66.66666667"},{"venue":"W4A","id":"1a15dfc090f0ade41deae00add9480b5ecc68b19","venue_1":"W4A","year":"2014","title":"Holistic web accessibility in a society of technology convergence","authors":"Kun-Pyo Lee","author_ids":"1829920","abstract":"Web accessibility is subject to the paradigm of convergence. The web plays a crucial role in this paradigm. Increasingly, it becomes a platform for an ecosystem where users with different products, services, and activities work together organically and complement each other. To cope with this complex system I suggest Holistic Web Accessibility through design, which converges Technology with Activity in designing for seamless product ecosystems and holistic human experiences.","cites":"0","conferencePercentile":"22.72727273"},{"venue":"W4A","id":"5e50859d9a770a24029400503c43d608d7c429f0","venue_1":"W4A","year":"2014","title":"JustSpeak: enabling universal voice control on Android","authors":"Yu Zhong, T. V. Raman, Casey Burkhardt, Fadi Biadsy, Jeffrey P. Bigham","author_ids":"1781339, 1718755, 1765880, 1783267, 1744846","abstract":"In this paper we introduce <i>JustSpeak</i>, a universal voice control solution for non-visual access to the Android operating system. <i>JustSpeak</i> offers two contributions as compared to existing systems. First, it enables system wide voice control on Android that can accommodate any application. <i>JustSpeak</i> constructs the set of available voice commands based on application context; these commands are directly synthesized from on-screen labels and accessibility metadata, and require no further intervention from the application developer. Second, it provides more efficient and natural interaction with support of multiple voice commands in the same utterance. We present the system design of <i>JustSpeak</i> and describe its utility in various use cases. We then discuss the system level supports required by a service like <i>JustSpeak</i> on other platforms. By eliminating the target locating and pointing tasks, <i>JustSpeak</i> can significantly improve experience of graphic interface interaction for blind and motion-impaired users.","cites":"6","conferencePercentile":"92.42424242"},{"venue":"W4A","id":"59e0a8b077cc2aa5640a27a653f47fc06f3d966f","venue_1":"W4A","year":"2014","title":"Friendsourcing the unmet needs of people with dementia","authors":"João Martins, José Carilho, Oliver Schnell, Carlos Duarte, Francisco M. Couto, Luís Carriço, Tiago João Vieira Guerreiro","author_ids":"4361933, 1984602, 3124301, 2289512, 8636753, 1805677, 2742146","abstract":"The decay of cognitive abilities associated with dementia severely impacts the quality of life of a person and his surrounding ecosystem. First, people with dementia (PwD) increasingly forget the events in their lives leading to depression, isolation and faster cognitive deterioration. Second, their caregivers, besides the emotional burden that having someone close in such a condition carries, are also likely to be overwhelmed with responsibilities and duties in maintaining the PwD with a balanced and decent lifestyle. Our approach tries to address this by providing a prosthetic memory captured in two ways: 1) automatically captures data from the PwD's smartphone and enriches it with automatically retrieved data from the web and, 2) a private social network group (friendsourcing) used to validate and personalize the relevant events in the PwD's life. By sharing the load among a limited but still populated set of trustworthy people we aim to maintain the caregiving process feasible and maintain more people engaged with the PwD. Overall, the ultimate goal is to provide reminiscence, safety and cognitive aids for the PwD that are up-to-date and personally relevant.","cites":"3","conferencePercentile":"83.33333333"},{"venue":"W4A","id":"186ca6034c30206f9223a49bbe6ccef3a0671f2c","venue_1":"W4A","year":"2013","title":"Size matters (spacing not): 18 points for a dyslexic-friendly Wikipedia","authors":"Luz Rello, Martin Pielot, Mari-Carmen Marcos, Roberto Carlini","author_ids":"1680197, 2884328, 1768225, 3345643","abstract":"In 2012, Wikipedia was the sixth-most visited website on the Internet. Being one of the main repositories of knowledge, students from all over the world consult it. But, around 10% of these students have dyslexia, which impairs their access to text-based websites. How could Wikipedia be presented to be more readable for this target group? In an experiment with 28 participants with dyslexia, we compare reading speed, comprehension, and subjective readability for the font sizes 10, 12, 14, 18, 22, and 26 points, and line spacings 0.8, 1.0, 1.4, and 1.8. The results show that font size has a significant effect on the readability and the understandability of the text, while line spacing does not. On the basis of our results, we recommend using 18-point font size when designing web text for readers with dyslexia. Our results significantly differ from previous recommendations, presumably, because this is the first work to cover a wide range of values and to study them in the context of an actual website.","cites":"13","conferencePercentile":"95.45454545"},{"venue":"W4A","id":"1c8f28018e72d16250ef756a7dcb19e65599e9b9","venue_1":"W4A","year":"2014","title":"An analysis of personalized web accessibility","authors":"Nádia Fernandes, Nikolaos Kaklanis, Konstantinos Votis, Dimitrios Tzovaras, Luís Carriço","author_ids":"2034607, 2783510, 1893777, 1697138, 1805677","abstract":"This paper presents an experimental study designed to understand the differences of performing personalized Web accessibility evaluations or generic evaluations. We used the WaaT evaluator, which can perform personalized WCAG 2.0 based evaluation. We claim that these tools can be used by an individual to understand if a page is accessible to himself, before wasting time browsing its content.\n Our study shows that there are considerable differences between the generic and the personalized evaluation results. It also shows that the number of barriers found in accessing pages is in average considerably lower for users with upper limb and cognitive impairments than for those with vision and hearing impairments. Finally, we argue that common accessibility evaluation metrics are inadequate to understand the differences between these user perspectives of the same page. For a particular metric, we show that score differences are diminished and sometimes even mislead the perception of the accessibility quality.","cites":"3","conferencePercentile":"83.33333333"},{"venue":"W4A","id":"4c63637a67b0fb82df933f27fcb85dd5423396d6","venue_1":"W4A","year":"2015","title":"Optimus web: selective delivery of desktop or mobile web pages","authors":"Nádia Fernandes, Tiago João Vieira Guerreiro, Diogo Marques, Luís Carriço","author_ids":"2034607, 2742146, 2868723, 1805677","abstract":"We propose a system that selectively delivers the most accessible representations of a website to the end-user. To do so, we resort to a Web proxy that, using the results of an automatic evaluator, changes HTTP requests and delivers the most suitable available representation. The accessibility evaluator uses WCAG 2.0 [1] guidelines and considers pages after browser interpretation. We performed a user study with 19 blind participants where different representations of website were used. Results show that user performance correlates with the computed accessibility levels, and that for different websites either mobile or desktop versions may turn out to be more accessible. Expert users seem to perform independently from the level of accessibility of the pages. These results suggest that a proxy that selectively delivers Web page representations is feasible and that future work should also consider the profile of the user for selection.","cites":"1","conferencePercentile":"66.66666667"},{"venue":"W4A","id":"7d49c0862703be1441cae5bb7728846b59d5dbb2","venue_1":"W4A","year":"2016","title":"Development technologies impact in web accessibility","authors":"Carlos Duarte, Inês Matos, João V. Messias, Ana Salvado, Carlos M. Duarte, Luís Carriço","author_ids":"2289512, 2961793, 2945930, 3445510, 3445983, 1805677","abstract":"This paper presents a study assessing the effect of development technology choices on the accessibility quality of web pages. We used an off-the-shelf tool to identify technologies over a set of 1669 pages, each from a different domain. We have focused, in particular, in programming languages, Web and JavaScript frameworks, and content management systems categories. Simultaneously, we used an automatic accessibility evaluation tool to assess the accessibility of those pages. The study shows statistical evidence that some technologies lead to more accessible pages, within all categories.","cites":"0","conferencePercentile":"45"},{"venue":"W4A","id":"a4e4a23a7634cedb582be0383f3123b6d332f755","venue_1":"W4A","year":"2014","title":"Overcoming the new accessibility challenges using the sweet framework","authors":"Gollapudi Vrj Sai Prasad, T. B. Dinesh, Venkatesh Choppella","author_ids":"2824097, 1750702, 1702919","abstract":"For many, Accessibility is about disability and aiding the disabled user. We argue for a much broader definition: One that is inclusive of not only the disabled and the technologically deprived, but also the able-bodied, who may still be facing linguistic, socio-cultural, cognitive type barriers. Further, we discuss how to overcome this new broad set of barriers (which have elsewhere been called New Accessibility). Modification of original static content to new target content -- a technique of Renarration -- is modeled as a webpage transformation. This is operationally realized as \"Sweets\". Sweets are external meta data used for transformation of the web page. They are collaboratively and socially produced either by humans or human triggered Sweet based web applications. The entire web architecture featuring Sweets, their repositories and their web applications is explained and shared as a potential mechanism for overcoming New Accessibility barriers. Two web applications, Alipi and Mural Annotation for IDH, are finally showcased to highlight that Sweets based architecture does indeed help in facing the barriers of New Accessibility.","cites":"1","conferencePercentile":"56.06060606"},{"venue":"W4A","id":"4516c5835d4693e74e5f601dd2495d592e2fe4df","venue_1":"W4A","year":"2012","title":"Alipi: tools for a re-narration web","authors":"T. B. Dinesh, Venkatesh Choppella","author_ids":"1750702, 1702919","abstract":"A set of tools that demostrate the concept of a re-narration web, that aims to add alternative, target specific narrations of web documents as an extension of the web protocol with the intent of assisting a process of content dissemination and access that is inclusive of non-literate people.","cites":"0","conferencePercentile":"17.24137931"},{"venue":"W4A","id":"763c9288dad5d15b85f8e5977496cbf6cccc44fc","venue_1":"W4A","year":"2013","title":"Using simultaneous audio sources to speed-up blind people's web scanning","authors":"João Guerreiro","author_ids":"1718751","abstract":"Sighted users are able to sift through a website quickly to find their information of interest. In contrast, screen readers present the information sequentially to blind users, which contrast with the visual presentation on screen that portrays more information at once. We believe that blind users will benefit from multiple simultaneous sound sources while scanning websites with several information items, in order to find their information of interest faster.","cites":"0","conferencePercentile":"21.21212121"},{"venue":"W4A","id":"7d1b44742386d01bb1503fd305accb9216e9e36e","venue_1":"W4A","year":"2005","title":"Web composition with WCAG in mind","authors":"Vicente Luque Centeno, Carlos Delgado Kloos, Martin Gaedke, Martin Nussbaumer","author_ids":"2431317, 1747541, 2974357, 2215691","abstract":"Accessibility should be a part of the Web design process instead of being a <i>post-design</i> repair process. Thus, it should be more integrated within the internal authoring tools' mechanism of generating new accessible Web contents. Web pages are usually composed of small pieces of HTML code which, dynamically nested and combined, generate full Web pages. This Web composition, specially when creating Web pages from data extracted from heterogeneous or external sources, should have accessibility into account in order to guarantee that the final page being constructed is accessible. This paper presents the set of rules that, in a Web composition process, a design tool must follow in order to create accessible Web pages. These rules are formalized with W3C standards like XPath and XQuery expressions. We also present WSLS as an accessibility enabled authoring tool that makes this task feasible, and focus in how this tool incorporates accessibility into the process of generating new Web contents.","cites":"9","conferencePercentile":"53.33333333"},{"venue":"W4A","id":"3b85d2ccb915282450066193c294aacf539d3354","venue_1":"W4A","year":"2012","title":"Alipi: a framework for re-narrating web pages","authors":"T. B. Dinesh, Suzan Üsküdarli, Subramanya Sastry, Deepti Aggarwal, Venkatesh Choppella","author_ids":"1750702, 2274172, 5061075, 2275741, 1702919","abstract":"We propose Alipi, a distributed and participatory approach for re-narrating web pages for the purpose of rendering the content more accessible. This model supports alternative descriptions for a web page or parts of it via rewriting or <i>re-narration</i> for a given target audience by volunteers. The goal is to render the Web accessible to people across varied abilities, age, economic situation, language and geographic locations. We present the motivation, architecture and prototype implementation of Alipi.","cites":"1","conferencePercentile":"41.37931034"}]}