{"WAA.csv":[{"venue":"WAA","id":"e87161005848f17594bf62ae418272d01fdf7fb5","venue_1":"WAA","year":"2001","title":"Empirical Evaluation of Boundary Policies for Wavelet-Based Image Coding","authors":"Claudia Schremmer","author_ids":"3342345","abstract":"The wavelet transform has become the most interesting new algorithm for still image compression. Yet there are many parameters within a wavelet analysis and synthesis which govern the quality of a decoded image. In this paper, we discuss different image boundary policies and their implications for the decoded image. A pool of gray–scale images has been wavelet–transformed at different settings of the wavelet filter bank and quantization threshold and with three possible boundary policies. Our empirical evaluation is based on three benchmarks: a first judgment regards the perceived quality of the decoded image. The compression rate is a second crucial factor. Finally, the best parameter settings with regard to these two factors is weighted with the cost of implementation. Contrary to the JPEG2000 standard, where mirror padding is implemented , our investigation proposes circular convolution as the boundary treatment.","cites":"1","conferencePercentile":"84.48275862"},{"venue":"WAA","id":"3463dd721a3fc485f668fd82f9ca881918569ead","venue_1":"WAA","year":"2001","title":"The Application of the Wavelet Transform to the Prediction of Gas Zones","authors":"Xiu Wen Yang, Jing Zhao, Jian Ping Li, Jing Liu, Shun Peng Zeng","author_ids":"3168610, 5349795, 2561190, 5661757, 3058930","abstract":"An accurately evaluate about the zone number and position of the gas zone is put forward in this paper. It provides the reliable basis for developing natural gas through synthetically analyzing the result of carrying on wavelet de-noising and wavelet package denoising disposal simultaneously to the density porosity curve and neutron porosity curve. If there is natural gas in the void of underground reservoir, it can increase the density well logging porosity D φ and decrease the compensation neutron porosity CNL φ. As long as overlapping these two kinds of porosity curves we can directly determine the zone meeting the condition of D CNL φ φ < is that one containing gas. While because of noise signals are contained in most of the well logging traces, small saw teeth will take place in the curves caused by some factors. Though this phenomenon is independent of the character of the zone, either of the explanation of the single curve or the two overlapping curves may run into obstacle, and makes the evaluation lack of accuracy. So it is obviously important to control the noise of the well logging traces. Despite a few ways existing for a long time in low frequency filter on the well logging traces, the rate of distinguish of the curves are reduces after dispose, so we can not explain gas zones effectively. Wavelet analysis, which has extensive application on the aspect of signal analysis and graph disposal, is a new developing branch of mathematics in recent years and achieves noticeable success. In this paper, in order to remove the signal noise of CNL φ and D φ , the one-dimension method of wavelet denoising and wavelet package denoising is used to achieve the purpose of prediction of parameters about gas zone.","cites":"0","conferencePercentile":"36.20689655"}]}