{"WABI.csv":[{"venue":"WABI","id":"f99c19741ccc9e96a536c94bab6941b979891425","venue_1":"WABI","year":"2002","title":"Restricting SBH Ambiguity via Restriction Enzymes","authors":"Steven Skiena, Sagi Snir","author_ids":"1721948, 1710762","abstract":"Sequencing by hybridization (SBH) is a proposed approach to DNA sequencing. The SBH-spectrum of the target sequence is a list of all k-mers occurring at least once in the sequence. Sequencing is successful if the SBH-spectrum is a result of only that sequence and ambiguous otherwise. Unfortunately, the expected number of sequences consistent with a given spectrum increases exponentially with the target sequence length. to increase the resolving power of SBH by including information from enzymatic digestion assays. In addition to the hybridization assay, we conduct a small number of complete digestion assays using different restriction enzymes. The computational phase of identifying consistent sequences then combines the hybridization and digestion information. This combination of SBH and digestion assays significantly increases the length of sequences that can be uniquely determined. We give procedures for selecting the best enzymes for the job, prove that a variant of the reconstruction problem which includes an extra free parameter is hard, and give effective heuristics to improve search-based reconstruction algorithms. We also give a lower bound on the number of restriction enzymes required for unique reconstruction.","cites":"4","conferencePercentile":"10"},{"venue":"WABI","id":"01e7c4ecbb0029701b621b88e22f2df0d597cf63","venue_1":"WABI","year":"2005","title":"Multiple Structural RNA Alignment with Lagrangian Relaxation","authors":"Markus Bauer, Gunnar W. Klau, Knut Reinert","author_ids":"2582848, 8686734, 2031588","abstract":"In contrast to proteins, many classes of functionally related RNA molecules show a rather weak sequence conservation but instead a fairly well conserved secondary structure. Hence it is clear, that any method that relates RNA sequences in form of (multiple) alignments should take structural features into account. Since multiple alignments are of great importance for subsequent data analysis, research in improving the speed and accuracy of such alignments benefits many other analysis problems. We present a formulation for computing provably optimal, structure-based, multiple RNA alignments and give an algorithm that finds such an optimal solution or at least a very good approximation of it. Our formulation is based on the structural trace formulation of Reinert et al. and uses a recently proposed weighting function of Hofacker et al. that makes use of McCaskill's approach to compute base pair probability functions. To solve the resulting computational problem we propose an algorithm based on Lagrangian relaxation which already proved useful in the two-sequence case. We compare our implementation, mLARA, to two recent programs (MARNA and pmmulti) and demonstrate that we can compute multiple alignments with consensus structures that have a significant lower minimum free energy term than computed by the other programs. Our prototypical experiments indicate that our new algorithm is the first approach to successfully compute provably optimal multiple structural alignments in reasonable computation time. Further advantages are its applicablity to long sequences where standard dynamic programming approaches must fail and its ability to deal with pseudoknot structures.","cites":"8","conferencePercentile":"55.17241379"},{"venue":"WABI","id":"2a590ecabff6f616c73456994f5869144b76edb9","venue_1":"WABI","year":"2007","title":"Seeded Tree Alignment and Planar Tanglegram Layout","authors":"Antoni Lozano, Ron Y. Pinter, Oleg Rokhlenko, Gabriel Valiente, Michal Ziv-Ukelson","author_ids":"1796873, 1792078, 3046332, 1805216, 1786373","abstract":"The optimal transformation of one tree into another by means of elementary edit operations is an important algorithmic problem that has several interesting applications to computational biology. Here we introduce a constrained form of this problem in which a partial mapping of a set of nodes (the \" seeds \") in one tree to a corresponding set of nodes in the other tree is given, and present efficient algorithms for both ordered and unordered trees. Whereas ordered tree matching based on seeded nodes has applications in pattern matching of RNA structures, unordered tree matching based on seeded nodes has applications in co-speciation and phylogeny reconciliation. The latter involves the solution of the planar tanglegram layout problem, for which a polynomial-time algorithm is given here.","cites":"7","conferencePercentile":"73.07692308"},{"venue":"WABI","id":"76b3a0ab239a9228e90697604addf51b9b28f726","venue_1":"WABI","year":"2013","title":"The generalized Robinson-Foulds metric","authors":"Sebastian Böcker, Stefan Canzar, Gunnar W. Klau","author_ids":"1715474, 2702352, 8686734","abstract":"The Robinson-Foulds (RF) metric is arguably the most widely used measure of phylogenetic tree similarity, despite its well-known shortcomings: For example, moving a single taxon in a tree can result in a tree that has maximum distance to the original one; but the two trees are identical if we remove the single taxon. To this end, we propose a natural extension of the RF metric that does not simply count identical clades but instead, also takes similar clades into consideration. In contrast to previous approaches, our model requires the matching between clades to respect the structure of the two trees, a property that the classical RF metric exhibits, too. We show that computing this generalized RF metric is, unfortunately, NP-hard. We then present a simple Integer Linear Program for its computation, and evaluate it by an all-against-all comparison of 100 trees from a benchmark data set. We find that matchings that respect the tree structure differ significantly from those that do not, underlining the importance of this natural condition.","cites":"1","conferencePercentile":"22.22222222"},{"venue":"WABI","id":"2d024e0c906a591262996fdbaa8c7209b4b4cafa","venue_1":"WABI","year":"2006","title":"Flux-Based vs. Topology-Based Similarity of Metabolic Genes","authors":"Oleg Rokhlenko, Tomer Shlomi, Roded Sharan, Eytan Ruppin, Ron Y. Pinter","author_ids":"3046332, 2719461, 1808821, 1779370, 1792078","abstract":"We present an effectively computable measure of functional gene similarity that is based on metabolic gene activity across a variety of growth media. We applied this measure to 750 genes comprising the metabolic network of the budding yeast. Comparing the in silico computed functional similarities to those obtained by using experimental expression data, we show that our computational method captures similarities beyond those that are obtained by the topological analysis of metabolic networks, thus revealing — at least in part — dynamic characteristics of gene function. We also suggest that network centrality partially explains functional centrality (i.e. the number of functionally highly similar genes) by reporting a significant correlation between the two. Finally, we find that functional similarities between topologically distant genes occur between genes with different GO annotations.","cites":"1","conferencePercentile":"11.36363636"},{"venue":"WABI","id":"40fac9d7fb0b807035a4a860fc2efe7632a9ad4f","venue_1":"WABI","year":"2008","title":"NAPX: A Polynomial Time Approximation Scheme for the Noah's Ark Problem","authors":"Glenn Hickey, Paz Carmi, Anil Maheshwari, Norbert Zeh","author_ids":"1779524, 1738236, 1720050, 1728566","abstract":"The Noah's Ark Problem (NAP) is an NP-Hard optimization problem with relevance to ecological conservation management. It asks to maximize the phylogenetic diversity (PD) of a set of taxa given a fixed budget, where each taxon is associated with a cost of conservation and a probability of extinction. NAP has received renewed interest with the rise in availability of genetic sequence data, allowing PD to be used as a practical measure of biodiversity. However, only simplified instances of the problem, where one or more parameters are fixed as constants, have as of yet been addressed in the literature. We present NAPX, the first algorithm for the general version of NAP that returns a 1 − ǫ approximation of the optimal solution. It runs in O \" nB 2 h 2 (log n+log 1 ǫ) 2 log 2 (1−ǫ) « time where n is the number of species, and B is the total budget and h is the height of the input tree. We also provide improved bounds for its expected running time.","cites":"0","conferencePercentile":"6"},{"venue":"WABI","id":"8d1a0e7f6687f6e95ca897f5a531c63e21ab5e40","venue_1":"WABI","year":"2008","title":"Genotype Sequence Segmentation: Handling Constraints and Noise","authors":"Qi Zhang, Wei Wang, Leonard McMillan, Jan Prins, Fernando Pardo-Manuel de Villena, David Threadgill","author_ids":"4672028, 1702047, 1748115, 5519672, 3707797, 8052139","abstract":"Recombination plays an important role in shaping the genetic variations present in current-day populations. We consider populations evolved from a small number of founders, where each individual's genomic sequence is composed of segments from the founders. We study the problem of segmenting the genotype sequences into the minimum number of segments attributable to the founder sequences. The minimum segmentation can be used for inferring the relationship among sequences to identify the genetic basis of traits, which is important for disease association studies. We propose two dynamic programming algorithms which can solve the minimum segmentation problem in polynomial time. Our algorithms incorporate biological constraints to greatly reduce the computation, and guarantee that only minimum segmentation solutions with comparable numbers of segments on both haplotypes of the genotype sequence are computed. Our algorithms can also work on noisy data including genotyping errors, point mutations, gene conversions, and missing values.","cites":"7","conferencePercentile":"44"},{"venue":"WABI","id":"1ffa290461443b576bd780d690ff70a99c346def","venue_1":"WABI","year":"2014","title":"Efficient Indexed Alignment of Contigs to Optical Maps","authors":"Martin D. Muggli, Simon J. Puglisi, Christina Boucher","author_ids":"3093163, 1879835, 1802700","abstract":"Since its emergence almost 20 years ago (Schwartz et al., Science 1995), optical mapping has undergone a transition from laboratory technique to commercially available data generation method. In line with this transition, it is only relatively recently that optical mapping data has started to be used for scaffolding contigs and assembly validation in large-scale sequencing projects — for example, the goat (Dong et al., Nature Biotech. 2013) and amborella (Chamala et al., Science 2013) genomes. One major hurdle to the wider use of optical mapping data is the efficient alignment of in silico digested contigs to an optical map. We develop Twin to tackle this very problem. Twin is the first index-based method for aligning in silico digested contigs to an optical map. Our results demonstrate that Twin is an order of magnitude faster than competing methods on the largest genome. Most importantly, it is specifically designed to be capable of dealing with large eukaryote genomes and thus is the only non-proprietary method capable of completing the alignment for the budgerigar genome in a reasonable amount of CPU time.","cites":"7","conferencePercentile":"87.5"}]}