{"WAC.csv":[{"venue":"WAC","id":"1ac7662bcc2b18569ce78e2372fc05870a8ea242","venue_1":"WAC","year":"2004","title":"Panel Report: \"Grand Challenges of Network and Service Composition\"","authors":"Giuseppe Valetto, Fabrice Saffre","author_ids":"1703915, 1784503","abstract":"This brief report intends to summarize some of the things we learned during WAC2004 sessions \" Network Composition \" and \" Negotiation and Deployment \" , and that were highlighted during the subsequent panel discussion. We try to focus especially on the following aspects: traits and trends of convergence emerging from the rather diverse findings presented in those sessions; controversial or divergent opinions on some of those findings; open issues that should be addressed by the autonomic communication community and how to tackle them; and major research directions that seem likely to emerge and shape a significant part of the autonomic communication landscape. 1 Findings and Commonalities We notice how a certain set of issues surfaced repeatedly in both sessions. Fig. 1 attempts to draw some relationships among those issues, starting from the idea of Adaptation as a generic term for the self-regulating operation of an autonomic system. Several of the works presented deal with Composition as an important form of adaptation and a first-class autonomic primitive. Policies and Negotiation are widely regarded as useful means to strategize about and achieve adaptation through composition, in a top-down vs. bottom-up fashion: policies can dictate the terms of composition (e.g. when, what and how), while negotiation can be used to spontaneously reconcile competing and/or conflicting policies, and converge towards stable system configurations. Finally, Semantic Knowledge can be used to obtain an explicit and abstract representation of autonomic adaptation, including composition. That representation remains formal and hence can be distilled into policies, but at the same time provides the ability to understand discuss, communicate and review the autonomic behavior of a system. Another evident common element is that wireless communication provides major motivation and an obvious test bench for the investigation of autonomic paradigms: LANs, PANs, sensor networks, as well as ubiquitous, ambient and ad hoc networking, are among the wireless and mobile contexts that look like natural catalysts for","cites":"0","conferencePercentile":"15.78947368"},{"venue":"WAC","id":"801e31daa373043f664083c4eb7ca0e454a9456b","venue_1":"WAC","year":"2004","title":"BIONETS: BIO-inspired NExt generaTion networkS","authors":"Iacopo Carreras, Imrich Chlamtac, Hagen Woesner, Csaba Király","author_ids":"1767395, 1700194, 1688970, 1768602","abstract":"The amount of information in the new emerging all-embracing pervasive environments will be enormous. Current Internet protocol conceived almost forty years ago, were never planned for these emerging pervasive environments. The communications requirements placed by these protocols on the low cost sensor and tag nodes are in direct contradiction to the fundamental goals if these nodes, being small, inexpensive and maintenance free. This situation needs therefore a radically different approach to communication in these systems, especially since pervasive and ubiquitous networks are expected to be the key drivers of the all encompassing Internet of the coming decades. The fundamental disparity between the need for extremely dispensable, low cost devices, such as sensors or tags, and increasing communications load per device due to the presence of billions of nodes, that is creating an unbridgeable paradox, is therefore an insurmountable obstacle on the way to adoption when conventional networking architectures are being considered. Biological systems provide insights into principles which can be adopted to completely redefine the basic concepts of control, structure, interaction and function of the emerging pervasive environments. The study of the rules of genetics and evolution combined with mobility, leads to the definition of service oriented communication systems which are autonomous, and autonomously self-adaptive. The objective of this article is to ascertain how this paradigm shift, which views a network only as a randomly self-organizing by-product of a collection of self-optimizing services, may become the enabler of the new world of omnipresent low cost pervasive environments of the future.","cites":"10","conferencePercentile":"71.05263158"},{"venue":"WAC","id":"903334bb5020b7af7d2a13787f5a495719b4f857","venue_1":"WAC","year":"2005","title":"Service Evolution in a Nomadic Wireless Environment","authors":"Iacopo Carreras, Francesco De Pellegrini, Daniele Miorandi, Hagen Woesner","author_ids":"1767395, 1680141, 1763896, 1688970","abstract":"In this paper, we present and analyze a framework for self-evolving autonomic services in a wireless nomadic environment. We present a disconnected network architecture, where users mobility is exploited to achieve a scalable behaviour, and communication is based on localized peer-to-peer interactions among neighboring nodes. Service management is achieved by introducing autonomic services, whose operations are based on a distributed evolution process. The latter relies on the concept of mating, i.e., the exchange of information (e.g., code, parameters, data) among service users, which collaborate to enhance their fitness, defined as the ability of the actual service to fullfill the environmental features. The core of the evolution process is given by the service mating policy, which defines the way the running code should be modified when mating with other users. We introduce a general framework for analyzing service mating policies and exploit results from martingales theory to study their convergence properties. In particular, we introduce two optimal policies, clone-and-mutate and combine-and-mutate, and analyze their convergence times through extensive numerical simulations, addressing the impact of various parameters (number of nodes, users speed, mobility pattern).","cites":"6","conferencePercentile":"50"},{"venue":"WAC","id":"31c53334a1d44f3e19d1a10454f9e302980100d7","venue_1":"WAC","year":"2004","title":"Spatial Computing: An Emerging Paradigm for Autonomic Computing and Communication","authors":"Franco Zambonelli, Marco Mamei","author_ids":"1684412, 1715670","abstract":"Emerging distributed computing scenarios call for novel \" autonomic \" approaches to distributed systems development and management. In this position paper we analyze the distinguishing characteristics of those scenarios, discuss the inadequacy of traditional paradigms, and elaborate on primary role of \" space \" in modern distributed computing. In particular, we show that spatial abstractions promise to be basic necessary ingredients for a novel \" spatial computing \" paradigm, acting as a unifying framework for autonomic computing and communication. On this base, we propose a preliminary \" spatial computing stack \" to frame the key concepts and mechanisms of spatial computing. Eventually, we try to sketch a research agenda in the area.","cites":"24","conferencePercentile":"100"},{"venue":"WAC","id":"b41f96b43060a7c3a5c04200ccc620c6b0ebc87a","venue_1":"WAC","year":"2004","title":"Content Distribution Through Autonomic Content and Storage Management","authors":"Nikolaos Laoutaris, Antonis Panagakis, Ioannis Stavrakakis","author_ids":"1683137, 2631072, 1702769","abstract":"Content Distribution has to date been addressed by a mix of centralized and uncoordinated distributed processes, such as server replication and traditional node caching mechanisms, respectively. It is an inherently distributed process that is also increasingly relying on entities that are not only increasingly distributed but also increasingly autonomous. Consequently, centralized – and typically targeting the \" socially optimal \" – decisions are rather unrealistic for a distributed environment of autonomic entities. Instead, a distributed management of the engaged autonomic entities, which take decisions dynamically, should be key to efficient content distribution. The latter is advocated in this paper in which two entities that are central to content distribution-specifically the content and the node storage – are considered and it is discussed how their autonomic behavior drives the operation of a content distribution network. In the first case, it is the content that manages itself by dynamically generating duplicate copies and pushing them to (seizing) the appropriate storage. In the second one, it is the node storage that is in charge, deciding on the content to be locally stored. The decisions taken by the distributed and autonomic entities may – in the extreme case – be driven by self-awareness and self-interest only, without any network state information and co-operativeness. Or, they may use (some) network information and take decisions in a more cooperative manner, despite their autonomic and self-interest-driven nature. An example is presented on the later case, showing the potential both social and individual benefits.","cites":"3","conferencePercentile":"39.47368421"},{"venue":"WAC","id":"18d6ceb1c4d583cf25438cc210b055f8e4fdb5cb","venue_1":"WAC","year":"2005","title":"Pocket Switched Networking: Challenges, Feasibility and Implementation Issues","authors":"Pan Hui, Augustin Chaintreau, Richard Gass, James Scott, Jon Crowcroft, Christophe Diot","author_ids":"2665582, 2775909, 3303869, 5675901, 1726850, 1737360","abstract":"The Internet is built around the assumption of contempo-raneous end-to-end connectivity. This is at odds with what typically happens in mobile networking, where mobile devices move between islands of connectivity, having opportunity to transmit packets through their wireless interface or simply carrying the data toward a connec-tivity island. We propose Pocket Switched Networking, a communication paradigm which reflects the reality faced by the mobile user. Pocket Networking falls under DTN. We describe the challenges that this approach entails and provide evidence that it is feasible with today's technology.","cites":"33","conferencePercentile":"100"},{"venue":"WAC","id":"79b5fce326b4ddb9adac83149910747c0711bb0c","venue_1":"WAC","year":"2004","title":"Challenges in Communications Research Beyond the VICOM Project","authors":"Francesco Vatalaro, Giovanni Cortese, Fabrizio Davide, Andrea Detti, Marco Leo, Pierpaolo Loreti, Giuseppe Riva","author_ids":"3125024, 1687323, 2708835, 1791403, 7796016, 1842721, 1730034","abstract":"The VICOM (Virtual Immersive COMmunications) project is a three-year project funded by the Italian Ministry of Instruction University and Research aiming at investigating innovative communication paradigms. The project represents a wide coordinated effort focused on integration of immer-sive and wireless technologies in view of the fourth generation of mobile communications. The main goal of the project consists of the design of a wideband system architecture for immersive services and of its validation through two distributed large test-beds. Starting from VICOM ongoing experiences some future challenges and objectives for the future situated and autonomic communications technologies are envisaged in the paper.","cites":"0","conferencePercentile":"15.78947368"}]}