{"WACC_99.csv":[{"venue":"WACC '99","id":"7669b4003b80bb403c511456d15296774773e773","venue_1":"WACC '99","year":"1999","title":"WACC'99 workshop program","authors":"Rebecca E. Grinter","author_ids":"1707373","abstract":"Objective and Scope The objective of the workshop is to provide a forum to discuss workflow management and work coordination in situations in which processes span several independent organisations. The Internet provides a ubiquitous means of communication, which could be exploited in conjunction with WorMow Management Systems (WfMS) to provide cross-organisational collaboration. WfMS and collaboration tools are now widely used within organisations, but currently available systems are not well suited for cross-organisational collaboration. Various related problems have to be addressed before such systems will be able to operate successfully across organisational boundaries: l Technical interoperability; definition of basic data types* communication protocols, and addressing schemes of participating systems. l Common terminology on the business and contents level, e.g. for orders, receipts, common objects, etc. l Common language for process models and other coordination schemas. l Privacy and restriction of access to organisation-internal systems to the needed and desired extent. l Mechanisms for querying and management of inter-organisational process status and history. l Inter-organisational management of shared processes. Some of these issues are currently being addressed by standardisation efforts such as the Workflow Management Coalition's Interface 4, Swap or OMG. There are several efforts on common process and coordination languages, and some common terminology problems are solved by standardisation efforts such as EDUEDIPACT. However, no current approach seems to provide the complete solution. The purpose of this workshop therefore is:. to get an overview of ongoing projects and upcoming products,. to compile requirements for such systems,. to learn about first successful deployments,. to identify research issues in cross-enterprise collaboration, 0 to start building a research community for inter-organisational workflow management and coordination. Aims and Objective The purpose of this workshop is to build upon recent work on tailorable groupware [2,5] and set a focus on the realization of tailorable collaborative systems. This will bring together researchers and practitioners from several different disciplines (organizational, social, psychological, HCI) in addition to computer science, which must all be integrated for a successful implementation of tailoring in groupware. The goal of the workshop is to compile an overview of the state-of-the-art in all aspects of tailorability implementation. This ranges * from processes and interfaces for collaborative tailoring to system architectures supporting tailoring. Background Tailoring of groupware raises several questions, which in the mainstream adaptability discussion are not (and do not have to be) addressed [6]. In general, collaborative work involves a group of two or …","cites":"0","conferencePercentile":"100"}]}