{"WACC.csv":[{"venue":"WACC","id":"1dd32ea18f77e7670dee409e8fb6dbec6ad6ac2a","venue_1":"WACC","year":"1999","title":"Virtual environments at work: ongoing use of MUDs in the workplace","authors":"Elizabeth F. Churchill, Sara A. Bly","author_ids":"1801572, 1761570","abstract":"In recent years much attention has been paid to network-based, distributed environments like text-based MUDs and MOOs for supporting collaborative work. Such environments offer a shared virtual world in which interactions can take place irrespective of the actual physical proximity or distance of interactants. Although these environments have proven successful within social, recreational and educational domains, few data have been reported concerning use of such systems in the workplace. In this paper we summarize in-depth interviews with 8 MUDders from a software research and development community where a MUD has been operational and actively used for a number of years. The interviews suggest that the MUD fills a valuable communication niche for this workgroup, being used both synchronously and asynchronously to enable the establishment of new contacts and the maintenance of existing contacts. These observations are discussed in the context of the organization under study.","cites":"52","conferencePercentile":"95.83333333"},{"venue":"WACC","id":"2c3fcbc68799732f6ab73c319d10400d0431b79f","venue_1":"WACC","year":"1999","title":"Moksha: exploring ubiquity in event filtration-control at the multi-user desktop","authors":"Rameshsharma Ramloll, John A. Mariani","author_ids":"3095188, 1707662","abstract":"Collaborative systems need to provide some means for users to be aware of peer activities. Common approaches involve broadcasting events generated as a result of a particular user's actions at the interface to others. Rather than flooding users with information about all activities occurring in the shared environment, filtration techniques allow each user to be exposed to relevant awareness information. Such techniques are often based on user configurable agents. Unfortunately, these so far do not support satisfactorily the improvisational nature of collaborative activities. This is because user configuration is effective mainly in cases where interactions can be anticipated and where configuration plans can be drawn. It is also difficult for a configurable agent to capture the diversity and the complex interrelationships between collaborative activities. In highly dynamic collaborative environments, the need to synchronise configurations with rapidly evolving needs imposes a heavy task load on participants. In Moksha, our prototypical multi-user desktop, this problem is addressed by extending the desktop metaphor and automating the filtration control process so that it becomes ubiquitous to the user. The cross-client linkage of the desktop interface elements, the use of multi-media and its browsing techniques are the main components underlying our strategy.","cites":"3","conferencePercentile":"16.66666667"},{"venue":"WACC","id":"9c4926f34410956c08f58f83b9250927cd924664","venue_1":"WACC","year":"1999","title":"Supporting the writing of reports in a hierarchical organization","authors":"Andreas Girgensohn","author_ids":"2195286","abstract":"In many hierarchical companies, reports from several independent groups must be merged to form a single, company-wide report. This paper describes a process and system for creating and structuring such reports and for propagating contributions up the organization. The system has been in regular use, in-house, by about 30 users for over a year to create monthly status reports. Our experiences indicate that it is possible to change a monthly reporting practice so that the system is easy to use, improves the quality of the written report, fosters collaboration across projects and creates a corporate memory for the company. These results were achieved as a consequence of our design effort to directly support the hierarchical and collaborative process of creating and assembling the report within the organization. User feedback has led to many improvements in the usability and functionality of the system. Further enhancements using information retrieval and text summarization techniques are in progress.","cites":"1","conferencePercentile":"8.333333333"},{"venue":"WACC","id":"3762e74523191750886f3ccbed5f5704029e91ea","venue_1":"WACC","year":"1999","title":"Declarative workflows that support easy modification and dynamic browsing","authors":"Richard Hull, François Llirbat, Eric Simon, Jianwen Su, Guozhu Dong, Bharat Kumar, Gang Zhou","author_ids":"1746861, 2724205, 1717633, 1734232, 1750571, 2676132, 1720964","abstract":"A new programming paradigm named \"Vortex\" is introduced for specifying a wide range of decision-making activities including, in particular, workflows. In Vortex workflows are specified declaratively. A particular emphasis is on \"object-focused\" workflows, i.e., workflows focused on how individual input objects should be processed within an organization. Such workflows arise commonly in practice, including insurance claims processing, and many electronic commerce applications, and in the area of Customer Care, e.g., web-based storefronts. Vortex workflows are \"attribute-centric\", because they are centered around how the attribute values for an input object are gathered and computed. Initially, only a few attributes of an input object have assigned values. During processing of the object, additional attribute values may be assigned by external modules, or by internal modules, including \"decision modules\". Decision modules include \"attribute rules\" that specify contributions to specific attribute values; these are combined with one of a broad family of available semantics. In Vortex, enabling conditions are used to determine what attributes should be evaluated. A novel choice-based execution model provides a general framework for optimization strategies. The use of enabling conditions, attribute rules and declarative semantics makes Vortex workflows easier to modify and refine than traditional, procedurally specified workflows. Vortex supports modularity and permits the natural intermixing of Vortex workflows with traditional, procedural workflows. The paper introduces a novel spreadsheet-like interface for dynamic browsing of Vortex executions.","cites":"51","conferencePercentile":"91.66666667"},{"venue":"WACC","id":"2152a5ca42e6f4e66e95213eb77a77f5a7d0cbab","venue_1":"WACC","year":"1999","title":"Systems architecture: product designing and social engineering","authors":"Rebecca E. Grinter","author_ids":"1707373","abstract":"The production of large and complex systems usually requires the coordination and collaboration of many individuals spread among numerous divisions of a corporation. However, much research examining coordination has focused on the subtleties of interactions between individuals who may work together in the same department. In this paper, I present a study of systems architects and the work that they do to coordinate design across organizational and institutional boundaries. I also describe the processes and tools that the architects use to support their work. The implications of the social processes involved in coordinating the design of large complex systems on the product and those involved in its production are discussed.","cites":"27","conferencePercentile":"79.16666667"},{"venue":"WACC","id":"520c02f4c535a971fcc2448a45888012038f1648","venue_1":"WACC","year":"1999","title":"Interoperability as a means of articulation work","authors":"Carla Simone, Gloria Mark, Dario Giubbilei","author_ids":"1697525, 1695284, 2347262","abstract":"The interoperability of systems to support cooperative work requires moving beyond purely technical issues; it also concerns the means and practices that users adopt to articulate their cooperative activities. Articulation has to be supported by a technology which focuses on this higher level of interoperability. This claim is motivated by observing the articulation process of users in real cooperative work practice. Based on this study, the functionality for this technology was designed to help users reconcile different handling and perspectives on shared objects in their cooperative work. The paper presents the architecture of an application infrastructure centered on the identified interoperability issues and focuses on the design of a specialized module, called reconciler, which provides the above functionality. The current state of its implementation together with identifying open research problems conclude the paper.","cites":"33","conferencePercentile":"83.33333333"},{"venue":"WACC","id":"41b71607d4f6fe08ecff54bcfcfe438eebccf06d","venue_1":"WACC","year":"1999","title":"\"Got COCA?\" - A new perspective in building electronic meeting systems","authors":"Du Li, Zhenghao Wang, Richard R. Muntz","author_ids":"1731024, 3167171, 1704462","abstract":"In a previous paper[11], we presented COCA (Collaborative Objects Coordination Architecture) as a generic framework for developing collaborative systems. COCA advocates separation of coordination policies from general-purpose computations in collaborative systems so that the former can be modeled in a high-level specification language. Reuse of both coordination policies and collaboration tools can be achieved.This paper overviews the COCA model and focuses on the application of COCA in building real-life systems. We prototyped a modest set of tools for electronic meeting systems (EMSs) to show how they can be used to support both unstructured and structured meetings, with only changes in the coordination policies and no changes to the tools themselves. A subset of Robert's Rules of Order[21] was formalized and specified as an example of control of formal structured meetings. Finally the current status and the future directions are summarized.","cites":"7","conferencePercentile":"33.33333333"},{"venue":"WACC","id":"3265c9b3d4546499e1b49dfc8ba86b5c1e8b1add","venue_1":"WACC","year":"1999","title":"Why do electronic conversations seem less polite? the costs and benefits of hedging","authors":"Susan Brennan, Justina O. Ohaeri","author_ids":"8724780, 3308118","abstract":"Electronic conversations often seem less polite than spoken conversations. The usual explanation for this is that people who are not physically copresent become depersonalized and less inhibited by social norms. While this explanation is intuitively appealing, we consider another possibility, based on the costs of producing \"polite\" utterances when speaking versus when typing. We examined a corpus of conversations generated by 26 three-person groups who interacted either face-to-face or electronically to do a collaborative memory task. We coded hedges (which mark an utterance as provisional) and questions (which display doubt or invite input from others), as people presented their own recollections, accepted, modified, or rejected those of others, and tried to reach consensus. Both of these devices are associated with politeness. For most people, hedging is more difficult when typing than when speaking because additional words are required, while marking an utterance as a question is equally easy in both media. The two groups made somewhat different use of these devices: Face-to-face groups hedged more than electronic groups, but both groups used questions just as often. We discuss how these and other differences emerge from the costs and affordances of communication media.","cites":"20","conferencePercentile":"62.5"},{"venue":"WACC","id":"2f8a4caa345aae660a7ff3a11c5f30743afa7ade","venue_1":"WACC","year":"1999","title":"Metaphorical representation in collaborative software engineering","authors":"James D. Herbsleb","author_ids":"1705550","abstract":"Finding a useful abstract representation is fundamental to solving many difficult problems in software engineering. In order to better understand how representations are actually used in key collaborative software engineering tasks, this empirical study examined all of the spoken representations of software behavior in 9 domain analysis sessions. It found that about 70% of them were metaphorical, representing system behavior as physical movement of objects, as perceptual processes, or in anthropomorphic terms ascribing beliefs and desires to the system. The pattern of use of these representations indicates 1) that they were not merely temporary placeholders, but rather their use persisted even when a specialized and more formal vocabulary had been developed, and 2) the metaphoric descriptions appear to reflect actual use of metaphor, rather than just a choice of vocabulary. The use of metaphor is explained in terms of how well they serve human cognitive abilities and collaborative needs. The predominance of metaphorical representations in synchronous collaborative sessions raises important issues about the possible misleading effects of metaphorical thinking. It also raises questions about the compatibility of the spoken representations with other representations (e.g., diagrams, specification languages) that trigger, and capture the results of, the verbal collaborative work.","cites":"12","conferencePercentile":"43.75"}]}