{"WADS.csv":[{"venue":"WADS","id":"2fb3d38aba9a0a431df4dcccfbb44527ac029bd9","venue_1":"WADS","year":"2007","title":"A Pseudopolynomial Time O (log n )-Approximation Algorithm for Art Gallery Problems","authors":"Ajay Deshpande, Taejung Kim, Erik D. Demaine, Sanjay E. Sarma","author_ids":"2449574, 6988088, 1727384, 1934849","abstract":"In this paper, we give a O(log copt)-approximation algorithm for the point guard problem where copt is the optimal number of guards. Our algorithm runs in time polynomial in n, the number of walls of the art gallery and the spread ∆, which is defined as the ratio between the longest and shortest pairwise distances. Our algorithm is pseudopoly-nomial in the sense that it is polynomial in the spread ∆ as opposed to polylogarithmic in the spread ∆, which could be exponential in the number of bits required to represent the vertex positions. The special subdivision procedure in our algorithm finds a finite set of potential guard-locations such that the optimal solution to the art gallery problem where guards are restricted to this set is at most 3copt. We use a set cover cum VC-dimension based algorithm to solve this restricted problem approximately.","cites":"21","conferencePercentile":"91.46341463"},{"venue":"WADS","id":"04eede31709515229b0dccf3a67d563de982e198","venue_1":"WADS","year":"2003","title":"Semi-matchings for Bipartite Graphs and Load Balancing","authors":"Nicholas J. A. Harvey, Richard E. Ladner, László Lovász, Tami Tamir","author_ids":"1815286, 1762656, 1725557, 2031981","abstract":"We consider the problem of fairly matching the left-hand vertices of a bipartite graph to the right-hand vertices. We refer to this problem as the optimal semi-matching problem; it is a relaxation of the known bipartite matching problem. We present a way to evaluate the quality of a given semi-matching and show that, under this measure, an optimal semi-matching balances the load on the right hand vertices with respect to any L p-norm. In particular, when modeling a job assignment system, an optimal semi-matching achieves the minimal makespan and the minimal flow time for the system. The problem of finding optimal semi-matchings is a special case of certain scheduling problems for which known solutions exist. However, these known solutions are based on general network optimization algorithms, and are not the most efficient way to solve the optimal semi-matching problem. To compute optimal semi-matchings efficiently, we present and analyze two new algorithms. The first algorithm generalizes the Hungarian method for computing maximum bipartite matchings, while the second, more efficient algorithm is based on a new notion of cost-reducing paths. Our experimental results demonstrate that the second algorithm is vastly superior to using known network optimization algorithms to solve the optimal semi-matching problem. Furthermore, this same algorithm can also be used to find maximum bipar-tite matchings and is shown to be roughly as efficient as the best known algorithms for this goal.","cites":"42","conferencePercentile":"96.2962963"},{"venue":"WADS","id":"c6629f4ba6d52c6488f8c09891cd2a3b44c4d0aa","venue_1":"WADS","year":"2013","title":"Smart-Grid Electricity Allocation via Strip Packing with Slicing","authors":"Soroush Alamdari, Therese C. Biedl, Timothy M. Chan, Elyot Grant, Krishnam Raju Jampani, Srinivasan Keshav, Anna Lubiw, Vinayak Pathak","author_ids":"1711428, 1809802, 1729779, 1734667, 2603928, 1692842, 1745436, 1716612","abstract":"One advantage of smart grids is that they can reduce the peak load by distributing electricity-demands over multiple short intervals. Finding a schedule that minimizes the peak load corresponds to a variant of a strip packing problem. Normally, for strip packing problems, a given set of axis-aligned rectangles must be packed into a fixed-width strip, and the goal is to minimize the height of the strip. The electricity-allocation application can be modelled as strip packing with slicing: each rectangle may be cut vertically into multiple slices and the slices may be packed into the strip as individual pieces. The stacking constraint forbids solutions in which a vertical line intersects two slices of the same rectangle. We give a fully polynomial time approximation scheme for this problem, as well as a practical polynomial time algorithm that slices each rectangle at most once and yields a solution of height at most 5/3 times the optimal height.","cites":"4","conferencePercentile":"66.07142857"},{"venue":"WADS","id":"b52d66136493bb1821e9bebbacc1089fb220a37b","venue_1":"WADS","year":"1993","title":"Point Probe Decision Trees for Geometric Concept Classes","authors":"Esther M. Arkin, Michael T. Goodrich, Joseph S. B. Mitchell, David M. Mount, Christine D. Piatko, Steven Skiena","author_ids":"1795183, 1679615, 1739556, 1709509, 1718753, 1721948","abstract":"A fundamental problem in model-based computer vision is that of identifying to which of a given set of concept classes of geometric models an observed model belongs. Considering a \\probe\" to be an oracle that tells whether or not the observed model is present at a given point in an image, we study the problem of computing eecient strategies (\\decision trees\") for probing an image, with the goal to minimize the number of probes necessary (in the worst case) to determine in which class the observed model belongs. We prove a hardness result and give strategies that obtain decision trees whose height is within a log factor of optimal. Our results generalize recent work on probing strategies which identify which single model is present, rather than which class of model is present. In most real pattern matching applications (e.g., character recognition, with multiple font types), it is more important to identify the concept class of an observed model, rather than its individual identity, which may require considerably more eeort to determine. These results grew out of discussions that began in a series of workshops on Geometric Probing in Computer Vision, sponsored by the Center for Night Vision and Electro-Optics, Fort Belvoir, Virginia, and monitored by the U.S. Army Research OOce. The views, opinions, and/or ndings contained in this report are those of the authors and should not be construed as an oocial Department of the Army position, policy, or decision, unless so designated by other documentation.","cites":"13","conferencePercentile":"56.25"},{"venue":"WADS","id":"5d7997f3deafcec73029793f54cf0d01aa4db5f3","venue_1":"WADS","year":"1999","title":"The Lazy Bureaucrat Scheduling Problem","authors":"Esther M. Arkin, Michael A. Bender, Joseph S. B. Mitchell, Steven Skiena","author_ids":"1795183, 1690852, 1739556, 1721948","abstract":"We introduce a new class of scheduling problems in which the optimization is performed by the worker (single \" machine \") who performs the tasks. A typical worker's objective is to minimize the amount of work he does (he is \" lazy \"), or more generally, to schedule as inefficiently (in some sense) as possible. The worker is subject to the constraint that he must be busy when there is work that he can do; we make this notion precise both in the preemptive and nonpreemptive settings. The resulting class of \" perverse \" scheduling problems, which we denote \" Lazy Bureaucrat Problems, \" gives rise to a rich set of new questions that explore the distinction between maximization and minimization in computing optimal schedules.","cites":"13","conferencePercentile":"50"},{"venue":"WADS","id":"d4969912f1d3f425acd419156a362e28bbce0efd","venue_1":"WADS","year":"2011","title":"Constructing Orthogonal de Bruijn Sequences","authors":"Yaw-Ling Lin, Charles B. Ward, Bharat Jain, Steven Skiena","author_ids":"1718367, 1719730, 2590494, 1721948","abstract":"A (σ, k)-de Bruijn sequence is a minimum length string on an alphabet set of size σ which contains all σ k k-mers exactly once. Motivated by an application in synthetic biology, we say a given collection of de Bruijn sequences are orthogonal if no two of them contain the same (k + 1)-mer; that is, the length of their longest common substring is k. In this paper, we show how to construct large collections of orthogonal de Bruijn sequences. In particular, we prove that there are at least σ/2 mutually-orthogonal order-k de Bruijn sequences on alphabets of size σ for all k. Based on this approach, we present a heuristic which proves capable of efficiently constructing optimal collections of mutually-orthogonal sequences for small values of σ and k, which supports our conjecture that σ − 1 mutually-orthogonal de Bruijn sequences exist for all σ and k.","cites":"1","conferencePercentile":"18.91891892"},{"venue":"WADS","id":"6daee69c7289aaac524844d73d6a132415b0b022","venue_1":"WADS","year":"2015","title":"A $2k$-Vertex Kernel for Maximum Internal Spanning Tree","authors":"Wen J. Li, Jianxin Wang, Jianer Chen, Yixin Cao","author_ids":"7877843, 8653176, 1746728, 3426511","abstract":"We consider the parameterized version of the maximum internal spanning tree problem, which, given an n-vertex graph and a parameter k, asks for a spanning tree with at least k internal vertices. Fomin et al. [J. Comput. System Sci., 79:1–6] crafted a very ingenious reduction rule, and showed that a simple application of this rule is sufficient to yield a 3k-vertex kernel. Here we propose a novel way to use the same reduction rule, resulting in an improved 2k-vertex kernel. Our algorithm applies first a greedy procedure consisting of a sequence of local exchange operations, which ends with a local-optimal spanning tree, and then uses this special tree to find a reducible structure. As a corollary of our kernel, we obtain a deterministic algorithm for the problem running in time 4 k · n O(1) .","cites":"4","conferencePercentile":"93.93939394"},{"venue":"WADS","id":"dc74d803bf40a731612a4e58c380069d3e49fafe","venue_1":"WADS","year":"2009","title":"Software Assumptions Failure Tolerance: Role, Strategies, and Visions","authors":"Vincenzo De Florio","author_ids":"1734762","abstract":"At our behest or otherwise, while our software is being executed , a huge variety of design assumptions is continuously matched with the truth of the current condition. While standards and tools exist to express and verify some of these assumptions, in practice most of them end up being either sifted off or hidden between the lines of our codes. Across the system layers, a complex and at times obscure web of assumptions determines the quality of the match of our software with its deployment platforms and run-time environments. Our position is that it becomes increasingly important being able to design software systems with architectural and structuring techniques that allow software to be decomposed to reduce its complexity, but without hiding in the process vital hypotheses and assumptions. In this paper we discuss this problem, introduce three potentially dangerous consequences of its denial, and propose three strategies to facilitate their treatment. Finally we propose our vision towards a new holistic approach to software development to overcome the shortcomings offered by fragmented views to the problem of assumption failures.","cites":"12","conferencePercentile":"88.33333333"},{"venue":"WADS","id":"04cac4ef3fb5f7950e56ebc852150d432b57e768","venue_1":"WADS","year":"2007","title":"Approximating the Maximum Sharing Problem","authors":"Amitabh Chaudhary, Danny Ziyi Chen, Rudolf Fleischer, Xiaobo Sharon Hu, Jian Li, Michael T. Niemier, Zhiyi Xie, Hong Zhu","author_ids":"1987900, 1743881, 1721205, 1704753, 1701502, 2751894, 1995602, 6869596","abstract":"In the maximum sharing problem (MS), we want to compute a set of (non-simple) paths in an undirected bipartite graph covering as many nodes as possible of the first node layer of the graph, with the constraint that all paths have both endpoints in the second node layer and no node in that layer is covered more than once. MS is equivalent to the node-duplication based crossing elimination problem (NDCE) that arises in the design of molecular quantum-dot cellular automata (QCA) circuits and the physical synthesis of BDD based regular circuit structures in VLSI design. We show that MS is NP-hard, present a polynomial-time 1.5-approximation algorithm, and show that MS cannot be approximated with a factor better than 740 739 unless P = N P .","cites":"4","conferencePercentile":"35.36585366"},{"venue":"WADS","id":"b328be6f5df3143bb82b01cef9081122817694f6","venue_1":"WADS","year":"1993","title":"Parallel Construction of Quadtrees and Quality Triangulations","authors":"Marshall W. Bern, David Eppstein, Shang-Hua Teng","author_ids":"1693008, 1719358, 1714796","abstract":"We describe efficient PRAM algorithms for constructing unbalanced quadtrees, balanced quadtrees, and quadtree-based finite element meshes. Our algorithms take time O(log n) for point set input and O(log n log k) time for planar straight-line graphs, using O(n+k/ log n) processors, where n measures input size and k output size.","cites":"72","conferencePercentile":"100"},{"venue":"WADS","id":"2dea2d8e7ee9a871e3acbf54b90c5ec7b9ec8bfe","venue_1":"WADS","year":"2015","title":"An Optimal Algorithm for Plane Matchings in Multipartite Geometric Graphs","authors":"Ahmad Biniaz, Anil Maheshwari, Subhas C. Nandy, Michiel H. M. Smid","author_ids":"1802242, 1720050, 1709081, 1721884","abstract":"Let P be a set of n points in general position in the plane which is partitioned into color classes. P is said to be color-balanced if the number of points of each color is at most n/2. Given a color-balanced point set P , a balanced cut is a line which partitions P into two color-balanced point sets, each of size at most 2n/3+1. A colored matching of P is a perfect matching in which every edge connects two points of distinct colors by a straight line segment. A plane colored matching is a colored matching which is non-crossing. In this paper, we present an algorithm which computes a balanced cut for P in linear time. Consequently, we present an algorithm which computes a plane colored matching of P optimally in Θ(n log n) time.","cites":"3","conferencePercentile":"83.33333333"},{"venue":"WADS","id":"1219723b24112414a73d5501d8dc889e1f4c90d4","venue_1":"WADS","year":"2001","title":"Optimization Over Zonotopes and Training Support Vector Machines","authors":"Marshall W. Bern, David Eppstein","author_ids":"1693008, 1719358","abstract":"We make a connection between classical polytopes called zonotopes and Support Vector Machine (SVM) classifiers. We combine this connection with the ellipsoid method to give some new theoretical results on training SVMs. We also describe some special properties of C-SVMs for C → ∞.","cites":"10","conferencePercentile":"50"},{"venue":"WADS","id":"3d28169f7c1524cf87c9215b61d536939ae5841a","venue_1":"WADS","year":"2009","title":"Succinct Orthogonal Range Search Structures on a Grid with Applications to Text Indexing","authors":"Prosenjit Bose, Meng He, Anil Maheshwari, Pat Morin","author_ids":"1699222, 1724986, 1720050, 1717195","abstract":"We present a succinct representation of a set of n points on an n × n grid using n lg n + o(n lg n) bits 3 to support orthogonal range counting in O(lg n/ lg lg n) time, and range reporting in O(k lg n/ lg lg n) time, where k is the size of the output. This achieves an improvement on query time by a factor of lg lg n upon the previous result of Mäkinen and Navarro [1], while using essentially the information-theoretic minimum space. Our data structure not only can be used as a key component in solutions to the general orthogonal range search problem to save storage cost, but also has applications in text indexing. In particular, we apply it to improve two previous space-efficient text indexes that support sub-string search [2] and position-restricted substring search [1]. We also use it to extend previous results on succinct representations of sequences of small integers, and to design succinct data structures supporting certain types of orthogonal range query in the plane.","cites":"28","conferencePercentile":"93.33333333"},{"venue":"WADS","id":"372d6d8687c8d172351b876b629a8c77f5f3fa13","venue_1":"WADS","year":"2001","title":"I/O-Efficient Shortest Path Queries in Geometric Spanners","authors":"Anil Maheshwari, Michiel H. M. Smid, Norbert Zeh","author_ids":"1720050, 1721884, 1728566","abstract":"We present I/O-efficient algorithms to construct planar Steiner spanners for point sets and sets of polygonal obstacles in the plane, and for constructing the \" dumbbell \" spanner of [6] for point sets in higher dimensions. As important ingredients to our algorithms, we present I/O-efficient algorithms to color the vertices of a graph of bounded degree, answer binary search queries on topol-ogy buffer trees, and preprocess a rooted tree for answering prioritized ancestor queries.","cites":"0","conferencePercentile":"5.882352941"},{"venue":"WADS","id":"2382a6b08557dcb89d69760426f09d0f749da669","venue_1":"WADS","year":"2001","title":"Optimal Möbius Transformations for Information Visualization and Meshing","authors":"Marshall W. Bern, David Eppstein","author_ids":"1693008, 1719358","abstract":"We give linear-time quasiconvex programming algorithms for finding a Möbius transformation of a set of spheres in a unit ball or on the surface of a unit sphere that maximizes the minimum size of a transformed sphere. We can also use similar methods to maximize the minimum distance among a set of pairs of input points. We apply these results to vertex separation and symmetry display in spherical graph drawing, viewpoint selection in hyperbolic browsing, element size control in conformal structured mesh generation, and brain flat mapping.","cites":"24","conferencePercentile":"76.47058824"}]}