{"WAIHCWS.csv":[{"venue":"WAIHCWS","id":"75cf7c82c811a7226ee60fe78b170c9b0f333646","venue_1":"WAIHCWS","year":"2013","title":"Do Facebook às Ruas - Comunidades em Interação","authors":"Lua Marcelo Muriana, Cristiano Maciel, Ana Cristina Bicharra Garcia","author_ids":"2833957, 1804160, 1715457","abstract":"In June 2013, Brazil witnessed several manifestations different from anything previously seen, since president Collor's impeachment. However, there is a big difference: now they are organized in few days. With Facebook, physical and virtual communities spread fast and easily organize demonstations. Popular mobilization for mutual concern issues, supported by technology, allowed the gathering of information by collective intelligence. The fanpage of the demonstration and that of the demonstration events in Facebook are studied in this paper, in order to analyze the interaction among users and to identify if this social networking can be considered a virtual community. RESUMO Em junho de 2013, o Brasil assistiu a uma série de manifestações que não se viam desde o impeachment do presidente Collor, com a diferença que as de hoje são organizadas em poucos dias. Com o uso da ferramenta Facebook, ficou simples e rápido para as comunidades físicas e virtuais divulgarem e organizarem os manifestos. A mobilização dessas pessoas em prol de assuntos de interesse comum, facultada pela tecnologia, permitiu-lhes arregimentar informações à inteligência coletiva. Serão objeto de apreciação neste estudo, que propõe-se a analisar a interação entre os usuários, bem como identificar se essa rede de relacionamento pode se comportar como uma Comunidade Virtual, as páginas de eventos de manifestações e fan pages. Copyright © by the paper's authors. Copying permitted only for private and academic purposes.","cites":"2","conferencePercentile":"100"},{"venue":"WAIHCWS","id":"cfa0d841bca38dd48b43090618cdef6e24741d7b","venue_1":"WAIHCWS","year":"2013","title":"An Ontology-Based Tool for Collaborative and Social Sensemaking","authors":"Ana Cristina Bicharra Garcia, Fernando Bicharra Pinto, Nayat Sánchez Pi","author_ids":"1715457, 1759016, 2134095","abstract":"Sensemaking activities of social networks involve network exploration and representation so, visual tools are designed to support these two activities. Existing social network analysis tools are usually weak in supporting complex analytical tasks and also in providing a collaborative environment for interaction. The analysis of data using a visual tool is rarely a task done in isolation, it tends to be part of a wider goal: that of making sense of the current situation, often to support decision-making. This paper discusses the storytelling design of a software environment to support organizations in sense-making activities and to support accidents investigation. A case study ACR-C describes petroleum industry employees investigating the root cause of an accident issue observed in one (or more) platforms. It is used throughout the paper as an example of human computer interaction where the ontology becomes a tool with domain knowledge to assist expert persons building a root cause tree leading to accidents. The framework will also provide with a col-laborative recommendation module assuming that the users build up clusters based on their similar analysis in rating of items. A case study ACR-C describes petroleum industry employees investigating the root cause of an accident issue observed in one (or more) platforms. It is used throughout the paper as an example of human computer interaction where the ontology becomes a tool with domain knowledge to assist expert persons buildind a root cause tree leading to accidents. This paper reports the experience gained in ACR-C, a project that aims to support knowledge management (KM), sharing and reuse across different media in oil & gas industry. We report the storytelling design approach adopted and the design phases that led to the first prototype. A user interface was designed to assess how different levels of data, information and knowledge were mapped using alternative visual tools. The results show that a clear separation of the visual data analysis from other sense-making subtasks Copyright by the paper's authors. Copying permitted only for private and academic purposes. helps users in focussing their attention and comprehension of root causes of the problem. Further work is needed to develop more fully intuitive visualizations that exploit the richer information and make the multiple connections between data more easily accessible.","cites":"0","conferencePercentile":"42.85714286"},{"venue":"WAIHCWS","id":"b29920f9c3c20955c85d509542559f021fa0ca0c","venue_1":"WAIHCWS","year":"2016","title":"A kitchen, the Twitter and my friends: having a coffee with ICT","authors":"Júnia Coutinho Anacleto Silva, André O. Bueno, Vinicius Ferreira","author_ids":"1682317, 1943477, 2928004","abstract":"As Information and Communication Technologies (ICTs) permeate people's interactions, designers face the challenge of creating new forms to promote contact among unrelated individuals and fostering the communication and potential support to leverage the sense of community in public spaces. This work is related to Urban Computing, studying the correlation among people, urban spaces and technologies. Our research is about observing and understanding the impact of ICT social support in a physical and social context. We developed an interactive application aiming at leveraging socialization in a public space inside a University Campus. Using an in-the-wild approach, our system brings some evidences showing to be efficient in supporting ways for people to socialize in situ and remotely.","cites":"0","conferencePercentile":"55"}]}