{"Wands_10.csv":[{"venue":"Wands '10","id":"a3ad3b859c630b1153276dda4439f3cc835afd54","venue_1":"Wands '10","year":"2010","title":"A multi-dimensional classification model for scientific workflow characteristics","authors":"Lavanya Ramakrishnan, Beth Plale","author_ids":"1792683, 1809305","abstract":"Workflows have been used to model repeatable tasks or operations in manufacturing, business process, and software. In recent years, workflows are increasingly used for orchestration of science discovery tasks that use distributed resources and web services environments through resource models such as grid and cloud computing. Workflows have disparate requirements and constraints that affects how they might be managed in distributed environments. In this paper, we present a multi-dimensional classification model illustrated by workflow examples obtained through a survey of scientists from different domains including bioinformatics and biomedical, weather and ocean modeling, astronomy detailing their data and computational requirements. The survey results and classification model contribute to the high level understanding of scientific workflows.","cites":"10","conferencePercentile":"71.42857143"},{"venue":"Wands '10","id":"2c5944196f6e6446a8753cbf45b444517b3722b3","venue_1":"Wands '10","year":"2010","title":"Open workflow infrastructure: a research agenda","authors":"Vlado Stankovski, Paolo Missier, Carole Goble, Ian Taylor","author_ids":"7546133, 1755645, 1701008, 4416638","abstract":"While current Distributed Computation Platforms (DCPs) provide environments for composition and enactment of distributed applications, a comprehensive methodology and tool that facilitates open, generic and rapid development, sharing and utilization of distributed applications represented through the workflow methodology, is still missing. The goal is to incorporate workflow editing, sharing and enactment capabilities directly into the Internet, thus making distributed applications available and usable in a wide range of pervasive settings. In this position paper, we outline a research agenda to build such an infrastructure with a flexible design to work on an Internet-wide scale. Research and technology development activities are intended to address the following end-user needs: (1) abstracting individual DCPs so that end-users can use common interfaces, (2) allowing rapid customization of the distributed process, (3) sharing processes, lessons and features from distributed applications across the community and (4) incorporating security and provenance framework.","cites":"1","conferencePercentile":"28.57142857"},{"venue":"Wands '10","id":"f3770bab7baff199e648540553e1a755930eae89","venue_1":"Wands '10","year":"2010","title":"Exploring repositories of scientific workflows","authors":"Julia Stoyanovich, Ben Taskar, Susan Davidson","author_ids":"1682824, 1685978, 5762189","abstract":"Scientific workflows are gaining popularity, and repositories of workflows are starting to emerge. In this paper we present some initial experiences of information discovery in repositories of scientific workflows. In the first part of the paper we consider a collection of <i>VisTrails</i> workflows, and explore how this collection may be summarized when workflow modules are used as features. We present a hierarchical browsable view of the repository in which categories are derived using frequent itemset mining or latent Dirichlet allocation. We demonstrate that both approaches may be used for effective data exploration. In the second part of the paper we focus on a collection of <i>Taverna</i> workflows from <i>myExperiment.org</i>, and consider how these workflows may be browsed using <i>modules</i> and <i>tags</i> as features. Finally, we outline some interesting challenges and describe conditions under which these techniques work well for repositories of scientific workflows, and conditions under which additional work is needed for effective data exploration.","cites":"11","conferencePercentile":"85.71428571"}]}