{"WAOA.csv":[{"venue":"WAOA","id":"9f00d2b70a239412ef2f9923b51cc61cbbb9cd7d","venue_1":"WAOA","year":"2010","title":"Densest k-Subgraph Approximation on Intersection Graphs","authors":"Danny Ziyi Chen, Rudolf Fleischer, Jian Li","author_ids":"1743881, 1721205, 1701502","abstract":"We study approximation solutions for the densest k-subgraph problem (DS-k) on several classes of intersection graphs. We adopt the concept of σ-quasi elimination orders, introduced by Akcoglu et al. [?], generalizing the perfect elimination orders for chordal graphs, and develop a simple O(σ)-approximation technique for graphs admitting such a vertex order. This concept allows us to derive constant factor approximation algorithms for DS-k on many intersection graph classes, such as chordal graphs, circular-arc graphs, claw-free graphs, line graphs of-hypergraphs, disk graphs, and the intersection graphs of fat geometric objects. We also present a polynomial time approximation scheme for the DS-k problem on unit disk graphs using the shifting technique.","cites":"7","conferencePercentile":"79.16666667"},{"venue":"WAOA","id":"833c558305f543834f45156496f24acb35276927","venue_1":"WAOA","year":"2007","title":"Geometric Spanners With Small Chromatic Number","authors":"Prosenjit Bose, Paz Carmi, Mathieu Couture, Anil Maheshwari, Michiel H. M. Smid, Norbert Zeh","author_ids":"1699222, 1738236, 1743150, 1720050, 1721884, 1728566","abstract":"Given an integer k ≥ 2, we consider the problem of computing the smallest real number t(k) such that for each set P of points in the plane, there exists a t(k)-spanner for P that has chromatic number at most k. We prove that t(2) = 3, t(3) = 2, t(4) = √ 2, and give upper and lower bounds on t(k) for k > 4. We also show that for any > 0, there exists a (1 +)t(k)-spanner for P that has O(|P |) edges and chromatic number at most k. Finally, we consider an on-line variant of the problem where the points of P are given one after another, and the color of a point must be assigned at the moment the point is given. In this setting, we prove that t(2) = 3, t(3) = 1 + √ 3, t(4) = 1 + √ 2, and give upper and lower bounds on t(k) for k > 4.","cites":"3","conferencePercentile":"37.5"},{"venue":"WAOA","id":"9864cf8e3ec6dd5a7ace5f03c7c1c77d7763e521","venue_1":"WAOA","year":"2010","title":"New Models and Algorithms for Throughput Maximization in Broadcast Scheduling - (Extended Abstract)","authors":"Chandra Chekuri, Avigdor Gal, Sungjin Im, Samir Khuller, Jian Li, Richard Matthew McCutchen, Benjamin Moseley, Louiqa Raschid","author_ids":"1733122, 1782519, 2214510, 1737147, 1701502, 3218665, 1867769, 1733877","abstract":"In this paper we consider some basic scheduling questions motivated by query processing that involve accessing resources (such as sensors) to gather data. Clients issue requests for data from resources and the data may be dynamic or changing which imposes temporal constraints on the delivery of the data. A proxy server has to compute a probing schedule for the resources since it can probe a limited number of resources at each time step. Due to overlapping client requests, multiple queries can be answered by probing the resource at a certain time. This leads to problems related to some well-studied broadcast scheduling problems. However, the specific requirements of the applications motivate some generalizations and variants of previously studied metrics for broadcast scheduling. We consider both online and offline versions of these problems and provide new algorithms and results.","cites":"7","conferencePercentile":"79.16666667"},{"venue":"WAOA","id":"54462ac4441830e6528cea13f450b7611c1dfc3d","venue_1":"WAOA","year":"2010","title":"A 3/2-Approximation Algorithm for Rate-Monotonic Multiprocessor Scheduling of Implicit-Deadline Tasks","authors":"Andreas Karrenbauer, Thomas Rothvoß","author_ids":"2864176, 1702257","abstract":"We present a new approximation algorithm for rate-monotonic multi-processor scheduling of periodic tasks with implicit deadlines. We prove that for an arbitrary parameter k E N it yields solutions with at most (~ + t)OPT + 9k many processors, thus it gives an asymptotic 3/2-approximation algorithm. This improves over the previously best known ratio of 7/4. Our algorithm can be implemented to run in time O(n 2), where n is the number of tasks. It is based on custom-tailored weights for the tasks such that a greedy maximal matching and subsequent partitioning by a first-fil strategy yields the result.","cites":"4","conferencePercentile":"66.66666667"}]}