{"WAPCV.csv":[{"venue":"WAPCV","id":"1efcfe61de627270c0e94ba07136096b1b667daf","venue_1":"WAPCV","year":"2008","title":"Integrating Visual Context and Object Detection within a Probabilistic Framework","authors":"Roland Perko, Christian Wojek, Bernt Schiele, Ales Leonardis","author_ids":"2386156, 2340109, 1697100, 1732672","abstract":"Visual context provides cues about an object's presence, position and size within an observed scene, which are used to increase the performance of object detection techniques. However, state-of-the-art methods for context aware object detection could decrease the initial performance. We discuss the reasons for failure and propose a concept that overcomes these limitations, by introducing a novel technique for integrating visual context and object detection. Therefore, we apply the prior probability function of an object detector, that maps the detector's output to probabilities. Together, with an appropriate contextual weight-ing, a probabilistic framework is established. In addition, we present an extension to state-of-the-art methods to learn scale-dependent visual context information and show how this increases the initial performance. The standard methods and our proposed extensions are compared on a novel, demanding image data set. Results show that visual context facilitates object detection methods.","cites":"4","conferencePercentile":"45.45454545"},{"venue":"WAPCV","id":"d0631d114df6e9655f07e1a53803b87fbd5ecff5","venue_1":"WAPCV","year":"2008","title":"Spatiotemporal Saliency: Towards a Hierarchical Representation of Visual Saliency","authors":"Neil D. B. Bruce, John K. Tsotsos","author_ids":"2866780, 1727853","abstract":"In prior work, we put forth a model of visual saliency motivated by information theoretic considerations [1]. In this effort we consider how this proposal extends to explain saliency in the spatiotemporal domain and further, propose a distributed representation for visual saliency comprised of localized hierarchical saliency computation. Evidence for the efficacy of the proposal in capturing aspects of human behavior is achieved via comparison with eye tracking data and a discussion of the role of neu-ral coding in the determination of saliency suggests avenues for future research.","cites":"8","conferencePercentile":"63.63636364"},{"venue":"WAPCV","id":"b48fbdab96ff93dfb56d048f09e3a7eaa84b941d","venue_1":"WAPCV","year":"2004","title":"Distributed Control of Attention","authors":"Ola Ramström, Henrik I. Christensen","author_ids":"3062729, 1723059","abstract":"Detection of objects is in general a computationally demanding task. To simplify the problem it is of interest to focus the attention to a set of regions of interest. Indoor environments often have large homogeneous textured objects, such as walls and furniture. In this paper we present a model which detects large homogeneous regions and uses this information to search for targets that are smaller in size. Homogeneity is detected by a number of different de-scriptors and a coalition technique is used to achieve robustness. Expectations about size allow for constraint object search. The presented model is evaluated in the context of a table top scenario.","cites":"1","conferencePercentile":"18.18181818"},{"venue":"WAPCV","id":"8345a92d05ec6a2e9e6badf1d236c072e6057fdf","venue_1":"WAPCV","year":"2007","title":"An Information Theoretic Model of Saliency and Visual Search","authors":"Neil D. B. Bruce, John K. Tsotsos","author_ids":"2866780, 1727853","abstract":"In this paper, a proposal which quantifies visual saliency based on an information theoretic definition is evaluated with respect to visual psychophysics paradigms. Analysis reveals that the proposal explains a broad range of results from classic visual search tasks, including many for which only specialized models have had success. As a whole, the results provide strong behavioral support for a model of visual saliency based on information, supplementing earlier work revealing the efficacy of the approach in predicting primate fixation data.","cites":"3","conferencePercentile":"36.11111111"},{"venue":"WAPCV","id":"9c80e353fd39097db387f1348a2ad5484cf74799","venue_1":"WAPCV","year":"2007","title":"Simultaneous Robot Localization and Mapping Based on a Visual Attention System","authors":"Simone Frintrop, Patric Jensfelt, Henrik I. Christensen","author_ids":"1800953, 1770066, 1723059","abstract":"Visual attention regions are useful for many applications in the field of computer vision and robotics. Here, we introduce an application to simultaneous robot localization and mapping. A biologically motivated attention system finds regions of interest which serve as visual landmarks for the robot. The regions are tracked and matched over consecutive frames to build stable landmarks and to estimate the 3D position of the landmarks in the environment. Matching of current landmarks to database entries enables loop closing and global localization. Additionally, the system is equipped with an active camera control, which supports the system with a tracking, a re-detection, and an exploration behaviour. We present experiments which show the applicability of the system in a real-world scenario. A comparison between the system operating in active and in passive mode shows the advantage of active camera control: we achieve a better distribution of landmarks as well as a faster and more reliable loop closing.","cites":"8","conferencePercentile":"77.77777778"},{"venue":"WAPCV","id":"db6caffab31dbf77a48d69613b0e6ae8d49c1279","venue_1":"WAPCV","year":"2004","title":"Fast Detection of Frequent Change in Focus of Human Attention","authors":"Nan Hu, Weimin Huang, Surendra Ranganath","author_ids":"2836784, 1742173, 1723244","abstract":"We present an algorithm to detect the attentive behavior of persons with frequent change in focus of attention (FCFA) from a static video camera. This behavior can be easily perceived by people as temporal changes of human head pose. Here, we propose to use features extracted by analyzing a similarity matrix of head pose by using a self-similarity measure of the head image sequence. Further, we present a fast algorithm which uses an image vector sequence represented in the principal components subspace instead of the original image sequence to measure the self-similarity. An important feature of the behavior of FCFA is its cyclic pattern where the head pose repeats its position from time to time. A frequency analysis scheme is proposed to find the dynamic characteristics of persons with frequent change of attention or focused attention. A nonparametric classifier is used to classify these two kinds of behaviors (FCFA and focused attention). The fast algorithm discussed in this paper yields real-time performance as well as good accuracy.","cites":"2","conferencePercentile":"36.36363636"}]}