{"WASA.csv":[{"venue":"WASA","id":"bb63396bd4684ab8e5b8dcbb1d581a6b6023dcd7","venue_1":"WASA","year":"2010","title":"Arbitrary Obstacles Constrained Full Coverage in Wireless Sensor Networks","authors":"Haisheng Tan, Yuexuan Wang, Xiaohong Hao, Qiang-Sheng Hua, Francis Chi-Moon Lau","author_ids":"2606216, 7708260, 8480982, 1740533, 1708000","abstract":"Coverage is critical for wireless sensor networks to monitor a region of interest and to provide a good quality of service. In most cases we need to achieve full coverage which means every point inside the region (excluding the obstacles) must be covered by at least one sensor. The problem of placing the minimum number of sensors to achieve full coverage for a region with obstacles is NP-hard. Most existing coverage methods, such as contour-based ones, simply place sensors along the boundaries to cover the holes near obstacles and the region boundary. These methods are inefficient especially when obstacles or the region become irregular. In this paper, based on computational geometry, we design a full coverage method, which accurately finds the uncovered holes and places sensors efficiently for both the regular and irregular obstacles and regions. Specifically, we show that the more irregular of the obstacles and the region, the more sensors our method saves.","cites":"6","conferencePercentile":"95.83333333"},{"venue":"WASA","id":"149232a6045b6a250fa38d2b35c1274bc3f772ad","venue_1":"WASA","year":"2012","title":"Attention-based addressee selection for service and social robots to interact with multiple persons","authors":"Liyuan Li, Qianli Xu, Yeow Kee Tan","author_ids":"1746918, 1786343, 3234735","abstract":"For robots to perform interaction with multiple persons, they have to be able to identify the addressees to interact with. We classify the methods of addressee detection and selection into two categories, namely, passive and active approaches. For passive approaches, the robot is programmed to detect a predefined signal, e.g., a voice command or a specific gesture, from a person who is supposed to be the addressee. In contrast, for active approaches, the robot is able to select a person as an addressee based on subtle cues that are inferred from the human pose, gaze, and facial expression. We present two new approaches for attention-based addressee selection, one is a passive method and the other is an active method. The passive method is designed for the robot to recognize common hand-waving gesture, where a Bayessian ensemble approach is proposed to fuse hand detections from depth segmentation, palm shape, skin color, and body pose. The active method is developed for the robot to perform natural interaction with multiple persons. It employs a novel human attention estimation algorithm based on human detection, tracking, upper body pose recogni-tion, face detection, gaze detection, lip motion analysis, and facial expression recognition. Extensive experiments have been conducted and the effectiveness of the proposed approaches is reported.","cites":"4","conferencePercentile":"89.58333333"},{"venue":"WASA","id":"f8a0cbe576fb9919995e06f32e86dcc5fe52ab94","venue_1":"WASA","year":"2013","title":"Neighbor Discovery Algorithm Based on the Regulation of Duty-Cycle in Mobile Sensor Network","authors":"Jinbao Li, Jian Yang, Yanqing Zhang, Longjiang Guo, Yingshu Li","author_ids":"2608608, 1704854, 1688104, 2864314, 1733432","abstract":"The Neighbor Discovery is a process by which a node identifies its neighbor nodes in its vicinity. We are particular interested in Neighbor Discovery problem in duty-cycle mobile sensor networks in this paper, where a mobile sensor needs to detect its neighbor nodes during its wake-up states. We proposed an algorithm which utilizes the boundary nodes in the communication range of the node to predict potential neighbor nodes, applies passion point process to predict the number of nodes in communication range of the node, regulates the duty-cycle of the node based on the model of balls and boxes, and then schedules the waking time of the node periodically by using the duty-cycle which is regulated to finish the detection. Finally, theoretical analysis and simulation experiments indicate that the proposed algorithm can discover more neighbor nodes in the short period with less energy.","cites":"0","conferencePercentile":"30"},{"venue":"WASA","id":"94e1874e49cde7947b090e3a4077ddf796886ede","venue_1":"WASA","year":"2009","title":"Design and Implementation of Davis Social Links OSN Kernel","authors":"Thomas Tran, Kelcey Chan, Shaozhi Ye, Prantik Bhattacharyya, Ankush Garg, Xiaoming Lu, Shyhtsun Felix Wu","author_ids":"6632937, 2455808, 1807004, 3259531, 2499663, 4382587, 1718534","abstract":"Social network popularity continues to rise as they broaden out to more users. Hidden away within these social networks is a valuable set of data that outlines everyone's relationships. Networks have created APIs such as the Facebook Development Platform and OpenSocial that allow developers to create applications that can leverage user information. However, at the current stage, the social network support for these new applications is fairly limited in its functionality. Most, if not all, of the existing internet applications such as email, BitTorrent, and Skype cannot benefit from the valuable social network among their own users. In this paper, we present an architecture that couples two different communication layers together: the end2end communication layer and the social context layer, under the Davis Social Links (DSL) project. Our proposed architecture attempts to preserve the original application semantics (i.e., we can use Thunderbird or Outlook, unmodified, to read our SMTP emails) and provides the communicating parties (email sender and receivers) a social context for control and management. For instance, the receiver can set trust policy rules based on the social context between the pair, to determine how a particular email in question should be prioritized for delivery to the SMTP layer. Furthermore, as our architecture includes two coupling layers, it is then possible, as an option, to shift some of the services from the original applications into the social context layer. In the context of email, for example, our architecture allows users to choose operations, such as reply, reply-all, and forward, to be realized in either the application layer or the social network layer. And, the realization of these operations under the social network layer offers powerful features unavailable in the original applications. To validate our coupling architecture, we have implemented a DSL kernel prototype as a Facebook application called CyrusDSL (currently about 40 local users) and a simple communication application combined into the DSL kernel but is unaware of Facebook's API.","cites":"2","conferencePercentile":"40"},{"venue":"WASA","id":"75ff793823c8eaaf29da5bb1ff21d02fba665a70","venue_1":"WASA","year":"2012","title":"Throughput and Delay with Network Coding in Hybrid Mobile Ad Hoc Networks: A Global Perspective","authors":"Jian Li, Luoyi Fu, Xinbing Wang, Changliang Xie, Xiaohua Tian, Yongsheng Zhang, Xiaoli Wang","author_ids":"1701502, 1922573, 1715597, 1990131, 2394645, 5188809, 5372038","abstract":"—In this paper, we study throughput and delay scaling laws of wireless network with network coding under different mobility models. Specifically, we consider 2-hop and multi-hop schemes with n nodes and k original packets for each pair of source-destination. We study two ad hoc network mobility models-hybrid random walk models(HRWM) and discrete random direction models(DRDM). For the hybrid random walk models, we divide the unit square into n 2β cells with an area of 1/n 2β , where 0 ≤ β ≤ 1/2, each cell is further divided into n 1−2β subcells. For the discrete random direction models, the unit square is divided into n 2α cells with an area of 1/n 2α , where 0 ≤ α ≤ 1/2. At the beginning of each time slot, every node moves from its current cell to the adjacent cell. We find that (1) under 2-hop relay scheme with network coding, there is a log n gain on delay only when the mobility model is random walk model; (2) under multi-hop relay scheme, there is a turning point and a critical turning point for delay in these two models. For hybrid random walk models, we take k = Θ(n β), and obtain that the delay is halved by the turning point β = 1/4. Compared to the network without network coding, our results show that there is a critical turning point β = 1/5, which means when 0 ≤ β < 1/5, the delay will be better without network coding for the network, and when 1/5 ≤ β ≤ 1/2, network coding helps decrease the delay. The same results also hold in discrete random direction models. At last, we propose the network model with network coding and infrastructure mode together. And in this mode, we obtain the results of throughput and delay.","cites":"0","conferencePercentile":"21.875"},{"venue":"WASA","id":"11ff38f70ea6a91255d9f98038c8a047356158aa","venue_1":"WASA","year":"2009","title":"Minimum-Latency Schedulings for Group Communications in Multi-channel Multihop Wireless Networks","authors":"Peng-Jun Wan, Zhu Wang, Zhiyuan Wan, Scott C.-H. Huang, Hai Liu","author_ids":"1787340, 5476567, 1826660, 1792957, 5011586","abstract":"This paper is motivated by exploring the impact of the number of channels on the achievable communication latency for a specific communication task. We focus on how to utilize the multiple channels to speed up four group communications including broadcast, aggregation, gathering, and gossiping in wireless networks under protocol interference model. Four scheduling algorithms are developed for these four group communications. We derive explicit tight bounds on the latencies of the four communication schedules produced by these algorithms. These la-tency bounds in general decrease with the number of channels and are also within constant factors of the respective minimum.","cites":"5","conferencePercentile":"74"},{"venue":"WASA","id":"49d241bf7f3463addd2c64410c2aeb3ae71b8c34","venue_1":"WASA","year":"2012","title":"Towards an expression recognition game to assist the emotional development of children with autism spectrum disorders","authors":"Natalie Harrold, Chek Tien Tan, Daniel Rosser","author_ids":"1854806, 2840881, 2823535","abstract":"The purpose of the proposed project is to create an expression recognition game to encourage positive emotional development of children with autism spectrum disorders (ASDs). Video games are emerging as forms of computer-aided interventions for the treatment of autism, however many do not monitor the progression of the child within the game. By learning from existing approaches in ASD games and consolidating guidelines for designing user interfaces for children with autism, this project aims to create a fun and engaging game for children with ASDs that makes use of a touch device camera as a way of classifying facial expressions in order to improve the children's emotional understanding.","cites":"3","conferencePercentile":"79.16666667"},{"venue":"WASA","id":"51c98ca992ee0e03be8349443877919dacd357b3","venue_1":"WASA","year":"2013","title":"An Auction Mechanism for Resource Allocation in Mobile Cloud Computing Systems","authors":"Yang Zhang, Dusit Niyato, Ping Wang","author_ids":"4449904, 1713586, 1689500","abstract":"A mobile cloud computing system is composed of heterogeneous services and resources to be allocated by the cloud service provider to mobile cloud users. On one hand, some of these resources are substi-tutable (e.g., users can use storage from different places) that they have similar functions to the users. On the other hand, some resources are complementary that the user will need them as a bundle (e.g., users need both wireless connection and storage for online photo posting). In this paper, we first model the resource allocation process of a mobile cloud computing system as an auction mechanism with premium and discount factors. The premium and discount factors indicate complementary and substitutable relations among cloud resources provided by the service provider. Then, we analyze the individual rationality and incentive compatibility (truthfulness) properties of the users in the proposed auction mechanism. The optimal solutions of the resource allocation and cost charging schemes in the auction mechanism is discussed afterwards.","cites":"5","conferencePercentile":"100"},{"venue":"WASA","id":"906a427558f590438796fdd1a9afc293d11d564e","venue_1":"WASA","year":"2013","title":"Compressive Data Retrieval with Tunable Accuracy in Vehicular Sensor Networks","authors":"Ruobing Jiang, Yanmin Zhu, Hongjian Wang, Min Gao, Lionel M. Ni","author_ids":"1761182, 1743564, 1699074, 3991973, 1726587","abstract":"On-demand data retrieval is a crucial routine operation in a vehicular sensor network. However, on-demand data retrieval in a vehicular environment is particularly challenging because of frequent network disruption, large number of data readings and limited transmission opportunities. Real world vehicular datasets usually contain a lot of data redundancy. Motivated by this important observation, we propose an approach called CDR with compressive sensing for on-demand data retrieval in the highly dynamic vehicular environment. The distinctive feature of CDR is that it supports tunable accuracy of data collection. There are two major challenges for the design of CDR. First, the sparsity level of the vehicular dataset is typically unknown beforehand. Second, it is even worse that the sparsity level of the dataset is changing over time. To combat the challenge posed by time-varying data sparsity, CDR can terminate from further collection of measurements, based on an adap-tive condition on which only localized measurements and computation are needed. Extensive simulations with real datasets and real vehicular GPS traces show that our approach achieves good performance of data retrieval with user-customized accuracy.","cites":"1","conferencePercentile":"65"},{"venue":"WASA","id":"6df57585fc566fe231cac8b3586da27db15fea01","venue_1":"WASA","year":"2012","title":"A Nonparametric Bayesian Approach for Opportunistic Data Transfer in Cellular Networks","authors":"Nam Tuan Nguyen, Yichuan Wang, Xin Liu, Rong Zheng, Zhu Han","author_ids":"2280305, 2287632, 1749705, 3647337, 1708590","abstract":"The number of mobile Internet users is growing rapidly, as well as the capability of mobile Internet devices. As a result, the enormous amount of traffic generated everyday on mobile Internet is pushing cellular services to their limits. We see great potential in the idea of scheduling the transmission of delay tolerant data towards times when the network condition is better. However, such scheduling requires good network condition prediction, which has not been effectively tackled in previous research. In this paper, we propose a Dynamic Hidden Markov Model (DHMM) to model the time dependent and location dependent network conditions observed by individual users. The model is dynamic since transition matrix and states are updated when new observations are available. On the other hand, it has all the properties of a Hidden Markov Model. DHMM can predict precisely the next state given the current state, hence can provide a good prediction of network condition. DHMM has two layers, the top layer is Received Signal Strength (RSS) and the bottom layer consists of states, defined as a mixture of location, time and the signal strength itself. Since the state is defined as a mixture , it is hidden and the number of states is also not known a priori. Thus, the Nonparametric Bayesian Classification is applied to determine the hidden states. We show through simulations that when combined with a Markov decision process, the opportunistic scheduling can reduce transmission costs up to 50.34% compared with a naive approach.","cites":"2","conferencePercentile":"67.70833333"},{"venue":"WASA","id":"a9f02d6e0e2e1a78a1e8fcbf3d8b098b5fb96de1","venue_1":"WASA","year":"2012","title":"Forced Spectrum Access Termination Probability Analysis under Restricted Channel Handoff","authors":"MohammadJavad NoroozOliaee, Bechir Hamdaoui, Taieb Znati, Mohsen Guizani","author_ids":"1681443, 1715173, 1711470, 1731676","abstract":"Most existing works on cognitive radio networks assume that cognitive (or secondary) users are capable of switching/jumping to any available channel, regardless of the frequency gap between the target and the current channels. Due to hardware limitations, cognitive users can actually jump only so far from where the operating frequency of their current channel is, given an acceptable switching delay that users are typically constrained by. This paper studies the performance of cognitive radio networks with dynamic multichannel access capability, but while considering realistic channel handoff assumptions, where cognitive users can only move/jump to their immediate neighboring channels. Specifically, we consider a cognitive access network with m channels in which a cognitive user, currently using a particular channel, can only switch to one of its k immediate neighboring channels. This set of 2k channels is referred to as the target handoff channel set. We first model this cognitive access network with restricted channel handoff as a continuous-time Markov process, and then analytically derive the forced termination probability of cognitive users. Finally, we validate and analyze our derived results via simulations. Our obtained results show that the forced access termination probability of cognitive users decreases significantly as the number k increases.","cites":"1","conferencePercentile":"52.08333333"},{"venue":"WASA","id":"23e91264fa4c544c80ce7b8cc76e3ebb491526eb","venue_1":"WASA","year":"2011","title":"Enhancing Macrocell Downlink Performance through Femtocell User Cooperation","authors":"Adem M. Zaid, Bechir Hamdaoui, Taieb Znati, Xiuzhen Cheng","author_ids":"2888258, 1715173, 1711470, 1749642","abstract":"This paper studies cooperative techniques that rely on femtocell user diversity to improve the down-link communication quality of macrocell users. We analytically analyze and evaluate the achievable performance of these techniques in the downlink of Rayleigh fading channels. We provide an approximation of both the bit-error rate (BER) and the data throughput that macrocell users receive with and without femtocell user cooperation. Using simulations, we show that under reasonable SNR values, cooperative schemes improve both the BER and the data throughput of macrocell users significantly when compared with the traditional, non-cooperative scheme.","cites":"1","conferencePercentile":"42.85714286"},{"venue":"WASA","id":"0b1eff10066604e4ba6b7393c123512378942ad5","venue_1":"WASA","year":"2012","title":"Bloom Filter-Based Ad Hoc Multicast Communication in Cyber-Physical Systems and Computational Materials","authors":"Homa Hosseinmardi, Nikolaus Correll, Richard Han","author_ids":"2378569, 2886493, 1719013","abstract":"This article presents an efficient ad hoc multicast communication protocol for next-generation cyber-physical systems and computational materials. Communication with such systems would be gestural, and when cells within such materials detect a motion, they would share that information with each other. We want to achieve efficient communication among only the group of nodes that sense a particular (gestural) event. Our approach is to employ a Bloom filter-based approach to label the multicast group with an approximate error-resilient multicast tag that captures the temporal and spatial characteristics of the sensor group. A Bloom filter is a space-efficient probabilistic data structure that is used to test whether an element is a member of a set. We describe our Bloom filter-based multicast communication (BMC) protocol, and report simulation results. 1 Introduction This paper explores the issue of establishing efficient multicast communication amongst an ad hoc group of cells or nodes that comprise next-generation cyber-physical systems and/or computational materials. We envision that future cyber-physical systems may resemble a computational wall, or amorphous computing façade, as shown in Fig. 1. Such a system would be comprised of many individual cells that sense the environment and communicate with each other. For example, in the case of an amorphous computing façade, the individual nodes may contain pressure , light, infrared and perhaps even simple vision sensors, and actuators that can change the translucency of each cell in the wall to admit more/less light, and/or \" open/close \" the cell to admit/shut off outside air flow. We further imagine that communicating with such cyber-physical systems will be gestural in nature, i.e. opening a window or set of cells would be done by making one gesture such as drawing an \" O \" shape in mid-air or on the wall that is recognized by the wall, while making another gesture would close the window or set of cells, such as drawing a \" C \" shape. The sensors on the cells would detect the motion, and those affected cells would share information with each other. They would collectively compute and decide which pattern was detected, and then actuate accordingly. The cells themselves are assumed to have fairly limited computational and communication resources.","cites":"2","conferencePercentile":"67.70833333"},{"venue":"WASA","id":"adfb93c228af4a0d1b343dde98a03de690a108fb","venue_1":"WASA","year":"2009","title":"Traffic-Aware Channel Assignment in Wireless Sensor Networks","authors":"Yafeng Wu, Matthew Keally, Gang Zhou, Weizhen Mao","author_ids":"6395546, 1745920, 1720964, 2147985","abstract":"Existing frequency assignment efforts in wireless sensor network research focus on balancing available physical frequencies among neighboring nodes, without paying attention to the fact that different nodes have different traffic volumes. Ignoring the different traffic requirements in different nodes in frequency assignment design leads to poor MAC performance. Therefore, in this paper, we are motivated to propose traffic-aware frequency assignment, which considers nodes' traffic volumes when making frequency decisions. We incorporate our traffic-aware frequency assignment design into an existing multi-channel MAC, and compare the performance with two conventional frequency assignment schemes. Our performance evaluation demonstrates that traffic-aware channel assignment can greatly improve multi-channel MAC performance. Our traffic-aware assignment scheme greatly enhances the packet delivery ratio and system throughput, while reducing channel access delay and energy consumption.","cites":"12","conferencePercentile":"96"},{"venue":"WASA","id":"b64356706affb9e030e88c32b17e41d1c49208f5","venue_1":"WASA","year":"2010","title":"An Introduction to Bayesian Techniques for Sensor Networks","authors":"Bin Liu","author_ids":"1702756","abstract":"The purpose of this paper is threefold. First, it briefly introduces basic Bayesian techniques with emphasis on present applications in sensor networks. Second, it reviews modern Bayesian simulation methods , thereby providing an introduction to the main building blocks of the advanced Markov chain Monte Carlo and Sequential Monte Carlo methods. Lastly, it discusses new interesting research horizons.","cites":"0","conferencePercentile":"29.16666667"},{"venue":"WASA","id":"d1d4c0da3df1fc23fbf48af0ac13c341eed10538","venue_1":"WASA","year":"2012","title":"Fast Group Communication Scheduling in Duty-Cycled Multihop Wireless Sensor Networks","authors":"XiaoHua Xu, Jiannong Cao, Peng-Jun Wan","author_ids":"1745553, 7468291, 1787340","abstract":"We study group communication scheduling in duty-cycled multi-hop wireless sensor networks. Assume that time is divided into time-slots and we group multiple consecutive time-slots into periods. Each node can transmit data at any time-slot while it only wakes up at its active time-slot of every period and thus be allowed to receive data. Under the protocol interference model, we investigate four group communication patterns, i.e., broadcast, data aggregation, data gathering, and gossiping. For each pattern, we develop a delay efficient scheduling algorithm which greatly improve the current state-of-the-art algorithm. Additionally , we propose a novel and efficient design to coherently couple the wireless interference requirement and duty cycle requirement.","cites":"4","conferencePercentile":"89.58333333"},{"venue":"WASA","id":"945f13647c4f8f702600d82cdd9bdbe341cc3c2b","venue_1":"WASA","year":"2009","title":"Data Collection with Multiple Sinks in Wireless Sensor Networks","authors":"Sixia Chen, Matthew Coolbeth, Hieu Dinh, Yoo-Ah Kim, Bing Wang","author_ids":"1719727, 3101648, 2395971, 2697328, 1718232","abstract":"In this paper, we consider Multiple-Sink Data Collection Problem in wireless sensor networks, where a large amount of data from sensor nodes need to be transmitted to one of multiple sinks. We design an approximation algorithm to minimize the latency of data collection schedule and show that it gives a constant-factor performance guarantee. We also present a heuristic algorithm based on breadth first search for this problem. Using simulation, we evaluate the performance of these two algorithms, and show that the approximation algorithm outperforms the heuristic up to 60%.","cites":"3","conferencePercentile":"50"},{"venue":"WASA","id":"6b260488040c4b6a31e53800215d9ead5d334788","venue_1":"WASA","year":"2010","title":"Energy-Efficient Restricted Greedy Routing for Three Dimensional Random Wireless Networks","authors":"Minsu Huang, Fan Li, Yu Wang","author_ids":"2928631, 1706783, 1687514","abstract":"In this paper, we investigate how to design energy-efficient localized routing in a large-scale three-dimensional (3D) wireless network. Several 3D localized routing protocols were proposed to seek either energy efficiency or delivery guarantee in 3D wireless networks. However, recent results [1, 2] showed that there is no deterministic localized routing algorithm that guarantees either delivery of packets or energy efficiency of its routes in 3D networks. In this paper , we focus on design of a simple localized routing method which can provide energy efficiency with high probability in a randomly deployed 3D network. In particular, we extend our previous routing method designed for 2D networks [3] to 3D networks. The proposed 3D routing method is a simple variation of 3D greedy routing and can guarantee energy efficiency of its paths with high probability in random 3D networks. We also study its asymptotic critical transmission radius to ensure the packet delivery with high probability in random 3D networks. Simulation results confirm our theoretical results.","cites":"2","conferencePercentile":"66.66666667"},{"venue":"WASA","id":"54dfe9dab7078d58ec6a779ef2c71eb38c09cbfe","venue_1":"WASA","year":"2014","title":"Energy Efficient Social-Based Routing for Delay Tolerant Networks","authors":"Chenfei Tian, Fan Li, Libo Jiang, Zeye Wang, Yu Wang","author_ids":"7202462, 1706783, 7921231, 3073497, 1687514","abstract":"Delay Tolerant Network (DTN) is one kind of emerging networks characterized by long delay and intermittent connectivity. Traditional ad hoc routing protocols are inapplicable or perform poorly in DTNs because nodes are seldom fully connected. In recent years, many routing protocols (especially social-based routing) are proposed to improve the delivery ratio in DTNs, but most of them do not consider the load of nodes thus may lead to unbalanced energy consumption among nodes. In this paper, we propose an Energy Efficient Social-based Routing (EESR) protocol to reduce the load of nodes while maintaining the delivery ratio within an acceptable range by limiting the chances of forwarding in traditional social-based routing. Furthermore, we also propose an improved version of EESR to dynamically adjust the controlling parameter. Simulation results on real-life DTN traces demonstrate the efficiency of our proposed algorithms.","cites":"1","conferencePercentile":"90"},{"venue":"WASA","id":"5c9cff1a78ac76456587c1ced38e229a8674c61c","venue_1":"WASA","year":"2012","title":"Older adults' attitudes toward homes service robots","authors":"Jamie Ng, Odelia Yiling Tan, Alvin Hong Yee Wong, Wei Kiat Koh","author_ids":"3125770, 3335212, 1952491, 2543228","abstract":"World population ageing is a global concern, and to Singapore, this is no different. Today, 15 percent of the total population is of age 60 and above. By 2050, Singapore will be the world's 4th largest ageing nation, after Japan, Macao and Korea, with 38% of the population above 60 years of age [United Nations, 2012]. Older adults in Singapore (as in many Asian societies) are traditionally supported by their families. This demographic shift will potentially increase the burden on their families, the working adults and their children. Home service robots are looked upon as potential aids to improve the quality of life of older adults, help them live independently and help relieve the stress of their caregivers. Before any technology can be useful, their potential users must be willing to accept and use them. Vacuum cleaning robot, such as the Roomba, have already been used and accepted in homes in the United States [Enzer, et al. 2009; Forlizzi 2007], and is available commercially in Singapore. However, beyond vacuum cleaning, are users in Singapore, particularly older adults, willing to accept other kinds of interactive home service robots or humanoid robots to assist them in other household tasks? What kind of assistance do they expect from the robot? How should a robot behave or look to warrant their acceptance in their homes? These are some questions our team seeks to address.","cites":"0","conferencePercentile":"21.875"},{"venue":"WASA","id":"fa2381ad035ac6db7951c21dff3d63c4e60cab6f","venue_1":"WASA","year":"2008","title":"Software Fault Localization Using N-gram Analysis","authors":"Syeda Nessa, Muhammad Arshad Ul Abedin, W. Eric Wong, Latifur Khan, Yu Qi","author_ids":"3246177, 2220261, 1876828, 1685603, 2361606","abstract":"A major portion of software development effort is spent in testing and debugging. Execution sequence collected in the testing phase can be a rich source of information for locating the fault in the program, but the exact execution sequence of a program, i.e., the actual order of execution of the statements in the program, is seldom used due to the huge volume. In this study, we apply data mining techniques on this data to reduce the debugging time by narrowing down the possible location of the fault. Our method applies N-gram analysis to rank the executable statements of a software by level of suspicion. We conducted three case studies to demonstrate the effectiveness of our proposed method. We also present comparison with other approaches, and illustrate the potential of our method.","cites":"12","conferencePercentile":"100"},{"venue":"WASA","id":"18c840ed55bdd3eb70198dd3f9d11dbcb9784e5c","venue_1":"WASA","year":"2010","title":"Approaching the Optimal Schedule for Data Aggregation in Wireless Sensor Networks","authors":"Pei Wang, Yuan He, Liusheng Huang","author_ids":"1701285, 6938459, 1807672","abstract":"Due to the large-scale ad hoc deployments and wireless interference , data aggregation is a fundamental but time consuming task in wireless sensor networks. This paper focuses on the latency of data ag-gregation. Previously, it has been proved that the problem of minimizing the latency of data aggregation is NP-hard [1]. Using maximum independent set and first fit algorithms, in this study we design a scheduling algorithm, Peony-tree-based Data Aggregation (PDA), which has a la-tency bound of 15R + Δ − 15, where R is the network radius (measured in hops) and Δ is the maximum node degree. We theoretically analyze the performance of PDA based on different network models, and further evaluate it through extensive simulations. Both the analytical and simulation results demonstrate the advantages of PDA over the state-of-art algorithm in [2], which has a latency bound of 23R + Δ − 18.","cites":"0","conferencePercentile":"29.16666667"},{"venue":"WASA","id":"ea32e33a0daf7b7861b22d06917eeaa25ac76ba5","venue_1":"WASA","year":"2008","title":"Opportunistic Cooperation with Receiver-Based Ratio Combining Strategy","authors":"Qian Wang, Kui Ren, Yanchao Zhang, Bo Zhu","author_ids":"1729612, 7015571, 1736350, 1707836","abstract":"In cooperative wireless communication systems, many combining techniques could be employed at the receiver, such as maximal ratio combining (MRC), equal gain combining (EGC), etc. To address the effect of receiver diversity combining on optimum energy allocation, we analyze the problem of minimizing average total transmit energy under a SNR constraint when different ratio combining methods are utilized at destination. For maximal ratio combining (MRC), based on the explicit analytical solution an asymptotic solution for normalized optimum total energy in terms of μ and η was derived in the high-SNR scenario. For fixed ratio combining (FRC), we find that there does not exist an explicit analytical solution to the optimum energy allocation problem. However, the convexity proof for the energy function provides a way of using numerical convex optimization methods to find the unique solution. Our results also show that, while direct transmission (E * r = 0) is optimum for certain channel states when the destination uses MRC, the relay should always transmit, i.e. E * r > 0 for all channel states, when the combining ratio β is a fixed number.","cites":"0","conferencePercentile":"9.523809524"},{"venue":"WASA","id":"9d59e9235f1323ffaee7347d76d217712fe8bf02","venue_1":"WASA","year":"2012","title":"AMPLE: A Novel Incentive Approach to Adaptive-Width Channel Allocation in Multi-hop, Non-cooperative Wireless Networks","authors":"Chunyang Wu, Fan Wu, Guihai Chen, Bo Sheng","author_ids":"1699859, 1739875, 1690235, 2226840","abstract":"Due to the limitation of radio spectrum resource and fast deployment of wireless devices, careful channel allocation is of great importance for mitigating the performance degradation caused by interference among different users in wireless networks. Most of existing work focused on fixed-width channel allocation. However, latest researches have demonstrated that it is possible to combine contiguous channels for better utilizing the available channels. In this paper, we study the problem of adaptive-width channel allocation in multi-hop, non-cooperative wireless networks from a game-theoretic point of view. We first present a strategic game model for this problem and demonstrate the existence of Nash Equilibrium (NE) in an anarchical scenario. Since a NE is not an ideal solution, we then propose AMPLE, a novel incentive approach to guarantee the system performance at high level. Since the problem of channel allocation in multiple collision domains is NP-complete, we first present an approximate algorithm that gives an allocation with good system performance. We then design a charging scheme that guarantees the system to converge to a Dominant Strategy Equilibrium (DSE), in which it is to the best interest of each node to follow the computed channel allocation, regardless how the others behave. Numerical results verify that AMPLE does prevent nodes' misbehavior, and achieves much higher average system throughputs than anarchical NEs.","cites":"0","conferencePercentile":"21.875"},{"venue":"WASA","id":"930506cb829e3b6422bd12737801b5034c377c9b","venue_1":"WASA","year":"2009","title":"Sniffer Channel Selection for Monitoring Wireless LANs","authors":"Yuan Song, Xian Chen, Yoo-Ah Kim, Bing Wang, Guanling Chen","author_ids":"2949951, 7137528, 2697328, 1718232, 3045450","abstract":"Wireless sniffers are often used to monitor access points (APs) in wireless LANs (WLANs) for network management, fault detection, and traffic characterization. It is cost effective to deploy single-radio snif-fers that can monitor multiple nearby APs. To achieve this, a sniffer needs to switch among multiple channels since these APs often operate on orthogonal channels. In this paper, we formulate and solve two optimization problems on sniffer channel selection. Both problems require that each AP be monitored by at least one sniffer. In addition, one optimization problem requires minimizing the maximum number of channels that a sniffer listens to, and the other requires minimizing the total number of channels that the sniffers listen to. We prove that both optimization problems are NP-hard. For each problem, we propose three algorithms to solve it, one based on integer programming (IP), one based on LP-relaxation, and the third based on a greedy heuristic. We evaluate the performance of the various algorithms using two real-world datasets. Our results show that, for each problem, all the three algorithms are effective in achieving their optimization goals, and overall, the LP-based algorithm outperforms the other two algorithms. Wireless LANs (WLANs) have been widely deployed in enterprise and campus networks. With this wide deployment, it becomes increasingly important to understand the behavior of WLANs, and automatically manage WLANs to ensure their normal operation and security. A widely-used and effective technique for understanding and monitoring WLANs is air sniffing, where a set of sniffers (also called air monitors, wireless monitors, or radio monitors) are placed inside a WLAN, each passively listening to the air waves in its vicinity, and collecting detailed MAC/PHY information (e.sions, and backoff times) provides valuable insights into the behavior of wireless medium and protocols, which can help network administrators to optimize radio coverage and determine the root causes of network faults for effective trouble shooting. In addition, for mission critical WLANs with high security requirements , such as those deployed in banks or military bases [1], PHY/MAC visibility provided by the sniffers is critical, as wired solution can only detect upper layer threats. While requiring additional infrastructure, the insights and benefits achieved by air sniffing cannot be obtained from traditional monitoring techniques (e.g., SNMP). On the other hand, large-scale WLAN monitoring through air sniffing faces several challenges. First, it requires a large number of sniffers, which can be costly to deploy and difficult to manage. …","cites":"4","conferencePercentile":"60"},{"venue":"WASA","id":"8101dbc8d65c6f9b69b6538dcce137f3be3d4b39","venue_1":"WASA","year":"2009","title":"Experimental Study on Secure Data Collection in Vehicular Sensor Networks","authors":"Harry Gao, Seth Utecht, Fengyuan Xu, Haodong Wang, Qun Li","author_ids":"2229284, 3180021, 1741521, 2758920, 1686663","abstract":"In this paper, we show through a simple secure symmetric key based protocol design and its implementation the feasibility of secure data collection in a vehicular sensor networks. We demonstrate that the protocol works in a realistic setting by collecting the real trace data through real implementation. Some of the key considerations are efficiency, deployability and security. The protocol does not safeguard against some of the techniques an adversary could deploy, such as jamming and deliberate battery-draining.","cites":"1","conferencePercentile":"22"},{"venue":"WASA","id":"5a47308bd83752647cbed22f0c97c651a3a688ea","venue_1":"WASA","year":"2010","title":"Interference-Aware Gossiping Scheduling in Uncoordinated Duty-Cycled Multi-hop Wireless Networks","authors":"Xianlong Jiao, Wei Lou, Xiaodong Wang, Junchao Ma, Jiannong Cao, Xingming Zhou","author_ids":"2159771, 8178505, 7136549, 1690667, 7468291, 1771752","abstract":"Gossiping is to broadcast the message of every node to all the other nodes in multi-hop wireless networks (MWNs). This operation plays an important role and is widely used in MWNs. Interference-aware gossiping scheduling (IAGS) aims to provide an interference-free scheduling for gossiping with the minimum latency. Previous work on IAGS mostly assumes that nodes are always active, and thus is not suitable for duty-cycled scenarios. In this paper, we investigate the IAGS problem in uncoordinated duty-cycled multi-hop wireless networks (IAGS-UDC problem) under protocol interference model and unbounded-size message model. We prove that the IAGS-UDC problem is NP-hard. We propose a novel approximation algorithm called MILD for this problem. The MILD algorithm achieves an approximation ratio of 3β 2 (∆ + 6)|T |, where β is 2 3 (α + 2), α denotes the ratio of the interference radius to the transmission radius, ∆ denotes the maximum node degree of the network, and |T | denotes the number of time-slots in a scheduling period. Moreover, the number of transmissions scheduled by the MILD algorithm is at most 3 times as large as the minimum number of transmissions.","cites":"3","conferencePercentile":"75"},{"venue":"WASA","id":"9ee2a28f92129386d6c535ce1813a6ee57d00b94","venue_1":"WASA","year":"2008","title":"Delivery Guarantee of Greedy Routing in Three Dimensional Wireless Networks","authors":"Yu Wang, Chih-Wei Yi, Fan Li","author_ids":"1687514, 1687645, 1706783","abstract":"In this paper, we investigate how to design greedy routing to guarantee packet delivery in a three-dimensional (3D) network. In 2D networks, many position-based routing protocols apply face routing on planar routing structure as a backup method to guarantee packet delivery when greedy routing fails at local minimum. However, in 3D networks, no planar topology can be constructed anymore. Even worse, a recent result [6] showed that there is no deterministic localized routing algorithm that guarantees the delivery of packets in 3D networks. Therefore, we propose to set up the transmission radius large enough to eliminate local minimum in the 3D network. In particular, we study the asymptotic critical transmission radius for greedy routing to ensure the packet delivery in randomly deployed 3D networks. Using similar techniques in [12], we theoretically prove that for a 3D network, formed by nodes that are produced by a Poisson point process of density n over a convex compact region of unit volume, 3 Õ 3β 0 ln n 4πn is asymptotically almost surely (abbreviated by a.a.s.) the threshold of the critical transmission radius for 3D greedy routing, where β0 = 3.2. We also conduct extensive simulations to confirm our theoretical results.","cites":"8","conferencePercentile":"80.95238095"},{"venue":"WASA","id":"d38d3fb2be8ead3da7eb9597b1ba6b7ff7bb5ab6","venue_1":"WASA","year":"2012","title":"Location Proof via Passive RFID Tags","authors":"Harry Gao, Robert Michael Lewis, Qun Li","author_ids":"2229284, 2824906, 1686663","abstract":"With the surge in location-aware applications and prevalence of RFID tags comes a demand for providing location proof service with minimal cost. We introduce two protocols that provide secure and accurate location proof service using passive RFID tags. Both protocols are lightweight, adaptive and cost-effective. The first protocol assumes the connection of a user to the remote server. The second protocol does not require real time interactions with the server. Instead, it uses the self-reported time of local RFID reader (such as a cell phone), which may be biased. The user can upload the information to the server later to obtain the location proof. The paper presents a solution to derive users' actual time of presence in the absence of a reliable clock, assuming an arbitrarily large number of falsified data points from malicious users.","cites":"0","conferencePercentile":"21.875"},{"venue":"WASA","id":"26b3b9996cf67994afa2a927895d1ff96e49aca5","venue_1":"WASA","year":"2008","title":"Supporting IPv6 Interaction with Wireless Sensor Networks Using NP++","authors":"Matthew Jakeman, Danny Hughes, Geoff Coulson, Gordon S. Blair, Steve Pink, Kevin Lee","author_ids":"3080757, 3412963, 1696978, 1700173, 2870713, 1737166","abstract":"There is growing interest in exploiting standard Internet protocols such as IPv6 in wireless sensor networks. Support for IPv6 has the potential to facilitate application development, increase the flexibility of sensor node interaction, and better integrate sensor nodes into the 'Internet of things'. Unfortunately, IPv6 is poorly suited for resource-constrained environments and is particularly wasteful for typical wireless sensor network data flows. This paper presents NP++, a flexible network protocol that provides efficient mapping of IPv6 onto heterogeneous physical networks. The performance of NP++ is evaluated in the context of a deployed WSN-based flood monitoring and warning system.","cites":"0","conferencePercentile":"9.523809524"},{"venue":"WASA","id":"6b65728e89faaaee7c7cee25c987be558c136530","venue_1":"WASA","year":"2012","title":"Adaptive Power Controlled Routing for Underwater Sensor Networks","authors":"Manal Al-Bzoor, Yibo Zhu, Jun Liu, Reda A. Ammar, Jun-Hong Cui, Sanguthevar Rajasekaran","author_ids":"1680765, 2438403, 1843598, 5321831, 1690957, 1698923","abstract":"Energy efficiency and mobility robustness are two of the main performance metrics to be addressed when designing any routing protocol for underwater sensor network (UWSN). Energy efficiency leads to a prolonged network life time, while mobility robustness ensures high and stable delivery ratio. Most of the routing strategies designed for UWSN require a full knowledge of the three dimensional location of nodes. In this paper, we introduce an energy efficient routing schema that does not require any location information, and achieves high packet delivery ratio for both static and mobile scenarios in sparse or dense networks. In our routing strategy, nodes assign themselves to concentric layers. A node to layer assignment is determined by signal power of a received interest packet broadcast by sink nodes. Routing paths are determined on the fly, and a forwarder is chosen based on its layer number and residual energy. Nodes are assumed to be able to adjust their transmission power to a finite set of values. Low power level is most likely selected by nodes when the network is dense, whereas a higher power level is selected when the network is sparse or when nodes at layers closer to the sink has more residual energy. Simulation results shows that our routing protocol achieves a high delivery ratio and a low energy consumption while reducing the delay when compared with other routing strategies for both sparse and dense networks.","cites":"6","conferencePercentile":"97.91666667"},{"venue":"WASA","id":"94cd3c6fa231224aeba8d2d0e2277b1d552ae76b","venue_1":"WASA","year":"2015","title":"Security and Privacy Issues of Fog Computing: A Survey","authors":"Shanhe Yi, Zhengrui Qin, Qun Li","author_ids":"1969902, 2517122, 1686663","abstract":"Fog computing is a promising computing paradigm that extends cloud computing to the edge of networks. Similar to cloud computing but with distinct characteristics, fog computing faces new security and privacy challenges besides those inherited from cloud computing. In this paper, we have surveyed these challenges and corresponding solutions in a brief manner.","cites":"4","conferencePercentile":"100"},{"venue":"WASA","id":"d863914a62843e68055f952b90a965a472b56ec7","venue_1":"WASA","year":"2006","title":"Upperbounding End-to-End Throughput of Multihop Wireless Networks","authors":"Hong Lu, Steve Liu","author_ids":"3655082, 2019733","abstract":"— In this paper, we propose efficient algorithms to compute the upperbound of end to end throughput that are both theoretically and practically tight in multihop wireless networks.","cites":"0","conferencePercentile":"36.36363636"},{"venue":"WASA","id":"943e5a001440ce37e934a05961563e8979f03083","venue_1":"WASA","year":"2012","title":"Towards more engaging telepresence by face tracking","authors":"Yuanwei Chua, Keng Peng Tee, Rui Yan, Liyuan Li, Zhiyong Huang","author_ids":"3171130, 1680432, 5495727, 1746918, 6829976","abstract":"Video conferencing is widely used with the growing popularity of Internet call systems such as FaceTime, Skype and broad band network. However, people still find it unnatural compared to face-to-face talk. One of the problems is that the display screen and web camera are fixed and do not track a person when he/she moves, resulting in an incomplete view and unnaturalness to the other party. In this paper, we propose a more engaging telepresence solution based on a tablet mounted on a pan-tilt robotic base. During video-conferencing, the human face is tracked by the built-in camera on the tablet. The tracking results will drive the robotic base in real-time such that the display and camera will follow the moving face. In this way, it not only sends the captured face images, but also gives natural feeling of head movement as in a face-to-face conversation. We conducted user studies and the findings showed preference of the proposed system.","cites":"1","conferencePercentile":"52.08333333"},{"venue":"WASA","id":"c72d84b53c9a9f81280ceaefa1126b4e8b284dac","venue_1":"WASA","year":"2009","title":"Experimental Study on Mobile RFID Performance","authors":"Zhong Ren, Chiu Chiang Tan, Dong Wang, Qun Li","author_ids":"3648452, 1724352, 1726751, 1686663","abstract":"An increasing number of applications use RFID in their design , but there is a lack of understanding of how mobility affects RFID performance in these applications. Unlike static RFID experiments, mobile RFID studies require more expensive equipment that are unavailable to most researchers. In this paper, we conduct machine-aided experiments to study the effects of mobility on RFID. Our results show that up to 50 RFID tags moving at speeds up to 2 m/s can be reliably read.","cites":"2","conferencePercentile":"40"}]}