{"WASSANAACL-HLT.csv":[{"venue":"WASSA@NAACL-HLT","id":"ffa41ccbd4fdf08d7f189c347ac3d9d13f163c8d","venue_1":"WASSA@NAACL-HLT","year":"2013","title":"Fine-Grained Emotion Recognition in Olympic Tweets Based on Human Computation","authors":"Valentina Sintsova, Claudiu Cristian Musat, Pearl Pu","author_ids":"2712578, 2504407, 1781996","abstract":"In this paper, we detail a method for domain specific, multi-category emotion recognition , based on human computation. We create an Amazon Mechanical Turk 1 task that elicits emotion labels and phrase-emotion associations from the participants. Using the proposed method, we create an emotion lexicon , compatible with the 20 emotion categories of the Geneva Emotion Wheel. GEW is the first computational resource that can be used to assign emotion labels with such a high level of granularity. Our emotion annotation method also produced a corpus of emotion labeled sports tweets. We compared the cross-validated version of the lexicon with existing resources for both the positive/negative and multi-emotion classification problems. We show that the presented domain-targeted lexicon outperforms the existing general purpose ones in both settings. The performance gains are most pronounced for the fine-grained emotion classification, where we achieve an accuracy twice higher than the benchmark.","cites":"11","conferencePercentile":"68.75"},{"venue":"WASSA@NAACL-HLT","id":"3fbb1c34233739413620e66213552a59238fe2c5","venue_1":"WASSA@NAACL-HLT","year":"2011","title":"Subjectivity and Sentiment Analysis of Modern Standard Arabic and Arabic Microblogs","authors":"Ahmed Mourad, Kareem Darwish","author_ids":"2364039, 1680260","abstract":"Though much research has been conducted on Subjectivity and Sentiment Analysis (SSA) during the last decade, little work has fo-cused on Arabic. In this work, we focus on SSA for both Modern Standard Arabic (MSA) news articles and dialectal Arabic microblogs from Twitter. We showcase some of the challenges associated with SSA on microblogs. We adopted a random graph walk approach to extend the Arabic SSA lexicon using Arabic-English phrase tables, leading to improvements for SSA on Arabic microblogs. We used different features for both subjectivity and sentiment classification including stemming , part-of-speech tagging, as well as tweet specific features. Our classification features yield results that surpass Arabic SSA results in the literature.","cites":"61","conferencePercentile":"100"},{"venue":"WASSA@NAACL-HLT","id":"0770c0cc97c14fe8faefbc0c30c06aeedfc3b2fd","venue_1":"WASSA@NAACL-HLT","year":"2013","title":"Recent adventures with emotion-reading technology","authors":"Rosalind W. Picard","author_ids":"1719389","abstract":"1 Abstract of the talk This talk will share stories from recent investigations at the MIT Media Lab in creating technology to recognize and better communicate emotion. Examples include automating facial affect recognition online for sharing media experiences, gathering the worlds largest sets of natural expressions (instead of lab-elicited data) and training machine learning models to predict liking of the experience based on expression dynamics throughout the experience. We also have found that most people have difficulty discriminating peak smiles of frustration from peak smiles of delight in static images. With machine learning and dynamic features, we were able to teach the computer to be highly accurate at discriminating these. These kinds of tools can potentially help many people with nonverbal learning disabilities, limited vision, social phobia, or autism who find it challenging to read the faces of those around them. I will also share recent findings from people wearing physiological sensors 24/7, and how weve been learning about connections between the emotion system, sleep and seizures. Finally, I will share some of our newest work related to crowd sourcing cognitive-behavioral therapy and computational empathy, where sentiment analysis could be of huge benefit.","cites":"0","conferencePercentile":"9.375"}]}