{"WASSAEMNLP.csv":[{"venue":"WASSA@EMNLP","id":"820ad8e25756f5804b58e308985bcae4faa583d1","venue_1":"WASSA@EMNLP","year":"2015","title":"How much does word sense disambiguation help in sentiment analysis of micropost data?","authors":"Chiraag Sumanth, Diana Inkpen","author_ids":"3308088, 1697366","abstract":"This short paper describes a sentiment analysis system for micro-post data that includes analysis of tweets from Twitter and Short Messaging Service (SMS) text messages. We discuss our system that makes use of Word Sense Disambigua-tion techniques in sentiment analysis at the message level, where the entire tweet or SMS text was analysed to determine its dominant sentiment. Previous work done in the area of Word Sense Disambigua-tion does not throw light on its influence on the analysis of social-media text and micropost data, which is what our work aims to achieve. Our experiments show that the use of Word Sense Disambigua-tion alone has resulted in an improved sentiment analysis system that outperforms systems built without incorporating Word Sense Disambiguation.","cites":"2","conferencePercentile":"78"},{"venue":"WASSA@EMNLP","id":"f7c9ee705b857cd093f00a531ba90bcf5ba5b25a","venue_1":"WASSA@EMNLP","year":"2015","title":"Mining HEXACO personality traits from Enterprise Social Media","authors":"Priyanka Sinha, Lipika Dey, Pabitra Mitra, Anupam Basu","author_ids":"2196088, 1724193, 1781070, 1713201","abstract":"In this paper we introduce a novel computational technique of extraction of personality traits (HEXACO) of employees from Enterprise Social Media posts. We deal with challenges such as not being able to use existing survey instruments for scoring and not being able to directly use existing psychological studies on written text due to lack of overlapping words between the existing dictionary and words used in Enterprise Social Media. Using our approach we are able to infer personality traits (HEXACO) from posts and find better coverage and usage of the extended dictionary.","cites":"0","conferencePercentile":"30"},{"venue":"WASSA@EMNLP","id":"26907bea45dd5ac9420ce4d06074f2aea349dffa","venue_1":"WASSA@EMNLP","year":"2015","title":"Enhanced Twitter Sentiment Classification Using Contextual Information","authors":"Soroush Vosoughi, Helen Zhou, Deb Roy","author_ids":"1918441, 1684652, 4719423","abstract":"The rise in popularity and ubiquity of Twitter has made sentiment analysis of tweets an important and well-covered area of research. However, the 140 character limit imposed on tweets makes it hard to use standard linguistic methods for sentiment classification. On the other hand, what tweets lack in structure they make up with sheer volume and rich metadata. This metadata includes geolocation, temporal and author information. We hypothesize that sentiment is dependent on all these contextual factors. Different locations, times and authors have different emotional valences. In this paper, we explored this hypothesis by utilizing distant supervision to collect millions of labelled tweets from different locations, times and authors. We used this data to analyse the variation of tweet sentiments across different authors, times and locations. Once we explored and understood the relationship between these variables and sentiment, we used a Bayesian approach to combine these variables with more standard linguistic features such as n-grams to create a Twit-ter sentiment classifier. This combined classifier outperforms the purely linguistic classifier, showing that integrating the rich contextual information available on Twitter into sentiment classification is a promising direction of research.","cites":"7","conferencePercentile":"96"},{"venue":"WASSA@EMNLP","id":"5341f4609308e54ba4a6880f6bc9a61cc90a7788","venue_1":"WASSA@EMNLP","year":"2015","title":"Sentiment Classification via a Response Recalibration Framework","authors":"Phillip Smith, Mark G. Lee","author_ids":"1802825, 1777812","abstract":"Probabilistic learning models have the ability to be calibrated to improve the performance of tasks such as sentiment classification. In this paper, we introduce a framework for sentiment classification that enables classifier recalibration given the presence of related, context-bearing documents. We investigate the use of prob-abilistic thresholding and document similarity based recalibration methods to yield classifier improvements. We demonstrate the performance of our proposed recalibra-tion methods on a dataset of online clinical reviews from the patient feedback domain that have adjoining management responses that yield sentiment bearing information. Experimental results show the proposed recalibration methods outperform uncali-brated supervised machine learning models trained for sentiment analysis, and yield significant improvements over a robust baseline.","cites":"0","conferencePercentile":"30"}]}