{"Waste_management.csv":[{"venue":"Waste management","id":"abb131c211e1c2d99f283ac3882bfe4b7aa3652f","venue_1":"Waste management","year":"2014","title":"Improving collection efficiency through remote monitoring of charity assets.","authors":"Fraser McLeod, Gunes Erdogan, Tom Cherrett, Tolga Bektas, Nigel Davies, Duncan Shingleton, Chris Speed, Janet Dickinson, Sarah Norgate","author_ids":"2542019, 6677776, 2964350, 2282665, 1789887, 1678471, 1735719, 2999792, 2011727","abstract":"Collection costs associated with servicing a major UK charity's donation banks and collecting unsold goods from their retail shops can account for up to 20% of the overall income gained. Bank and shop collections are commingled and are typically made on fixed days of the week irrespective of the amounts of materials waiting to be collected. Using collection records from a major UK charity, this paper considers what vehicle routing and scheduling benefits could accrue if bank and shop servicing requirements were monitored, the former using remote sensing technology to allow more proactive collection scheduling. A vehicle routing and scheduling algorithm employing tabu search methods was developed, and suggested time and distance savings of up to 30% over the current fixed schedules when a minimum bank and shop fill level of between 50% and 60% was used as a collection trigger. For the case study investigated, this led to a potential revenue gain of 5% for the charity and estimated CO2 savings of around 0.5 tonnes per week across the fleet of six heterogeneous vehicles.","cites":"1","conferencePercentile":"50"},{"venue":"Waste management","id":"a9d47e97357bb54e75e59464db2720618aa99da8","venue_1":"Waste management","year":"2009","title":"19th century London dust-yards: a case study in closed-loop resource efficiency.","authors":"Costas A Velis, David C Wilson, Christopher R Cheeseman","author_ids":"8162986, 1691025, 7749343","abstract":"The material recovery methods used by dust-yards in early 19th century London, England and the conditions that led to their development, success and decline are reported. The overall system developed in response to the market value of constituents of municipal waste, and particularly the high coal ash content of household 'dust'. The emergence of lucrative markets for 'soil' and 'breeze' products encouraged dust-contractors to recover effectively 100% of the residual wastes remaining after readily saleable items and materials had been removed by the thriving informal sector. Contracting dust collection to the private sector allowed parishes to keep the streets relatively clean, without the need to develop institutional capacity, and for a period this also generated useful income. The dust-yard system is, therefore, an early example of organised, municipal-wide solid waste management, and also of public-private sector participation. The dust-yard system had been working successfully for more than 50 years before the Public Health Acts of 1848 and 1875, and was thus important in facilitating a relatively smooth transition to an institutionalised, municipally-run solid waste management system in England. The dust-yards can be seen as early precursors of modern materials recycling facilities (MRFs) and mechanical-biological treatment (MBT) plants; however, it must be emphasised that dust-yards operated without any of the environmental and occupational health considerations that are indispensable today. In addition, there are analogies between dust-yards and informal sector recycling systems currently operating in many developing countries.","cites":"2","conferencePercentile":"50"}]}