{"WAW.csv":[{"venue":"WAW","id":"b90696347cdde547896bb3c71f4ee8dc321c3330","venue_1":"WAW","year":"2007","title":"Using Bloom Filters to Speed Up HITS-Like Ranking Algorithms","authors":"Sreenivas Gollapudi, Marc Najork, Rina Panigrahy","author_ids":"1695567, 1763978, 1679451","abstract":"This paper describes a technique for reducing the query-time cost of HITS-like ranking algorithm. The basic idea is to compute for each node in the web graph a summary of its immediate neighborhood (which is a query-independent operation and thus can be done off-line), and to approximate the neighborhood graph of a result set at query-time by combining the summaries of the result set nodes. This approximation of the query-specific neighborhood graph can then be used to perform query-dependent link-based ranking algorithms such as HITS and SALSA. We have evaluated our technique on a large web graph and a substantial set of queries with partially judged results, and found that its effectiveness (retrieval performance) is comparable to the original SALSA algorithm, while its efficiency (query-time speed) is substantially higher.","cites":"8","conferencePercentile":"25"},{"venue":"WAW","id":"d75781bec367fc840eea6551a4f9485d049a9a2f","venue_1":"WAW","year":"2006","title":"Web Structure in 2005","authors":"Yu Hirate, Shin Kato, Hayato Yamana","author_ids":"1733395, 2910035, 1749490","abstract":"The estimated number of static web pages in Oct 2005 was over 20.3 billion, which was determined by multiplying the average number of pages per web server based on the results of three previous studies, 200 pages, by the estimated number of web servers on the Internet, 101.4 million. However, based on the analysis of 8.5 billion web pages that we crawled by Oct. 2005, we estimate the total number of web pages to be 53.7 billion. This is because the number of dynamic web pages has increased rapidly in recent years. We also analyzed the web structure using 3 billion of the 8.5 billion web pages that we have crawled. Our results indicate that the size of the \" CORE, \" the central component of the bow tie structure, has increased in recent years, especially in the Chinese and Japanese web.","cites":"1","conferencePercentile":"25"},{"venue":"WAW","id":"d41417d03bc623c50f5c2bd7887eb4377ea9622a","venue_1":"WAW","year":"2011","title":"Modeling Social Networks through User Background and Behavior","authors":"Ilias Foudalis, Kamal Jain, Christos H. Papadimitriou, Martha Sideri","author_ids":"2225033, 1800444, 1734636, 2120623","abstract":"We propose a generative model for social networks, both undirected and directed, that takes into account two fundamental characteristics of the user: background (specifically, the real world groups to which the user belongs); and behavior (namely, the ways in which the user engages in surfing activity and occasionally adds links to other users encountered this way). Our experiments show that networks generated by our model compare very well with data from a host of actual social networks with respect to a battery of standard metrics such as degree distribution and assortativity, and verify well known predictions about social networks such as densification and shrinking diameter. We also propose a new metric for social networks intended to gauge the level of surfing activity, namely the correlation between degree and Page rank.","cites":"12","conferencePercentile":"64.28571429"},{"venue":"WAW","id":"6ed10012773ed496c04fb10d9702c0f2b43f2bd9","venue_1":"WAW","year":"2009","title":"Quantifying the Impact of Information Aggregation on Complex Networks: A Temporal Perspective","authors":"Fernando Mourão, Leonardo C. da Rocha, Lucas C. O. Miranda, Virgílio A. F. Almeida, Wagner Meira","author_ids":"1732109, 1733399, 2494410, 7360316, 1691267","abstract":"Introduction Motivation Demand for scalable and robust modeling tools: An increasing amount of data is being stored Data is getting more complex Complex Networks is a popular and successful model that has been applied to fields such as sport, economy, and biology, among others.","cites":"1","conferencePercentile":"25"},{"venue":"WAW","id":"5fe76d8372223b20677b58dbcb101b292bdf8152","venue_1":"WAW","year":"2004","title":"Making Eigenvector-Based Reputation Systems Robust to Collusion","authors":"Hui Zhang, Ashish Goel, Ramesh Govindan, Kahn Mason, Benjamin Van Roy","author_ids":"2976776, 1679667, 1747970, 1986683, 1731282","abstract":"Eigenvector based methods in general, and Google's PageR-ank algorithm for rating web pages in particular, have become an important component of information retrieval on the Web. In this paper, we study the efficacy of, and countermeasures for, collusions designed to improve user rating in such systems. We define a metric, called the amplification factor, which captures the amount of PageRank-inflation obtained by a group due to collusions. We prove that the amplification factor can be at most 1//, where is the reset probability of the PageRank random walk. We show that colluding nodes (e.g., web-pages) can achieve this amplification and increase their rank significantly in realistic settings; further, several natural schemes to address this problem are demonstrably inadequate. We propose a relatively simple modification to PageRank which renders the algorithm insensitive to such collusion attempts. Our scheme is based on the observation that nodes which cheat do so by \" stalling \" the random walk in a small portion of the web graph and, hence, their PageRank must be especially sensitive to the reset probability. We perform exhaustive simulations on the Web graph to demonstrate that our scheme successfully prevents colluding nodes from improving their rank, yielding an algorithm that is robust to gaming.","cites":"78","conferencePercentile":"100"},{"venue":"WAW","id":"a968877d6379429ecc0d4406d65544d2ca6d6a97","venue_1":"WAW","year":"2004","title":"Crawling the Infinite Web: Five Levels Are Enough","authors":"Ricardo A. Baeza-Yates, Carlos Castillo","author_ids":"1747635, 3747087","abstract":"A large amount of publicly available Web pages are generated dynamically upon request, and contain links to other dynamically generated pages. This usually produces Web sites which can create arbitrarily many pages. This poses a problem to search engine managers: they need a rule to configure the search engine's crawler in such a way that it stops downloading pages from each Web site at some depth. But how deep must the crawler go? In this article, several probabilistic models for browsing \" infinite \" Web sites are proposed and studied. We use these models to estimate how deep a search engine must go to download a significant portion of the Web site content that is actually visited. The proposed models are validated against real data on page views in several Web sites, showing that, in both theory and practice, a crawler needs to download just a few levels, no more than 3 to 5 \" clicks \" away from the start page, to reach 90% of the pages that users actually visit.","cites":"30","conferencePercentile":"70"},{"venue":"WAW","id":"25cd97338a9da3c0084a2e77d8f8ec726e0fb7f8","venue_1":"WAW","year":"2010","title":"Game-Theoretic Models of Information Overload in Social Networks","authors":"Christian Borgs, Jennifer T. Chayes, Brian Karrer, Brendan Meeder, R. Ravi, Ray Reagans, Amin S. Sayedi-Roshkhar","author_ids":"1721812, 1695997, 2796576, 1794786, 1711488, 2166098, 3825320","abstract":"We study the effect of information overload on user engagement in an asymmetric social network like Twitter. We introduce simple game-theoretic models that capture rate competition between celebrities producing updates in such networks where users non-strategically choose a subset of celebrities to follow based on the utility derived from high quality updates as well as disutility derived from having to wade through too many updates. Our two variants model the two behaviors of users dropping some potential connections (followership model) or leaving the network altogether (engagement model). We show that under a simple formulation of celebrity rate competition, there is no pure strategy Nash equilibrium under the first model. We then identify special cases in both models when pure rate equilibria exist for the celebrities: For the follow-ership model, we show existence of a pure rate equilibrium when there is a global ranking of the celebrities in terms of the quality of their updates to users. This result also generalizes to the case when there is a partial order consistent with all the linear orders of the celebrities based on their qualities to the users. Furthermore, these equilibria can be computed in polynomial time. For the engagement model, pure rate equilibria exist when all users are interested in the same number of celebrities, or when they are interested in at most two. Finally, we also give a finite though inefficient procedure to determine if pure equilibria exist in the general case of the followership model.","cites":"6","conferencePercentile":"40.90909091"},{"venue":"WAW","id":"193d88b5f0ebaa7fb676f93f41cf8c286cccf7a0","venue_1":"WAW","year":"2004","title":"A Geometric Preferential Attachment Model of Networks","authors":"Abraham D. Flaxman, Alan M. Frieze, Juan Vera","author_ids":"1765721, 1709874, 1887419","abstract":"We study a random graph G n that combines certain aspects of geometric random graphs and preferential attachment graphs. The vertices of G n are n sequentially generated points x 1 , x 2 ,. .. , x n chosen uniformly at random from the unit sphere in R 3. After generating x t , we randomly connect it to m points from those points in x 1 , x 2 ,. .. , x t−1 which are within distance r. Neighbors are chosen with probability proportional to their current degree and a parameter α biasses the choice towards self loops. We show that if m is sufficiently large, if r ≥ ln n/n 1/2−β for some constant β, and if α > 2, then whp at time n the number of vertices of degree k follows a power law with exponent α + 1. Unlike the preferential attachment graph, this geometric preferential attachment graph has small separators, similar to experimental observations of [8]. We further show that if m ≥ K ln n, K sufficiently large, then G n is connected and has diameter O(ln n/r) whp.","cites":"55","conferencePercentile":"85"},{"venue":"WAW","id":"0c14bd69ebf2cc246725d0f9caae1620d12f2c93","venue_1":"WAW","year":"2007","title":"Bias Reduction in Traceroute Sampling - Towards a More Accurate Map of the Internet","authors":"Abraham D. Flaxman, Juan Vera","author_ids":"1765721, 1887419","abstract":"Traceroute sampling is an important technique in exploring the internet router graph and the autonomous system graph. Although it is one of the primary techniques used in calculating statistics about the internet, it can introduce bias that corrupts these estimates. This paper reports on a theoretical and experimental investigation of a new technique to reduce the bias of traceroute sampling when estimating the degree distribution. We develop a new estimator for the degree of a node in a traceroute-sampled graph; validate the estimator theoretically in Erd˝ os-Rényi graphs and, through computer experiments, for a wider range of graphs; and apply it to produce a new picture of the degree distribution of the autonomous system graph.","cites":"6","conferencePercentile":"14.28571429"}]}