{"WAYSOUPS.csv":[{"venue":"WAY@SOUPS","id":"6e81b5701c632d97d7d8fa098ee2b868ac8f5848","venue_1":"WAY@SOUPS","year":"2016","title":"Who Are You? It Depends (On What You Ask Me!): Context-Dependent Dynamic User Authentication","authors":"Raghav V. Sampangi, Kirstie Hawkey","author_ids":"2765458, 1771438","abstract":"In this position paper, we present a new mechanism for context-dependent user authentication. We propose an approach in which the type of authentication (single/two factor, two-step, etc.) and the choice of the authentication mechanisms (algorithms/protocols used) vary dynamically, depending on contextual information. Authenticating mechanisms in online and offline systems rely on three main factors related to the user [2]—user attributes (e.g. fingerprint), knowledge (e.g. password, PIN) and possession (e.g. devices, cards). With most of our daily transactions being online, the emphasis on multi-step verification and multi-factor authentication is more than ever now. Traditionally, the approaches to user authentication have been more static, which have often proved to be less secure. More recently, some researchers [3] have explored allowing users to choose one of several available authentication schemes. In the recent past, researchers have also considered context-dependent attributes in user authentication. Context is information that allows a system to \" characterize the situation of an entity, where an entity can be a person, place, or physical, or computational object \" [4]. Using context-dependent attributes makes a system more dynamic and adaptive; it makes it possible for systems to associate levels of trust with user actions to grant access to requested resources [1] and to design adaptive systems to authenticate users based on their location and other attributes [5]. In our approach, we consider the possibility of making the authentication process itself dynamic, in that the type of authentication (whether the system uses single or multiple factors, and if the system uses two-step verification) and the choice of the mechanism used are determined dynamically. By doing so, the authentication remains dynamic—not known to either the user or the administrator, and we hope to make it difficult for an unauthorized entity to gain access to the system, if he/she has acquired user credentials and/or possessions (devices, cards, etc.). In our work, we set out to explore the extent to which user authentication can be dynamic and adaptive. Having explored existing research (and having been at the receiving end of stolen credentials!), we considered ways to make the authentication unpredictable to an unauthorized entity. We were inspired by the potential of context-aware systems and the promise shown by multi-factor authentication and two-step verification in being able to successfully (and increasingly reliably) authenticate users. The ability of contextual data to uniquely define a transaction motivated us to consider a combination of the two. We considered …","cites":"0","conferencePercentile":"58.33333333"},{"venue":"WAY@SOUPS","id":"a567f52214f3e23da1a120c2b9af6a07470de2c7","venue_1":"WAY@SOUPS","year":"2016","title":"Examining Visual-Spatial Paths for Mobile Authentication","authors":"David Lu, Taehoon Lee, Sauvik Das, Jason I. Hong","author_ids":"3549790, 1709596, 2630673, 1689960","abstract":"Inspired by people's strong memory for visual-spatial paths (e.g., commuting paths), we present in this paper an introductory exploration of the use of these paths for memorable, strong mobile authentication. In a preliminary study, we evaluated several low-fidelity representations for encoding relatively strong (~20 bit) secrets as visual-spatial paths: a 2D birds-eye view, a 3D third-person view, and 3D immersed view. We found that the 3D immersed view worked best for memorability, and used this initial study to inspire the design for a novel mobile authentication application: the Memory Palace. We ran a within-subjects experiment to evaluate our Memory Palace authentication concept against Android's 9-dot Patternlock along two dimensions: memorability and resilience to shoulder surfing. Results from our experiment suggest people have significantly higher memorability for visual-spatial secrets encoded in the Memory Palace which were also significantly more resilient against shoulder surfing. We conclude with directions for further work: specifically, creating sharable paths for more socially compatible authentication and segmenting secret paths for simple, non-binary access control.","cites":"0","conferencePercentile":"58.33333333"}]}