{"WBIR.csv":[{"venue":"WBIR","id":"0f12e615d1fc37e9a906b56a83767dddfa4f60dd","venue_1":"WBIR","year":"2006","title":"Point Similarity Measures Based on MRF Modeling of Difference Images for Spline-Based 2D-3D Rigid Registration of X-Ray Fluoroscopy to CT Images","authors":"Guoyan Zheng, Xuan Zhang, Slavica Jonic, Philippe Thévenaz, Michael Unser, Lutz-Peter Nolte","author_ids":"2533175, 1698961, 7803988, 1742952, 1746136, 1799325","abstract":"One of the main factors that affect the accuracy of intensity-based registration of two-dimensional (2D) X-ray fluoroscopy to three-dimensional (3D) CT data is the similarity measure, which is a criterion function that is used in the registration procedure for measuring the quality of image match. This paper presents a unifying framework for rationally deriving point similarity measures based on Markov random field (MRF) modeling of difference images which are obtained by comparing the reference fluoroscopic images with their associated digitally reconstructed radiographs (DRR's). The optimal solution is defined as the maximum a posterior (MAP) estimate of the MRF. Three novel point similarity measures derived from this framework are presented. They are evaluated using a phantom and a human cadaveric specimen. Combining any one of the newly proposed similarity measures with a previously introduced spline-based registration scheme, we develop a fast and accurate registration algorithm. We report their capture ranges, converging speeds, and registration accuracies.","cites":"3","conferencePercentile":"34.375"},{"venue":"WBIR","id":"2f25a6dae690795370896228c0ddbc37d456ff94","venue_1":"WBIR","year":"2012","title":"Registration for Correlative Microscopy Using Image Analogies","authors":"Tian Cao, Christopher Zach, Shannon Modla, Debbie Powell, Kirk Czymmek, Marc Niethammer","author_ids":"1698736, 1713941, 1730024, 1710440, 1720761, 1695046","abstract":"Correlative microscopy is a methodology combining the func-tionality of light microscopy with the high resolution of electron mi-croscopy and other microscopy technologies for the same biological specimen. In this paper, we propose an image registration method for correl-ative microscopy, which is challenging due to the distinct appearance of biological structures when imaged with di↵erent modalities. Our method is based on image analogies and allows to transform images of a given modality into the appearance-space of another modality. Hence, the registration between two di↵erent types of microscopy images can be transformed to a mono-modality image registration. We use a sparse representation model to obtain image analogies. The method makes use of representative corresponding image training patches of two di↵erent imaging modalities to learn a dictionary capturing appearance relations. We test our approach on backscattered electron (BSE) Scanning Electron Microscopy (SEM)/confocal and Transmission Electron Microscopy (TEM)/confocal images and show improvements over direct registration using a mutual-information similarity measure to account for di↵erences in image appearance.","cites":"5","conferencePercentile":"96.15384615"}]}