{"WBMA_03.csv":[{"venue":"WBMA '03","id":"17127e17c00dda8d5cbad6ad126a5509ead8b284","venue_1":"WBMA '03","year":"2003","title":"Bayesian face recognition using Gabor features","authors":"Xiaogang Wang, Xiaoou Tang","author_ids":"2868636, 1741901","abstract":"In this paper, we propose a new face recognition approach combining a Bayesian probabilistic model and Gabor filter responses. Since both the Bayesian algorithm and the Gabor features can reduce intrapersonal variation through different mechanisms, we integrate the two methods to take full advantage of both approaches. The efficacy of the new method is demonstrated by the experiments on 1180 face images from the XM2VTS database and 1260 face images from the AR database.","cites":"13","conferencePercentile":"58.33333333"},{"venue":"WBMA '03","id":"11ea9089c61cf1fc0af144c16c50af2d7be95168","venue_1":"WBMA '03","year":"2003","title":"Combination of Fisher scores and appearance based features for face recognition","authors":"Ling Chen, Hong Man","author_ids":"1717165, 1687271","abstract":"A novel feature generation scheme which combines multiclass mapping of Fisher scores and appearance based features for face recognition (FR) is proposed in this paper. Multi-class mapping of Fisher scores is based on partial derivative analysis of parameters of hidden Markov model (HMM), and appearance based features are obtained directed from face images. Linear discriminant analysis (LDA) is used to analyze the feature vectors generated under this scheme. Recognition performance improvement is observed over stand-alone HMM method as well as Fisherface method, which also uses appearance based feature vectors. Moreover, by reducing the number of models involved in the training and testing stages, the proposed feature generation scheme can maintain very high discriminative power at much lower computational complexity comparing to that of the traditional HMM based FR system. Experimental results are provided to demonstrate the viability of this scheme for face recognition.","cites":"3","conferencePercentile":"16.66666667"}]}