{"WCAE.csv":[{"venue":"WCAE","id":"5ebc70dacc62bf26cf5da1baa50efd59dce7ce41","venue_1":"WCAE","year":"2003","title":"Activating computer architecture with classroom presenter","authors":"Beth Simon, Richard J. Anderson, Steven A. Wolfman","author_ids":"1752036, 2308531, 3162853","abstract":"In this paper we discuss our experiences using a Tablet PC-based presentation system in an undergraduate computer architecture class. The system allowed us to integrate PowerPoint slides with high quality pen-based writing and to separate the instructor's view of the materials from the students' view. This allowed a more natural and interactive development of class concepts and content.\n The system that we used was Classroom Presenter which was developed at University of Washington and Microsoft Research. The system has received substantial use at University of Washington, being used in approximately 15 large courses since Autumn 2002. The successful deployment at the University of San Diego in a small undergraduate course is interesting since the developers of the system viewed Classroom Presenter as most appropriate for large lectures and for distance courses. The deployment at the University of San Diego explored new ground in usage of the system. In this work we present an overview of the system and discuss particular uses and advantages of the system in an undergraduate architecture class setting.","cites":"8","conferencePercentile":"93.33333333"},{"venue":"WCAE","id":"30a202b45d404e51531267a3e7362892f5036e3e","venue_1":"WCAE","year":"2002","title":"A survey of web resources for teaching computer architecture","authors":"William Yurcik, Edward F. Gehringer","author_ids":"1713112, 1731813","abstract":"The use of Web resources is becoming a core part of teaching computer architecture. In this paper we identify five notable Web sites that specialize in teaching tools for computer architecture instructors and discuss the role they can play in facilitating learning. While these Web sites contain a wide range of valuable resources, there remain gaps in what is available online. Community support appears meager for making tools and resources available. We conclude that the computer-architecture community faces challenges both in the content of Web-based materials (accurate and appropriate information) and the process (making information known and available to academic community).","cites":"2","conferencePercentile":"63.63636364"},{"venue":"WCAE","id":"2ed1d0574405591e7a8883d5082a99bd28d48b93","venue_1":"WCAE","year":"2002","title":"PECTOPAH: promoting education in computer technology using an open-ended pedagogically adaptable hierarchy","authors":"Hugh Osborne, Shirley Crossley, Jirí Mencák, William Yurcik","author_ids":"3062322, 3405452, 8146881, 1713112","abstract":"An understanding of Computer Systems Architecture (CSA) is essential to an understanding of Computer Science. There is however a tendency, at all levels, in teaching Information and Communications Technology (ICT) to neglect CSA, but teaching ICT without teaching CSA is like teaching Russian without teaching the Cyrillic alphabet -- students may become reasonably fluent in the application of abstract high level skills (e.g. they know that the Russian for restaurant is <i>restoran</i>), but lack the basic skills needed to maintain and extend those skills (e.g. they cannot identify PECTOPAH as being the \"real\" Russian for restaurant). There are two major reasons for the neglect of CSA in teaching ICT. There is a misconception of the effect of technological change, and there is a tendency to use inappropriate didactic tools.","cites":"2","conferencePercentile":"63.63636364"},{"venue":"WCAE","id":"8b53fcdf322d597b8a9ebc898b58e88ecc8f7cf2","venue_1":"WCAE","year":"2002","title":"How computers really work: a children's guide","authors":"Shirley Crossley, Hugh Osborne, William Yurcik","author_ids":"3405452, 3062322, 1713112","abstract":"Current Information Technology teaching at elementary school level concentrates on teaching pupils \"application skills\". Very little time is spent in teaching pupils the fundamentals of \"how a computer works\" -- computer architectures.\n One source of this lacuna is the lack of suitable support material for teaching the basic concepts of computer architecture to this age group. This paper reports on the investigation, development and evaluation of a pilot computer architecture CD-ROM, aimed at 7--11 year olds.","cites":"1","conferencePercentile":"36.36363636"}]}