{"WCCCE_12.csv":[{"venue":"WCCCE '12","id":"6fe3c61627feb72171234ede7c568298f1c84bff","venue_1":"WCCCE '12","year":"2012","title":"Instructional strategies in the EGRET course: an international graduate forum on becoming a researcher","authors":"Daniela Damian, Marian Petre, Mariel Miller, Allyson F. Hadwin","author_ids":", 1683003, 2723883, 1980728","abstract":"In today's knowledge economy, graduate students in the field of Computer Science are increasingly required to develop sophisticated, multi-faceted knowledge of conducting research across multiple contexts and countries. This paper reports the experience of teaching a course to prepare Computer Science graduate students for conducting research in the international community. The course emphasized development of skills critical for a successful research career in computer science, and included construction of knowledge as well as hands-on application of instructional content. The intended learning outcomes included (a) gaining familiarity with research design and methodologies in computer science, (b) preparing and delivering research presentations, (c) reviewing the literature, (d) reading and writing research papers, (e) writing and evaluating research proposals, and (f) networking in the international research community.\n In this paper, we describe an innovative instructional design that emphasized international collaboration with graduate students from another university on a different continent, namely the Open University in the UK. Our instructional strategies included (a) remote participation of graduate students across universities and countries using technologies for computer mediated communication, (b) incorporation of collaborative activities using online tools scaffolding students' construction of sophisticated knowledge of key research activities, and (c) providing students with opportunities for hands-on practical application of concepts in collaborative research activities.","cites":"0","conferencePercentile":"37.5"},{"venue":"WCCCE '12","id":"557af3e5e8f7e8ffcb8b504eee230a89e377e768","venue_1":"WCCCE '12","year":"2012","title":"Perspectives on assessment in computing education","authors":"Christopher Hundhausen (Moderator), Allison Elliott Tew, Mark Guzdial","author_ids":", 2792618, 1829670","abstract":"This panel brings together three computing education researchers with extensive experience in assessing the impact of computing education. Two of the panelists have taken a leading role in assessing the outcomes of large, multi-institutional interventions in computing education. The third panelist has developed and rigorously validated a standardized instrument for measuring one's understanding of computing concepts. After briefly discussing their perspectives on assessment, the panel will field questions about assessment, and engage the audience in a general discussion of assessment issues.","cites":"0","conferencePercentile":"37.5"}]}