{"WCITDNF.csv":[{"venue":"WCITD/NF","id":"6d31f279bfbfe1b9b1c70146bbb0a5a35786f04c","venue_1":"WCITD/NF","year":"2010","title":"ICT Driven Knowledge Management in Developing Countries: A Case Study in a Chinese Organisation","authors":"Jin Tong, Siraj Ahmed Shaikh","author_ids":"1796616, 2339459","abstract":"Current research of knowledge management (KM) is mostly based on experience in developed countries that are already becoming knowledge economies [16]. In general, ICT (information and communication technologies) is playing an important part of KM in these countries. Applications of their KM models and frameworks might not yield expected results in developing countries. It is necessary to help organisations in developing countries to understand the issues of KM in their local context. Towards this goal, this paper explores current KM practice in China through a case study of a recently created Chinese mobile phone company (referred to as Lotus). The researchers present a model demonstrating how ICT can promote effective KM based on the Lotus case findings. However, this model is more applicable in the wider developing countries context than just China.","cites":"0","conferencePercentile":"26.19047619"},{"venue":"WCITD/NF","id":"3c381bec3c255d3c7fc6eedf4c18becb0ba17886","venue_1":"WCITD/NF","year":"2010","title":"Technical ICTD - A User Centered Lifecycle","authors":"Jörg Dörflinger, Tom Gross","author_ids":"3188200, 1731989","abstract":"Technical Information and Communication Technology for Development (ICTD) lacks appropriate research methods along the entire development lifecycle spanning design, development, deployment, and evaluation. Many ICTD projects have failed meeting the challenges of technical ICTD because of inappropriate research methods which often left frustrated end users alone with unusable research results. Successful technical ICTD research needs a shared methodology that involves the end user in all research lifecycle phases. With User Centered Design and Action Research the Mobile Human Computer Interaction (HCI) research field offers concepts with a clear end user focus. However, applying Mobile HCI research methods unchanged in technical ICTD will fail due to the specific cultural, infrastructural and governmental context of ICTD research. In this paper we present a set of Mobile HCI research methods adapted for technical ICTD research based on results and lessons learned of a research project in rural South Africa.","cites":"1","conferencePercentile":"61.9047619"},{"venue":"WCITD/NF","id":"b0d3775f3da70086b5afb0bd745a1b12c1c21ca5","venue_1":"WCITD/NF","year":"2010","title":"Performance Analysis of User-Centric Network Selection and Network-Centric Resource Allocation Approaches in Wireless Networks","authors":"Sahin Albayrak, Manzoor Ahmed Khan, Fikret Sivrikaya, Ahmet Cihat Toker, Cuong Troung","author_ids":"1722170, 1972460, 2582015, 2073973, 3003077","abstract":"The possible leveraging of high deployment costs, and the possibility to increase revenue have also introduced the concept of network sharing between different operators. On the other hand, the realization of a user-centric paradigm in future heterogeneous wireless networks , which implies free and automatic choice among different available wireless and mobile access networks, will revolutionize future wireless networks. For this innovative concept to materialize a paradigm shift is required from a long-term contractual based service delivery to a short-term contractual and dynamic service delivery. In this paper we formulate and compare the network-centric resource allocation and and user-centric network selection problems in a multi-operator scenario using two different flavors of game theory, namely bargaining games (for network-centric resource sharing) and multi-attribute auctions (for user-centric interface selection). We also compare the contributed solutions to one another to investigate their performance in terms of efficient resource allocation, call blocking probability, and user satisfaction.","cites":"0","conferencePercentile":"26.19047619"}]}