{"WCNC_Workshops.csv":[{"venue":"WCNC Workshops","id":"ae203d3ac397efda2279683d64812fdadae18c33","venue_1":"WCNC Workshops","year":"2015","title":"Compressive spectrum sensing augmented by geo-location database","authors":"Zhijin Qin, Lin Wei, Yue Gao, Clive Parini","author_ids":"1830444, 1688982, 1744619, 1700940","abstract":"—In cognitive radio (CR), white space devices (WSDs) need to have the knowledge of spectrum occupancy in TV white space (TVWS) before dynamic access. There are two common schemes proposed to achieve this: 1) geo-location database and 2) spectrum sensing. In geo-location database, calculating digital terrestrial television (DTT) location probability and maximum permitted power in each channel in an efficient way becomes important as the database is supposed to give a quick response once a request comes. Spectrum sensing is a scheme which can provide a more reliable and real-time results for spectrum occupancy. However, the high sampling rate is a big challenge in spectrum sensing for power limited WSDs. In this paper, we proposed to combine the location probability based geo-location database with compressive sensing (CS) based spectrum sensing to achieve sub-Nyquist sampling rates for WSDs. The history data from geo-location database is utilized to support the signal recovery for the spectrum sensing. In addition, a new method to calculate DTT location probability efficiently is proposed. Theoretical analysis of the proposed algorithm are tested in TVWS and it shows that performance of the proposed algorithm outperforms the traditional algorithm.","cites":"1","conferencePercentile":"72.22222222"},{"venue":"WCNC Workshops","id":"d65afed1e0f5884d8b19ded9a2241a44d8869165","venue_1":"WCNC Workshops","year":"2012","title":"Intra-vehicle UWB MIMO channel capacity","authors":"Han Deng, Jia Li, Liuqing Yang, Timothy Talty","author_ids":"2627003, 1687366, 6984692, 2280496","abstract":"—In wireless communication, MIMO technology can improve performance by offering larger channel capacity without additional bandwidth or transmitting power. This paper presents the measurement of intra-vehicle ultra wideband (UWB) multiple-input multiple-output (MIMO) channels and evaluates channel capacity. The measurement was carried out in time domain for three scenarios: (1) in the car compartment, (2) beneath the chassis, and (3) inside the engine compartment. The results show that MIMO channel capacities increase while using more antennas and the capacity achieved by water filling is larger than that achieved by equal power distribution.","cites":"0","conferencePercentile":"24"},{"venue":"WCNC Workshops","id":"48d42a8c96d7ea3a2db799208e814ca1d5255e33","venue_1":"WCNC Workshops","year":"2012","title":"Exploring passenger dynamics and connectivities in Beijing underground via bluetooth networks","authors":"Rina Wu, Yuan Cao, Chi Harold Liu, Pan Hui, Li Li, Erwu Liu","author_ids":"8671023, 1714439, 1791656, 2665582, 1682059, 1818083","abstract":"—Unlike traditional opportunistic networks characterized by relatively very short connectivity period among mobile devices during their contacts, in this paper, we explicitly consider the underground/bus scenario where the inherited structured mobility pattern enforces more stable passenger behaviors. If with the aid of potential formation of Bluetooth-enabled multi-hop wireless networks, one can expect a type of new emerging applications for passengers on the move. In particular, we conducted a thorough experimental study on passenger dynamics and connectivities in Beijing Underground during peak hours, via building an information collection application in an Android-based smartphone. From the total of 41,806 records for 120 days, we have performed extensive analysis on a variety of statistics for the number of neighbors, the lifetime of the neighbors, the received signal strength indicator (RSSI) and its derived physical distance, flow speed of the nearby passengers, battery usage rate, etc. Then, we further prove our justification that Bluetooth is the perfect technology to build up a relatively small multi-hop wireless network with the network size of four nodes, and in particular it is applicable and may fundamentally drive new applications in an underground environment during the peak hour, where two notable examples are music album sharing and neighborhood gaming. I. INTRODUCTION The past several years have seen the astounding proliferation of affordable, wireless, and easily programmable mobile computing and communication devices such as smartphones and now, tablet computers. While integrated media and location-tracking features (e.g., cameras, GPS receivers, accelerome-ters, etc.) have become standard fare, one can expect a rapid increase of other \" sentient \" functions to vividly interact with nearby neighbors of the similar social interests/preferences. Notable examples include the \" participatory sensing \" [1], [2] (in which participants use devices to collect, possibly analyze, and make available nearby environmental data for large-scale applications), mobile file sharing [3], Micro-Blogging system [4], Bluetooth-enabled stranger finders [5], and Bluetooth-enabled poster sites in London Underground [6], etc.; however all above not fully exploit the features in underground/bus environments. On the (almost) standard fare of the communication interfaces , 3G, Wi-Fi, and Bluetooth are three major enabling technologies. The resulted network is often referred as an opportunistic network, where contacts among users are usually opportunistic and connections among devices are intermittent. While on the one hand people argue that these uncertainties","cites":"1","conferencePercentile":"52"},{"venue":"WCNC Workshops","id":"bcc9a8e230fdf85ba53c1dc9f2c76596bcabb17f","venue_1":"WCNC Workshops","year":"2012","title":"Supporting efficient machine-to-machine communications in the future mobile internet","authors":"Jun Li, Yanyong Zhang, Kiran Nagaraja, Dipankar Raychaudhuri","author_ids":"1681426, 1813845, 1698614, 1690964","abstract":"— Machine-to-machine (M2M) communication represents an important new class of applications for the future \" Internet of Things (IoT) \". The IoT scenario requires scalable connectivity to billions of embedded devices such as sensors, RFID's and machines. Current sensor networking solutions involve the use of gateways for hierarchical access to sensor devices, but this approach leads to specialized M2M systems which are not visible to the vast majority of Internet devices and applications. The MobilityFirst future Internet architecture provides a new framework for efficiently supporting sensor net and M2M scenarios through the use of an identity naming system for all network attached objects using the concept of a \" globally unique identifier (GUID) \". The use of GUID results in a \" flat \" network where sensors and other embedded devices are visible to all applications and devices on the Internet. In addition, GUID names make it possible to introduce context and content-aware services which are well suited for M2M scenarios where attributes such as location or type of content are more important than physical address for establishing network connectivity. This paper presents a discussion of how M2M service scenarios are supported in the MobilityFirst architecture, introducing the protocol layers and API's as they apply to sensors and embedded devices. A proof-of-concept prototype implementation is discussed and an application to a sensor scenario is described.","cites":"3","conferencePercentile":"74"},{"venue":"WCNC Workshops","id":"661e097328c7a099ea4b6aa4f3df4b97a69c900a","venue_1":"WCNC Workshops","year":"2013","title":"Base stations from current mobile cellular networks: Measurement, spatial modeling and analysis","authors":"Jiaxin Zhang, Wenbo Wang, Xing Zhang, Yu Huang, Zhuowen Su, Zongchao Liu","author_ids":"3248628, 1722461, 1743897, 1718835, 3007787, 7768723","abstract":"—In heterogeneous cellular networks spatial characteristics of base stations (BSs) influence the system performance intensively. Existing models like two-dimensional hexagonal grid model or homogeneous spatial poisson point process (SPPP) are based on the assumption that BSs are ideal or uniformly distributed, but the aggregation behavior of users in hot spots has an important effect on the location of low power nodes (LPNs), so these models fail to characterize the distribution of BSs in the current mobile cellular networks. In this paper, firstly existing spatial models are analyzed. Then, based on real data from a mobile operator in one large city of China, a set of spatial models is proposed in three typical regions: dense urban, urban and suburban. For dense urban area, \" Two Tiers Poisson Cluster Superimposed Process \" is proposed to model the spatial characteristics of real-world BSs. Specifically, for urban and suburban area, conventional SPPP model still can be used. Finally, the fundamental relationship between user behavior and BS distribution is illustrated and summarized. Numerous results show that SPPP is only appropriate in the urban and suburban regions where users are not gathered together obviously. Principal parameters of these models are provided as reference for the theoretical analysis and computer simulation, which describe the complex spatial configuration more reasonably and reflect the current mobile cellular network performance more precisely.","cites":"1","conferencePercentile":"50"},{"venue":"WCNC Workshops","id":"51f5f932eb8b6b8ea9419ffdb975c92fd9e63d9a","venue_1":"WCNC Workshops","year":"2012","title":"UPnP: Breaking out of the LAN","authors":"Jim Grimmett, Eamonn O'Neill","author_ids":"1711308, 1696153","abstract":"— The use of devices embedded in the environment is limited by users' ability to find them and configure their mobile devices to use them. Existing commercial implementations of device discovery technologies tend to be restricted to local networks and do not scale well beyond those environments. In this paper we introduce an architecture that extends Universal Plug and Play (UPnP) to address these limitations and therefore enable zero-configuration discovery and use of embedded devices across multiple networks.","cites":"0","conferencePercentile":"24"},{"venue":"WCNC Workshops","id":"4c42c5223f84ba7aef317bedb7da1f671c3c9edb","venue_1":"WCNC Workshops","year":"2013","title":"Energy saving: Scaling network energy efficiency faster than traffic growth","authors":"Yan Chen, Oliver Blume, Azeddine Gati, Antonio Capone, Chi-En Wu, Ulrich Barth, Thomas L. Marzetta, Haibin Zhang, Shugong Xu","author_ids":"1700696, 2915548, 7514644, 1739614, 2950394, 1862300, 1723300, 3304640, 1802931","abstract":"—As the mobile traffic is expected to continue its exponential growth in the near future, energy efficiency has gradually become a must criterion for wireless network design. Three fundamental questions need to be answered before the detailed design could be carried out, namely what energy efficiency network is, where the energy efficiency improvement may come, how the energy efficiency evaluation of a whole mobile network could be conducted. In this paper, we target to shed a light on the answers of the three questions by introducing the bottom-up energy efficiency evaluation methodology for large networks with the combination of different areas and time periods, as well as the basic traffic, deployment, and power models that will be applied therein. Moreover, we shall illustrate where the overall energy saving gain may come by analyzing the power-traffic relation and the three research projects in the GreenTouch Mobile WG.","cites":"2","conferencePercentile":"65"}]}