{"WCSP.csv":[{"venue":"WCSP","id":"1ee0605a2e1ab82045842d4d6438adb6bbcbe804","venue_1":"WCSP","year":"2011","title":"Chernoff upper bound of PEP for distributed space-time coding relay systems in Nakagami-m fading channels","authors":"Nan Wang, Ming Chen, Wence Zhang, Xiaoli Chu","author_ids":"1715792, 1711264, 2953691, 1680129","abstract":"—The Chernoff upper bound of the pairwise error probability (PEP) and a closed-form approximation for distributed space-time coding (DSTC) relay systems in Nakagami-m fading channels are derived in this paper, numerical results show that the upper bound approximation is quite near to the real value of the Chernoff upper bound of the PEP.","cites":"0","conferencePercentile":"23.4375"},{"venue":"WCSP","id":"979f94bc5aac2be4066f745310d24334c88c0881","venue_1":"WCSP","year":"2011","title":"Adaptive mobility-assisted data collection in wireless sensor networks","authors":"Liang He, Jun Tao, Jianping Pan, Jingdong Xu","author_ids":"1765426, 1780100, 1732425, 7169649","abstract":"—Mobility-assisted data collection in wireless sensor networks offers us a new approach to reducing and balancing the energy consumption of sensor nodes, however, the resultant data collection latency may be large due to the limited travel speed. Much research effort has been made on reducing the data collection latency with the scenario of a single mobile device. A potential problem with this is its scalability, and a straightforward solution is to employ multiple mobile devices to collect data collaboratively. In this paper, the data collection with multiple heterogeneous mobile devices, in terms of the capability to conduct data collection, is investigated. Our previous work, which models the network where a mobile sink visits sensor nodes and collects data as an M/G/1 queue, is extended, and new analytical results on the response time distribution, or equivalently the distribution of the data collection latency in the network, are presented. In addition, an adaptive data collection scheme is proposed, which schedules the data collection based on the service demand to reduce the operation cost. The accuracy of our modeling and analysis, along with the performance evaluation of the proposed data collection scheme, is verified through extensive simulations.","cites":"2","conferencePercentile":"75"},{"venue":"WCSP","id":"8ce276d6708aac0bcf39aea5616f82921236e38f","venue_1":"WCSP","year":"2011","title":"The uplink capacity of SA-MIMO system under single-user scenario","authors":"Jianxin Dai, Ming Chen, Pei-Jung Chung","author_ids":"3834749, 1711264, 2135078","abstract":"—The uplink capacity of the single-user smart antennas (SA)-multiple-input-multiple-output (MIMO) wireless systems, which combines smart antennas with MIMO at the receiver, is investigated in this paper. The joint optimization problem corresponding to the capacity is deduced, and in the case of equal power allocation and the same direction-of-arrivals (DOAs) from different transmit antennas at the same antenna array the closed-form expression of the capacity is obtained, an upper bound of the capacity is also given in the case of different DOAs at the same antenna array. Some numerical results are also given to compare the capacities of conventional MIMO and SA-MIMO systems.","cites":"1","conferencePercentile":"57.8125"},{"venue":"WCSP","id":"86035bc46a1bde2f953766e9b4a5175a4145f093","venue_1":"WCSP","year":"2011","title":"Distribution of PAPR in LOFDM systems based on extreme value theory","authors":"Kui Xu, Dongmei Zhang, Youyun Xu, Zhenxing Lv, Wenwen Liang","author_ids":"1735664, 1711277, 1724701, 3129141, 2550040","abstract":"—The extreme value theory and the assumption that lattice orthogonal frequency division multiplexing (LOFDM) signal converges weakly to a Gaussian random process are employed to derive peak-to-average-power ratio (PAPR) in LOFDM systems. Two complementary cumulative distribution functions (CCDF) of LOFDM system with equal and unequal subcarrier power allocation are given, respectively. Computer simulations have been conducted, to validate the analytical results, showing a very good match between the identified PAPR distribution and that of real LOFDM signals. Our theoretical analysis is confirmed by numerical simulations that the PAPR problem of LOFDM systems is more deteriorative than that of standard OFDM systems.","cites":"0","conferencePercentile":"23.4375"},{"venue":"WCSP","id":"4c9537ac454de216a4ffdedb306cfd23a90f7de2","venue_1":"WCSP","year":"2011","title":"Pilot tone selection in OFDM amplified-and-forward relay system","authors":"Linfeng An, Ming Chen, Bingyang Wu","author_ids":"1820006, 1711264, 2796442","abstract":"—Channel estimation for OFDM amplify-and-forward relay system requires transmission of pilot tones in source node, and different pilot tones can be derived according to different channel estimation algorithms and OFDM scenarios. This paper derives two different pilot tones with different scenarios: 1) no virtual subcarrier is applied in OFDM system and LS algorithm is used in channel estimation; 2) virtual subcarriers are applied in OFDM system and RLS algorithm is used in channel estimation.","cites":"0","conferencePercentile":"23.4375"},{"venue":"WCSP","id":"9b2070af1ce5af7b6217e8cd5c45bd44a42fc3a1","venue_1":"WCSP","year":"2011","title":"Non-orthogonal pilot design and analysis for CoMP systems","authors":"Xiujun Zhang, Xiang Chen, Shidong Zhou, Jing Wang","author_ids":"8442773, 1724260, 7523237, 1697912","abstract":"—In this paper, a non-orthogonal pilot scheme is proposed for the downlink of the coordinated multi-point (CoMP) systems to reduce the pilot overhead. Compared with the conventional orthogonal pilot schemes resulting in a heavy burden of the system along with the increasing number of transmit antennas, our proposed scheme doesn't need the necessary orthogonality between different antennas' pilot sequences. By exhaustively searching the non-orthogonal vectors over proper different unitary spaces, the optimal pilot sequences based on the criteria of minimal cross-correlation can be obtained for different antennas in CoMP systems. Analysis and simulations show that the proposed scheme provides a tradeoff between the accuracy of channel estimation and the total pilot overhead. In particular, when the number of cooperative transmitting antennas is large, our proposed scheme outperforms the orthogonal one at the same pilot overhead, with regard to available system capacity by linear beamforming.","cites":"0","conferencePercentile":"23.4375"},{"venue":"WCSP","id":"ffa5f2b8c5a9264de8eb3ca35a564839c1694107","venue_1":"WCSP","year":"2012","title":"Exploiting statistical and outdated CSI in multiuser downlink transmission","authors":"Shi Jin, Jue Wang, Michail Matthaiou, Xiqi Gao","author_ids":"5517238, 1718812, 1784770, 1717796","abstract":"Notice: Changes introduced as a result of publishing processes such as copy-editing and formatting may not be reflected in this document. For a definitive version of this work, please refer to the published source. Please note that access to the published version might require a subscription. Chalmers Publication Library (CPL) offers the possibility of retrieving research publications produced at Chalmers University of Technology. It covers all types of publications: articles, dissertations, licentiate theses, masters theses, conference papers, reports etc. Since 2006 it is the official tool for Chalmers official publication statistics. To ensure that Chalmers research results are disseminated as widely as possible, an Open Access Policy has been adopted. The CPL service is administrated and maintained by Chalmers Library. Abstract—In this paper, we propose a multiuser downlink transmission scheme, which exploits both the statistical and outdated channel state information (CSI) at the transmitter. The proposed scheme extends the outdated CSI-aided scheme, first introduced by Maddah-Ali and Tse in [1] (denoted as MAT), by sending symbols demanded by a user along its statistical eigenmodes, instead of directly sending the symbols through separate antennas, and we refer to it as statistical eigenmode-MAT (SE-MAT). Considering zero-forcing receiver, we explicitly prove that the proposed SE-MAT scheme can achieve a higher ergodic sum-rate compared to the original MAT scheme, under different correlation conditions. Moreover, a user selection method which selects statistically orthogonal users for the SE-MAT transmission is proposed to further improve the system performance.","cites":"1","conferencePercentile":"62.5"},{"venue":"WCSP","id":"7c7c0300f6d6d2863eaf25ff0a9d1989cbd9da42","venue_1":"WCSP","year":"2013","title":"A dependable Slepian-Wolf coding based clustering algorithm for data aggregation in wireless sensor networks","authors":"Qihang Shu, Qiang Hu, Jun Zheng, Nathalie Mitton","author_ids":"2635696, 4367117, 1737694, 1801854","abstract":"HAL is a multidisciplinary open access archive for the deposit and dissemination of scientific research documents, whether they are published or not. The documents may come from teaching and research institutions in France or abroad, or from public or private research centers. L'archive ouverte pluridisciplinaire HAL, est destinée au dépôt età la diffusion de documents scientifiques de niveau recherche, publiés ou non, ´ emanant desétablissements d'enseignement et de recherche français oú etrangers, des laboratoires publics ou privés. Abstract—This paper considers the Slepian-Wolf coding based data aggregation problem and the corresponding dependable clustering problem in wireless sensor networks (WSNs). A dependable Slepian-Wolf coding based clustering (D-SWC) algorithm is proposed to provide dependable clustering against cluster-head failures. The proposed D-SWC algorithm attempts to elect a primary cluster head and a backup cluster head for each cluster member during clustering so that once a failure occurs to the primary cluster head the cluster members within the failed cluster can promptly switchover to the backup cluster head and thus recover the connectivity of the failed cluster to the data sink without waiting for the next-round clustering to be performed. Simulation results show that the D-SWC algorithm can effectively increase the amount of data transmitted to the data sink as compared with an existing non-dependable clustering algorithm for Slepian-Wolf coding based data aggregation in WSNs.","cites":"0","conferencePercentile":"33.33333333"},{"venue":"WCSP","id":"e7f2278ee8618bca153ab4c7d00fa84f190fdf30","venue_1":"WCSP","year":"2012","title":"Energy savings using an adaptive base station to relay station switching paradigm","authors":"A. T. M. Shafiul Alam, Laurence Dooley, Adrian S. Poulton, Yusheng Ji","author_ids":"3353945, 1732820, 2773361, 7753600","abstract":"(2012). Energy savings using an adaptive base station-to-relay station switching paradigm. Copyright and Moral Rights for the articles on this site are retained by the individual authors and/or other copyright owners. For more information on Open Research Online's data policy on reuse of materials please consult the policies page. Abstract—Applying a Base Station (BS) sleep approach during low traffic periods has recently been advocated as a strategy for reducing energy consumption in cellular networks. The complete switching off of certain BS however, can lead to coverage holes and severe performance degradation in terms of off-cell user throughput, greater transmit power dissipation in both the up and downlinks, and more complex interference management. This paper presents a novel cellular network energy saving model in which certain BS rather being turned off are switched to Relay Station (RS) mode during low traffic periods. The switched RS and other shared RS deployed at the cross border of each cell are responsible for upholding the same quality of service (QoS) provision as when all BS are active. A centralised adaptive switching threshold algorithm is also introduced to undertake the switching decision, instead of using a fixed threshold. Simulation results confirm the new BS-RS Switching model using an adaptive threshold can reduce network energy consumption by more than half, as well as improving off-cell users' throughput.","cites":"3","conferencePercentile":"90"},{"venue":"WCSP","id":"61dfd928104fa2073d2a66245169fe4fe0c6b15d","venue_1":"WCSP","year":"2011","title":"An efficient CFO estimation algorithm for the downlink of 3GPP-LTE","authors":"Feng Wang, Yu Zhu","author_ids":"1745827, 1736182","abstract":"— Synchronization is of fundamental importance for wireless cellular systems, especially for orthogonal frequency division multiplexing (OFDM) based systems. In this paper, we investigate carrier frequency offset (CFO) estimation in the initial synchronization for the downlink of 3GPP-long term evolution (3GPP-LTE). Firstly, three traditional CFO estimation schemes including the primary synchronization channel (P-SCH) signals (PSS) correlation based scheme, the cyclic prefix (CP) based scheme, and the multiple signal classification (MUSIC) based scheme, are respectively applied. Simulation results show that the PSS correlation based scheme can achieve better performance than the other two. Furthermore, we extend the traditional PSS correlation based scheme, and propose a more efficient CFO estimation algorithm. Simulation results show that, compared to the traditional estimator, the proposed estimator has better estimation performance in terms of normalized mean square error (MSE), and achieves a gain of around 2 dB over both additive white Gaussian noise (AWGN) channels and frequency selective fading channels.","cites":"0","conferencePercentile":"23.4375"},{"venue":"WCSP","id":"308a3d9a015f7790393f23bb2ed976354b31e6e8","venue_1":"WCSP","year":"2012","title":"Dynamic user association for energy minimization in macro-relay network","authors":"Xin Li, Hao Wang, Nan Liu, Xiaohu You","author_ids":"1705796, 3429863, 5350838, 1736885","abstract":"—In this paper, an energy minimization problem for users with heterogeneous locations and rate requirements in the macro-relay network is considered, in which the rate requirements of all users are strictly guaranteed and meanwhile the total energy consumption of the network is minimized. First, the energy minimization problem is formulated as an integer optimization problem, which is similar to the well-known knapsack problem and has been proven to be NP-hard. Then the complexity of the optimal exhaustive search method is analyzed and a practical and effective algorithm, macro and relay selection for energy minimization (MRSEM), is proposed. The proposed MRSEM algorithm dynamically associates users to macro or relay station according to both the radio frequency energy and circuit energy, thus to minimize the total energy consumption of the system. Extensive simulations are conducted and the results show that, the proposed MRSEM algorithm can significantly reduce the total energy consumption compared with existing schemes, while it almost achieves the optimal solution of the exhaustive search method. Index Terms—energy-efficiency, macro-relay network, dynamic user association.","cites":"2","conferencePercentile":"80"}]}