{"WCW.csv":[{"venue":"WCW","id":"c2b7f6d9d9ee17663503e62f04e6b9a424f91630","venue_1":"WCW","year":"2004","title":"Dynamic Content Placement for Mobile Content Distribution Networks","authors":"Wagner Moro Aioffi, Geraldo Robson Mateus, Jussara M. Almeida, Raquel Cardoso de Melo Minardi","author_ids":"2371767, 1735875, 8118988, 2599547","abstract":"As wireless networks increase in popularity, the development of efficient content distribution techniques to meet the growing and constantly changing client demand becomes a necessity. Previous content distribution network proposals, targeting mainly wired networks, are not adequate to handle the high temporal and spatial variability in client demand caused by user mobility. This paper proposes and analyzes a wireless dynamic content distribution network framework that replicates content in response to changes in client demand in order to reduce the total traffic over the network backbone. We propose a mathematical programming model to determine the offline optimal solution as well as an online algorithm based on demand forecasting. Using a previously developed mobility simulator, we show our new online algorithm outperforms the traditional centralized and distributed static placement approaches, reducing the total traffic over the network backbone in up to 78%, compared to the best previous approach analyzed.","cites":"3","conferencePercentile":"71.42857143"},{"venue":"WCW","id":"2797dd141154207735b5adc17ca885b21b7e5f62","venue_1":"WCW","year":"2004","title":"FatNemo: Building a Resilient Multi-source Multicast Fat-Tree","authors":"Stefan Birrer, Dong Lu, Fabián E. Bustamante, Yi Qiao, Peter A. Dinda","author_ids":"3121463, 1884623, 2376639, 2597275, 1782580","abstract":"FatNemo is a novel scalable peer-to-peer multi-source multicast protocol based on the idea of fat-trees. In fat-trees the available bandwidth increases as one moves up the tree, yielding a minimal mean and standard deviation of the response time. For many-to-many multicast applications, such as video confer-encing, this eliminates the bottlenecks inside the overlay network. FatNemo organizes its members into a tree of clusters. Starting at the lowest tree layer, peers can be members of multiple successive layers. Bandwidth capacity is used to decide the highest layer a peer can participate in. The size of the cluster is increased as we go up the tree. FatNemo relies on co-leaders to balance the load and to increase its resilience to path and end host failures. We present an evaluation of our protocol using simulation, comparing its performance with that of alternative protocols (Narada, Nice and Nice-PRM). Our results show that FatNemo not only minimizes the average and the standard deviation of the response time, but also handles end host failures gracefully without suffering a performance penalty.","cites":"29","conferencePercentile":"100"}]}