{"WDIA.csv":[{"venue":"WDIA","id":"b1062bb6aa85ebc7c33670d9af3f84ce5a8761e6","venue_1":"WDIA","year":"2012","title":"Extraction and Visualization of Cardiac Beat by Grid-Based Active Stereo","authors":"Hirooki Aoki, Ryo Furukawa, Masahito Aoyama, Shinsaku Hiura, Ryusuke Sagawa, Hiroshi Kawasaki","author_ids":"1992778, 1697820, 2640956, 1915982, 1706605, 1710962","abstract":"We propose a method to observe cardiac beat from 3D shape information of body surface by using grid-based active stereo, and report preliminary experiments to evaluate validities of the proposed method. By comparing results of our proposed with those of electrocardiogram (ECG), we confirmed sufficient correspondences between peak intervals of inter-frame depth changes measured by the active stereo and R-R intervals measured by ECG. We tried the visualization of the spatial distribution of inter-frame depth change plotted on the 3D shape of thoracoabdominal region. And, the shape change by cardiac beat is mainly found on the left side of the chest region. 1 Introduction Some researchers proposed cardiac beat measurement without contact by applying the thermal imaging [1] and the microwave reflectometry [2] in order to decrease the discomfort of examinees by attaching sensing devices on the body. These methods need expensive measurement devices. Novel measurement method by using webcam was proposed as feasible solution with low-cost devices [3]. However, in this mehotd, it is considered that the cardiac rate can be measured, but the waveform of cardiac beat cannot be measured accurately. Hence, we propose a non-contact measurement method of cardiac beat by applying a 3D measurement method based on active stereo. We consider that non-contact cardiac beat measurement by 3D sensor has one advantage of obtaining spatial distribution of cardiac beat. We expect that the spatial distribution of cardiac beat change enable us to assess the cardiac function. The active stereo systems that consist of cameras and video projectors have been widely used for 3D measurements. However, determining correspondences between the 2D pattern and the captured image is a difficult problem. A stable solution that","cites":"0","conferencePercentile":"25"},{"venue":"WDIA","id":"22e0a8b9c4fcc1675fbc79565e662a6b604003e7","venue_1":"WDIA","year":"2012","title":"Optimal Decoding of Stripe Patterns with Window Uniqueness Constraint","authors":"Shuntaro Yamazaki, Masaaki Mochimaru","author_ids":"2200826, 1793121","abstract":"We propose an optimal algorithm for solving correspondences problem in one-shot depth acquisition using color stripe patterns composed of pseudo-random sequence (PRS). Our algorithm solves one-dimensional matching in a globally optimal manner, imposing the uniqueness of subsequences in the PRS as a hard constraint. The proposed algorithm has linear time complexity with respect to the size of image, which is of the same order as conventional dynamic programming matching. Experimental results are presented to demonstrate the performance of the algorithm using real data, for several color stripes that have been proposed in this field.","cites":"0","conferencePercentile":"25"}]}