{"WDV.csv":[{"venue":"WDV","id":"c5bb3498ec29516ce9b18f3fa882dd3121ffcb16","venue_1":"WDV","year":"2006","title":"Dynamic Texture Recognition Using Volume Local Binary Patterns","authors":"Guoying Zhao, Matti Pietikäinen","author_ids":"1757287, 1714724","abstract":"Dynamic texture is an extension of texture to the temporal domain. Description and recognition of dynamic textures has attracted growing attention. In this paper, a new method for recognizing dynamic textures is proposed. The textures are modeled with volume local binary patterns (VLBP), which are an extension of the LBP operator widely used in still texture analysis, combining the motion and appearance together. A rotation invariant VLBP is also proposed. Our approach has many advantages compared with the earlier approaches , providing a better performance for two test databases. Due to its rotation invariance and robustness to gray-scale variations, the method is very promising for practical applications.","cites":"29","conferencePercentile":"95.83333333"},{"venue":"WDV","id":"950d9328899e8c8c66e326442b1e383dc8426cea","venue_1":"WDV","year":"2006","title":"Bayesian Tracking with Auxiliary Discrete Processes. Application to Detection and Tracking of Objects with Occlusions","authors":"Patrick Pérez, Jaco Vermaak","author_ids":"1799777, 1798861","abstract":"A number of Bayesian tracking models involve auxiliary discrete variables beside the main hidden state of interest. These discrete variables usually follow a Markovian process and interact with the hidden state either via its evolution model or via the observation process, or both. We consider here a general model that encompasses all these situations, and show how Bayesian filtering can be rigorously conducted with it. The resulting approach facilitates easy re-use of existing tracking algorithms designed in the absence of the auxiliary process. In particular we show how particle filters can be obtained based on sampling only in the original state space instead of sampling in the augmented space, as it is usually done. We finally demonstrate how this framework facilitates solutions to the critical problem of appearance and disappearance of targets, either upon scene entering and exiting, or due to temporary occlusion-s. This is illustrated in the context of color-based tracking with particle filters.","cites":"6","conferencePercentile":"52.08333333"},{"venue":"WDV","id":"4b9307f36fdb0cb4ec0590010dec0fb6a7df1957","venue_1":"WDV","year":"2006","title":"Spatial Segmentation of Temporal Texture Using Mixture Linear Models","authors":"Lee A. D. Cooper, Jun Liu, Kun Huang","author_ids":"2155631, 1843598, 1737503","abstract":"In this paper we propose a novel approach for the spatial segmentation of video sequences containing multiple temporal textures. This work is based on the notion that a single temporal texture can be represented by a low-dimensional linear model. For scenes containing multiple temporal textures, e.g. trees swaying adjacent a flowing river, we extend the single linear model to a mixture of linear models and segment the scene by identifying sub-spaces within the data using robust generalized principal component analysis (GPCA). Computation is reduced to minutes in Matlab by first identifying models from a sampling of the sequence and using the derived models to segment the remaining data. The effectiveness of our method has been demonstrated in several examples including an application in biomedical image analysis.","cites":"16","conferencePercentile":"79.16666667"},{"venue":"WDV","id":"14fd3834340b28d1dc8252ccd44cc60612e1f3e0","venue_1":"WDV","year":"2006","title":"A Rao-Blackwellized Parts-Constellation Tracker","authors":"Grant Schindler, Frank Dellaert","author_ids":"2582852, 2038264","abstract":"We present a method for efficiently tracking objects represented as constellations of parts by integrating out the shape of the model. Parts-based models have been successfully applied to object recognition and tracking. However, the high dimensionality of such models present an obstacle to traditional particle filtering approaches. We can efficiently use parts-based models in a particle filter by applying Rao-Blackwellization to integrate out continuous parameters such as shape. This allows us to maintain multiple hypotheses for the pose of an object without the need to sample in the high-dimensional spaces in which parts-based models live. We present experimental results for a challenging biological tracking task.","cites":"5","conferencePercentile":"43.75"}]}