{"WEAH.csv":[{"venue":"WEAH","id":"67871db7c23b3f4d3ac0b8f5badc14b5498d66a1","venue_1":"WEAH","year":"2007","title":"On the \"Evolvable Hardware\" Approach to Electronic Design Invention","authors":"Varun Aggarwal, Karl Berggren, Una-May O'Reilly","author_ids":"2771413, 5409400, 1769843","abstract":"Our interest is in evolutionary electronics and its exploitation for invention. In this paper, we survey how the community currently tries to exploit the invention potential of evolvable hardware. We assess whether the current state-of-art in evolvable hardware has resulted in successful inventions or invention tools. We discuss the challenges faced by the community in this regard and how the community can overcome these challenges by exploiting nascent technologies , which include new design substrates, new computational paradigms and recently discovered design principles.","cites":"0","conferencePercentile":"60"},{"venue":"WEAH","id":"53f2c9eecc7f1ff388777615eac0c444d4e6e2ab","venue_1":"WEAH","year":"2007","title":"Accelerating the Evolution of Evolvable Hardware-based Packet Classifiers","authors":"Harald Widiger, Andreas Tockhorn, Ralf Salomon, Dirk Timmermann","author_ids":"2116736, 3070227, 1742191, 1741106","abstract":"— In modern networks, the requirements towards network equipment rise together with the bandwidth. Customers and internet service providers ask for more and more services like Voice-over-IP, IP-TV, and data services with a dependable quality. To satisfy these demands, the requirements towards packet classification as key functionality in network equipment, e.g., routers become overwhelming. We developed a packet classifier based on an evolvable hardware hash function and investigated its performance with real world data. The performance did show a reasonable degradation compared to random numbers. The computation time, which is required for evolving one generation in the genetic algorithm, corresponds to the actual fitness. We did find possibilities to maximize the speed of fitness evaluation by taking advantage of the fact, that the whole packet classifier including the fitness evaluation module is a pure hardware implementation based on FPGA technology. We were thus able to increase the performance of the evolvable packet classifier significantly while limiting the additional required hardware resources.","cites":"0","conferencePercentile":"60"}]}