{"WearSysMobiSys.csv":[{"venue":"WearSys@MobiSys","id":"850cf867be487adde5c21b867d1ee6e43dc6a7c4","venue_1":"WearSys@MobiSys","year":"2015","title":"A Review of Smart Clothing in Military","authors":"Sofia Scataglini, Giuseppe Andreoni, Johan Gallant","author_ids":"2677626, 7578802, 2053810","abstract":"Wearable technologies are now pervading many applications in several fields. The aim of this review paper is to collect and summarize the actual smart clothing in the space and military field where conditions could be critical for health and safety, and outline the innovation trend for innovative services to police and soldiers.","cites":"0","conferencePercentile":"28.57142857"},{"venue":"WearSys@MobiSys","id":"4618f09410aa706f538095abfc656b2a9e136190","venue_1":"WearSys@MobiSys","year":"2015","title":"User-Centered Design for Wearable Neuro-rehabilitation System","authors":"Paolo Perego, Roberto Sironi, Riccardo Lavezzari, Giuseppe Andreoni","author_ids":"2027282, 3051954, 2259837, 7578802","abstract":"Brain Computer Interfaces (BCIs) are direct technological interfaces between the brain and the computer. BCIs record and process brain activity in order to extract command which can be used for communication, control. This technology usually implements bio-feedback (or neuro-feedback) which is a tool that allows to the patient/user to verify the correct use of the system. Biofeedback can be also used like an indicator of rehabilitation status of a neuromuscular sub-system.Usually BCI researcher focuses on performance and reliability, but since the system should be applied in everyday life, usability, comfortability and wearability are mandatory. This work discusses the application of the User-Centered Design process applied to the development of a wearable EEG headset for rehabilitation and present a new concept focused on user-friendliness, combining aesthetical appealing with functionality and reliability.","cites":"0","conferencePercentile":"28.57142857"},{"venue":"WearSys@MobiSys","id":"a4924b783be70e7f1363076d655057f6287b1072","venue_1":"WearSys@MobiSys","year":"2015","title":"Toward Detection of Unsafe Driving with Wearables","authors":"Luyang Liu, Çagdas Karatas, Hongyu Li, Sheng Tan, Marco Gruteser, Jie Yang, Yingying Chen, Richard P. Martin","author_ids":"7955064, 2326505, 1682162, 2264487, 1708469, 1688599, 3467781, 1746628","abstract":"This paper explores the potential for wearable devices to identify driving activities and unsafe driving, without relying on information or sensors in the vehicle. In particular, we study how wrist-mounted inertial sensors such as those in smart watches and fitness trackers, can track steering wheel usage and inputs. Identifying steering wheel usage helps mobile device detect driving and reduce distractions. Tracking steering wheel turning angles can improve vehicle motion tracking by mobile devices and help identify unsafe driving. The approach relies on motion features that allow distinguishing steering from other confounding hand movements. Once steering wheel usage is detected, it also use wrist rotation measurements to infer steering wheel turning angles. Our preliminary experiments show that the technique is 98.9% accurate in detecting driving and can estimate turning angles with average error within two degrees.","cites":"5","conferencePercentile":"100"},{"venue":"WearSys@MobiSys","id":"4f273d0f8570a87980815c02dc237f6f9fe77fb4","venue_1":"WearSys@MobiSys","year":"2015","title":"Colorizer: Smart Glasses Aid for the Colorblind","authors":"Andrei Popleteev, Nicolas Louveton, Rod McCall","author_ids":"1808655, 3102091, 1799513","abstract":"We present a smart glasses application for helping colorblind people to distinguish problematic colors in daily life. The prototype processes a live video stream from the mobile camera, remaps colors according to the user needs, and displays the augmented result. Color transformation ensures high contrast between colors which are otherwise indistinguishable for the user.","cites":"1","conferencePercentile":"67.85714286"},{"venue":"WearSys@MobiSys","id":"c2e2e8180787e2ad53a3231fc2590515ef755dec","venue_1":"WearSys@MobiSys","year":"2015","title":"Prototyping Wearables for Supporting Cognitive Mapping by the Blind: Lessons from Co-Creation Workshops","authors":"Wallace Ugulino, Hugo Fuks","author_ids":"2543577, 7328178","abstract":"This paper describes the co-creation workshops we carried out with three groups composed of blind users, mobility instructors, designers, and computer engineering students. The wearables prototyped by these groups combine verbalized warnings with haptic and audio feedback aiming at supporting blind persons in the task of identifying landmarks. The identification of landmarks is an essential skill required for the cognitive mapping and spatial representation. Since 2013 we have been worked on the investigation of wearables for supporting landmark identification and, thus, the cognitive mapping by the blind. The prototypes we describe in this paper were used in 82 trials in 2 empirical studies and are now being replicated for supporting mobility-training sessions.","cites":"1","conferencePercentile":"67.85714286"},{"venue":"WearSys@MobiSys","id":"4c95ae9588c20dcaae076989bd1487490bfacd25","venue_1":"WearSys@MobiSys","year":"2015","title":"Real-Time Calibration of a Human Thermal Model with Solar Radiation Using Wearable Sensors","authors":"Takashi Hamatani, Akira Uchiyama, Teruo Higashino","author_ids":"3180585, 2610505, 1692953","abstract":"In this paper, we propose a non-invasive method to estimate core temperature based on a human thermal model considering individual differences using a wrist-watch wearable sensor. The method employs the two-node model to simulate the change of core and skin temperature by calculating heat exchange between core, skin and environment and heat production in the body. The method determines the optimal parameter set representing individual thermoregulation function and physical feature through exhaustive simulation based on monitored skin temperature, ambient temperature and humidity, and heart rate.\n We have evaluated our method through totally 94 hours of real experiments. The results show that our method improves the accuracy by 12% at most compared to the default individual parameter set.","cites":"1","conferencePercentile":"67.85714286"},{"venue":"WearSys@MobiSys","id":"607b3d6dfb6e35277ca57aecef524e4c1ff534d0","venue_1":"WearSys@MobiSys","year":"2015","title":"Wearable Inertial Sensor for Jump Performance Analysis","authors":"Bojan Milosevic, Elisabetta Farella","author_ids":"1775655, 1777488","abstract":"Wearable devices enable the unobtrusive sensing of a wide range of human activities and the development of innovative applications. While the consumer market is pushing them particularly as activity or heart rate trackers, their adoption in healthcare is still restricted to few cases, primarily due to their limited accuracy and reliability. An interesting field of application is the jump performance assessment. It is frequently used by therapists to estimate neuromuscular imbalances, since it helps to monitor training progress in athletes or injured patients. Measurements are typically captured with accurate but expensive instrumentation (e.g. force plates). In this work, we propose the use of a versatile low-cost wearable device equipped with inertial sensors for the evaluation of jump height, which can be easily employed at home. We consider two categories of jumps, the counter-movement jump (a single vertical jump) and the plyometric jump (the fast repetition of 4 jumps). The proposed approach, after an initialization phase, uses gyroscope data to continuously track the orientation of the device and align it with the vertical plane and the accelerometer data to estimate the jump trajectory. To validate the system, we collected 200 jumps performed with our device and the Myotest and we observed a mean difference of 0.7 cm (max. 1.9 cm) for the counter-movement jumps and 0.6 (max. 2.1 cm) for the plyometric jumps.","cites":"0","conferencePercentile":"28.57142857"},{"venue":"WearSys@MobiSys","id":"48683ba0a58411bb33b941f3edc65ad230cb17fb","venue_1":"WearSys@MobiSys","year":"2015","title":"Smartphone Usage Restriction During Crossing Roads and Railways","authors":"Tsubasa Saeki, Kaori Fujinami","author_ids":"2664178, 2272050","abstract":"In late years, a number of people walk carelessly while continuing watching a smartphone screen, which often causes fatal accidents. In this poster abstract, we propose a system to restrain smartphone usage at the time of crossing road and railroad based on the combination of the present and past location of a pedestrian, walking direction and walking speed by means of smartphone-mounted sensors. A geographical database that includes roads and railway information is also combined. We achieved a recall of 0.75 against the judgment of ``crossing'' situation.","cites":"0","conferencePercentile":"28.57142857"},{"venue":"WearSys@MobiSys","id":"f72a2a0516168d880120127cec09d0c231f10e1c","venue_1":"WearSys@MobiSys","year":"2015","title":"Feasibility Analysis for Estimation of Blood Pressure and Heart Rate using A Smart Eye Wear","authors":"Nasimuddin Ahmed, Rohan Banerjee, Avik Ghose, Arijit Sinharay","author_ids":"1927438, 3216424, 1919875, 3227190","abstract":"The major issue with hypertension is the fact that it does not have any symptoms also measurements are highly variable in nature. However, high blood pressure has severe effects on a person's health. This poses a requirement for continuous blood pressure monitoring and analysis of people suffering from chronic condition. In this paper we propose PPG based continuous blood pressure and heart rate monitoring system in form factor of a Smart Eye wear. We do a feasibility analysis of the idea and show that it is possible to determine blood pressure and heart rate by sensing PPG from the side of head region (temple) where a spectacle frame would fit. The advantage of Smart Eye Wear over other wearable device is that it provides better contact, minimal motion artifact and maintains uniform pressure without causing any trouble to user.","cites":"0","conferencePercentile":"28.57142857"},{"venue":"WearSys@MobiSys","id":"23ed2b0be32ffd1ea187d45db34ba4c38cc7beba","venue_1":"WearSys@MobiSys","year":"2015","title":"Early Implementation Experience with Wearable Cognitive Assistance Applications","authors":"Zhuo Chen, Lu Jiang, Wenlu Hu, Kiryong Ha, Brandon Amos, Padmanabhan Pillai, Alexander G. Hauptmann, Mahadev Satyanarayanan","author_ids":"4553599, 1697318, 2934512, 1855637, 1773498, 1802347, 7661726, 1747303","abstract":"A cognitive assistance application combines a wearable device such as Google Glass with cloudlet processing to provide step-by-step guidance on a complex task. In this paper, we focus on user assistance for narrow and well-defined tasks that require specialized knowledge and/or skills. We describe proof-of-concept implementations for four different tasks: assembling 2D Lego models, freehand sketching, playing ping-pong, and recommending context-relevant YouTube tutorials. We then reflect on the difficulties we faced in building these applications, and suggest future research that could simplify the creation of similar applications.","cites":"4","conferencePercentile":"92.85714286"},{"venue":"WearSys@MobiSys","id":"0dda7c1af3da132e12f04795b275b7dee99467b1","venue_1":"WearSys@MobiSys","year":"2015","title":"Wearable Sensing Framework for Human Activity Monitoring","authors":"Mostafa Uddin, Ahmed Salem, Ilho Nam, Tamer Nadeem","author_ids":"2902076, 6279618, 1883540, 2459493","abstract":"Wearable computation is getting integrated into our daily life day by day. In this work, we propose a generic framework to continuously monitor users' daily activities. The framework proposes light computation tasks on the wearable device to reduce the amount of data communicated between the wearable, and its host. A 9-axis wristbands are being used to collect user's activities. The collected signals are subject to light weight preprocessing and segmentation on the wearable device prior sending to the host, were it goes through activity detection algorithms. In this paper, we elaborate the feasibility of the proposed framework thru presenting two case studies.","cites":"3","conferencePercentile":"85.71428571"}]}