{"WearSys_16.csv":[{"venue":"WearSys '16","id":"4d6f934cfc0181442db4cb9897a8378381175817","venue_1":"WearSys '16","year":"2016","title":"In-ear Biosignal Recording System: A Wearable For Automatic Whole-night Sleep Staging","authors":"Anh Nguyen, Raghda Alqurashi, Zohreh Raghebi, Farnoush Banaei-kashani, Ann C. Halbower, Thang Dinh, Tam Vu","author_ids":"2947957, 7520605, 7803937, , 3285472, 8188392, 6956703","abstract":"In this work, we present a low-cost and light-weight wearable sensing system that can monitor bioelectrical signals generated by electrically active tissues across the brain, the eyes, and the facial muscles from inside human ears. Our work presents two key aspects of the sensing, which include the construction of electrodes and the extraction of these biosignals using a supervised non-negative matrix factorization learning algorithm. To illustrate the usefulness of the system, we developed an autonomous sleep staging system using the output of our proposed in-ear sensing system. We prototyped the device and evaluated its sleep stage classification performance on 8 participants for a period of 1 month. With 94% accuracy on average, the evaluation results show that our wearable sensing system is promising to monitor brain, eyes, and facial muscle signals with reasonable fidelity from human ear canals.","cites":"2","conferencePercentile":"90"},{"venue":"WearSys '16","id":"23334c7b7860b8e4db873fdeed127a1034173d5c","venue_1":"WearSys '16","year":"2016","title":"DeepSense: A GPU-based Deep Convolutional Neural Network Framework on Commodity Mobile Devices","authors":"Loc Nguyen Huynh, Rajesh Krishna Balan, Youngki Lee","author_ids":"7310032, 1730123, 3693511","abstract":"Recently, a branch of machine learning algorithms called deep learning gained huge attention to boost up accuracy of a variety of sensing applications. However, execution of deep learning algorithm such as convolutional neural network on mobile processor is non-trivial due to intensive computational requirements. In this paper, we present our early design of DeepSense - a mobile GPU-based deep convolutional neural network (CNN) framework. For its design, we first explored the differences between server-class and mobile-class GPUs, and studied effectiveness of various optimization strategies such as branch divergence elimination and memory vectorization. Our results show that DeepSense is able to execute a variety of CNN models for image recognition, object detection and face recognition in soft real time with no or marginal accuracy tradeoffs. Experiments also show that our framework is scalable across multiple devices with different GPU architectures (e.g. Adreno and Mali).","cites":"2","conferencePercentile":"90"}]}