{"WEASELTech_07.csv":[{"venue":"WEASELTech '07","id":"10eb006bedd734cd82a163699d97de9010d2d16d","venue_1":"WEASELTech '07","year":"2007","title":"Experimental evaluation of a lightweight method for augmenting requirements analysis","authors":"Carlos Jensen, Colin Potts","author_ids":"1766473, 7373711","abstract":"We introduce the concept of augmentation methods, methods that complement other methods by addressing specific non-functional requirements (NFRs). Since most projects do not have dedicated expertise in all relevant NFRs most team members may be comparative novices for that class of NFR. STRAP is a lightweight goal-refinement method for analyzing privacy NFRs. We describe it briefly and then present three experiments to assess its effectiveness and that of several existing privacy frameworks. We analyze the results in terms of method efficiency: the number of analysts needed to find a given proportion of benchmark problems. The alternative methods are generally effective in identifying privacy vulnerabilities but they are inefficient, since the average analyst misses many potential problems. In three distinct application domains, STRAP led to equal or better identification of privacy vulnerabilities and was in all cases more efficient. We conclude that a combination of lightweight structuring and heuristic appropriateness is the reason for these advantages.","cites":"1","conferencePercentile":"31.81818182"},{"venue":"WEASELTech '07","id":"f1d38cac5a86865e2d67a2d9bf9dde2e71573ac1","venue_1":"WEASELTech '07","year":"2007","title":"Practical experiments are informative, but never perfect","authors":"Rosalva E. Gallardo-Valencia, Vivian Olivera, Susan Elliott Sim","author_ids":"2378192, , 1705823","abstract":"The design of empirical experiments involves making design decisions to trade off what is ideal against what is achievable. Researchers must weigh limitations on resources, metrics, and the current state of knowledge, against the validity of the results. In this paper, we report on the design decisions we made in a small controlled experiment and their effects on the conclusions of the study. The goal of the study was to measure the impact of requirements formats on maintenance tasks. We encountered problems with the subjects' lack of expertise in the technology used, the equivalence of subjects in our experiment conditions, and the number of subjects. These issues meant that we were able to draw conclusions about how subjects worked with the requirements formats, but not about the effect of the formats on the completeness of the implementation. We had a practical and doable experiment, but our results were not conclusive, only informative.","cites":"0","conferencePercentile":"13.63636364"},{"venue":"WEASELTech '07","id":"69eaaa4836e6dd9be7817dc5a0c0fd2726890eb8","venue_1":"WEASELTech '07","year":"2007","title":"Case study, interrupted: the paucity of subject systems that span the requirements-architecture gap","authors":"Mamadou H. Diallo, Susan Elliott Sim, Thomas A. Alspaugh","author_ids":"2274755, 1705823, 2345411","abstract":"A number of approaches for spanning the requirements-architecture gap have been published in recent years, and we sought to rigorously characterize the gap and to conduct a comparative evaluation of approaches to span the gap using a case study method on a realistic problem. However, our intentions were impeded by the problem of finding appropriate subject systems that included sufficient information in both requirements and architecture document. Most subject systems that we found contained either detailed requirements or detailed architecture description, but not both. In this paper, we report on our search and the seventeen most suitable subject systems with the hope of aiding others undertaking a similar study. We speculate on the reasons for the paucity of suitable subject systems and invite contributions and suggestions for our ongoing work.","cites":"3","conferencePercentile":"54.54545455"},{"venue":"WEASELTech '07","id":"1512f29bd5a52a532f6f5f36dc9fb7c1eea884bd","venue_1":"WEASELTech '07","year":"2007","title":"Toward a task model of concurrent software maintenance","authors":"Scott D. Fleming, R. E. K. Stirewalt, Eileen Kraemer","author_ids":"2676392, 2145865, 2313440","abstract":"This paper describes a first step toward developing a methodology for the maintenance of concurrent software that incorporates best practices in design and verification. Specifically, we describe our plan for using the think-aloud method to study the strategies, goals, and intentions of contemporary practitioners engaged in the maintenance of concurrent software. The method will yield a task model that details the specific tasks practitioners undertake while so engaged. Initially, we will conduct the study with graduate students in a formal-methods course at Michigan State University.","cites":"0","conferencePercentile":"13.63636364"}]}