{"Weaving_Services_and_People_on_":[{"venue":"Weaving Services and People on the World Wide Web","id":"2debed5897f4a511fb7226a88563f4e73f01105f","venue_1":"Weaving Services and People on the World Wide Web","year":"2008","title":"Personalized Service Creation and Provision for the Mobile Web","authors":"Quan Z. Sheng, Jian Yu, José M. del Álamo, Paolo Falcarin","author_ids":"1713128, 1740321, 2015658, 2816308","abstract":"The convergence of telecom networks and the Internet is fostering the emergence of environments where Web services are available to mobile users. The variability in computing resources, display terminal, and communication channel require intelligent support on personalized delivery of relevant data and services to mobile users. Personalized service provisioning presents several research challenges on context information management, service creation, and inherent limitations of mobile devices. In this chapter, we describe a novel framework that supports weaving context information and services for personalized service creation and execution. By leveraging technologies on Web services, agents, and publish/subscribe systems, our framework enables an effective, user-centric access of integrated services over the mobile Web environments. This chapter overviews the design, architecture , and implementation of the framework. 1 2 Sheng et al.","cites":"1","conferencePercentile":"16.66666667"},{"venue":"Weaving Services and People on the World Wide Web","id":"8521e12415fcb32caff8cb674508c1b064b64c70","venue_1":"Weaving Services and People on the World Wide Web","year":"2008","title":"Context-based Semantic Mediation in Web Service Communities","authors":"Michael Mrissa, Stefan Dietze, Philippe Thiran, Chirine Ghedira, Djamal Benslimane, Zakaria Maamar","author_ids":"2103409, 3081683, 2592801, 2264824, 1689640, 1724195","abstract":"Communities gather Web services that provide a common functionality, acting as an intermediate layer between end users and Web services. On the one hand, they provide a single endpoint that handles user requests and transparently selects and invokes Web services, thus abstracting the selection task and leveraging the provided quality of service level. On the other hand, they maximize the visibility and use rate of Web services. However, data exchanges that take place between Web services and the community endpoint raise several issues, in particular due to semantic heterogeneities of data. Specific mediation mechanisms are required to adapt data operated by Web services to those of the community. Hence, mediation facil-ititates interoperability and reduces the level of difficulty for Web services to join and interact with communities. In this chapter, we propose a mediation approach that builds on 1) context-based semantic representation for Web services and the 1 2 Mrissa et al. community; and 2) mediation mechanisms to resolve the semantic heterogeneities occuring during data exchanges. We validate our solution through some experiments as part of the WSMO framework over a test community and show the limitations of our approach.","cites":"5","conferencePercentile":"66.66666667"}]}