{"Web-KRMCIKM.csv":[{"venue":"Web-KRM@CIKM","id":"3fc115438c3e9113ce4062c58188223b58e78137","venue_1":"Web-KRM@CIKM","year":"2012","title":"Efficient mining of correlated sequential patterns based on null hypothesis","authors":"Cindy Xide Lin, Ming Ji, Marina Danilevsky, Jiawei Han","author_ids":"2651864, 1712945, 1994333, 1722175","abstract":"Frequent pattern mining has been a widely studied topic in the research area of data mining for more than a decade. However, pattern mining with real data sets is complicated - a huge number of co-occurrence patterns are usually generated, a majority of which are either redundant or uninformative. The true correlation relationships among data objects are buried deep among a large pile of useless information. To overcome this difficulty, mining correlations has been recognized as an important data mining task for its many advantages over mining frequent patterns.\n In this paper, we formally propose and define the task of mining <i>frequent correlated sequential patterns</i> from a sequential database. With this aim in mind, we re-examine various interestingness measures to select the appropriate one(s), which can disclose succinct relationships of sequential patterns. We then propose <i>PSBSpan</i>, an efficient mining algorithm based on the framework of the pattern-growth methodology which mines frequent correlated sequential patterns. Our experimental study on real datasets shows that our algorithm has outstanding performance in terms of both efficiency and effectiveness.","cites":"3","conferencePercentile":"66.66666667"},{"venue":"Web-KRM@CIKM","id":"049b2c21b4ac3fd4b45df71880148e454f9016d1","venue_1":"Web-KRM@CIKM","year":"2014","title":"Structure Learning of Bayesian Network with Latent Variables by Weight-Induced Refinement","authors":"Chao He, Kun Yue, Hao Wu, Weiyi Liu","author_ids":"4935551, 3137031, 1739602, 8665888","abstract":"Bayesian network (BN) with latent variables (LVs) provides a concise and straightforward framework for representing and inferring uncertain knowledge with unobservable variables or with regard to missing data. To learn the BN with LVs consistently with the realistic situations, we propose the information theory based concept of existence weight and incorporate it into the clique-based learning method. In line with the challenges when learning BN with LVs, we focus on determining the number of LVs, and determining the relationships between LVs and the observed variables. First, we define the existence weight and propose the algorithms for finding the &#949;-cliques from the BN without LVs learned from data. Then, we introduce the LV to each &#949;-clique and adjust the BN structure with LVs. Further, we adjust the value of parameter &#949; to determine the number of LVs. Experimental results show the feasibility of our method.","cites":"2","conferencePercentile":"70.83333333"}]}