{"Web-Powered_Databases.csv":[{"venue":"Web-Powered Databases","id":"cda41f800867c5d71e04ba73a5328066213aa837","venue_1":"Web-Powered Databases","year":"2003","title":"Ubiquitous Access to Web Databases","authors":"Athman Bouguettaya, Brahim Medjahed, Mourad Ouzzani, Yao Meng","author_ids":"1705708, 3315690, 2168047, 1803963","abstract":"INTRODUCTION The Web is emerging as the de facto medium for conducting all types of economic, political, and social activities. Nowadays, organizations publish data in various Web information sources (e.g., databases, HTML and XML repositories) without referring to any central control. Publishing information on the Web is no longer a major issue. However, accessing Web databases in a uniform and efficient way is still a research goal. In general, Web users are novice. They are not expected to have experience dealing with databases or knowledgeable about all available databases. In this respect, requiring users to keep track of information such as locations, formats (or structures), content, and query languages of the growing number of Web databases is unreasonable. There is a need to provide across the board transparency to allow users to access and manipulate data irrespective of platforms, locations, systems, etc. Users must be provided with tools for the effective and efficient exploration of such systems. The challenge is to build an infrastructure that can support flexible tools for information space organization, communication facilities, information discovery, content description, and assembly of data from heterogeneous sources. Old techniques for manipulating these sources are not appropriate and efficient for Internet/Web-based databases. In this context, we distinguish the following key issues when dealing with Web databases: • Discovering relevant information sources in a very large and dynamic information space. • Understanding the meaning, content, and patterns of use of the available information sources. Users have a need to be incrementally educated about the information space. • Accessing located sources and querying them for relevant information items. To address the aforementioned issues, we developed the WebFINDIT system. WebFINDIT builds a scalable and uniform infrastructure for locating and accessing heterogeneous and autonomous databases in large and dynamic environments. One key feature of our proposed approach is the clustering of Web databases into distributed ontologies. An ontology provides an abstraction of a specific domain of information interest. For example, databases related to medical research would belong to the ontology called Research. The same database may belong to as many ontologies as it desires based on its own information interests. To deal with the dynamic nature of the Web information space, databases may join and leave ontologies at their own discretion. The main advantage of the proposed ontological organization is filtering interactions and reducing the overhead of locating information. Moreover, ontologies and databases are linked through …","cites":"0","conferencePercentile":"75"}]}