{"WEB.csv":[{"venue":"WEB","id":"c8f0e19fc2efbf4f5b75b745478db57c2163a572","venue_1":"WEB","year":"2009","title":"Analyzing Processes behind Web Service Standards Development","authors":"Karthikeyan Umapathy, Sandeep Purao, John W. Bagby","author_ids":"3220155, 1715722, 2143083","abstract":"Anticipatory standards such as Web service standards are artifacts 'designed' by consortium-based standards development organizations. Intricate processes followed to develop anticipatory standards are not well-understood. Recently, the D-S-N model was developed to explain these processes, and suggested that these processes contain cycles of design (D), sense-making (S), and negotiation (N) activities. In this paper, we provide an initial report of a case study that empirically analyzes archival documents of SOAP standard development. Our findings reveal that the D-S-N model is applicable to the Web service standardization process followed at W3C but this model provides only partial explanation of the process, and that design and sense-making are the core activities of the process. Our findings also show that participants spent most of their time discussing technical issues and identifying action items to be performed, large organizations dominated the process, and negotiation is the least frequent activity.","cites":"2","conferencePercentile":"75"},{"venue":"WEB","id":"0eb50b8f35f7570be27116f0185ca410b5a50f2b","venue_1":"WEB","year":"2009","title":"Distinct Impact of Information Access Patterns on Supplier's Non-contractible Investments and Adaptation for Supply Chain Agility","authors":"Jeffrey C. F. Tai, Eric T. G. Wang, Hersen Doong, Kai Wang","author_ids":"1770544, 1768942, 1691261, 3751236","abstract":"This study explores how distinct information access patterns affect a supplier's supply chain agility. A supplier's specific investments for IT-enabled supply chain coordination and relational adaptation in supply chain operations are identified as the technical and behavioral antecedents to its supply chain agility. Because both are non-contractible elements in formal contracts and complementary to buyer's supply chain coordination information and buyer's specific investments in monitoring and control, either buyer or supplier may hold up their counterpart based on their own information assets. Therefore, this study draws on the theory of incomplete contracts and suggests that both buyer and supplier need to make their idiosyncratic information assets alienable and accessible to their counterpart so that the rent-seeking problem can be alleviated and the supplier's investment and adaptation incentives improved. This study contributes to the literature by demonstrating that distinct information access patterns can improve a supplier's supply chain agility through the mediation of the non-contractible investments and adaptation made by the supplier.","cites":"0","conferencePercentile":"25"},{"venue":"WEB","id":"9e0d0ce3f5fac322f86b761255c4575df240abcd","venue_1":"WEB","year":"2011","title":"On the Volatility of Online Ratings: An Empirical Study","authors":"Christopher S. Leberknight, Soumya Sen, Mung Chiang","author_ids":"3312609, 1687150, 1683977","abstract":"Many online rating systems represent product quality using metrics such as the mean and the distribution of ratings. However, the mean usually becomes stable as reviews accumulate, and consequently, it does not reflect the trend emerging from the latest user ratings. Additionally, understanding whether any variation in the trend is truly significant requires accounting for the volatility of the product's rating history. Developing better rating aggregation techniques should focus on quantifying the volatility in ratings to weight or discount older ratings. We present a theoretical model based on stock market metrics, known as the Average Rating Volatility (ARV), which captures the fluctuation present in these ratings. Next, ARV is mapped to the discounting factor for weighting (aging) past ratings and used as the coefficient in Brown's Simple Exponential Smoothing to produce an aggregate mean rating. This proposed method represents the \" true \" quality of a product more accurately because it accounts for both volatility and trend in the product's rating history. Empirical findings on rating volatility for several product categories using data from Amazon further motivate the need for the proposed methodology.","cites":"6","conferencePercentile":"100"}]}