{"Web2SE_11.csv":[{"venue":"Web2SE '11","id":"1f07de7e6dd7fa992aa8d6caca62e2a7cbbf671c","venue_1":"Web2SE '11","year":"2011","title":"Measuring API documentation on the web","authors":"Chris Parnin, Christoph Treude","author_ids":"1765101, 1685418","abstract":"Software development blogs, developer forums and Q&#38;A websites are changing the way software is documented. With these tools, developers can create and communicate knowledge and experiences without relying on a central authority to provide official documentation. Instead, any content created by a developer is just a web search away. To understand whether documentation via social media can replace or augment more traditional forms of documentation, we study the extent to which the methods of one particular API - jQuery - are documented on the Web. We analyze 1,730 search results and show that software development blogs in particular cover 87.9% of the API methods, mainly featuring tutorials and personal experiences about using the methods. Further, this effort is shared by a large group of developers contributing just a few blog posts. Our findings indicate that social media is more than a niche in software documentation, that it can provide high levels of coverage and that it gives readers a chance to engage with authors.","cites":"33","conferencePercentile":"100"},{"venue":"Web2SE '11","id":"03496d55101a05f4586f58a94dc35e902190f7bc","venue_1":"Web2SE '11","year":"2011","title":"Supporting the cooperation of end-user programmers through social development environments","authors":"Leif Singer, Kurt Schneider","author_ids":"1823705, 1724127","abstract":"Many programs are being created by end-users without formal training in programming. Spreadsheets are the most popular environment for this, but mashups which combine public services into new, albeit small applications are also becoming more and more popular. Research shows that end-user programmers make potentially costly mistakes. Yet initiatives that aim at bringing software engineering principles to end-users are still rudimentary. In particular, we see much unused potential in approaches that foster and support the cooperation among end-user programmers. Whereas the application of mechanisms from social software to software engineering problems is gaining traction, this has not yet been investigated sufficiently for end-user software engineering.\n This paper discusses how insights from Communities of Practice research may be implemented using mechanisms from recent developments in social software. From the implementation of the presented social mechanisms, we expect an improvement in cooperation and mutual help in communities of end-user programmers. We plan to combine this approach with lightweight variations of software engineering methods targeted at end-user programmers. This should lead to higher quality in the programs developed by these end-users, as good practices are more likely to spread.","cites":"3","conferencePercentile":"50"},{"venue":"Web2SE '11","id":"f22d3496f5ad6297f2843c0aed7e409dac83d2e6","venue_1":"Web2SE '11","year":"2011","title":"Towards understanding twitter use in software engineering: preliminary findings, ongoing challenges and future questions","authors":"Gargi Bougie, Jamie Starke, Margaret-Anne Storey, Daniel M. German","author_ids":"3299734, 3286826, 1734938, 3645859","abstract":"There has been some research conducted around the motivation for the use of Twitter and the value brought by micro-blogging tools to individuals and business environments. This paper builds on our understanding of how the phenomenon affects the population which birthed the technology: Software Engineers. We find that the Software Engineering community extensively leverages Twitter's capabilities for conversation and information sharing and that use of the tool is notably different between distinct Software Engineering groups. Our work exposes topics for future research and outlines some of the challenges in exploring this type of data.","cites":"21","conferencePercentile":"83.33333333"}]}