{"Web2SE_10.csv":[{"venue":"Web2SE '10","id":"340ff37b738cebf2d466d30ca54badcabfb71fb3","venue_1":"Web2SE '10","year":"2010","title":"Mashup environments in software engineering","authors":"Lars Grammel, Christoph Treude, Margaret-Anne Storey","author_ids":"1683778, 1685418, 1734938","abstract":"Too often, software engineering (SE) tool research is focused on creating small, stand-alone tools that address rarely understood developer needs. We believe that research should instead provide developers with flexible environments and interoperable tools, and then study how developers appropriate and tailor these tools in practice. Although there has been some prior work on this, we feel that flexible tool environments for SE have not yet been fully explored. In particular, we propose adopting the Web 2.0 idea of mashups and mashup environments to support SE practitioners in analytic activities involving multiple information sources.","cites":"8","conferencePercentile":"71.42857143"},{"venue":"Web2SE '10","id":"92e4217caaa9707cc611084e60fd55a7f1925727","venue_1":"Web2SE '10","year":"2010","title":"Keeping up with your friends: function Foo, library Bar.DLL, and work item 24","authors":"Andrew Begel, Thomas Zimmermann","author_ids":"1776779, 1776543","abstract":"Development teams who work with others need to be aware of what everyone is doing in order to manage the risk of taking on dependencies. Using newsfeeds of software development activities mined from software repositories, teams can find relevant information to help them make well-informed decisions that affect the success of their endeavors. In this paper, we describe the architecture of a newsfeed system that we are currently building on top of the Codebook software repository mining platform. We discuss the design, construction and aggregation of newsfeeds, and include other important aspects such as summarization, filtering, context, and privacy.","cites":"15","conferencePercentile":"100"},{"venue":"Web2SE '10","id":"d622532c7f81863981e5b627811eda921eff3d2b","venue_1":"Web2SE '10","year":"2010","title":"The implications of how we tag software artifacts: exploring different schemata and metadata for tags","authors":"Christoph Treude, Margaret-Anne Storey","author_ids":"1685418, 1734938","abstract":"Social tagging has been adopted by software developers in various contexts from source code to work items and build definitions. While the success of tagging is usually attributed to the simplicity of tags, the implementation details of tagging systems vary significantly in terms of metadata, schemata and semantics. In this position paper, we argue that academia and industry should be aware of these differences and that we should start to examine their implications.","cites":"4","conferencePercentile":"14.28571429"}]}