{"Web3D.csv":[{"venue":"Web3D","id":"02e0a9356350283d63c12e8f13a0a04090facb18","venue_1":"Web3D","year":"2000","title":"Evolutionary co-operative design between human and computer: implementation of ``the genetic sculpture park''","authors":"Duncan Rowland, Frank Biocca","author_ids":"3157789, 2815587","abstract":"The Genetic Sculpture Park seeks to blur the distinction between artist and observer and to empower the novice in the creation of complex computer graphic models. Each visitor to the park experiences a unique set of forms and engages in a co-operative dialogue with the computer to produce more aesthetically pleasing designs. Inspired by Darwin's Theory of Evolution, Genetic Algorithms are used to allow visitors to 'breed' forms tailored to his or her own individual sense of aesthetics. This paper recounts investigations into evolutionary design methodologies (&#8220;3D Head Models&#8221;) and describes their implementation in an interactive Java/VRML world.","cites":"3","conferencePercentile":"15"},{"venue":"Web3D","id":"c22ccd9a5977b7986fbe319629a2ee0a80827ec7","venue_1":"Web3D","year":"2007","title":"Interactive walkthrough of large 3D models of buildings on mobile devices","authors":"Alessandro Mulloni, Daniele Nadalutti, Luca Chittaro","author_ids":"1805219, 2598911, 1692716","abstract":"Interactive visualization of large 3D architectural models on mobile devices such as PDAs would significantly benefit applications such as indoor navigators and mobile tourist guides, on-site monitoring and annotation of architectural designs at construction sites, evacuation training and evacuation guidance.\n Although PDAs are becoming more powerful and a few are even equipped with 3D hardware accelerators, their performance does not yet allow to handle a large architectural model at an acceptable frame rate. To face this problem, we propose and experiment a system that exploits hierarchical view frustum culling and portal culling for interactively visualizing 3D architectural models on mobile devices. We also discuss the performance of the system and its integration with our mobile X3D player (MobiX3D). The performance of the system has been evaluated on a large three-floor building with 39 rooms, 42 stairs and 42 doors.","cites":"8","conferencePercentile":"87.93103448"},{"venue":"Web3D","id":"0bcb402c8a1a6c293a5efe197941a1db8febb46e","venue_1":"Web3D","year":"2000","title":"Special panel session on multi-user virtual environments (panel session) (abstract only)","authors":"Chris Greenhalgh, Michael V. Capps","author_ids":"1714469, 1736456","abstract":"This paper is a personal reflection on the different communities that are contributing to the design and implementation of multi-user virtual world systems. Given the Web3D Consortium's considered re-labeling from &#8220;VRML&#8221; to &#8220;Web3D&#8221; this seems an ideal opportunity to take stock of some of the interests which have historically fallen at the edge of (or outside the scope of) specifically VRML activity. I discuss a number of distinct communities which have been developing characteristic multi-user 3D technologies: Internet virtual worlds (including VRML); distributed simulation; games; visualization; and &#8220;pure&#8221; multi-user VR research. In each case I will suggest the primary concerns and goals of each, as well as sketching out a little of their respective backgrounds. I then suggest a taxonomy of approaches to multi-user virtual reality, which can inform reflection and future work, and consider the extent to which these communities may be converging. Finally I make some suggestions for next steps in VRML multi-user support. It is my hope that this paper will give the reader an entry point into some of these related communities, and will facilitate the establishment of new synergies within the community at large.","cites":"0","conferencePercentile":"5"},{"venue":"Web3D","id":"b926c54ae168915b3ef189b6d1070eaf3fef1e64","venue_1":"Web3D","year":"2010","title":"Visualization methods for molecular studies on the web platform","authors":"Marco Callieri, Raluca Mihaela Andrei, Marco Di Benedetto, Monica Zoppè, Roberto Scopigno","author_ids":"1787254, 1770495, 2274666, 1780792, 7980724","abstract":"This work presents a technical solution for the creation of visualization schemes for biological data on the web platform. The proposed technology tries to overcome the standard approach of molecular/biochemical visualization tools, which generally provide a fixed set of visualization methods. This goal is reached by exploiting the capabilities of the WebGL API and the high level objects of the SpiderGL library, these features will give the users the possibility to implement an arbitrary visualization scheme, while keeping simple the implementation process. To better explain the philosophy and capabilities of this technology, we will describe the implementation of the web version of a specific visualization method, demonstrating how it can deal with both the requirements of scientific rigor in manipulating the data and the necessity to produce flexible and appealing rendering styles.","cites":"16","conferencePercentile":"90"},{"venue":"Web3D","id":"7e66fada84dae711405dc9dc9bfcad45a5afddee","venue_1":"Web3D","year":"2000","title":"Real-time animation and motion capture in Web human director (WHD)","authors":"Christian Babski, Daniel Thalmann","author_ids":"2533361, 1689760","abstract":"Motion capture systems usually work in conjunction with complex 3D applications, such as 3D Studio Max by Kinetix or Maya by Alias/Wavefront. Once models have been created in these applications, motion capture systems provide the necessary data input to animate these models. The context of this paper introduces a simple motion capture system, which is integrated into a web-based application, thus allowing HANIM humanoids to be animated using VRML and JAVA. Since Web browser/VRML plugin context is commonly available on computers, the presented motion capture application is easy to use on any platform. Taking benefit of a standard language as VRML makes the exploitation of produced animation easier than other commercial application with their specific formats.","cites":"16","conferencePercentile":"80"},{"venue":"Web3D","id":"c45b0effc08f87d5077e029c2f5ccbaf118c8cbc","venue_1":"Web3D","year":"2014","title":"Using linked data for interactive 3D web content integration","authors":"Xiaoyu Zhang, Denis Gracanin, Kresimir Matkovic","author_ids":"1791962, 1709677, 1715967","abstract":"The recent advances in Web and mobile technology broke exciting new possibilities for virtual reality (VR) on the Web. Authoring and sharing of 3D content is becoming a very important activity. Associating semantics with the 3D web content facilitates automatic, machine interpretation of 3D information. In order to support such an integration, we created an ontology to abstract the semantic knowledge in the virtual environments. Based on the ontology we propose to use Linked Data for content publishing. Linked Data helps the content integrator to recognize the object and infer more knowledge from the data. We use JSON-LD, a Linked Data implementation, to demonstrate the usefulness of the newly proposed approach.","cites":"0","conferencePercentile":"20"},{"venue":"Web3D","id":"0db2becb4ff530966189d779db26377e0534c80b","venue_1":"Web3D","year":"2000","title":"Under the hood of GeoVRML 1.0","authors":"Martin Reddy, Lee Iverson, Yvan G. Leclerc","author_ids":"3176567, 1700290, 2155634","abstract":"GeoVRML 1.0 provides geoscientists with a rich suite of enabling capabilities that cannot be found elsewhere. That is, the ability to model dynamic 3-D geographic data that can be distributed over the web and interactively visualized using a standard browser configuration. GeoVRML includes nodes for VRML97 that perform this task; addressing issues such as coordinate systems, scalability, animation, accuracy, and preservation of the original geographic data. The implementation is released as open source and includes various tools for generating GeoVRML data. All these facilities provide geoscientists with an excellent medium to present complex 3-D geographic data in a dynamic, interactive, and web-accessible format. We illustrate these capabilities using real-world examples drawn from diverse application areas.","cites":"25","conferencePercentile":"97.5"},{"venue":"Web3D","id":"7d16b8a3426c72570fe96d75ed7c5ef34cd90db9","venue_1":"Web3D","year":"2008","title":"Adapting X3D for multi-touch environments","authors":"Yvonne Jung, Jens Keil, Johannes Behr, Sabine Webel, Michael Zöllner, Timo Engelke, Harald Wuest, Mario Becker","author_ids":"1680577, 1741600, 1694015, 1770796, 3247907, 2165480, 3189365, 3274650","abstract":"Multi-touch interaction on tabletop displays is a very active field of todays HCI research. However, most publications still focus on tracking techniques or develop a gesture configuration for a specific application setup. Very few explore generic high level interfaces for multi-touch applications. In this paper we present a comprehensive hardware and software setup, which includes an X3D based layer to simplify the application development process.\n We present a robust FTIR based optical tracking system, examine in how far current sensor and navigation abstractions in the X3D standard are useful and finally present extensions to the standard, which enable designers and other non-programmers to develop multi-touch applications very efficiently.","cites":"8","conferencePercentile":"85.29411765"},{"venue":"Web3D","id":"5a9b637b630d2547e2da1b2589a116b30b06f92c","venue_1":"Web3D","year":"2013","title":"A data-efficient collaborative modelling method using websockets and the BlobTree for over-the air networks","authors":"Herbert Grasberger, Pourya Shirazian, Brian Wyvill, Saul Greenberg","author_ids":"3065891, 2622065, 8541842, 1696942","abstract":"Collaborative modelling has become more important in the last few years, especially now that mobile devices show processing power to support 3D modelling in real-time. Current mobile networks, such as 3G and LTE, unfortunately are not as fast as traditional wired internet and have higher latency.\n The problem with collaborative modelling using triangle meshes is that complex models are slow to synchronize and require large network resources depending on the amount of data needed to update a model. Synchronizing thousands of triangles over the network between all participating users can introduce substantial lag between the transactions, especially on over-the air networks, making fine grained and rapid updates at interactive rates hard to achieve.\n In contrast the <i>BlobTree</i> is based on combining skeletal primitives and sketched-shapes using standard CSG and various blending operators. Using this methodology complex models can be encoded with a smaller memory footprint than mesh based systems, thus allowing for less traffic across a network to synchronize two or more workstations with one model. As a result fine grained and rapid updates are possible, improving the visual communication between all participating users.","cites":"4","conferencePercentile":"80"},{"venue":"Web3D","id":"ca514920d5e0500144b5b77b170aac534c9b0de4","venue_1":"Web3D","year":"2010","title":"SpiderGL: a JavaScript 3D graphics library for next-generation WWW","authors":"Marco Di Benedetto, Federico Ponchio, Fabio Ganovelli, Roberto Scopigno","author_ids":"2274666, 1729580, 1731043, 7980724","abstract":"Thanks to the WebGL graphics API specification for the JavaScript programming language, the possibility of using the GPU capabilities in a web browser without the need for an ad-hoc plug-in is now coming true. This paper introduces SpiderGL, a JavaScript library for developing 3D graphics web applications. SpiderGL provides data structures and algorithms to ease the use of WebGL, to define and manipulate shapes, to import 3D models in various formats, to handle asynchronous data loading. We show the potential of this novel library with a number of demo applications. Furthermore, we introduce MeShade, a SpiderGL-based web application for shader material editing from within the web browser, which produces all the code needed for embedding interactive 3D model visualization capabilities inside web pages and online repositories.","cites":"32","conferencePercentile":"95"},{"venue":"Web3D","id":"ea5a3e378ad5d0fb964444f1c9df02ff63900b74","venue_1":"Web3D","year":"2003","title":"VRML97 distributed authoring interface","authors":"Stéphane Louis Dit Picard, Samuel Degrande, Christophe Gransart, Christophe Chaillou, Grégory Saugis","author_ids":"1886612, 2240151, 1761609, 1774410, 2858901","abstract":"In this paper, we present the design and implementation of the VRML97 Distributed Authoring Interface (DAI) introduced in Spin-3D, a distributed Collaborative Virtual Environment (CVE). Our proposal is a powerful interface, very close to the classical VRML97 External Authoring Interface (EAI). The DAI allows the connection of any external application with the Spin-3D CVE platform. With the Spin-3D CVE platform and the DAI, it will be easy to develop collaborative applications. We use the Common Object Request Broker Architecture (CORBA) to support distributed authoring applications. Complex collaborative applications and remote interaction introduce new considerations in the design of the DAI: we enhance the standard VRML97 EAI with new interfaces in order to easily traverse the VRML97 scene graph and limit the network overhead introduced by the remote interaction. Moreover, taking advantage of the CORBA middleware, external applications can be written with any programming language for which the OMG de ned an IDL mapping.","cites":"2","conferencePercentile":"28.84615385"},{"venue":"Web3D","id":"66fb27d6f22ae1b1e3ade3ae33187bd9b0dc536b","venue_1":"Web3D","year":"2012","title":"3DNSITE: a networked interactive 3D visualization system to simplify location awareness in crisis management","authors":"Giovanni Pintore, Enrico Gobbetti, Fabio Ganovelli, Paolo Brivio","author_ids":"1778838, 1708999, 1731043, 2868319","abstract":"We report on the 3DNSITE system, a web-based client-server 3D visualization tool for streaming and visualizing large tridimensional hybrid data (georeferenced point clouds and photographs with associated viewpoints and camera parameters). The system is motivated by the need to simplify data acquisition and location recognition for crisis managers and first responders during emergency operations or training sessions. In this peculiar context, it is very important to easily share 3D environment data among people in a distributed environment, accessing huge 3D models with embedded photographs on devices with heterogenous hardware capabilities and interconnected on different network types. Moreover, since the specific end-users are not necessary skilled with virtual reality and 3D objects interaction, the navigation interface must be simple and intuitive. Taking into account these constraints, we propose a mixel object-based/image-based system, which enhances the current state-of-the-art by exploiting a multi-resolution representation for the 3D model and a multi-level cache system for both the images and 3D models structure. A novel low-degree-of-freedom user interface is presented to navigate in the scenario with touchscreen devices. The proposed implementation, included in a more general training and decision framework for emergency operations, is evaluated on real-world datasets.","cites":"4","conferencePercentile":"71.21212121"},{"venue":"Web3D","id":"7522f038883dee03fd3c84854a94d8c35e61d43a","venue_1":"Web3D","year":"2000","title":"Three-dimensional Beans - creating Web content using 3D components in a 3D authoring environment","authors":"Ralf Dörner, Paul Grimm","author_ids":"8360122, 2442906","abstract":"This paper deals with the question how the component idea can be transferred to the authoring of 3D content for the WWW. The concept of 3D Beans and their according authoring environment is presented. In addition, an implementation of this concept using Java3D and Java Beans is described. Advantages of the concept are discussed and illustrated with an application example from the area of computer-based training. Major advantages of the 3D Beans concept are on the one hand that 3D content can be created in a virtual environment more directly and efficiently using pre-fabricated components that fit together. Especially, as the author is supported by a Bean authoring environment that itself uses information from the 3D Beans. On the other hand, a 3D authoring environment offers more degrees of freedom for authoring component-based applications.\n/0","cites":"15","conferencePercentile":"75"},{"venue":"Web3D","id":"36d3f77d3c1c1f483b9155179162bc06112fc2e5","venue_1":"Web3D","year":"2011","title":"Cross-media agent platform","authors":"Radoslaw Niewiadomski, Mohammad Obaid, Elisabetta Bevacqua, Julian Looser, Le Quoc Anh, Catherine Pelachaud","author_ids":"1759118, 1761180, 1772136, 2863606, 2914864, 1703084","abstract":"We have developed a general purpose use and modular architecture of an embodied conversational agent (ECA). Our agent is able to communicate using verbal and nonverbal channels like gaze, facial expressions, and gestures. Our architecture follows the SAIBA framework that sets 3-step process and communication protocols. In our implementation of SAIBA architecture we focus on flexibility and we introduce different levels of the customization. In particular, our system is able to display the same communicative intention with different embodiments, be a virtual agent or a robot. Moreover our framework is independent of the animation player technology. Agent animations can be displayed across different medias, such as web browser, virtual or augmented reality. In this paper we present our agent architecture and its main features.","cites":"10","conferencePercentile":"86.36363636"},{"venue":"Web3D","id":"1270881c3d427bd73570fe9f78d09c46cf3087c5","venue_1":"Web3D","year":"2012","title":"Adaptive quad patches: an adaptive regular structure for web distribution and adaptive rendering of 3D models","authors":"Enrico Gobbetti, Fabio Marton, Marcos Balsa, Fabio Ganovelli, Marco Di Benedetto","author_ids":"1708999, 1685719, 2130009, 1731043, 2274666","abstract":"We introduce an approach for efficient distribution and adaptive rendering of 3D mesh models supporting a simple quad parameterization. Our method extends and combines recent results in geometric processing, real-time rendering, and web programming. In particular: we exploit recent results on surface reconstruction and isometric parametrization to transform point clouds into two-manifold meshes whose parametrization domain is a small collection of 2D square regions; we encode the resulting parameterized meshes into a very compact multiresolution structures composed of variable resolution quad patches whose geometry and texture is stored in a tightly packed texture atlas; we adaptively stream and render variable resolution shape representations using a GPU-accelerated adaptive tessellation algorithm with negligible CPU overhead. Real-time performance is achieved on portable GPU platforms using OpenGL, as well as on exploiting emerging web-based environments based on WebGL. Promising applications of the technology range from the automatic creation of rapidly renderable objects for games to the set-up of browsable 3D models repositories in the web that will be accessible by upcoming generation of WebGL-enabled web browers.","cites":"12","conferencePercentile":"93.93939394"},{"venue":"Web3D","id":"5338f4043b08f45845041f91a4f32608451fb139","venue_1":"Web3D","year":"2014","title":"Spatial data structures for accelerated 3D visibility computation to enable large model visualization on the web","authors":"Christian Stein, Max Limper, Arjan Kuijper","author_ids":"1756190, 1733680, 1738151","abstract":"The visualization of massive 3D models is an intensively examined field of research. Due to their rapidly growing complexity of such models, visualisation them in real-time will never be possible through a higher speed of rasterization alone. Instead, a practical solution has to reduce the amount of data to be processed, using a fast visibility determination.\n In recent years, the combination of Javascript and WebGL raised attention for the possibility of rendering hardware-accelerated 3D graphics directly in the browser. However, when compared to desktop applications, they are still fighting with their disadvantages of a generally slower execution speed, or a downgraded set of functionality.\n We demonstrate the integration of spatial data structures, computed on the client side, using latest technology trends to mitigate the shortcomings of the 3D Web environment. We employ comparably small bounding volume hierarchies to accelerate our visibility determination, as well as to enable specific culling techniques. This allows for an interactive visualization of such massive 3D data sets. Our in-depth analysis of different data structures and environments shows which combination of data structure and visibility determination techniques are currently the best fit for the Web.","cites":"5","conferencePercentile":"77.5"},{"venue":"Web3D","id":"60ea41803103af703869ad033e260b7acc1287d8","venue_1":"Web3D","year":"2015","title":"Evaluating 3D thumbnails for virtual object galleries","authors":"Max Limper, Florian Brandherm, Dieter W. Fellner, Arjan Kuijper","author_ids":"1733680, 2268676, 1734569, 1738151","abstract":"Virtual 3D object galleries on the Web nowadays often use real-time, interactive 3D graphics. However, this does usually still not hold for their preview images, sometimes referred to as thumbnails. We provide a technical analysis on the applicability of so-called 3D thumbnails within the context virtual 3D object galleries. Like a 2D thumbnail for an image, a 3D thumbnail acts as a compact preview for a real 3D model. In contrast to an image series, however, it enables a wider variety of interaction methods and rendering effects. By performing a case study, we show that such true 3D representations are, under certain circumstances, even able to outperform 2D image series in terms of bandwidth consumption. We thus present a complete pipeline for generating compact 3D thumbnails for given meshes in a fully automatic fashion.","cites":"0","conferencePercentile":"31.39534884"},{"venue":"Web3D","id":"c92c2a2b690892d728ddbb8f865b5d2490cec381","venue_1":"Web3D","year":"2015","title":"Exploring the Jenolan Caves: bringing the physical world to 3D online education","authors":"Matt Adcock, Stuart Anderson, Shlomo Berkovsky, Paul Flick, Dennis Frousheger, Brett Grandbois, Chris Gunn, David Haddon, Jane Li, Thomas Lowe, Benjamin Mackey, Frederick Pauling, Christian Richter, Kazys Stepanas, Fletcher Talbot, Gavin Walker, Belinda Ward, Luke Tomes, Sally Miles, Daniel Keogh, Ben Colenso, Hay Wie Lie, Dean Longmore, Jayden Hanly, Dave Canavan","author_ids":"1691131, 3109856, 1696183, 2096282, 2329652, 1920444, 1690012, 5256446, 3203586, 2642581, 1811322, 3087178, 8457205, 2209656, 2124036, 3142078, 3331647, 2808915, 2140281, 3276392, 3203872, 2731852, 2932597, 3138477, 2056793","abstract":"In August 2014, CSIRO and 3P Learning (through subsidiary IntoScience) launched what is probably Australia's biggest (and arguably coolest) school excursion ever. In classrooms around the country, students can now set out to explore the spectacular Jenolan Caves located in the scenic Blue Mountains. Students are immersed, via the web, in an authentic 3D digital recreation of the Jenolan Caves to discover the science behind cave formation.","cites":"0","conferencePercentile":"31.39534884"},{"venue":"Web3D","id":"337125f0fbad15d8990b482454da3019b06bb394","venue_1":"Web3D","year":"2013","title":"Compression-domain seamless multiresolution visualization of gigantic triangle meshes on mobile devices","authors":"Marcos Balsa, Enrico Gobbetti, Fabio Marton, Alex Tinti","author_ids":"2130009, 1708999, 1685719, 2702863","abstract":"We present a software architecture for distributing and rendering gigantic 3D triangle meshes on common handheld devices. Our approach copes with strong bandwidth and hardware capabilities limitations in terms with a compression-domain adaptive multiresolution rendering approach. The method uses a regular conformal hierarchy of tetrahedra to spatially partition the input 3D model and to arrange mesh fragments at different resolution. We create compact GPU-friendly representations of these fragments by constructing cache-coherent strips that index locally quantized vertex data, exploiting the bounding tetrahedron for creating local barycentic parametrization of the geometry. For the first time, this approach supports local quantization in a fully adaptive seamless 3D mesh structure. For web distribution, further compression is obtained by exploiting local data coherence for entropy coding. At run-time, mobile viewer applications adaptively refine a local multiresolution model maintained in a GPU by asynchronously loading from a web server the required fragments. CPU and GPU cooperate for decompression, and a shaded rendering of colored meshes is performed at interactive speed directly from an intermediate compact representation using only 8bytes/vertex, therefore coping with both memory and bandwidth limitations. The quality and performance of the approach is demonstrated with the interactive exploration of gigatriangle-sized models on common mobile platforms.","cites":"8","conferencePercentile":"92.5"},{"venue":"Web3D","id":"58b6eab2752fdf1cbd022cf214c28437345d9bb9","venue_1":"Web3D","year":"2006","title":"Web-based 3D planning tool for radiation therapy treatment","authors":"Felix G. Hamza-Lup, Larry S. Davis, Omar A. Zeidan","author_ids":"1875458, 1693428, 1915494","abstract":"One of the biggest concerns in external treatment planning is the collision avoidance of the treatment Linear Accelerator (LINAC&#174;) components such as gantry (G), table (T), collimator (C), and any other auxiliary components such as fixation devices etc, with the patient. Some external treatment plans require complex components of the above GTC combinations.We are presenting a preliminary design and implementation of a 3D-graphical tool for the detection of potential gantry-collimator-couch collisions in external treatment planning. The graphical tool uses the Virtual Reality Modeling Language (VRML) to model the exact geometry of any treatment machine by reading its manufacturer's CAD design files. Unlike other anti-collision methods developed so far in the literature, our tool would be able to model the details of the treatment linac and add-on devices for patient-specific setups. Hence, the tool will create patient-specific realistic collision map for any external treatment scenario. The tool can be used as a stand-alone program or embedded in the Eclipse treatment planning system.","cites":"4","conferencePercentile":"38.23529412"},{"venue":"Web3D","id":"52577457106e1ecc986f6bc1509f619345d42c9d","venue_1":"Web3D","year":"2012","title":"3D revision control framework","authors":"Jozef Dobos, Anthony Steed","author_ids":"1749292, 1678604","abstract":"The maintenance of assets in a large 3D scene can involve many authors with potentially different skills and different modeling tools. The standard paradigm of collaborative editing is sharing of files between various instances of applications. This presents problems, not limited to maintaining consistency of the models and dealing with concurrent edits in the same part of a scene. In this paper, we present a novel framework for non-linear revision control and online distribution of 3D assets. This framework supports concurrent asynchronous 3D editing of models and tracking of multiple revisions so that they can be integrated at a later date. It thus provides similar functionality to file-based revision control systems, but is built around a NoSQL database, hence avoids the constraints of file based storage. The framework supports distributed editing over the Internet and additional lightweight clients in web-browsers with WebGL support.","cites":"10","conferencePercentile":"90.90909091"},{"venue":"Web3D","id":"1b9a86c14621d18c177a2fdd5ea6ada84568fe5f","venue_1":"Web3D","year":"2006","title":"Function-based shape modeling and visualization in X3D","authors":"Qi Liu, Alexei Sourin","author_ids":"1728293, 1732503","abstract":"In this paper, a function-based extension of Extensible 3D (X3D) is proposed. The extension allows authors to use analytical functions to define geometry, color, 3D texture as well as operations on 3D shapes or time-dependent metamorphoses. The functions can be implicit, parametric or explicit functions, defined as analytical formulas or scripts with similar syntax as ECMAScripts. The extension allows authors to benefit from both the compactness of function-based models and the new features in Extensible 3D. The Scene Access Interface (SAI) of X3D is used in the general implementation of the function-based extension. Xj3D browser is chosen as the development platform. Besides the SAI implementation, a special plugin for BS Contact VRML/X3D is also developed using non-standard interface.","cites":"5","conferencePercentile":"50"},{"venue":"Web3D","id":"399729f440bad25c90b495d76a7c568f651c3042","venue_1":"Web3D","year":"2013","title":"XML3DRepo: a REST API for version controlled 3D assets on the web","authors":"Jozef Dobos, Kristian Sons, Dmitri Rubinstein, Philipp Slusallek, Anthony Steed","author_ids":"1749292, 3325913, 1714432, 1711750, 1678604","abstract":"Current Web 3D technologies are not yet fully exploiting the modern design patterns for accessing online resources such as REST. XML3DRepo is a novel fusion of XML3D and 3D Repo. XML3D is an open source extension to HTML that supports interactive 3D graphics in WebGL-enabled browsers. 3D Repo is a recent versioning framework for 3D assets that provides raw access to its NoSQL database. XML3DRepo, in turn, is a server-side combination of the two technologies that stores a unified file format independent representation of 3D scenes in its repository but exposes a RESTful API for a deeper integration with other services using a variety of encodings selected between by the client application. First, we outline the overall architecture of the system and provide a simple yet powerful API definition that we believe has the potential to accommodate crowdsourcing of 3D models in the future. Next, we describe different 3D data encoding strategies for the Web and evaluate several of these for their speed and efficiency in our open source prototype implementation of the proposed API. We conclude that none of the formats strike the right balance between the number of requests, decoding overhead and the compression achieved making the proposed flexible architecture even more compelling.","cites":"7","conferencePercentile":"87.5"},{"venue":"Web3D","id":"e9c5420f8206581271bf6caa6b75c41bf4ec3623","venue_1":"Web3D","year":"2016","title":"Open3D: crowd-sourced distributed curation of city models","authors":"Zhihan Lv, Paul Guerrero, Niloy J. Mitra, Anthony Steed","author_ids":"1792647, 2871337, 1710455, 1678604","abstract":"Detailed, large-scale 3D models of cities are important assets for many applications. While creating such models is difficult and time consuming, keeping them updated is even more challenging. In comparison, in many domains, crowd-sourcing of data is now an established process for expanding the scope or detail of data sets. In this paper, we describe the initial prototype implementation of Open3D, a crowd-sourcing platform for distributed curation of large-scale city models. We present an open architecture with interfaces that clearly separate model storage and indexing from viewing or editing. To support collaborative editing of extremely large models, we propose to use a modeling and model description paradigm that can integrate polygon-based modeling with parametric operations. We demonstrate the main concepts and prototype through an online city model that can be synchronously edited by multiple users, with live changes being propagated among clients. The main implementation consists of a set of <i>web services</i>, which support key functions such as model storage, locks for editing and spatial queries; a light-weight <i>viewer</i> based on the Cesium library, which runs on desktops and mobile devices; and a prototype <i>editor</i>, which clients can install to edit the models.","cites":"1","conferencePercentile":"91.66666667"},{"venue":"Web3D","id":"40b3b115b1b002dc106b22eaf1d70253a8d3ae3c","venue_1":"Web3D","year":"2001","title":"A web architecture for progressive delivery of 3D content","authors":"Efi Fogel, Daniel Cohen-Or, Revital Ironi, Tali Zvi","author_ids":"2952370, 1701009, 2667820, 3157410","abstract":"(a) (b) (c) Figure 1: The Flamingo model at 3 resolution Levels, wire-frame view. Abstract In this paper a Web architecture for 3D content delivery is presented. The architecture is based on a progressive compression representation integrated into the X3D framework. The architecture is designed to enhance the Internet user experience by delivering 3D content quickly, reliably, and with high quality. The progressive compressed stream enables handling 3D models containing large amounts of polygonal and textual data. At the client end the stream is progressively decoded up to the \" best \" level-of-details as defined by the client computational resources and the user inclination.","cites":"22","conferencePercentile":"100"},{"venue":"Web3D","id":"a620dedcc7a7d86c4b17ddf062483f5ef131bc80","venue_1":"Web3D","year":"2014","title":"HuMoRS: huge models mobile rendering system","authors":"Marcos Balsa, Marco Agus, Fabio Marton, Enrico Gobbetti","author_ids":"2130009, 2544127, 1685719, 1708999","abstract":"We present <i>HuMoRS</i>, a networked 3D graphics system for interactively streaming and exploring massive 3D mesh models on mobile devices. The system integrates a networked architecture for adaptive on-device rendering of multiresolution surfaces with a simple and effective interactive camera controller customized for touch-enabled mobile devices. During interaction, knowledge of the currently rendered scene is exploited to automatically center a rotation pivot and to propose context-dependent precomputed viewpoints. Both the object of interest and the viewpoint database are resident on a web server and adaptive transmission is demonstrated over wireless and phone connections in a Cultural Heritage application for the exploration of sub-millimetric colored reconstructions of stone statues. We report also on a preliminary user-study comparing the performances of our camera navigation method with respect to the most popular Virtual TrackBall implementations, with and without pivoting.","cites":"6","conferencePercentile":"87.5"},{"venue":"Web3D","id":"8ee4036a979bbc872d636f1a2cf12ec764fb7570","venue_1":"Web3D","year":"2002","title":"Contigra: an XML-based architecture for component-oriented 3D applications","authors":"Raimund Dachselt, Michael Hinz, Klaus Meißner","author_ids":"1724208, 2876485, 1771042","abstract":"Even though numerous Web3D technologies exist, most of them do not support a high-level, multi-disciplinary authoring process. Moreover, concepts of reuse are rarely provided. A component-based approach is introduced with the CONTIGRA architecture to construct interactive, three-dimensional applications, either stand-alone or web-based. The approach is entirely based on declarative XML documents describing the component imple¿mentation, its interface, as well as component configuration and composition of 3D user interfaces and virtual environments. Extensible 3D (X3D) is used as the scene graph basis. However, the resulting applications can be translated to other 3D tech¿nologies, too. Another advantage of the approach is reuse both at the implementation level and the higher abstract component level. This paper introduces the overall architecture and the XML schemas used for the component documents. It finally outlines the associated authoring process and tools involved.","cites":"39","conferencePercentile":"90.90909091"},{"venue":"Web3D","id":"1510a5ca8ff89d2ef5ae6e90ddcff46d32b0184f","venue_1":"Web3D","year":"2006","title":"Using the AMACONT architecture for flexible adaptation of 3D web applications","authors":"Raimund Dachselt, Michael Hinz, Stefan Pietschmann","author_ids":"1724208, 2876485, 1848975","abstract":"Providing personalized content and applications which also address heterogeneous capabilities of multiple device types becomes a significant challenge of today's Web development. By now most of the work in the field of adaptive hypermedia is devoted to Web content such as hypertext, images, video, and animation, but rarely to three-dimensional graphics. Research on the adaptation of 3D graphics is still in its infancy. The generic approach introduced in this paper combines the AMACONT adaptive hypermedia architecture with the component-based 3D document model CONTIGRA to achieve 3D adaptation methods such as parametric, structural, and implicit rule-based adaptation as well as rich hypermedia adaptation across media boundaries. In addition a layered context modeling framework supports not only personalization, but also adaptation to device and other contexts. It is shown that the approach can be generalized to other XML-based 3D document formats, e.g. X3D.","cites":"9","conferencePercentile":"64.70588235"},{"venue":"Web3D","id":"927f1523e5d482328ea651f51f244a1ffbfee9bd","venue_1":"Web3D","year":"2005","title":"Function-based representation of complex geometry and appearance","authors":"Qi Liu, Alexei Sourin","author_ids":"1728293, 1732503","abstract":"In this paper, we introduce a function-based extension of Virtual Reality Modeling Language. In this extension, analytical functions are used for defining geometry and appearance of 3D shapes, as well as transformations of them. By analytical functions we understand definitions with parametric, implicit and explicit formulas. In our hybrid function-based web visualization model, these very different analytical representations can be used concurrently for defining geometry and appearance of the shapes. We also illustrate how the proposed extension can be further enriched with any proprietary function-based models. The presented VRML plug-in is very useful for building both static and interactive virtual environments on the Web. This is illustrated with the implementation of the Virtual Collaborative Shape Modeling Laboratory.","cites":"14","conferencePercentile":"86.11111111"},{"venue":"Web3D","id":"43ac2fa8a0816fde2950d15a576bb71de6156aea","venue_1":"Web3D","year":"2002","title":"Multiresolution streaming mesh with shape preserving and QoS-like controlling","authors":"Bing-Yu Chen, Tomoyuki Nishita","author_ids":"1733344, 1696605","abstract":"How to transmit 3D meshes efficiently has become an important topic on Web3D platform, since there are more and more people need to use 3D models on the Internet. The data size of a geometric 3D model is usually large for being able to represent more details of the model, although we do not need to use such a detail model in most cases. Hence, to offer 3D model which shape and features could still be recognized easily with less data size is necessary. Additionally, the network bandwidth of the Internet is not stable actually, how much data is suitable for Internet is also a question. Therefore, we propose a new multiresolution streaming mesh for Internet transmission with QoS-like (Quality of Service) controlling in this paper.While transmitting the streaming mesh with our system, the server first delivers a simplified mesh model with the data size according to the current network bandwidth. If the user at the client side needs to use a more detail model, the server then sends some necessary patches to the client, so that the client program could show the detail model progressively. Our approach is different from previous works, for Web3D utilization, the size of the patch data which is used for reconstructing the original 3D model is less, and the shape and features of the simplified model could still be recognized easily. Moreover, our method needs no complex computations, to generate this streaming mesh on demand is possible. With the QoS-like controlling, the transmission rate between the server and the client has been controlled automatically and the users could get the 3D models with proper qualities as their network situations.","cites":"28","conferencePercentile":"81.81818182"},{"venue":"Web3D","id":"4a13a92768063194312b9be4783000d5fb9c4776","venue_1":"Web3D","year":"2001","title":"Enabling custom enhancements in digital sports broadcasts","authors":"Richter A. Rafey, Simon Gibbs, Michael Hoch, Hubert Lê Van Gông, Sidney W. Wang","author_ids":"3148435, 3063520, 2503262, 1719990, 3298298","abstract":"Digital TV is an area where interaction is expected to become increasingly prevalent in the next few years. Graphics technologies like VRML that are designed for distributing applications provide a presentation engine that can serve as a foundation for moving visual enhancements from the studio to the consumer platform. As these enhancements move downstream to viewers, they introduce capabilities for compelling interaction. We have developed a prototype that extends VRML to support interactive TV applications, specifically focusing on enhancements for sports broadcasts. Our extensions are built on Blendo [1], a presentation engine developed in Sony that derives from VRML. This paper describes the context for our extensions and the specific extensions that we have developed so far.","cites":"8","conferencePercentile":"28.57142857"},{"venue":"Web3D","id":"8ab73665b0a57da2636d9ba0af5f0db2ffc99ff4","venue_1":"Web3D","year":"2016","title":"glTF streaming from 3D repo to X3DOM","authors":"Timothy Scully, Sebastian Friston, Carmen Fan, Jozef Dobos, Anthony Steed","author_ids":"1721441, 2557421, 8632577, 1749292, 1678604","abstract":"As Web3D technology advances, the need for delivering real-time 3D content online has gained traction in the academic as well as commercial world. Various efforts have been made in creating a suitable transmission format for streaming of 3D assets over the Internet. Despite being accustomed to waiting for long periods of time for massive scenes to load in CAD editors, end users often expect an instant rendering on a web browser. An effective streaming transmission format, coupled with progressive encoding methods, is able to create a better interactive experience for the users. Most of the existing techniques are either domain specific, tying the users in on a particular rendering engine, or they are too general; resulting in extra processing at the application level. In this paper, we demonstrate a novel method of transmitting 3D assets in glTF format for high interoperability and scalability in 3D Repo. Firstly, we extend glTF with the ability to stream binary data buffers with a progressive encoding technique to increase performance and overall client interactivity. Next, we extend X3DOM for glTF support and introduce multipart optimization into glTF as a way of grouping multiple meshes together which significantly reduces the number of network requests as well as draw calls. Finally, we investigate memory management protocols and devise a novel GraphicsMemoryManager suitable for streaming on top of X3DOM in order to render models that otherwise would not fit available video memory.","cites":"0","conferencePercentile":"43.33333333"},{"venue":"Web3D","id":"7191661ac83b55042f462dece58ad581c17be38a","venue_1":"Web3D","year":"2003","title":"Adopting and augmenting X3D for efficient 3D content production: concepts and tools","authors":"Raimund Dachselt, Ralf Dörner, Paul Grimm","author_ids":"1724208, 8360122, 2442906","abstract":"Overview The goals of the workshop are: 1. to broaden the X3D view, which was quite centered on specification and standardization issues by now to the support of higher-level concepts and dedicated tools that reflect an authoring with X3D. 2. to discuss a production process for 3D applications (like games, training applications, visualizations) based on X3D using modern component and framework concepts. 3. to develop visions on how to use, how to improve and how to extend X3D for an efficient production of 3D applications. 4. to open and encourage a discussion as well as to develop ideas on the actual usage/employment of X3D, the integration with other Web solutions and (media) standards and tools associated with it. Duration half-day","cites":"1","conferencePercentile":"19.23076923"},{"venue":"Web3D","id":"64b8bd786aa13de2af17274e204e0069225028e7","venue_1":"Web3D","year":"2011","title":"A taskonomy of 3D web use","authors":"Jacek Jankowski","author_ids":"3312524","abstract":"This paper aims to shed some light on the fundamental tasks users engage in while browsing the 3D Web. Firstly, we will provide an overview and discussion of several field studies that provide insights on how the current version of the Web is used focusing on the tasks that users carry out. Then we will present a comprehensive review of the state of the art of mouse-based 3D interaction techniques for Desktop 3D Virtual Environments (DVEs). Finally, we will introduce a simple taxonomy - a \"<i>3D Web Taskonomy</i>\" that was designed to assists designers and developers of interactive 3D Web applications to better evaluate their options when choosing and implementing an interaction technique.","cites":"7","conferencePercentile":"65.90909091"},{"venue":"Web3D","id":"c28d88cbdf37b999784760a0dece2198f045f1d3","venue_1":"Web3D","year":"2015","title":"Towards web-based semantic enrichment of 3D insects","authors":"Stuart Anderson, Matt Adcock, Beth Mantle, John La Salle, Chuong V. Nguyen, David R. Lovell","author_ids":"3109856, 1691131, 3352972, 2185378, 5369974, 3008221","abstract":"Natural history collections are an invaluable resource housing a wealth of knowledge with a long tradition of contributing to a wide range of fields such as taxonomy, quarantine, conservation and climate change. It is recognized however [Smith and Blagoderov 2012] that such physical collections are often heavily underutilized as a result of the practical issues of accessibility. The digitization of these collections is a step towards removing these access issues, but other hurdles must be addressed before we truly unlock the potential of this knowledge.","cites":"0","conferencePercentile":"31.39534884"},{"venue":"Web3D","id":"a67afad7c6720df0d9c6ad9561729636a5c83601","venue_1":"Web3D","year":"2009","title":"2LIP: filling the gap between the current and the three-dimensional web","authors":"Jacek Jankowski, Stefan Decker","author_ids":"3312524, 1685642","abstract":"In this article we present a novel approach, the 2-Layer Interface Paradigm (2LIP), for designing simple yet interactive 3D web applications, an attempt to marry advantages of 3D experience with the advantages of the narrative structure of hypertext. The hypertext information, together with graphics, and multimedia, is presented semi-transparently on the foreground layer. It overlays the 3D representation of the information displayed in the background of the interface. Hyperlinks are used for navigation in the 3D scenes (in both layers).\n We introduce a reference implementation of 2LIP: Copernicus - The Virtual 3D Encyclopedia, which can become a model for building 3D Wikipedia. Based on the evaluation of Copernicus we show that designing web interfaces according to 2LIP provides users with a better experience during browsing the Web, has a positive effect on the visual and associative memory, improves spatial cognition of presented information, and increases overall user's satisfaction without harming the interaction.","cites":"5","conferencePercentile":"72.91666667"},{"venue":"Web3D","id":"e12c7b79430e248d7eed3db2704e5baade001c1b","venue_1":"Web3D","year":"2011","title":"Semi-automatic end-user tools for construction of virtual avatar behaviors","authors":"Madhusudhanan Srinivasan, Ronald A. Metoyer","author_ids":"2778574, 1809549","abstract":"We present tools and techniques for the design of an interactive motion data structure to drive virtual avatars. Our approach automatically analyzes a traditional labeled motion graph and constructs a condensed, coarser graph referred to as a Behavior Finite State Machine (BFSM). Each node of the BFSM represents a single behavior, and each weighted edge represents a valid transition and its likelihood. We present a semi-automated mechanism for user-editing of the graph. We also introduce an interface for user-in-the-loop design of transitions and blend spaces to generate controllable avatars from a BFSM. We present the results of our approach using two dynamic interactive examples, locomotion and martial arts, and discuss the strengths and weaknesses of our technique.","cites":"0","conferencePercentile":"9.090909091"},{"venue":"Web3D","id":"cd54c8bb52ffc1d4669069be39049fa88a0f98b1","venue_1":"Web3D","year":"2007","title":"A reusable 3D visualization component for the semantic web","authors":"Alessio Bosca, Dario Bonino, Marco Comerio, Simone Grega, Fulvio Corno","author_ids":"2315050, 1806604, 3169902, 2809577, 1712546","abstract":"Ontology visualization and exploration is not a trivial task as many issues can affect the effectiveness of interactions. As ontologies are, in the general case, quite connected graphs where concepts are the nodes and semantic relationships the edges, the problems include space allocation, edge superposition, scene over-crowding, etc.\n In this paper we propose a solution for the visualization and the exploration of ontologies using a 3-dimensional space, where information is represented on a 3D view-port enriched by visual cues. Our visualization tool aims at tackling representation issues of ontology models (as space allocation or the completeness and read-ability of displayed information) by adopting different views, at different granularities, in order to grant a constant navigability of the rendered model. Each provided view represents semantic information according to a different, task-based visualization paradigm, at a suitable level of detail.\n Besides being primarily implemented as a Prot&#233;g&#233; plug-in, the proposed solution (named OntoSphere3D) is designed to be a reusable visualization component within Semantic Web applications; in fact, every scene can be exploited as a standalone facility that provides access to ontological data through an intuitive and appealing 3D interface. A case-study, is presented, where re-usability is demonstrated by integrating the OntoSphere3D visualization inside an Eclipse-based tool for Web Service design (called Web Services Design Tool) developed by some of the authors in the context of another research project.","cites":"3","conferencePercentile":"46.55172414"},{"venue":"Web3D","id":"45f8884e8a93457a753bc032980301d16bd53cb7","venue_1":"Web3D","year":"2001","title":"jGL and its applications as a Web3D platform","authors":"Bing-Yu Chen, Tomoyuki Nishita","author_ids":"1733344, 1696605","abstract":"This paper proposes a new platform for 3D graphics on the Internet (and recently also for Web3D). To develop 3D graphics programs on the Internet is not very easy, because there are no high-quality tools like OpenGL. For this purpose, we have developed a 3D graphics library, called jGL, by using pure Java since the end of 1996. At that time, we ignored some functions, such as texture mapping, because these functions were too complex to be realized on low-cost machines, even on the fastest machine three years ago. jGL is a general-purpose 3D graphics library, and its application-programming interface is defined in a manner quite similar to that of OpenGL. Today, the hardware is better, but the network bottleneck is still the same as before, so we almost rewrote all the code to enhance its capabilities and performance and minimized its code size to make it more suitable for running on the Internet. Moreover, VRML is a standard 3D graphics file format and very popular. To display or play a 3D model or scene on the Internet, people would like to use the VRML file format, and use the VRML browser plug-in of the Internet browsers to view it. Unfortunately, besides the Microsoft Windows and SGI workstation environments, the support for displaying VRML models is not enough. Hence, we also developed a real platform independent VRML browser applet by using jGL, that can be used on any Java enabled Internet browsers. It is also a good example for jGL.","cites":"8","conferencePercentile":"28.57142857"},{"venue":"Web3D","id":"52f8a50f077c4556d11b279fe11c2545a9920c6f","venue_1":"Web3D","year":"2007","title":"High-quality networked terrain rendering from compressed bitstreams","authors":"Fabio Bettio, Enrico Gobbetti, Fabio Marton, Giovanni Pintore","author_ids":"1760313, 1708999, 1685719, 1778838","abstract":"We describe a compressed multiresolution representation and a client-server architecture for supporting interactive high quality remote visualization of very large textured planar and spherical terrains. Our approach incrementally updates a chunked level-of-detail BDAM hierarchy by using precomputed wavelet coefficient matrices decoded from a compressed bitstream originating from a thin server. The structure combines the aggressive compression rates of wavelet-based image representations with the ability to ensure overall geometric continuity for variable resolution views of planar and spherical terrains with no need for run-time stitching. The efficiency of the approach is demonstrated on a large scale interactive remote visualization of global and local terrains on ADSL networks. A library implementing an early version of this work has been incorporated into a widely distributed geo-viewing system with tens of thousands of clients.","cites":"10","conferencePercentile":"94.82758621"},{"venue":"Web3D","id":"2d3e6724a28030c81d90d1b86c06c89afc7e18ae","venue_1":"Web3D","year":"2004","title":"An XML-based visual shading language for vertex and fragment shaders","authors":"Frank Goetz, Ralf Borau, Gitta Domik","author_ids":"2347684, 1815639, 1817248","abstract":"This paper presents a new system for the visual development of complex vertex and fragment shaders. The system makes usage of the advantages of visual programming languages. The core of the system is a Java program. With this program users can develop and test dataflow diagrams that describe the functionality of OpenGL ARB vertex and fragment programs. To get a graphical feedback the system is able to display rendered and shaded scenes immediately. The rendering of these three dimensional scenes will be done with the common Java-OpenGL binding <i>GL4Java</i>. Further on <i>Cg4Java</i>, a new binding for connecting Java to NVIDIA's High-Level Shading Language <i>C for graphics (Cg)</i> was developed. For an easy and fast way of verification, and for the possibility of a future integration into XML based 3D formats like Extensible 3D (X3D), the whole topology of the dataflow diagrams will be stored in XML. The concept of shader programming with dataflow diagrams and the architecture of our system will be described in detail. For a better understanding two examples will be presented and explained.","cites":"6","conferencePercentile":"27.77777778"},{"venue":"Web3D","id":"4e41d86506c417fc64b40d408b973c09d4f01c0c","venue_1":"Web3D","year":"2013","title":"Artworks narrating a story: a modular framework for the integrated presentation of three-dimensional and textual contents","authors":"Marco Callieri, Chiara Leoni, Matteo Dellepiane, Roberto Scopigno","author_ids":"1787254, 4982068, 2674152, 7980724","abstract":"The integrated presentation of a 3D model and a descriptive text which is strongly connected to the geometry (and, more in general, of multiple interconnected datasets of different nature) is still problematic. This is often solved by using plugins and/or resulting in poorly connected exploration tree (where one media is used as a \"primary content\", and the rest of the data are just used to enrich it).\n In this paper, we present a framework for the presentation, on the web platform, of multiple heterogeneous datasets. Thanks to a modular design, and a simple mechanism to index data structures and messages, it is possible to design interconnected viewers, and build a flexible system for this purpose. By explicitly annotating the datasets with locators, which are present in all datasets, it is possible to build a strongly connected graph, and let the user explore it, obtaining a real multi-media exploration, <i>inside</i> and <i>across</i> the various datasets. The entire system is implemented using HTML5 and JavaScript, making it a portable solution, able to run natively inside browsers, without additional components. We tested the system on two practical, complex examples, both composed of an intricate high-resolution geometry, and rich textual information.","cites":"7","conferencePercentile":"87.5"},{"venue":"Web3D","id":"f790375c3aba00913fe83d7e4123a662500ae763","venue_1":"Web3D","year":"2011","title":"Model-driven development of interactive and integrated 2D and 3D user interfaces using MML","authors":"Andreas Pleuß, Denis Gracanin, Xiaoyu Zhang","author_ids":"3079931, 1709677, 1791962","abstract":"While there is a lot of research done in the area of 2D or 3D user interfaces (UIs) construction, comparatively little is known about systematic approaches to designing and developing integrated 2D/3D UIs and applications. The previously developed Multimedia Modeling Language (MML) provides a top down approach for a model driven development of 2D/3D UIs and applications. The MML Structure Model and Media Components provide support for including X3D based content and automatic generation of application skeletons. We use a work instruction manual for a woodchipper as an example to illustrate how to apply MML. We discuss the ramifications of this approach and opportunities for some improvements.","cites":"1","conferencePercentile":"22.72727273"},{"venue":"Web3D","id":"0d8bb9d34fc417b5cabe68137f5f1766eeaf0814","venue_1":"Web3D","year":"2013","title":"An approach to WebGL based distributed virtual environments","authors":"Xiaoyu Zhang, Denis Gracanin","author_ids":"1791962, 1709677","abstract":"Modern Web browsers with WebGL support allow users to access online 3D applications without installing add-ons or additional software. The popularity of WebGL enabled browsers motivates rapid development of dynamic and attractive online virtual environment (VE) applications. Constructing dynamic VE applications by integrating content from third party services is an effective approach to motivate more developers to be involved in Web 3D content sharing. Our conceptual framework called <i>CaffeNeve</i> is designed to provide the standardizations of constructing component and service based distributed virtual environments (DVEs). In this paper we explain <i>CaffeNeve</i> and describe a WebGL-based implementation of the framework. Three major framework components, component service, container and client, are described in terms of framework organization as well as their WebGL implementation issues. A simple demo application illustrates the use of the provided infrastructure and demonstrates the methodology of creating WebGL applications from remote content services.","cites":"0","conferencePercentile":"20"},{"venue":"Web3D","id":"c95ea5e1b0d6fad1dd19bafc9d1bd7841da6edc1","venue_1":"Web3D","year":"2014","title":"Accelerating entomology with Web3D insects","authors":"Matt Adcock, Chuong V. Nguyen, David R. Lovell, John La Salle","author_ids":"1691131, 5369974, 3008221, 2185378","abstract":"Capturing high-quality 3D models of insects is challenging - they are usually too small for laser or depth camera based systems, and techniques such as CT scanning do not record color. We have developed a prototype system that generates unprecedentedly high-quality natural-color 3D models of various insects from 3mm to 30 mm in length. Through the use of 3D web standards we are able to use these models to develop novel applications for entomologists and ensure wide accessibility.","cites":"0","conferencePercentile":"20"},{"venue":"Web3D","id":"58413e87d239b1ff4373bd0c2f869ca376c848f1","venue_1":"Web3D","year":"2000","title":"WebTOP: 3D interactive optics on the Web","authors":"Kiril Vidimce, John T. Foley, David C. Banks, Yong-Tze Chi, Taha Mzoughi","author_ids":"2891782, 8316556, 2520059, 2254957, 3350124","abstract":"The Optics Project (TOP) is a 3D interactive computer graphics system that visualizes optical phenomena. The primary motivation for creating TOP was to develop a tool to help undergraduate students learn optics. WebTOP is a Web-based version of the system that encompasses a physical simulation, an overview of the theory involved, a showcase of examples, and a set of suggested exercises. The actual simulation is implemented using VRML, Java, and the External Authoring Interface, and runs under multiple hardware/OS/browser configurations. This work is significant in that it represents, to our knowledge, the first complete 3D interactive optics system on the Web.","cites":"4","conferencePercentile":"25"},{"venue":"Web3D","id":"a9b36b2e9b966e5a6c825e34179323e0749a1042","venue_1":"Web3D","year":"2003","title":"Behavior3D: an XML-based framework for 3D graphics behavior","authors":"Raimund Dachselt, Enrico Rukzio","author_ids":"1724208, 2021950","abstract":"Success of 3D applications on the Web inherently depends on object behavior and interaction. Current Web3D formats often fall short in supporting behavior modeling. This paper introduces a flexible concept for declaratively modeling 3D object behaviors. Based on Extensible 3D (X3D) a node concept is suggested with object-oriented features such as inheritance, strong typing, and polymorphism. An XML-based language <i>Behavior3DNode</i> serves the interface definition of new nodes. Their implementation is simplified by automated code generation. A novel grammar generation mechanism collects all existing nodes in a dynamic XML Schema. Thus new behavior nodes can be used along with built-in nodes as first class scene graph elements. A rich set of predefined behaviors is proposed, among them <i>Animation</i> and <i>State Machine</i> node collections. The concepts were successfully implemented with VRML97/X3D and integrated into a 3D component approach.","cites":"36","conferencePercentile":"98.07692308"},{"venue":"Web3D","id":"6f86755956d07292a311ce7df8557fc4683ce1d5","venue_1":"Web3D","year":"2001","title":"Steerable media: interactive television via video synthesis","authors":"Chris Marrin, Rob Myers, Jim Kent, Peter Broadwell","author_ids":"2930678, 2490782, 2095203, 2485605","abstract":"The Steerable Media Project explores the next generation of interactive television through parallel, iterative investigations into driving content scenarios, delivery formats, and platform architectures. The aim of the project is to produce a new content paradigm for interactive TV that exhibits the visual aesthetic of existing TV content while providing opportunities for the user to continuously steer the content progression. This paper describes the goals of the project and summarizes the results that have been achieved in each area.","cites":"10","conferencePercentile":"46.42857143"},{"venue":"Web3D","id":"ae1aacfcc1781d6865130d00fcf4a64efa03a1ab","venue_1":"Web3D","year":"2002","title":"InTml: a description language for VR applications","authors":"Pablo Figueroa, Mark Green, H. James Hoover","author_ids":"2361132, 3081643, 1799799","abstract":"We present the Interaction Technique Markup Language (InTml), a profile on top of the core X3D that describes 3D interaction techniques (InTs) and hardware platforms. InTml makes 3D InTs easier to understand, compare, and integrate in complete virtual reality (VR) applications. InTml can be used as a front end for any VR toolkit, so InTml documents that plug together 3D InTs, VR objects, and devices can be fully described and executed.","cites":"49","conferencePercentile":"95.45454545"},{"venue":"Web3D","id":"87bf9666d429bef721be8fcb6b4e19a4a8ff45c5","venue_1":"Web3D","year":"2003","title":"MVIP-II: a protocol for enabling communication in collaborative virtual environments","authors":"John Robinson, Sarah J. Dumoulin, John A. Stewart","author_ids":"7527123, 2720687, 2652206","abstract":"This paper presents the second edition of our multicast protocol designed to enable shared virtual worlds.This second release was undertaken to provide an interaction methodology with other participants of a shared virtual world. These virtual world participants can be either human-controlled, or algorithmically controlled content delivery avatars.","cites":"3","conferencePercentile":"36.53846154"},{"venue":"Web3D","id":"02043698fc2b63f155d87fe3c0533fe762e20e1d","venue_1":"Web3D","year":"2015","title":"Volumetric texture data compression scheme for transmission","authors":"Yeonsoo Yang, Ankit Sharma, Armand Girier","author_ids":"2666187, 2712049, 2018387","abstract":"We present a texture data compression technique for transmission of volumetric weather radar data. High resolution volume rendering of such time varying volumetric data sets requires large size and number of texture files. In case of WebGL based volume rendering on web browsers, performance problems occur due to the latencies associated with loading of 3D assets, especially transmission of huge texture files. Existing compression technique can help to solve this problem. The most relevant work is S3TC texture compression. As an advanced compression scheme, we combine the S3TC compression method with efficient encoding of volume data in the RGBA channels of an image followed by DEFLATE compression to further reduce the file size. We show how this optimized scheme with X3D/X3DOM extensions fits into our weather data visualization application requirements and provide experimental results.","cites":"0","conferencePercentile":"31.39534884"},{"venue":"Web3D","id":"4f3d46db6eab23be45325b9a9fa009ecaf1f5f5d","venue_1":"Web3D","year":"2003","title":"Viewpoint adaptation during navigation based on stimuli from the virtual environment","authors":"Szilárd Kiss, Anton Nijholt","author_ids":"2409409, 1745198","abstract":"We consider the possibility of automatically modifying the user's viewpoint orientation for the purpose of enhancing the navigation experience. We concentrate on outdoor virtual environments where the terrain is uneven as well as certain cases of indoor at environment floors, respectively on environments where focus-drawing objects and different types of obstacles exist. Most natural environments present these properties and virtual environments that are based on natural environments are in abundance. The navigational adjustments are introduced as response to environment stimuli such as slope changes, the emergence of visibility rays to focus objects or as navigational difficulty events occur after encounters with nonoversteppable obstacles. A scheme is presented that facilitates the viewpoint orientation feature. Conceptually, the viewpoint orientation is a method of partially and temporarily decoupling the head movements from the navigation direction. Virtual environments in general and their encoding in VRML, X3D, Java3D as well as other scenegraphs are analyzed to reveal bottlenecks in current scenegraphs that make the implementation of such automatic adjustments from difficult to impossible, needing custom navigational code where possible. Different scenarios are presented, where these adjustments can prove useful by speeding up the navigation and providing a higher quality, richer experience. Additional to relevant literature, further experiments are necessary to analyze the effect of automatic view adjustments on the user's immersiveness experience and direction sense (path finding), experiments which could be carried out using custom navigational interfaces incorporating head movement extensions separated from the navigational data, extensions proposed in this paper.","cites":"8","conferencePercentile":"67.30769231"},{"venue":"Web3D","id":"30a947a8e80757beee77a35c63a8f8b51b05e54d","venue_1":"Web3D","year":"2004","title":"PathSim visualizer: an Information-Rich Virtual Environment framework for systems biology","authors":"Nicholas F. Polys, Doug A. Bowman, Chris North, Reinhard C. Laubenbacher, Karen Duca","author_ids":"1723848, 1729869, 1796013, 1722698, 1792197","abstract":"Increasingly, biology researchers and medical practitioners are using computational tools to model and analyze dynamic systems across scales from the macro to the cellular to the biochemical level. We are using Information-Rich Virtual Environments (IRVEs) to display the results of biological simulations, and to allow users to interact with those simulations. While simulation architectures, algorithms, and processing power have enjoyed continuous optimization to date, the user interfaces to these applications have not. The problems of designing such IRVE interfaces arise from the requirement that a variety of spatial and abstract information must be integrated into one coherent experience for the user. This paper explores the design and development issues encountered in our implementation of a bioinformatics application, PathSim (<b>Path</b>ogen <b>Sim</b>ulation). Specifically, we describe the information and interaction issues in building a front-end tool to visually analyze the results of an agent-based immunology simulation. Finally, we present custom scenegraph objects and consider candidate functionality for future standards components.","cites":"18","conferencePercentile":"88.88888889"},{"venue":"Web3D","id":"0ce957946a09b767c2651aaf398c8192a48350e5","venue_1":"Web3D","year":"2002","title":"VRML data sharing in the spin-3D CVE","authors":"Stéphane Louis Dit Picard, Samuel Degrande, Christophe Gransart, Christophe Chaillou","author_ids":"1886612, 2240151, 1761609, 1774410","abstract":"In this paper, we present the design and implementation of a VRML97 multi-user layer introduced in SPIN-3D, our Distributed Collaborative Virtual Environment. The main consideration of our multi-user extension is the ease of design of multi-user objects from single-user standard VRML97 objects. Any standard VRML97 browser must at least display the single-user content without taking account of the multi-user description. Whereas other approaches use a VRML node insertion mechanism, such as in Living Worlds, our approach uses a substitution mechanism. And beneath our multi-user extension, we use the Common Object Request Broker Architecture to provide a network communication layer for supporting the virtual meetings.","cites":"6","conferencePercentile":"18.18181818"},{"venue":"Web3D","id":"5099d292fc89572b23a66a06b4c1ff39698ceb7e","venue_1":"Web3D","year":"2009","title":"An asymmetric 2D Pointer/3D Ray for 3D interaction within collaborative virtual environments","authors":"Thierry Duval, Cédric Fleury","author_ids":"2790132, 3327755","abstract":"In this paper we present a new metaphor for interaction within Collaborative Virtual Environments (CVE). This metaphor is dedicated to non-immersive or semi-immersive 3D interactions, for which users cannot afford to buy expensive devices neither for 3D visualization of their virtual environment nor for interaction. With these low-cost restrictions, we think that it is more effective to use basic 2D metaphors rather than to try to adapt 3D virtual metaphors which would be more difficult to use because of the poor immersion level offered by such systems.\n The problem that will arise within a CVE is that it is difficult to make a user aware of the 2D metaphors used by another user, because they are not associated with a 3D virtual object of the shared universe. So our idea is to provide to a user a 3D virtual ray (using ray-casting for object selection) that would act like a 2D pointer on the screen, allowing the user to only control the 2D position of the closest ray end, and calculating the orientation of the ray so that its projection on the screen would always be a point. This way, since the user is controlling a 3D virtual ray, the other users can be made aware of his activity.\n To test the efficiency of this 2D Pointer / 3D Ray, we have made some experiments making users compare different devices to realize some simple selection and manipulation tasks. The results show that this kind of 2D solution is efficient and allows 3D interaction within Virtual Environments by people who cannot afford expensive immersive hardware. This new metaphor allows more users to collaborate within CVE.","cites":"5","conferencePercentile":"72.91666667"},{"venue":"Web3D","id":"bba0d6d723337e0867ef3ea89490fcd90f912231","venue_1":"Web3D","year":"2003","title":"A comparison of the usability and effectiveness of web-based delivery of instructions for inherently-3D construction tasks on handheld and desktop computers","authors":"Guy W. Zimmerman, Julie Barnes, Laura M. Leventhal","author_ids":"1955709, 3197202, 2167605","abstract":"Since its inception, VRML has held out the promise of initiating a quantum leap in web deliverable content and applications. However, the promise has yet to be realized. In this paper, we consider the problem of the web-based delivery of instructions for inherently-3D construction tasks. We describe a presentation that we built using VRML and discuss a comparative study of the effectiveness of the presentation when viewed using both a traditional desktop environment and also a handheld PDA. The study was both quantitative and qualitative and examined the effect of the user interface and delivery technology on overall task success, user interaction level, and task success for inherently 3D steps.","cites":"7","conferencePercentile":"61.53846154"},{"venue":"Web3D","id":"878c9a5c57eefb6e241f22a61616c850a20da180","venue_1":"Web3D","year":"2006","title":"Using expressive rendering for remote visualization of large city models","authors":"Jean-Charles Quillet, Gwenola Thomas, Xavier Granier, Pascal Guitton, Jean-Eudes Marvie","author_ids":"2406220, 1726201, 1688525, 2010548, 2042875","abstract":"In this paper, we present a new approach for remote visualization of large 3D cities. Our approach is based on expressive rendering (also known as Non-Photorealistic Rendering), and more precisely, on feature lines. By focusing on characteristic features, this solution brings a more legible visualization and reduces the amount of data transmitted on the network. We also introduce a client-server system for remote rendering, as well as the involved pre-processing stage that is required for optimization. Based on the presented system, we perform a study on the usability of such an approach in the context of mobile devices.","cites":"17","conferencePercentile":"82.35294118"},{"venue":"Web3D","id":"7318d9e626e35d4dfcd35ec24d7324fefe9a03d8","venue_1":"Web3D","year":"2002","title":"A scalable force propagation approach for web-baseddeformable simulation of soft tissues","authors":"Kup-Sze Choi, Hanqiu Sun, Pheng-Ann Heng, Jack C. Y. Cheng","author_ids":"1739623, 7218938, 1714602, 2806811","abstract":"Physically based models and simulation are usually computationally intensive and not suitable for real-time interactive virtual reality applications including on-line medical training and surgical simulation. In this paper, we propose and develop a web-based scalable deformable model by simulating deformation of soft tissues as a successive force propagation process. This approach avoids laborious formulation of stiffness matrices in conventional mass-spring models. Computational speed is optimized by taking into account only the nodes confined in localized deformation regions. Scalability is achieved by controlling the degree of localization. The model is applicable for simulating both hollow and volumetric objects. The proposed technique provides a scalable solution for web-based interactive applications involving soft tissues deformation.","cites":"12","conferencePercentile":"45.45454545"},{"venue":"Web3D","id":"119b27ea91209dcfa85837f1478f86a45de53726","venue_1":"Web3D","year":"2003","title":"Early experiences with a 3D model search engine","authors":"Patrick Min, J. Alex Halderman, Michael M. Kazhdan, Thomas A. Funkhouser","author_ids":"2161228, 2349976, 1690653, 1807080","abstract":"New acquisition and modeling tools make it easier to create 3D models, and affordable and powerful graphics hardware makes it easier to use them. As a result, the number of 3D models available on the web is increasing rapidly. However, it is still not as easy to find 3D models as it is to find, for example, text documents and images. What is needed is a \\3D model search engine,\" a specialized search engine that targets 3D models. We created a prototype 3D model search engine to investigate the design and implementation issues. Our search engine can be partitioned into three main components: (1) acquisition: 3D models have to be collected from the web, (2) analysis: they have to be analyzed for later matching, and (3) query processing and matching: an online system has to match user queries to the collected 3D models. Our site currently indexes over 36,000 models, of which about 31,000 are freely available. In addition to a text search interface, it offers several 3D and 2D shape-based query interfaces. Since it went online one year ago (in November 2001), it has processed over 148,000 searches from 37,800 hosts in 103 different countries. Currently 20--25% of the about 1,000 visitors per week are returning users. This paper reports on our initial experiences designing, building, and running the 3D model search engine.","cites":"30","conferencePercentile":"88.46153846"},{"venue":"Web3D","id":"9caccb59cf0a77c19df822e3fe93dd7d9ede951c","venue_1":"Web3D","year":"2001","title":"Volume visualization in VRML","authors":"Johannes Behr, Marc Alexa","author_ids":"1694015, 1751554","abstract":"Volume visualization has become an invaluable visualization tool. A wide variety of data sets coming from medical applications (e.g. MRI, CT or 3D ultrasound) or geological sensory information are represented as structured volume grids. In many application it is favorable to access the data sets from the net and explore the volume on a typical PC. Modern graphics hardware makes volume rendering at interactive rates possible. However, protocols for exchange of 3D graphics content such as VRML97 are not equipped to process volume data. This paper presents an approach using 2D/3D textures and standard rendering hardware, which allows real-time rendering of volume and polygonal data in VRML applications. The proposed environment enables the user to navigate through-and interact with-the VRML scene, combining volume and surface model data sets.","cites":"18","conferencePercentile":"82.14285714"},{"venue":"Web3D","id":"32370fd74c84ec8374f1d67e08f2feb732844177","venue_1":"Web3D","year":"2000","title":"The morph node","authors":"Marc Alexa, Johannes Behr, Wolfgang Müller","author_ids":"1751554, 1694015, 1722084","abstract":"We discuss potential and limitations of a Morph Node, inspired by the corresponding construct in Java3D. A Morph Node in Java3D interpolates vertex attributes among several homeomorphic geometries. This node is a promising candidate for the delivery of 3D animation in a very compact form. We review the state-of-the-art in Web 3D techniques with respect to the possibility of interpolating among several geometries. This review leads to a simple extension for VRML-97 as well as a recommendation for necessary changes in Java3D. Furthermore, we discuss various optimization issues for Morph Nodes.","cites":"23","conferencePercentile":"90"},{"venue":"Web3D","id":"8a7b60eb31998aa6fae5e451cff9b6ac08a29159","venue_1":"Web3D","year":"2013","title":"A VR based intervention tool for autism spectrum disorder","authors":"Mai El-Shehaly, Kimberly Zeitz, Rebecca Zeitz, Kevin Logan, Congwu Tao, Ji-Sun Kim, Denis Gracanin, Susan W. White, John A. Richey","author_ids":"1720427, 1728421, 1719267, 8674142, 1733334, 1713169, 1709677, 2197231, 3262763","abstract":"Recently, there has been increased interest in using Brain-Computer Interface (BCI) in virtual reality (VR) applications [Friedman et al. 2010]. We describe an ongoing research in BCI-enabled immersive VR systems and the development of a VR-based intervention tool based on X3D for people with Autism Spectrum Disorder (ASD) [Bellani et al. 2011; Munson and Pasqual 2012].","cites":"1","conferencePercentile":"50"},{"venue":"Web3D","id":"e89f3ae0db4308d65610986598583efed2dc128b","venue_1":"Web3D","year":"2013","title":"Unified WebGL/CSS scene-graph and application to AR","authors":"Hafez Rouzati, Luis Cruiz, Blair MacIntyre","author_ids":"2102401, 2821989, 1768774","abstract":"In this paper we present the implementation of a unified WebGL/CSS scene graph that allows 2D web elements to be combined with 3D WebGL-based graphics using a single scene-graph interface and discuss issues with respect to the augmented reality-enabled web browser Argon2.","cites":"1","conferencePercentile":"50"},{"venue":"Web3D","id":"25a0f691f2771cf3e545f278274e479d2036b751","venue_1":"Web3D","year":"2007","title":"From coarse-grained components to DVE applications: a service- and component-based framework","authors":"Xiaoyu Zhang, Denis Gracanin","author_ids":"1791962, 1709677","abstract":"Distributed Virtual Environments (DVEs) are distributed, simulated virtual worlds where users gather and interact within a shared space. Web-based DVE applications are attracting more and more attention. However, building DVE applications requires a significant effort, even with the modern development tools. In this paper we propose a component-based and a service-based framework for constructing DVE applications from coarse-grained components. This component-based and service-oriented architecture provides a great flexibility for building complex DVE applications. Based on the developed terminology and profile, the framework provides a high level description language for specifying user interaction tasks. The DVE developers can concentrate on the application design rather than worrying about the programming details. The framework also provides a runtime platform for coarse-grained components integration and a shared scene graph for coordinating the presentation for individual users.","cites":"6","conferencePercentile":"75.86206897"},{"venue":"Web3D","id":"167817a489c43ab34625d1a54e0eff1c45249ca5","venue_1":"Web3D","year":"2013","title":"Declarative integration of interactive 3D graphics into the world-wide web: principles, current approaches, and research agenda","authors":"Jacek Jankowski, Sandy Ressler, Kristian Sons, Yvonne Jung, Johannes Behr, Philipp Slusallek","author_ids":"3312524, 2546062, 3325913, 1680577, 1694015, 1711750","abstract":"With the advent of WebGL, plugin-free hardware-accelerated interactive 3D graphics has finally arrived in all major Web browsers. WebGL is an imperative solution that is tied to the functionality of rasterization APIs. Consequently, its usage requires a deeper understanding of the rasterization pipeline. In contrast to this stands a declarative approach with an abstract description of the 3D scene. We strongly believe that such approach is more suitable for the integration of 3D into HTML5 and related Web technologies, as those concepts are well-known by millions of Web developers and therefore crucial for the fast adoption of 3D on the Web. Hence, in this paper we explore the options for new declarative ways of incorporating 3D graphics directly into HTML to enable its use on any Web page. We present declarative 3D principles that guide the work of the <i>Declarative 3D for the Web Architecture W3C Community Group</i> and describe the current state of the fundamentals to this initiative. Finally, we draw an agenda for the next development stages of Declarative 3D for the Web.","cites":"12","conferencePercentile":"95"},{"venue":"Web3D","id":"cedbf24fe7cd31ff0d92e40f8865e0d9057d568e","venue_1":"Web3D","year":"2016","title":"Hybrid avatars: enabling co-presence in multiple realities","authors":"Timo Koskela, Matti Pouke, Paula Alavesa, Hannu Kukka, Minna Pakanen, Toni Alatalo, Timo Ojala","author_ids":"1852930, 2069163, 2084330, 2220949, 1854339, 2548035, 7967584","abstract":"Virtual reality (VR) and augmented reality (AR) technologies are quickly making their way into people's everyday lives. Typically, these technologies are used separately to create either plain VR or AR applications rather than harnessing the possibilities of combining the two. In this position paper, we introduce a novel concept of <i>hybrid avatar</i> that enables avatar-based interactions between VR and AR users visiting the same place both in the real world and its virtual counterpart. We illustrate a generic architecture for implementing hybrid avatar interactions, present our prototype implementation and discuss the implementation related challenges. Main contribution of this paper is to provide new ideas for research on the areas of VR, AR, and hybrid reality.","cites":"1","conferencePercentile":"91.66666667"},{"venue":"Web3D","id":"c60b8b6f6459eabff6ab26fa80a7b16a128bdb79","venue_1":"Web3D","year":"2009","title":"X3DOM: a DOM-based HTML5/X3D integration model","authors":"Johannes Behr, Peter Eschler, Yvonne Jung, Michael Zöllner","author_ids":"1694015, 2341368, 1680577, 3247907","abstract":"We present a model that allows to directly integrate X3D nodes into HTML5 DOM content. This model tries to fulfill the promise of the HTML5 specification, which references X3D for declarative 3D scenes but does not define a specific integration mode. The goal of this model is to ease the integration of X3D in modern web applications by directly mapping and synchronizing live DOM elements to a X3D scene model. This is a very similar approach to the current SVG integration model for 2D graphics.\n Furthermore, we propose a framework that includes a new X3D Profile for the DOM integration. This profile should make implementation simple, but in addition we show that the current X3D runtime model still scales well. A detailed discussion includes DOM integration issues like events, namespaces and scripting. We finally propose an implementation framework that should work with multiple browser frontends (e.g. Firefox and WebKit) and different X3D runtime backends.\n We hope to connect the technologies and the X3D/ W3C communities with this proposal and outline a model, how an integration without plugins could work. Moreover, we hope to inspire further work, which could lead to a native X3D implementation in browsers similar to the SVG implementations today.","cites":"120","conferencePercentile":"100"},{"venue":"Web3D","id":"fae8309e3cc27cc23c6ab7e80c7cddc2d1aae1cd","venue_1":"Web3D","year":"2016","title":"Informational components for mixed and augmented reality content","authors":"Gerard Jounghyun Kim, Sangyong Lee, Gun A. Lee","author_ids":"1715149, 3238387, 1720232","abstract":"In this paper, we describe a comprehensive set of information constructs for representing Mixed and Augmented Reality contents. The proposed set of components extends the conventional ones used for representing virtual reality contents, as virtual environments are often used for Mixed Reality implementations. We lay out the principles and requirements for the proposed extension and give details of the component model including (but not limited to) those for place-holding the objects in the real world, sensors, extended events and behaviors, supporting video backdrops and specifying spatial calibration among the virtual and real. We demonstrate the ease and extendibility of our model with various examples and show partial implementation results. The proposed model will serve as a sound basis for establishing standard and interoperable mixed augmented reality contents in the future.","cites":"0","conferencePercentile":"43.33333333"},{"venue":"Web3D","id":"3c4a1b846c5bab51fc3bffedd9859c99c5af2c99","venue_1":"Web3D","year":"2010","title":"A scalable architecture for the HTML5/X3D integration model X3DOM","authors":"Johannes Behr, Yvonne Jung, Jens Keil, Timm Drevensek, Michael Zöllner, Peter Eschler, Dieter W. Fellner","author_ids":"1694015, 1680577, 1741600, 3062522, 3247907, 2341368, 1734569","abstract":"We present a scalable architecture, which implements and further evolves the HTML/X3D integration model X3DOM introduced in [Behr et al. 2009]. The goal of this model is to integrate and update declarative X3D content directly in the HTML DOM tree. The model was previously presented in a very abstract and generic way by only suggesting implementation strategies. The available open-source <i>x3dom.js</i> architecture provides concrete solutions to the previously open points and extents the generic model if necessary. The outstanding feature of the architecture is to provide a single declarative interface to application developers and at the same time support of various backends through a powerful fallback-model. This fallback-model does not provide a single implementation strategy for the runtime and rendering module but supports different methods transparently. This includes native browser implementations and X3D-plugins as well as a WebGL-based scene-graph, which allows running the content without the need for installing additional plugins on all browsers that support WebGL. The paper furthermore discusses generic aspects of the architecture like encoding and introspection, but also provides details concerning two backends. It shows how the system interfaces with X3D-plugins and WebGL and also discusses implementation specific features and limitations.","cites":"43","conferencePercentile":"100"},{"venue":"Web3D","id":"4c5eb9bde6e3c8fcf063030bb738d972f84613e2","venue_1":"Web3D","year":"2013","title":"A hybrid visualization system for molecular models","authors":"Charles Marion, Joachim Pouderoux, Julien Jomier, Sébastien Jourdain, Marcus D. Hanwell, Utkarsh Ayachit","author_ids":"3184634, 2610245, 1992545, 1890741, 2512406, 2761175","abstract":"Nowadays, 3D visualization is part of our everyday lives and remains an important tool for understanding complex structures, dynamic simulations, and research discoveries. In the meantime, the complexity of the visualization often requires specific hardware, including visualization clusters, as well as dedicated software tools. Several efforts, such as WebGL and remote visualization, have been pushing visualization to the web browser. However, technical limitations have constrained the adoption of web browsers as a means of rendering 3D datasets. To surpass these limitations, prospective action has been recently initiated with the development of a web application based on two innovative technologies: WebGL and ParaViewWeb. This application combines the benefits of local and remote rendering, therefore allowing a user to visualize small to massive 3D molecular datasets on a large number of devices. To demonstrate this approach a prototype has been developed, and in this paper we present the hybrid architecture of the proposed system, the initial implementation experiment, and a comparison with current technologies. Finally, we discuss the future work and potential improvements of the application.","cites":"3","conferencePercentile":"72.5"},{"venue":"Web3D","id":"1a8d15ba28c8d8dce608d98e7dc0e5d2e76816da","venue_1":"Web3D","year":"2008","title":"Streaming web services for 3D portal applications","authors":"Xiaoyu Zhang, Denis Gracanin","author_ids":"1791962, 1709677","abstract":"3D Portal application is a multi-user Virtual Environment that creates its content from distributed 3D components. The users can explore the shared virtual space and interact with the virtual objects contributed from various providers. Service Oriented Architecture (SOA) is often used for the distributed Web applications as well as some real-time distributed simulations. SOA has its advantages in service integration and data interoperation based on the underlying Web services technology. However, the request-response communication style of the service invocation sets up a real-time performance barrier for the distributed 3D applications using SOA. We introduce a framework for real-time 3D portal applications using SOA. The proposed framework introduces additional streaming channels in the scene aggregation and uses <i>profiles</i> to coordinate the application integration. Both MPEG-4 and X3D are used as the standards for the 3D content delivery and presentation. We discuss the performance challenges based on the experiment results from a pilot study. Considering the performance impact of SOA, we suggest a set of applications that fit the proposed framework.","cites":"4","conferencePercentile":"52.94117647"},{"venue":"Web3D","id":"6fb0c6145e7baa2d462f208f18d7856e29795d28","venue_1":"Web3D","year":"2012","title":"Evaluation of static vs. animated views in 3D web user interfaces","authors":"Jacek Jankowski","author_ids":"3312524","abstract":"3D viewing applications (e.g., VRML/X3D browsers) often provide a viewpoint menu in order to allow easy navigation for users, so they can navigate from one point of interest to another simply by selecting a menu item. The viewpoint menu plays an important role in 3D interaction [Jankowski 2011]; it turned out to be an important navigation tool in our recent study [Jankowski and Decker 2012].","cites":"1","conferencePercentile":"30.3030303"},{"venue":"Web3D","id":"93cd367a40c9c2499eae706a51ba3d44739db86c","venue_1":"Web3D","year":"2002","title":"Rapid evaluation of Catmull-Clark subdivision surfaces","authors":"Jeffrey Bolz, Peter Schröder","author_ids":"2959110, 1775659","abstract":"Using subdivision as a basic primitive for the construction of arbitrary topology, smooth, free-form surfaces is attractive for content destined for display on devices with greatly varying rendering performance. Subdivision naturally supports level of detail rendering and powerful compression algorithms. While the underlying algorithms are conceptually simple it is difficult to implement player engines which achieve optimal performance on modern CPUs such as the Intel Pentium family.In this paper we describe a novel table driven evaluation strategy for subdivision surfaces using as an example the scheme of Catmull and Clark. Cache conscious design and exploitation of SIMD instructions allows us to achieve nearly 100% FPU utilization in the inner loop and achieve a composite performance of 1.2 flop/cycle on the Intel PIII and 1.8 flop/cycle on the Intel P4 including all memory transfers. The algorithm supports tradeoffs between cache size and memory bus usage which we examine. A library which implements this engine is freely available from the authors.","cites":"66","conferencePercentile":"100"},{"venue":"Web3D","id":"7c86b0b417a5fea750d4d9c8cd07149a49f063f3","venue_1":"Web3D","year":"2016","title":"VirtualOulu: collaborative, immersive and extensible 3D city model on the web","authors":"Toni Alatalo, Timo Koskela, Matti Pouke, Paula Alavesa, Timo Ojala","author_ids":"2548035, 1852930, 2069163, 2084330, 7967584","abstract":"In this paper, we describe the creation of a photorealistic digital 3D representation of a real world city and its subsequent publication as an open and collaborative 3D virtual world on the web using an open source software platform. We present the guidelines and conventions used in the collaborative development process of the model. We report the design and implementation of the web user interface of the model that exploits on dynamic on demand (un)loading of assets during navigation to reduce memory consumption on user device. We demonstrate the extensibility of the model with example applications. We report an empirical performance evaluation of the web user interface in terms of download latencies and memory consumption, and frame rate achieved with three different types of user devices during navigation. We identify a rendering bottleneck in the current implementation and present a candidate solution for fixing it.","cites":"2","conferencePercentile":"100"}]}