{"Web_Intelligence_and_Security_-":[{"venue":"Web Intelligence and Security - Advances in Data and Text Mining Techniques for Detecting and Preventing Terrorist Activities on the Web","id":"9078bdeaefe125d2770a4ea0328369297f8857e3","venue_1":"Web Intelligence and Security - Advances in Data and Text Mining Techniques for Detecting and Preventing Terrorist Activities on the Web","year":"2010","title":"Methods for Interactive Exploration of Large-Scale News Streams","authors":"Daniel A. Keim, Milos Krstajic, Peter Bak, Daniela Oelke, Florian Mansmann","author_ids":"1689367, 2909899, 1767272, 3147524, 1807859","abstract":"This paper presents a visual analytics approach to exploring large news articles collection in the domains of polarity, spatial and entity analysis. The exploration is performed on the data collected with Europe Media Monitor (EMM), a system which monitors over 2,500 online sources and processes 90,000 articles per day. In the analysis of the news feeds, we want to find out which topics are important in different countries, what is the general polarity of the articles within these topics and how the quantitative evolution of entities that are mentioned in the news, such as persons and organizations, developed over time. To assess the polarity of a news article, automatic techniques for polarity analysis are employed and the results are represented using Literature Fingerprinting for visualization. In the spatial description of the news feeds, every article can be represented by two geographic attributes, news origin and the location of the event itself. In order to assess these spatial properties of news articles, we conducted our analysis, which is able to cope with size and spatial distribution of the data. To demonstrate the use of our system, we also present case studies that show a) temporal analysis of entities, and b) analysis of their co-occurrence in news articles. Within this application framework, we show opportunities how real-time news feed data can be efficiently analyzed.","cites":"1","conferencePercentile":"100"}]}