{"Web_IntelligenceIAT_Workshops.c":[{"venue":"Web Intelligence/IAT Workshops","id":"a702462de5f48b8e3b3813c99e92484e2fa75a20","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"Study on the Government Affairs System Based on MetaData","authors":"Peng Zhang, Liming Li, Yanzhang Wang, Lu Yan, Ning Wang","author_ids":"1678443, 6644824, 1741568, 1787885, 1692369","abstract":"E-government is an important way to enhance the administration and the public service. With the study on metadata, the paper proposes the concept model of the government affairs system(GAS) based on metadata, and also explores the application of metadata and its related technology. At last it probes into the function of metadata in the government affairs system with an instance. It is hoped to be referenced for the construction of E-government.","cites":"0","conferencePercentile":"17.68707483"},{"venue":"Web Intelligence/IAT Workshops","id":"eed8a4d1d3ee240e09ddb6755d84799735f4eddf","venue_1":"Web Intelligence/IAT Workshops","year":"2011","title":"Ubiquitous Monitoring and User Perceptions as a Persuasive Strategy","authors":"Stuart Moran, Isaac Wiafe, Keiichi Nakata","author_ids":"2888389, 1736502, 7507695","abstract":"Observation is one of the most commonly used techniques to change behaviour through persuasion. When pervasive technology adopts this technique, in the form of ubiquitous monitoring, the benefits are likely to be significant. However, there is generally a lack of systematic methods for designing persuasive systems. This research aims to explore the use of the PSA-BI model and the 3D-RAB model in creating a method for systematically designing intentional behavioural change into ubiquitous monitoring systems.","cites":"1","conferencePercentile":"60.52631579"},{"venue":"Web Intelligence/IAT Workshops","id":"049bd56ba248e65ef0e926c8b57c1fe812754a98","venue_1":"Web Intelligence/IAT Workshops","year":"2011","title":"A Distributed Cognition Based Tool for Information Trajectory Analysis","authors":"Stuart Moran, Keiichi Nakata, Satoru Inoue","author_ids":"2888389, 7507695, 3062670","abstract":"Distributed cognition is a useful approach to study the interaction between agents (humans or artefacts) in a system, such as the collaboration involved in air traffic control. When taking a distributed cognition perspective, information processing can be directly observed. This provides the opportunity to explore how information moves through a system, and to identify specific areas where (pervasive) technology can be introduced. However, the analysis involved can not be simply used \"off-the-shelf\" and must be tailored to a specific scenario. Furthermore, the amount of time spent conducting the analysis is often quite significant. This motivates the need for a software tool to support this kind of analysis, to guide the researcher, and reduce the amount of time spent on analysis. This paper presents a prototype of such a tool.","cites":"1","conferencePercentile":"60.52631579"},{"venue":"Web Intelligence/IAT Workshops","id":"85ee0abb8eb4781976f241480d480644682560ba","venue_1":"Web Intelligence/IAT Workshops","year":"2007","title":"Resource-Aware Update Policy for Highly Dynamic P2P Networks","authors":"Dragan Milosevic, Jérôme Kunegis, Sahin Albayrak","author_ids":"3235207, 1697769, 1722170","abstract":"As a user attention has become a precious resource, a special care has to be taken to reduce the time needed for answering queries in P2P networks. Existing solutions are usually not fully aware of the seriousness to carefully use available network resources, and they are often focused on guarantying that results are found or that given update is propagated to all peers. Since the costs for giving such guaranties might be extremely large, a core of this paper is focused on presenting one update policy that carefully utilises available network resources and tries to improve itself by learning the importance of available peers. The rationality of having such update policy is supported by analysing the usage of peers together with estimating the load values of different network links.","cites":"0","conferencePercentile":"19.29824561"},{"venue":"Web Intelligence/IAT Workshops","id":"f3590b918b273a5d57a4b6294dba96043174e4bb","venue_1":"Web Intelligence/IAT Workshops","year":"2007","title":"Speeding Coordination by Combining Analytical and Inductive Learning","authors":"Dragan Milosevic, Sahin Albayrak","author_ids":"3235207, 1722170","abstract":"In a highly dynamic information society, the practical applicability of one filtering framework is usually directly proportional to its flexibility, where this assumes not only an easy integration of novel strategies but also the ability to adapt to new resource conditions. A major drawback of many existing systems, trying to make different synergies between filtering strategies, is usually concerned with an inability to easily integrate new strategies and with not taking care of resource availability, being critical for the realisation of the successful commercial deployments. The cornerstone of the presented filtering framework is in the encapsulation of the searching algorithms inside separate filtering agents whose abilities to be utilised in different runtime situations are efficiently learnt by combining both analytical and inductive learning. The evaluation results demonstrate that analytical learning successfully exploits domain knowledge about filtering strategies while helping inductive learning do faster adaptation.","cites":"0","conferencePercentile":"19.29824561"},{"venue":"Web Intelligence/IAT Workshops","id":"c7c9519c64dc247fc8bdd2b086954d7e7285de41","venue_1":"Web Intelligence/IAT Workshops","year":"2010","title":"Research on the Problem and Solution in Chinese E-government Development","authors":"Ning Wang, Ke Chao, He Bai, Qiuyan Zhong, Yanzhang Wang","author_ids":"1692369, 2046616, 3063591, 3304422, 1741568","abstract":"To promote a healthy and effective development of E-government in China, problems obstacle the E-government development are analyzed from planning, system construction and application level, based on previous construction experience such as overlapping projects, image projects, extensive investment and high failure rate. Corresponding solutions are given at last.","cites":"0","conferencePercentile":"21.3592233"},{"venue":"Web Intelligence/IAT Workshops","id":"76e8f69d42347da97dfaffc6d6a05ebee9f55a7c","venue_1":"Web Intelligence/IAT Workshops","year":"2010","title":"The Role of User Perceptions in Designing Ubiquitous Monitoring Systems","authors":"Stuart Moran, Keiichi Nakata","author_ids":"2888389, 7507695","abstract":"Pervasive computing will fundamentally change the way people interact with computers. By observing our actions on an unprecedented scale, the technology will enable new services and applications without the need for direct interaction from the user. However, research has shown that excessive levels of monitoring/data collection can cause undesirable effects on users. Researchers have begun to study the effect of this technology on users in order to prevent the possibility of undesirable effect. The focus has been on the impact of overall system design/choices, leaving the role of the user as a relatively unexplored area. As such, in this paper we propose the importance of user perceptions of monitoring systems in the process of predicting and explaining human behaviour.","cites":"0","conferencePercentile":"21.3592233"},{"venue":"Web Intelligence/IAT Workshops","id":"52d134dd431d8c788296a490bb4c84829dd60342","venue_1":"Web Intelligence/IAT Workshops","year":"2007","title":"An Improvement of Coleman Model of Trust: Using FNHMS to Manage Reputation in Multi-agent Systems","authors":"Guangquan Xu, Zhiyong Feng, Gang Wang, Huabei Wu","author_ids":"7322490, 1683334, 4148672, 2021801","abstract":"In his classical model of trust, Coleman argues the decision of an actor to trust or not is a function of the expected gain and loss involved. Here we will improve the Coleman model of trust. We believe that only if one agent is in the trustworthy group can the other agents trust it. In this paper, we mainly devote ourselves to the work of management of agents according to their reputation: we take advantage of FNHMS (Fuzzy Non-homogeneous Markov System) to model the agent system, during which three population parameters and two basic parameters are defined to deduce the transition probabilities matrix, so lastly we can simulate the change of the scale of trustworthy agents and know the whole distribution of agents about their reputation. Finally our experimental results prove that the theoretical results are true, and our improvement of the Coleman model of trust is fit and reasonable.","cites":"0","conferencePercentile":"19.29824561"},{"venue":"Web Intelligence/IAT Workshops","id":"a35de69799b47d1db6725e2cd7e2564736168b7d","venue_1":"Web Intelligence/IAT Workshops","year":"2012","title":"Policy-Based Governance within Luna: Why We Developed Yet Another Agent Framework","authors":"Larry Bunch, Jeffrey M. Bradshaw, Thomas C. Eskridge, Paul J. Feltovich, James Lott, Andrzej Uszok, Marco M. Carvalho","author_ids":"1882092, 7206985, 1703522, 2608613, 3048318, 1867435, 2735559","abstract":"In this article, we explain our rationale for the development of Luna, a software agent framework. In particular, we focus on how we use capabilities for comprehensive policy-based governance to ensure that key requirements for security, declarative specification of taskwork, and built-in support for joint activity within mixed teams of humans and agents are satisfied. KAoS, IHMC's ontology-based policy services framework, enables the semantically-rich and extensible semantics and the operational power and flexibility needed to realize these capabilities within Luna. We show how Luna is specifically designed to allow developers and users to leverage different forms of policybased governance in an endless variety of ways.","cites":"1","conferencePercentile":"75"},{"venue":"Web Intelligence/IAT Workshops","id":"2d2053c2368812a7cc564222366d6397afd80e2f","venue_1":"Web Intelligence/IAT Workshops","year":"2012","title":"Applicability of Demographic Recommender System to Tourist Attractions: A Case Study on Trip Advisor","authors":"Yuanyuan Wang, Stephen Chi-fai Chan, Grace Ngai","author_ids":"3814574, 2508623, 1706729","abstract":"Most of the existing recommender systems for tourism apply knowledge-based and content-based approaches, which need sufficient historical rating information or extra knowledge and suffer from the cold start problem. In this paper, a demographic recommender system is utilized for the recommendation of attractions. This system categorizes the tourists using their demographic information and then makes recommendations based on demographic classes. Its advantage is that the history of ratings and extra knowledge are not needed, so a new tourist can obtain recommendation. Focusing on the attractions on Trip Advisor, we use different machine learning methods to produce prediction of ratings, so as to determine whether these approaches and demographic information of tourists are suitable for providing recommendations. Our preliminary results show that the methods and demographic information can be used to predict tourists' ratings on attractions. But using demographic information alone can only achieve limited accuracy. More information such as textual reviews is required to improve the accuracy of the recommendation.","cites":"3","conferencePercentile":"92.94871795"},{"venue":"Web Intelligence/IAT Workshops","id":"625d619d9d10918bbd932fccb121ab3b7f48d2aa","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"A Utility-Based Web Content Sensitivity Mining Approach","authors":"Cheng Wang, Ying Liu, Liheng Jian, Peng Zhang","author_ids":"3879731, 1718041, 2974663, 1678443","abstract":"Abnormal remarks on World Wide Web, such as violence, threat, superstition, etc. may disturb the social order and public morality. Most traditional methods filter a page as long as it contains a keyword in a predefined blacklist. Such methods cannot provide a quantitative measure of how sensitive the content is. In this paper, we propose a utility-based Web content sensitivity mining approach. Utility is viewed as the measure of how sensitive a page is. It allows the Internet regulators to take different operations according to different sensitivity values. We apply our approach on a real-world Web dataset. It identified a number of sensitive Web pages that traditional frequency-based methods failed to find. By varying the sensitive values of the keywords, different sets of high sensitivity keywords were discovered.","cites":"1","conferencePercentile":"53.75"},{"venue":"Web Intelligence/IAT Workshops","id":"93dd4aa990d51175a0b49c102dfa94bfa647ea3a","venue_1":"Web Intelligence/IAT Workshops","year":"2010","title":"Analysis of User Feedback Cost for Document Similarity Judgment","authors":"Minghuang Chen, Seiji Yamada, Yasufumi Takama","author_ids":"8408644, 1679243, 1768055","abstract":"This paper investigates the behavior of users judging the similarity of documents from the viewpoint of user feedback cost, in particular judgment time and accuracy. An experiment is conducted, in which 21 test participants were asked to judge the similarity of documents. As the clue for the judgment, 3 types of information: original text, snippet, and term, are mutually provided. The judgment accuracy and judgment time are analyzed using analysis of variance (ANOVA) and multiple comparison tests to examine the difference of snippet, term and text. The result shows that displaying term is the best in terms of time cost, whereas the judgment accuracy when a snippet is provided is improved with experience. The obtained result will contribute to the design of interfaces that can minimize the user&#8217;s feedback cost.","cites":"0","conferencePercentile":"21.3592233"},{"venue":"Web Intelligence/IAT Workshops","id":"89be3b572101f72b14506a290fecbb0030d1fc13","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"An Abstract Model for Dynamic Access Control Architectures","authors":"Chuchang Liu, Angela Billard, Benjamin Long","author_ids":"3167907, 2641252, 2826191","abstract":"This paper presents an abstract model for Dynamic Access Control Architectures (DACAs). This model can express the most essential characteristics of a DACA, including risk, reputation and cost aspects, and how they interrelate. Such a model is helpful for designing and implementing a DACA, since it provides the flexibility to express several complex characteristics abstractly, ultimately resulting in a more structured foundation for implementation.","cites":"0","conferencePercentile":"21.875"},{"venue":"Web Intelligence/IAT Workshops","id":"23bfa038450aa40f0390c68e3e7de92517661417","venue_1":"Web Intelligence/IAT Workshops","year":"2011","title":"Explanation and Coordination in Human-Agent Teams: A Study in the BW4T Testbed","authors":"Maaike Harbers, Jeffrey M. Bradshaw, Matt Johnson, Paul J. Feltovich, Karel van den Bosch, John-Jules Ch. Meyer","author_ids":"1728623, 7206985, 3387473, 2608613, 7881863, 1691228","abstract":"There are several applications in which humans and agents jointly perform a task. If the task involves interdependence among the team members, coordination is required to achieve good team performance. Coordination in human-agent teams can be improved by giving humans insight in the behavior of the agents. When humans are able to understand and predict an agent's behavior, they can more easily adapt their own behavior to that of the agent. One way to achieve such understanding is by letting agents explain their behavior. This paper presents a study in the BW4T coordination test bed that examines the effects of agents explaining their behavior on coordination in human-agent teams. The results show that explanations about agent behavior do not always lead to better team performance, but they do impact user experience in a positive way.","cites":"1","conferencePercentile":"60.52631579"},{"venue":"Web Intelligence/IAT Workshops","id":"4597d65d30c0c3a97b85d232719ba3349e43167d","venue_1":"Web Intelligence/IAT Workshops","year":"2013","title":"Developing Troubleshooting Systems Using Ontologies","authors":"Reza Basseda, Michael Kifer, John P. Kane, Steven Greenspan, Paul Fodor","author_ids":"1991776, 1989587, 2234195, 2508928, 1773085","abstract":"Development of troubleshooting software is an attractive area of research for agent based system developers. In this project, we attempt to use ontologies extracted from different textual resources to automatically construct a troubleshooting virtual expert. In our solution, we verify the information about the structure of the system extracted from the textual document, then generate a conversation with the user in order to identify the problem and recommend appropriate remedies. To illustrate the approach, we have built knowledge base for a simple use case. A special parser generates conversations that can help the user solve software configuration problems.","cites":"0","conferencePercentile":"26.47058824"},{"venue":"Web Intelligence/IAT Workshops","id":"679c34ef3d786cce94d4cac54671988ba9ce923f","venue_1":"Web Intelligence/IAT Workshops","year":"2011","title":"Tomorrow's E-Mail: DLM 3.0 Project's Vision for the Future of E-Mail in Enterprises","authors":"Jérôme Mulsant, Gaëlle Recourcé, Romain Vuillemot","author_ids":"1846049, 1716250, 1683275","abstract":"In this paper we present the DLM 3.0 project's vision for e-mail communication in enterprise. The project promotes the use of semantic techniques, based on case studies and ergonomic analysis to improve current email tools, in an enterprise context. The project's realm is to create a corporate social network centered on email, with email being connected to the company tools, and automatically interacting with them. In this paper we describe the in situ study of email usages we performed to identify both human factors and technical limits of current messaging systems, personal information management and work-flows. Then we describe the features we developed towards a corporate social network and the next steps of the project.","cites":"0","conferencePercentile":"25.26315789"},{"venue":"Web Intelligence/IAT Workshops","id":"28d53852bf235cb20472e1d6aec3134f8bb710d4","venue_1":"Web Intelligence/IAT Workshops","year":"2011","title":"Semi-supervised Learning Framework for Cross-Lingual Projection","authors":"PengLong Hu, Mo Yu, Jing Li, Conghui Zhu, Tiejun Zhao","author_ids":"2871756, 2482533, 1742253, 2675365, 3006844","abstract":"Cross-lingual projection encounters two major challenges, the noise from word-alignment error and the syntactic divergences between two languages. To solve these two problems, a semi-supervised learning framework of cross-lingual projection is proposed to get better annotations using parallel data. Moreover, a projection model is introduced to model the projection process of labeling from the resource-rich language to the resource-scarce language. The projection model, together with the traditional target model of cross-lingual projection, can be seen as two views of parallel data. Utilizing these two views, an extension of co-training algorithm to structured predictions is designed to boost the result of the two models. Experiments show that the proposed cross-lingual projection method improves the accuracy in the task of POS-tagging projection. And using only one-to-one alignments proves to lead to more accurate results than using all kinds of alignment information.","cites":"2","conferencePercentile":"77.36842105"},{"venue":"Web Intelligence/IAT Workshops","id":"b4e7e3e1a94cc5274650edbee8e8b351e872566c","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"Mining for Patterns of Semantic Link Usage: Do Domain Users Actually Like Semantic Browsing?","authors":"Ed de Quincey, Helen Oliver, Patty Kostkova, Gawesh Jawaheer, Gemma Madle, Gayo Diallo, Dimitra Alexopoulou, Michael Schroeder, Bianca Habermann, Khaled Khelif, Simon Jupp, Robert Stevens","author_ids":"2958014, 3357707, 1698007, 2149041, 2145728, 1694291, 3018277, 1682804, 3104445, 3348964, 1740795, 1702360","abstract":"A perceived limitation of the current Web is that it is comprised of static links with no connection to any underlying domain knowledge. The Semantic Web is seen as a potential solution to this problem by delivering semantically related information to users dynamically. However, the benefit to users is rarely questioned and there have been few real-world user evaluations of semantic systems. In this paper we present a user-centred evaluation of three Semantic Web Browsers (SWB) that have been extended as part of the Sealife project. The results presented are based on analysis of the server logs from each application in relation to time taken to perform pre-defined tasks along with the amount of semantic activity carried out. It was found that the user experience was dependent on the SWB used but there was some indication users will be able to find information more quickly and that users will explore semantic features if present.","cites":"0","conferencePercentile":"17.68707483"},{"venue":"Web Intelligence/IAT Workshops","id":"f0054bae09b62161860287e012c74afe9ef9a8db","venue_1":"Web Intelligence/IAT Workshops","year":"2011","title":"A Utility-Based Recommendation Approach for Academic Literatures","authors":"Shenshen Liang, Ying Liu, Liheng Jian, Yang Gao, Zhu Lin","author_ids":"2541889, 1718041, 2974663, 1725881, 2663695","abstract":"With the rapid growth of information on the World Wide Web, recommender system has been receiving increasing attention. In academic literature recommendation applications, existing methods recommend papers merely based on their contents or cited frequencies, and none of them consider user's personalized requirements, such as authority, popularity, time, etc. To this end, in this paper, we propose a utility-based recommendation method. Experiments on a real-world data set show that our approach can obtain personalized recommendations without losing much quality.","cites":"0","conferencePercentile":"25.26315789"},{"venue":"Web Intelligence/IAT Workshops","id":"012e3fe57c9882c902dc0c8a69ceec231d9b5166","venue_1":"Web Intelligence/IAT Workshops","year":"2007","title":"Redefining Social Network Services: A Solution to Personal Information and Knowledge Management","authors":"Tingting Jiang, Daqing He","author_ids":"1684109, 1725184","abstract":"Instead of aiming at the augmentation of human communication abilities as other social software does, social network services (SNS) provide better chances for people to enhance their abilities to handle interpersonal relationships, by deriving their theoretical foundation from social network theory. However, they are far from working perfectly as reflected by the defects in the networks - distrust, fragmentation, and duplication. This paper addresses such problems innovatively in the context of personal information and knowledge management (PIKM), which involves a series of activities in our daily life and work that can be well supported by restructured SNS. While our future efforts target an operable SNS system as the solution to PIKM, our research at current stage gives full consideration to the identified problems, and achieves an initial system model with four primary modules: Personal Profile, Collaboration Workspace, Knowledge Network of Practice, and Platform.","cites":"2","conferencePercentile":"61.40350877"},{"venue":"Web Intelligence/IAT Workshops","id":"9cb1ceffc28fa0aa71c4b0198fd641bc5b8e6a0a","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"Research on Relation Models of Unexpected Events Oriented to Emergency Decision Support","authors":"Xuehua Wang, Dong Wang, Peng Zhang, Xin Ye, Ning Wang","author_ids":"2722768, 1726751, 1678443, 1743213, 1692369","abstract":"Inheritance relation model, Causal relation model and Reachable relation models are studied. These models can be applied in emergency information&#8217;s construction, data extraction and navigation of the disaster chain.","cites":"0","conferencePercentile":"17.68707483"},{"venue":"Web Intelligence/IAT Workshops","id":"477b8543801a6fefc0a62e4445c1b94dc09b48d0","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"The Application of Web Service Technology in Government Information Resources Sharing System","authors":"Ning Wang, He Bai, Li Hui, Xuehua Wang, Yanzhang Wang","author_ids":"1692369, 3063591, 1760144, 2722768, 1741568","abstract":"According to the current needs of the government information resources sharing, by reference Web Service technology, introduce Web Service technology and analyze its advantages, on the basis of the research, suggest a Web Service based government information resources shared system, to achieve effective conversion, unified exchange and sharing between different business system and different types of data.","cites":"0","conferencePercentile":"17.68707483"},{"venue":"Web Intelligence/IAT Workshops","id":"01a03a57615a54d3ee410e91469ceafc65ca878e","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"nAble Adaptive Scaffolding Agent - Intelligent Support for Novices","authors":"Joseph MacInnes, Stephanie Santosa, Nathan Kronenfeld, Judi McCuaig, William Wright","author_ids":"2665037, 2829030, 3207968, 2507730, 1879488","abstract":"Scaffolding techniques allow human instructors to support novice learners in critical early stages, and to remove that support as expertise grows. This paper describes nAble, an adaptive scaffolding agent designed to guide new users through the use of an analytic software tool in the &#8216;nSpace Sandbox&#8217; for visual sense-making. nAble adapts the interface and instructional content based on user expertise, learning style and subtask. Bayesian Networks and Hidden Markov task models provide the agent reasoning engine. An experiment was conducted in which participants were provided with one of: an adaptive scaffold, an indexed help file or a human guide. Users of the adaptive scaffold outperformed users of the indexed help and more quickly converged with the performance of users with the human guide.","cites":"0","conferencePercentile":"21.875"},{"venue":"Web Intelligence/IAT Workshops","id":"b899f01ecc87af8664cf8f948a8e6eb84ed0fe75","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Study on the Authorization Management Model Based on Organization in E-government","authors":"Peng Zhang, Yanzhang Wang, Wang Dong, Dong Yanjie, Ning Wang","author_ids":"1678443, 1741568, 2247385, 2360697, 1692369","abstract":"E-government is an important way to enhance the administration and the public service. With the analysis of Chinese government&#8217;s organizations and positions, the paper proposes an authorization management model based on organization which faces the integration of various business fields in government. In the view of management and technology, it solves the problem of the separation between organization management and empowerment, and decreases the complexity of management. It is hoped to be referenced for the construction of E-government.","cites":"0","conferencePercentile":"21.875"},{"venue":"Web Intelligence/IAT Workshops","id":"174e4f3ebc20b00b4dcc85ee51f96aac26bd0700","venue_1":"Web Intelligence/IAT Workshops","year":"2010","title":"The Development of an NLP-Based Chinese Ontology Construction Platform","authors":"Zhifang Sui, Yao Liu, Jun Zhao, Hong Zhang","author_ids":"1728854, 2553851, 1760149, 1734058","abstract":"This paper describes an NLP-based Chinese ontology construction platform developed by the authors. The construction platform is developed based on the open source project Prot&#233;g&#233;. The paper mainly focuses on two key technologies of automatic construction of ontology&#8212;the extraction of attribute value and the automatic generation of ontology hierarchy structure. The paper then introduces how the automatic construction technologies integrate into Prot&#233;g&#233; in the form of plug-in components, and finally describes the initial ideas for the development of an new ontology construction platform, which makes it possible to construct a large-scale ontology knowledge base.","cites":"0","conferencePercentile":"21.3592233"},{"venue":"Web Intelligence/IAT Workshops","id":"2378442b19892b792043503b179e77669084f833","venue_1":"Web Intelligence/IAT Workshops","year":"2013","title":"Correlation Coefficient of Compositional Data Based on Isometric Logratio Transformation","authors":"Wen Long, Qian Wang","author_ids":"1798232, 1729612","abstract":"Compositional data is a relatively independent field in statistical analysis. Aitchison used to introduce the additive-logratio transformation (alr) and centered logratio transformation (clr) in 1986, which are effective tools to solve the problem of compositional data. But those approaches are not isometry ways, and the interpretation of transformed data might be different from the expected properties. Then Egozcue put forward the isometric logratio transformation, which can transform the simplex space into the real Euclidean space. This paper aims at introducing a new approach to calculate the correlation of two sets of compositional data. This approach based on the isometric logratio transformation can preserve all metric properties and solve the problem of calculation of correlation coefficient on compositional data.","cites":"0","conferencePercentile":"26.47058824"},{"venue":"Web Intelligence/IAT Workshops","id":"9319ba38b438d11c997d6ef16b8d2b84d207ea20","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Comparison of Performance for SVM Based Relevance Feedback Document Retrieval in Several Vector Space Models","authors":"Takashi Onoda, Hiroshi Murata, Seiji Yamada","author_ids":"2551060, 2891223, 1679243","abstract":"We investigate the following data mining problems from the document retrieval: From a large data set of documents, we need to find documents that relate to human interest as few iterations of human testing or checking as possible. Ineach iteration a comparatively small batch of documents is evaluated for relating to the human interest. We apply ative learning techniques based on Support Vector Machine for evaluating successive batches, which is called relevance feedback. Our proposed approach has been very useful for document retrieval with relevance feedback experimentally. In this paper, we adopt several Vector Space Models into our proposed method, and then show the comparison results of the performance of our method in several Vector Space Models.","cites":"0","conferencePercentile":"21.875"},{"venue":"Web Intelligence/IAT Workshops","id":"2e271161937cc171e2d2e82ab6ba7b53a86b3d28","venue_1":"Web Intelligence/IAT Workshops","year":"2011","title":"MACS - Affective Conditioning System for Shared Working Environments","authors":"Mónica Sara Santos, Jeremy V. Pitt","author_ids":"7987725, 1800515","abstract":"Open plan offices require people to share a common space, and violation of (implicitly or explicitly stated) social norms can cause instances of incivility. Left unaddressed, bad feeling can lead to diminished productivity and cooperation in a shared enterprise, and in the long-term might lead to more serious problems, such as conflict and aggression. We propose an anonymous online system for flagging violations of social norms can address potential incivilities/conflict in open-plan offices. This paper reports on progress on the development of such a system, which aims to integrate affective computing, event recognition, forgiveness, reputation and participatory adaptation of social norms, to restore the office to equilibrium after an episode of incivility.","cites":"1","conferencePercentile":"60.52631579"},{"venue":"Web Intelligence/IAT Workshops","id":"ccbba91e80a3f7fc573c59405e55055921e561f6","venue_1":"Web Intelligence/IAT Workshops","year":"2011","title":"Problems and Countermeasures for Disaster Reduction in China's Remote Rural Areas","authors":"Ning Wang, Hongyu Huang, Yanzhang Wang, Hui Li, Liming Li","author_ids":"1692369, 5379983, 1741568, 1750828, 6644824","abstract":"In front of various disasters, the remote rural areas of China appear to be more vulnerable. Because of lacking sufficient attention, disaster reduction in these areas has become the short board of the disaster prevention and reduction system in china. Therefore, this paper lays special stress on analyzing the causes that giving rise to this phenomenon, and the deficiencies in execution, and then proposes some practicable ways to change this situation.","cites":"0","conferencePercentile":"25.26315789"},{"venue":"Web Intelligence/IAT Workshops","id":"95ff6e9f3c1ecc9df135afec25cec8afdca3314d","venue_1":"Web Intelligence/IAT Workshops","year":"2011","title":"Evaluating the Trade-Offs between Diversity and Precision for Web Image Search Using Concept-Based Query Expansion","authors":"Enamul Hoque, Orland Hoeber, Minglun Gong","author_ids":"2939577, 1679276, 2834751","abstract":"Even though Web image search queries are often ambiguous, traditional search engines retrieve and present results solely based on relevance ranking, where only the most common and popular interpretations of the query are considered. Rather than assuming that all users are interested in the most common meaning of the query, a more sensible approach may be to produce a diversified set of images that cover the various aspects of the query, under the expectation that at least one of these interpretations will match the searcher's needs. However, such a promotion of diversity in the search results has the side-effect of decreasing the precision of the most common sense. In this paper, we evaluate this trade-off in the context of a method for explicitly diversifying image search results via concept-based query expansion using Wikipedia. Experiments with controlling the degree of diversification illustrate this balance between diversity and precision for both ambiguous and specific queries. Our ultimate goal of this research is to propose an automatic method for tuning the diversification parameter based on degree of ambiguity of the original query.","cites":"4","conferencePercentile":"89.47368421"},{"venue":"Web Intelligence/IAT Workshops","id":"10e5c9c0c85eb4f9d8f61d1c3ee74efde0d7b5e4","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"Identifying Differences in News Coverage between Cultural/Ethnic Groups","authors":"Charles B. Ward, Mikhail Bautin, Steven Skiena","author_ids":"1719730, 2168395, 1721948","abstract":"Large-scale analysis over historical news corpora provides us with unique opportunities to examine sociological issues with respect to local and mass media. In particular, we combine the Lydia named entity recognition system with an name-based ethnicity classification engine to examine issues of ethnic and geocentric sentiment/coverage bias in newspapers. We describe new methods for ethnicity and nationality detection for news entities (people), and build on this to identify interesting temporal, geospatial, and association trends in the coverage with respect to 13 distinct cultural/ethnic/linguistic (CEL) groups.","cites":"4","conferencePercentile":"82.65306122"},{"venue":"Web Intelligence/IAT Workshops","id":"dc182d19ad98a87b862289c8a0052760be1b36d4","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"The Behavioural Implications of Ubiquitous Monitoring","authors":"Stuart Moran, Keiichi Nakata","author_ids":"2888389, 7507695","abstract":"Ubiquitous environments such as intelligent pervasive spaces are designed to make life better for users. In order to provide much of their intended functionality, significant amounts of data need to be collected about users through sensors deployed ubiquitously. Existing monitoring technologies have been known to often cause undesirable effects, and it is anticipated that ubiquitous monitoring, with its increased coverage, will result in an increase in the occurrence of these effects. So far, a limited amount of research has investigated the impact of this technology on users. As such, we present a preliminary model, consisting of a series of factors related to ubiquitous monitoring believed to influence behaviour, and augmented by the Theory of Planned Behaviour for understanding, predicting and therefore preventing any undesirable effects.","cites":"1","conferencePercentile":"46.59863946"},{"venue":"Web Intelligence/IAT Workshops","id":"07af6e078f4445abfaee5e8f4d5a81960adcc7dc","venue_1":"Web Intelligence/IAT Workshops","year":"2011","title":"Graph-Cut Based Iterative Constrained Clustering","authors":"Masayuki Okabe, Seiji Yamada","author_ids":"1791789, 1679243","abstract":"This paper proposes a constrained clustering method that is based on a graph-cut problem formalized by SDP (Semi-Definite Programming). Our SDP approach has the advantage of convenient constraint utilization compared with conventional spectral clustering methods. The algorithm starts from a single cluster of a complete dataset and repeatedly selects the largest cluster, which it then divides into two clusters by swapping rows and columns of a relational label matrix obtained by solving the maximum graph-cut problem. This swapping procedure is effective because we can create clusters without any computationally heavy matrix decomposition process to obtain a cluster label for each data. The results of experiments using a Web document dataset demonstrated that our method outperformed other conventional and the state of the art clustering methods in many cases. Hence we consider our clustering provides a promising basic method to interactive Web clustering.","cites":"0","conferencePercentile":"25.26315789"},{"venue":"Web Intelligence/IAT Workshops","id":"14ad7a827047349b3cfe239bb4df9fb3962eaf2b","venue_1":"Web Intelligence/IAT Workshops","year":"2007","title":"Online Discussion Participation Prediction Using Non-negative Matrix Factorization","authors":"Yik-Hing Fung, Chun-hung Li, William Kwok-Wai Cheung","author_ids":"1793524, 1682842, 1749915","abstract":"This paper studies the online discussion participation prediction (OFPP). Online discussion is an application on the web that provides a cyberspace for users to exchange or share different information. Finding suitable online discussions on Internet becomes difficult as huge amount of information existed. This led to recommendation systems that provide advices to users. In this paper, a weighted non-negative matrix factorization method is used to discover latent user preferences of online discussions such that prediction of user's participation can be obtained. Experimental results show that with the prediction of user's preferences, suitable online discussions can be suggested to the user.","cites":"2","conferencePercentile":"61.40350877"},{"venue":"Web Intelligence/IAT Workshops","id":"0cd22bc8c4465b3824bb3caac94fa9ffeaeb50b8","venue_1":"Web Intelligence/IAT Workshops","year":"2010","title":"Construction of Emergency Plan Network Model Supporting for Multi-plan-based Application","authors":"Jiangnan Qiu, Hao Zhang, Rui Zhang, Qiuyan Zhong, Ning Wang","author_ids":"7891642, 1694161, 1740520, 3304422, 1692369","abstract":"Cross-region public emergencies take place with composed threats and potential hazards, which needs multi-plan-based methods to be in application. In this paper an Emergency Plan System is suggested to provide those kinds of multi-plan supports. Two networks, HEPN and CEPN, are introduced to describe different aspects of the system. A general network called Emergency Plan Network (EPN) is composed based on those two and the application of EPN is present.","cites":"0","conferencePercentile":"21.3592233"},{"venue":"Web Intelligence/IAT Workshops","id":"480b28094485ad117554884a11d830891ecd019b","venue_1":"Web Intelligence/IAT Workshops","year":"2010","title":"An Interactive Tool for Constrained Clustering with Human Sampling","authors":"Masayuki Okabe, Seiji Yamada","author_ids":"1791789, 1679243","abstract":"This paper describes an interactive tool for constrained clustering that helps users to select effective constraints efficiently during the constrained clustering process. This tool has some functions such as 2-D visual arrangement of a data set and constraint assignment by mouse manipulation. Moreover, it can execute distance metric learning and k-medoids clustering. In this paper, we show the overview of the tool and how it works, especially in the functions of display arrangement by multi-dimensional scaling and incremental distance metric learning. Eventually we show a preliminary experiment in which human heuristics found through our GUI improve the clustering. This study provides fundamental technologies for interactive clustering of Web page and Web usages.","cites":"0","conferencePercentile":"21.3592233"},{"venue":"Web Intelligence/IAT Workshops","id":"4c2ed2d199245ab8228afa267e45019b2ebcce67","venue_1":"Web Intelligence/IAT Workshops","year":"2010","title":"A Hierarchical Description Framework of Decision Model for Multilevel Users","authors":"Xue-Long Chen, Yanzhang Wang, Ning Wang","author_ids":"2580295, 1741568, 1692369","abstract":"To make up for the insufficiency of the existing methods of decision model representation in supporting multilevel model users, a kind of hierarchical description framework of decision model is proposed. This framework is made up of basic layer, building block layer and conceptual layer that supporting three kinds of model users, which are the model constructors, the DSS constructors and the decision makers or the decision analyzers, respectively. In the end of the paper, an example is given to prove the scientificity and feasibility of the proposed description framework.","cites":"0","conferencePercentile":"21.3592233"},{"venue":"Web Intelligence/IAT Workshops","id":"7cc74d696fc827b70fb8fef8ed4d924cb978eb96","venue_1":"Web Intelligence/IAT Workshops","year":"2010","title":"Research on Organizational Collaboration Oriented OB4LAC in E-government","authors":"Huaiming Li, Shuai Yang, Ning Wang, Yanzhang Wang","author_ids":"2530913, 7388432, 1692369, 1741568","abstract":"With the development of collaborative electronic government system and the development trend of organizational collaboration in e-government. More and more e-government systems and safety platforms are developed and deployed. All of these bring the problems of collaborative electronic government system safety and integration of complicated systems, businesses and resources. One of the keys to solve these problems is the access control and authorization management of systems. In this paper, the Organization Based 4 Level Access Control (OB4LAC) is extended, and we propose the Organizational Collaboration Oriented OB4LAC (OB4LACC). Through the study of inter-organizational security collaboration schema based on OB4LACC, we discussed the OB4LACC application in the inter-organizational security collaboration. And we resolved lots of issues in the inter-organizational security collaboration, such as permission to enlarge and Conflict of permission.","cites":"0","conferencePercentile":"21.3592233"},{"venue":"Web Intelligence/IAT Workshops","id":"09a71a75f9efa7feb281261e7ba11176283a0999","venue_1":"Web Intelligence/IAT Workshops","year":"2010","title":"The Information Resource Integration in E-government Based on EAI","authors":"Liming Li, Peng Zhang, Ning Wang, Yanzhang Wang","author_ids":"6644824, 1678443, 1692369, 1741568","abstract":"Aim at E-Government application systems&#8217; some hot issues, such complex environment, resource redundancy and data not sharing, this thesis discusses application of EAI in e-government resource integration, and builds EAI information resources integration framework based on J2EE for the E-Government systems, which provides a new ideas for information resources integration of E-Government systems.","cites":"1","conferencePercentile":"56.31067961"},{"venue":"Web Intelligence/IAT Workshops","id":"7f58b640c6da71658dd498a5e8fa039574867262","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"Automated Web Site Evaluation - An Approach Based on Ranking SVM","authors":"Peng Li, Seiji Yamada","author_ids":"1722268, 1679243","abstract":"This paper proposes an automated web site evaluation approach using machine learning to cope with ranking problems. Evaluating web sites is a significant task for web service because evaluated web sites provide useful information for users to estimate sites&#8217; validation and popularity. Although many practical approaches have been taken to present a measuring stick for web sites, their evaluation functions are set up manually. Thus, we develop a method to obtain evaluation function using Ranking SVM and automatically rank web sites with the learned classifier. Also we conducted experiments and confirmed the effectiveness of our approach and its potential in performing high quality web site evaluation.","cites":"3","conferencePercentile":"74.48979592"},{"venue":"Web Intelligence/IAT Workshops","id":"15f0b57fc5af248f39a6f4301c974d3e662abd10","venue_1":"Web Intelligence/IAT Workshops","year":"2011","title":"Research on Acquisition Method of Knowledge Element for Emergency Management System","authors":"Xue-Long Chen, Wen-Hui Xiao, Liming Li, Yanzhang Wang, Ning Wang","author_ids":"2580295, 3019727, 6644824, 1741568, 1692369","abstract":"In this paper, a formal description of knowledge element is given. On the basis of the formal description, a preliminary research about knowledge element acquisition method of emergency management system is proposed. For the characteristics of emergency management knowledge which is multi-field, multidisciplinary, multi-granularity and multi-dimensional, the knowledge element acquisition method is combined with web2.0 ideas that pay more attention to the interaction of the users. The knowledge element acquisition method provides unstructured and structured knowledge building interfaces and uses a Semi-Automatic Model of knowledge acquisition which is combined with a variety of key technologies. Because of this, knowledge element of the final acquisition is more comprehensive and scientific.","cites":"0","conferencePercentile":"25.26315789"},{"venue":"Web Intelligence/IAT Workshops","id":"5089e83a9d2fc280cc649319449e262650cc2eda","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Solving Sum and Product Riddle via BDD-Based Model Checking","authors":"Xiangyu Luo, Kaile Su, Abdul Sattar, Yan Chen","author_ids":"1742825, 1776629, 1742312, 1700696","abstract":"We model the Sum and Product Riddle in public announcement logic, which is interpreted on an epistemic Kripke model. The model is symbolically represented as a finite state program with n agents. A model checking method to the riddle is developed by using the BDD-based symbolic model checking algorithm for logic of knowledge we developed in [7]. The method is implemented by extending the model checker MCTK [7] and then the solution of the riddle is verified successfully.","cites":"2","conferencePercentile":"71.5625"},{"venue":"Web Intelligence/IAT Workshops","id":"32499261465638c033e832329a73319634172dae","venue_1":"Web Intelligence/IAT Workshops","year":"2013","title":"Construction of a Chinese Semantic Dictionary by Integrating Two Heterogeneous Dictionaries: TongYiCi Cilin and HowNet","authors":"Chunxia Liang, Yanqiu Shao, Jing Zhao","author_ids":"1710329, 8005394, 5349795","abstract":"In order to build a practical semantic dictionary which will play an important role in the field of Chinese information processing, a Chinese semantic dictionary with a simple structure TH-CSD has been built in this paper. First, the architecture of the TH-CSD converted from TongYiCi Cilin extended version is introduced. Then the algorithm of integrating the data of How Net based on synonyms or similar words into TH-CSD is proposed, and the automatic results produced by the proposed algorithms are manually corrected. Lastly, for better understanding of the data in the TH-CSD, an online system for the TH-CSD is introduced.","cites":"0","conferencePercentile":"26.47058824"},{"venue":"Web Intelligence/IAT Workshops","id":"d9f1f0d1ce96e3add2ed8423e013502249fdf38e","venue_1":"Web Intelligence/IAT Workshops","year":"2010","title":"User Navigation Behavior Mining Using Multiple Data Domain Description","authors":"Li Xue, Ming Chen, Yun Xiong, Yangyong Zhu","author_ids":"2378008, 1711264, 3068690, 8247706","abstract":"User Navigation Behavior Mining (UNBM) mainly studies the problems of extracting the interesting user access patterns from user access sequences (UAS), which are usually used for user access prediction and web page recommendation. Through analyzing the real world web data, we find most of user access sequences carrying hybrid features of different patterns, rather than a single one.","cites":"8","conferencePercentile":"98.05825243"},{"venue":"Web Intelligence/IAT Workshops","id":"75c6324e11faa6d34a9f86fb2614d0a17974626e","venue_1":"Web Intelligence/IAT Workshops","year":"2012","title":"Clustering with Extended Constraints by Co-Training","authors":"Masayuki Okabe, Seiji Yamada","author_ids":"1791789, 1679243","abstract":"Constrained Clustering is a data mining technique that produces clusters of similar data by using pre-given constraints about data pairs. If we consider using constrained clustering for some practical interactive systems such as information retrieval or recommendation systems, the cost of constraint preparation will be the problem as well as other machine learning techniques. In this paper, we propose a method to complement the lack of constraints by using co-training framework, which extends training examples by leveraging two kinds of feature sets. Our method is based on a constrained clustering ensemble algorithm that integrates a set of clusters produced by a constrained k-means with random ordered data assignment, and runs the same algorithm on two different feature sets to extend constraints. We evaluate our method on a Web page dataset that provides two different feature sets. The results show that our method achieves the performance improvement by using co-training approach.","cites":"0","conferencePercentile":"31.41025641"},{"venue":"Web Intelligence/IAT Workshops","id":"15282c4555506b7ab4ac29695e2e246b9809500a","venue_1":"Web Intelligence/IAT Workshops","year":"2012","title":"Design and Implementation of a Cloud-Learning Service Platform","authors":"Jun Xiao, Minjuan Wang, Lamei Wang, XiaoXiao Zhu, Jason W. P. Ng","author_ids":"2781973, 1744112, 7974240, 1945398, 1870494","abstract":"With the fast development of cloud computing, education \"\"\"\"cloud\"\"\"\" has become a research hot spot. The integration of cloud computing and education has important impact on the establishment of an open, flexible learning service platform and on implementing resource sharing. By analyzing the current development of education cloud, this paper presents the architecture of an education cloud service platform and principles for designing various cloud services such as search, learning, resource service, and management. Based on the architecture we designed and developed a \"Mobile Class\" system for lifelong learning. This paper also reports the results of our usability testing with targeted users.","cites":"0","conferencePercentile":"31.41025641"},{"venue":"Web Intelligence/IAT Workshops","id":"a0e69a5546988d39cd7c6ba1907c5af656a2c57d","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"Contextual Data Management and Retrieval: A Self-Organized Approach","authors":"Gabriella Castelli, Franco Zambonelli","author_ids":"2880880, 1684412","abstract":"Pervasive computing devices are able to generate enormous amounts of distributed data, from which knowledge about situations and facts occurring in the world should be inferred for the use of pervasive services. However accessing and managing effectively such a huge amount of distributed information is challenging for services. In this paper we propose a self-organized agent-based approach to autonomously organize distributed contextual data items into sorts of knowledge networks. Knowledge networks are conceived as an alive self-organized layer in charge of managing data, that can facilitate services in extracting useful information out of a large amount of distributed items. We present the W4 Data Model we used to represent data and the self-organized approach to build Knowledge Networks. Some experimental","cites":"5","conferencePercentile":"87.41496599"},{"venue":"Web Intelligence/IAT Workshops","id":"049194674f32a155e6c209821968cd67508a7662","venue_1":"Web Intelligence/IAT Workshops","year":"2010","title":"Careful Seeding Based on Independent Component Analysis for k-Means Clustering","authors":"Takashi Onoda, Miho Sakai, Seiji Yamada","author_ids":"2551060, 3251141, 1679243","abstract":"The k-means method is a widely used clustering technique because of its simplicity and speed. However, the clustering result depends heavily on the chosen initial value. In this report, we propose a seeding method with independent component analysis for the k-means method. Using a benchmark dataset, we evaluate the performance of our proposed method and compare it with other seeding methods.","cites":"1","conferencePercentile":"56.31067961"},{"venue":"Web Intelligence/IAT Workshops","id":"602c313bc8cde3952546187234efb8d2e4abb9c0","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"Clustering with Constrained Similarity Learning","authors":"Masayuki Okabe, Seiji Yamada","author_ids":"1791789, 1679243","abstract":"This paper proposes a method of learning a similarity matrix from pairwise constraints for interactive clustering. The similarity matrix can be learned by solving an optimization problem as semi-definite programming where we give additional constraints about neighbors of constrained pairwise data besides original constraints. For interactive clustering, since we can get only a few pairwise constraints from a user, we need to extend such constraints to richer ones. Thus this proposed method to extend the pairwise constraints to space-level ones is effective to interactive clustering. First we formalize clustering with constrained similarity learning, and then introduce the extended constraints as linear constraints. We verify the effectiveness of our proposed method by applying it on a simple clustering task. The results of the experiments shows that our method is promising.","cites":"1","conferencePercentile":"46.59863946"},{"venue":"Web Intelligence/IAT Workshops","id":"03c02aa2ce1688e87607497296dbfe4609497335","venue_1":"Web Intelligence/IAT Workshops","year":"2011","title":"Independent Component Analysis Based Seeding Method for K-Means Clustering","authors":"Takashi Onoda, Miho Sakai, Seiji Yamada","author_ids":"2551060, 3251141, 1679243","abstract":"The k-means clustering method is a widely used clustering technique for the Web because of its simplicity and speed. However, the clustering result depends heavily on the chosen initial clustering centers, which are chosen uniformly at random from the data points. We propose a seeding method based on the independent component analysis for the k-means clustering method. We evaluate the performance of our proposed method and compare it with other seeding methods by using benchmark datasets. We applied our proposed method to a Web corpus, which is provided by ODP. The experiments show that the normalized mutual information of our proposed method is better than the normalized mutual information of k-means clustering method and k-means++ clustering method. Therefore, the proposed method is useful for Web corpus.","cites":"3","conferencePercentile":"85.26315789"},{"venue":"Web Intelligence/IAT Workshops","id":"dadc8c62cf3913232eb01a9262b5aefba4851087","venue_1":"Web Intelligence/IAT Workshops","year":"2007","title":"An Approach to Discovery with miAamics and jABC","authors":"Christian Kubczak, Tiziana Margaria, Christian Winkler, Bernhard Steffen","author_ids":"2651365, 1772793, 1700240, 1804858","abstract":"We address the discovery scenario using miAamics, a framework for rule-based evaluation originally developed for efficient and scalable personalization purposes, as a reasoning engine. The discovery service is implemented in the jABC framework.","cites":"8","conferencePercentile":"89.47368421"},{"venue":"Web Intelligence/IAT Workshops","id":"4e30a6ea321dd28f87bee8a518df2b1c4eb542c9","venue_1":"Web Intelligence/IAT Workshops","year":"2007","title":"The Data Preprocessing of Behavior Pattern Discovering in Collaboration Environment","authors":"Jinliang Song, Tiejian Luo, Su Chen, Feng Gao","author_ids":"1700560, 1726990, 4758970, 1710132","abstract":"Collaboration environment supports organizations and individuals sharing resource, taking advantage of their knowledge, and cooperating to accelerate their work especially for large scale problem. To find out the law of collaboration works through an automated approach is beneficial to improve collaboration environment, and is known as behavior pattern discovering. Traditionally, preprocessing is considered as data preparation, and mainly covers four kinds of methods as variable selection, sample selection, variable construction, and variable transformation. The preprocessing in behavior pattern discovering focuses on sample selection and variable transformation, because of the four challenges in behavior pattern discovering that the lack of reference knowledge, the cutting short of continuous recorded data, the transformation of resource data according to meanings, and the utilization of various recorded information. This paper emphasizes the indicators that information reservation and data reduction, and points out the major challenge in preprocessing is how to balance the two. Further more, the paper gives out effective algorithms on variable transformation and event sequence dividing. Such algorithms assure that the whole behavior pattern discovering approach works under an efficient and automatic way.","cites":"2","conferencePercentile":"61.40350877"},{"venue":"Web Intelligence/IAT Workshops","id":"82b20426dc47669375e089d594351d7166fc0e50","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"ERPBAM: A Model for Structure and Reasoning of Agent Based on Entity-Relation-Problem Knowledge Representation System","authors":"Xue-Long Chen, Liming Li, Yanzhang Wang, Ning Wang, Xin Ye","author_ids":"2580295, 6644824, 1741568, 1692369, 1743213","abstract":"At first, a new knowledge representation system, named entity-relation-problem (E-R-P) knowledge representation system, is proposed. Then a model for structure and reasoning of agent based on the E-R-P knowledge representation system, named ERPBAM, is put forward. ERPBAM is straightforward, flexible and general. So it solves the problem of complexity of structure and reasoning for agent, which is caused by complex symbol representation and deduction. Furthermore, ERPBAM has the ability to handle all kinds of information, especially the fuzzy information, involved in the reasoning process. Because E-R-P knowledge representation system synthetically represents the knowledge of objective system and realistic problems, the structure and reasoning process of agent in ERPBAM become more integrated, and the corresponding implementation code becomes more compact.","cites":"1","conferencePercentile":"46.59863946"},{"venue":"Web Intelligence/IAT Workshops","id":"b95ea7e28fed9524fd368d489533ba615906a58f","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Interactive Spam Filtering with Active Learning and Feature Selection","authors":"Masayuki Okabe, Seiji Yamada","author_ids":"1791789, 1679243","abstract":"This paper proposes an interactive spam filtering method that utilizes active learning and feature selection. Identifying effective features are very important in spam filtering because spam mails include so many meaningless words that are slightly different from each other. Thus identifying effective and ineffective features is promising approach.Although traditional feature selection methods have been done based on some amount of labeled training data, this assumption does not hold in interactive spam filtering. We propose a method to identify effective features through active learning in spam filtering using naive Bayes approach. Experimental results show that our method outperforms traditional methods that operate with no feature selection.","cites":"3","conferencePercentile":"82.5"},{"venue":"Web Intelligence/IAT Workshops","id":"d7334881ff9c6406c4b4635a8d016848c8ac69d0","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Research on the Web Information System Development Platform Based on MVC Design Pattern","authors":"Ning Wang, Liming Li, Yanzhang Wang, Wang Yi-bing, Jing Wang","author_ids":"1692369, 6644824, 1741568, 3051030, 1697912","abstract":"In order to make the Web information system development more efficient, improving the reusability, stability and scalability of system, features of a Web information system development are studied. A Web information system development platform adapting to operational requests and achieving quick development based on MVC design pattern is constructed. After introducing the platform&#8217;s framework system, the design and realization of its main parts, design philosophy and basic framework of the platform are given, integrating application examples.","cites":"0","conferencePercentile":"21.875"},{"venue":"Web Intelligence/IAT Workshops","id":"d08d249fbc9caf28b4d4079653abdf86d36046e6","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"Proposal to the Development of Emergency Logistics System","authors":"Lan Lan, Huaiming Li, Ning Wang","author_ids":"6119467, 2530913, 1692369","abstract":"Emergency logistics is still in the stage of initial development in China. In response to all kinds of major public emergency, China has a certain ability of the protection of emergency supplies. However, in most cases, the first time protection of emergency supplies can be difficult to achieve in general. Especially, the \"5.12\" large earthquake makes Chinese emergency logistics system facing an unprecedented test. Based on the analysis of problems of China's current emergency logistics system, the paper gives proposal to improve logistics system.","cites":"0","conferencePercentile":"17.68707483"},{"venue":"Web Intelligence/IAT Workshops","id":"3db0b733d66bba52723fc9c0410d30270486049b","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"Research and Application on Business Rules for One-Stop Administrative Permit System","authors":"Xin Ye, Na Wang, Yanzhang Wang, Hui Li, Shengju Han","author_ids":"1743213, 1806730, 1741568, 1750828, 2076700","abstract":"Administrative permit businesses are modeled based on business objects. An extended NAM based on the roles, business objects and time constraint is proposed in this paper. Based on the extended NAM, on the one hand, the description of business rules among objects and the corresponding reasoning mechanisms are proposed. On the other hand, description of business rules during in object processing is proposed. In the end, the general business process of one-stop administrative permit system is proposed, so that the approval businesses dispersed in various departments are integrated and the flexibility of the system can be increased.","cites":"0","conferencePercentile":"17.68707483"},{"venue":"Web Intelligence/IAT Workshops","id":"80c63e53791ac1ecceaab22d3a07779e9a141925","venue_1":"Web Intelligence/IAT Workshops","year":"2007","title":"Applying Cross-Level Association Rule Mining to Cold-Start Recommendations","authors":"Cane Wing-ki Leung, Stephen Chi-fai Chan, Korris Fu-Lai Chung","author_ids":"2142726, 2508623, 1728107","abstract":"We propose a novel hybrid recommendation algorithm for addressing the well-known cold-start problem in Collaborative Filtering (CF). Our algorithm makes use of Cross-Level Association RulEs (CLARE) to integrate content information about domain items into collaborative filters. We first introduce a preference model comprising both user-item and item-item relationships in recommender systems, and then describe how the CLARE algorithm generates recommendations for cold-start items based on the preference model. Experimental results validated that CLARE is capable of recommending cold-start items, and that it increases the number of recommendable items significantly by addressing the cold-start problem.","cites":"8","conferencePercentile":"89.47368421"},{"venue":"Web Intelligence/IAT Workshops","id":"01598681804f4411b40e55901c82291f2b6901d6","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Identifying Opinion Leaders in BBS","authors":"Zhongwu Zhai, Hua Xu, Peifa Jia","author_ids":"1774830, 1718800, 2463381","abstract":"Opinion leaders play a very important role in information diffusion; they are found in all fields of society and influence the opinions of the masses in their fields. Most proposed algorithms on identifying opinion leaders in internet social network are global measure algorithms and usually omit the fact that opinion leaders are field-limited. We propose and test several algorithms, including interest-field based algorithms and global measure algorithms, to identify opinion leaders in BBS. Our experiments show that different algorithms are sensitive to different indicators; the interest-field based algorithms which not only take into account of the social networks&#8217; structure but also the users&#8217; interest space are more reasonable and effective in identifying opinion leaders in BBS. The interest-field based algorithms are sensitive to the high status nodes in the social network, and their performance relies on the quality of field discovery.","cites":"6","conferencePercentile":"92.8125"},{"venue":"Web Intelligence/IAT Workshops","id":"36d563a805968aab39996f13c246bc8f9fc1ee6c","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"How Does Label Propagation Algorithm Work in Bipartite Networks?","authors":"Xin Liu, Tsuyoshi Murata","author_ids":"1749705, 1702484","abstract":"Community detection in networks receives much attention recently. In this paper, we investigate a recently proposed community detection algorithm&#8212;label propagation algorithm (LPA), and propose a new algorithm to make it more suitable for bipartite networks. We demonstrate through five real world data sets that the new algorithm, while maintaining the accuracy and the near linear time complexity of the standard LPA, is more stable than the latter. More importantly, the new algorithm is readily parallelized, which implies that it is potential for real time community analysis of large-scale bipartite networks.","cites":"7","conferencePercentile":"93.87755102"},{"venue":"Web Intelligence/IAT Workshops","id":"d882312214c20688c8055fc496bbfb24fbb85f81","venue_1":"Web Intelligence/IAT Workshops","year":"2011","title":"Leveraging the Linked Data Principles for Electronic Communications","authors":"Antoine Zimmermann","author_ids":"1776818","abstract":"In this position paper, I advocate the use of Semantic Web and Linked Data technologies to improve online communication. In particular, the Linked Data principles allow users to better integrate multiple forms of online communications, bridging the gap between emails, forums, blogging and microblogging and so on. By lifting message content and metadata to standard formats (using RDF, RDFS, OWL and SPARQL) with a rich, well defined semantics, it is expected that finding information in a mixture of fastly growing user-generated content, conversation and social activities will be easier and more uniform all over the Internet.","cites":"1","conferencePercentile":"60.52631579"},{"venue":"Web Intelligence/IAT Workshops","id":"6c2b4c91f68f010ba5cb3840ebf9882919f3bd67","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"An Emergency Decision Support System Based on the General Decision Process","authors":"Xin Ye, Yanzhang Wang, Hui Li, Zailin Dai","author_ids":"1743213, 1741568, 1750828, 2358673","abstract":"Emergency Decision Support System (EDSS) is a very useful method to improve the level of emergency management. How to build an open, comprehensive and flexible emergency decision support system to handle various public emergencies and integrate various models and methods, has become a focus in the theoretical study and practical applications. Firstly, the general decision process of emergency management is proposed. Then, as the starting point and the end result of decision-making, the problem is studied in detail, and problem model is presented. Finally, the architecture of EDSS base on general decision process is proposed.","cites":"1","conferencePercentile":"53.75"},{"venue":"Web Intelligence/IAT Workshops","id":"25a58c330fbb9f9c756590f23978543622074ca5","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Social and Personal Context Modeling for Contact List Recommendation on Mobile Device","authors":"Jun-Ki Min, Hee-Taek Kim, Sung-Bae Cho","author_ids":"2468515, 3126395, 1723666","abstract":"This paper presents a social and personal context modeling method on mobile device. It infers user&#8217;s contexts, such as amity with others and emotional state, from uncertain logs stored in mobile devices using Bayesian networks. Proper services are then provided to the user based on the semantic compatibility between current and past contexts. Here, the contexts are hierarchically matched after each context is expanded to the context-tree using domain ontology. We have implemented a contact list recommendation application on mobile device that recommends phone numbers in a phonebook according to the user&#8217;s situation. Experimental results on real-user data show that the method provides an efficient and accurate means for mobile based social networking applications.","cites":"0","conferencePercentile":"21.875"},{"venue":"Web Intelligence/IAT Workshops","id":"d92b0f2600c24a5d16e278d70f4768fab7f4dd28","venue_1":"Web Intelligence/IAT Workshops","year":"2007","title":"A Preliminary Analysis of Computational Complexity of the Threshold Adjusting Mechanism in Multi-issue Negotiations","authors":"Katsuhide Fujita, Takayuki Ito","author_ids":"1705264, 1679044","abstract":"In this paper, we propose a threshold adjusting mechanismin complex negotiations among software agents. The mechanism reduces computational complexity to find agreements that produce higher social welfare. Multi-issue negotiation protocols have been studied widely and represent a promising field since most negotiation problems in the real world involve interdependent multiple issues. We have proposed negotiation protocols where a bidding-based mechanism is used to find social-welfare maximizing deals. The threshold adjusting mechanism proposed here reduces the number of candidate bids. The preliminary experimental results show that the threshold adjusting mechanism can reduce the computational cost while keeping enough optimality.","cites":"1","conferencePercentile":"47.80701754"},{"venue":"Web Intelligence/IAT Workshops","id":"0d83403397c7e59a39dd289a707d2e82e034b93e","venue_1":"Web Intelligence/IAT Workshops","year":"2010","title":"Designing Pervasive Interactions for Ambient Guidance with Situated Flows","authors":"Fahim Kawsar, Gerd Kortuem, Bashar Altakrouri","author_ids":"1792840, 1682658, 1776706","abstract":"Effectively guiding people in complex and highly dynamic work environment requires advances in high-level declarative activity models that can describe the flow of human work activities and their intended outcomes, as well as novel user interface models for distributing guidance information across time and space. This paper describes a new line of research aimed at developing a new programming and human interface approach for pervasive systems based on high-level models of human activities, so-called situated flows, and mobile projector interfaces for uncovering task information embedded in physical environments","cites":"1","conferencePercentile":"56.31067961"},{"venue":"Web Intelligence/IAT Workshops","id":"2a22c9f086857ecab71eb44003c93b67e90edc97","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"Ontology-Based Semantic Web Image Retrieval by Utilizing Textual and Visual Annotations","authors":"Ja-Hwung Su, Bo-Wen Wang, Hsin-Ho Yeh, Vincent S. Tseng","author_ids":"3098461, 2375105, 3235495, 1726056","abstract":"The goal of traditional visual or textual-based image retrieval is to satisfy user&#8217;s queries by associating the images and semantic concepts effectively. As a result, perceptual structures of images have attracted researchers&#8217; attention in recent studies. However, few past studies have been made on achieving semantic image retrieval by using image annotation techniques. To catch user&#8217;s ontological intention, we propose a new approach, namely Intelligent Web Image FetchER (iWIFER), which simultaneously considers the ontological requirements in usability, intelligence and effectiveness. Based on the proposed visual and textual-based annotation models, the image query becomes easy and effective. Through empirical evaluations, our annotation models can deliver accurate results for semantic web image retrieval.","cites":"2","conferencePercentile":"63.60544218"},{"venue":"Web Intelligence/IAT Workshops","id":"4e3d9e750729248d12e2de97bd96a21fa6c8c7fe","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Effective Ranking and Recommendation on Web Page Retrieval by Integrating Association Mining and PageRank","authors":"Ja-Hwung Su, Bo-Wen Wang, Vincent S. Tseng","author_ids":"3098461, 2375105, 1726056","abstract":"Nowadays, the well-known search engines, such as Google, Yahoo, MSN, etc, have provided the users with good search results based on special search strategies. However there still exist some problems unsolved for traditional search engines, including: 1) the gap between user&#8217;s intention and searched results is not easy to narrow down under the global search space, and 2) user&#8217;s interested pages hidden in the local website are not associated with the search results. To deal with such problems, in this paper, we propose a novel approach for personalized page ranking and recommendation by integrating association mining and PageRank so as to meet user&#8217;s search goals. Moreover, by mining the users&#8217; browsing behaviors, we can successfully bridge the gap between global search results and local preferences. The effectiveness of our proposed approach was verified through experimental evaluations.","cites":"4","conferencePercentile":"87.8125"},{"venue":"Web Intelligence/IAT Workshops","id":"fb48b7e878c5d14639696d67f9a1e4bd4fe87417","venue_1":"Web Intelligence/IAT Workshops","year":"2013","title":"Sentiment Analysis Using Sentiment Features","authors":"Seyed Ali Bahrainian, Andreas Dengel","author_ids":"3091795, 1703343","abstract":"Sentiment Analysis (SA) or opinion mining has recently become the focus of many researchers, because analysis of online text is beneficial and demanded for market research, scientific surveys from psychological and sociological perspective, political polls, business intelligence, enhancement of online shopping infrastructures, etc. This paper introduces a novel solution to SA of short informal texts with a main focus on Twitter posts known as \"tweets\". We compare state-of-the-art SA methods against a novel hybrid method. The hybrid method utilizes a Sentiment Lexicon to generate a new set of features to train a linear Support Vector Machine (SVM) classifier. We further illustrate that our hybrid method outperforms the state-of-the-art unigram baseline.","cites":"3","conferencePercentile":"93.38235294"},{"venue":"Web Intelligence/IAT Workshops","id":"0866dcd736d4d4aedb858264a0dc37f8f2a03399","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"Enhanced Gestalt Theory Guided Web Page Segmentation for Mobile Browsing","authors":"Xin Yang, Yuanchun Shi","author_ids":"6826800, 1732440","abstract":"This paper proposes a novel Web page segmentation method for mobile browsing, aiming to break a Web page into visually and semantically coherent units fitted to the limited screen size of mobile devices. We intend to simulate human&#8217;s perceptive process guided by four general laws in Gestalt theory, namely: proximity, similarity, closure and simplicity. We also present an application of adapting Web pages to mobile terminals based on segmentation. Experimental results show that the proposed method is efficient and can greatly improve segmentation accuracy.","cites":"3","conferencePercentile":"74.48979592"},{"venue":"Web Intelligence/IAT Workshops","id":"18a8a2e6e5af27285300f9f27fba46118b841f0f","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Generating Personalized Summaries Using Publicly Available Web Documents","authors":"Chandan Kumar, Prasad Pingali, Vasudeva Varma","author_ids":"5583292, 1941849, 1704709","abstract":"Many Knowledge workers are increasingly using online resources to find out latest developments in their specialty and articles of interest. To extract relevant information from such multiple online information sources summarization is being used. Current summarization systems produce a uniform version of summary for all users. However summaries which are generic in nature do not cater to the user&#8217;s background and interests. In this paper we propose to makethe summarization process user specific and present a design for generating personalized summaries of online articles that are tailored to each person&#8217;s interest. The user&#8217;s data available on web is used for model their background and interest. A controlled user-centered qualitative evaluation carried out on news articles of science and technology domain, indicates better user satisfaction with personalized summaries compared to generic summaries.","cites":"2","conferencePercentile":"71.5625"},{"venue":"Web Intelligence/IAT Workshops","id":"8ba723186216e1eba01550c0da490ed4c4c544db","venue_1":"Web Intelligence/IAT Workshops","year":"2007","title":"Semiautomatic Extraction of Topic Maps from Web Pages Using Clustering with Web Contents and Structure","authors":"Motohiro Mase, Seiji Yamada, Katsumi Nitta","author_ids":"2823688, 1679243, 1779912","abstract":"In this paper, we describe a method to semi-automatically extract Topic Maps from a set of Web pages. We introduce the following two points to the existing clustering method: The first is merging only the linked Web pages, to extract the underlying relationship of the topics. The second is introducing the similarity by contents of Web pages and the types of links, and the distance between the directories in which the pages are located, to generate dense clusters. We generate the topic map by assuming the clusters as topics, the edges as associations, the Web pages related to the topic as occurrences from the result of clustering. We experimentally extracted the topic map and evaluated it.","cites":"0","conferencePercentile":"19.29824561"},{"venue":"Web Intelligence/IAT Workshops","id":"d720e607264414e8982785ece7016de88ec5653b","venue_1":"Web Intelligence/IAT Workshops","year":"2007","title":"Comparison of Learning Performance and Retrieval Performance for Support Vector Machines Based Relevance Feedback Document Retrieval","authors":"Takashi Onoda, Hiroshi Murata, Seiji Yamada","author_ids":"2551060, 2891223, 1679243","abstract":"This paper presents a learning performance and a retrieval performance of an interactive document retrieval method, which is based on Support Vector Machine(SVM). Some works have been done to apply classification learning like SVM to relevance feedback and obtained successful results. However they did not fully utilize characteristic of example distribution in document retrieval. We propose heuristics to bias document showing in order to take good learning performance and good retrieval performance of relevance feedback. This paper introduces two evaluation crietria. One criterion measures the learning performance and the other measures the retrieval performance. We compared a SVM-based system with our heuristic with conventional systems like Rocchio-based system and a SVM-based system without our heuristic by the introduced crietria. We could confirm the learning performance of our system outperformed other ones.","cites":"0","conferencePercentile":"19.29824561"},{"venue":"Web Intelligence/IAT Workshops","id":"5f64067aeddf029c0ab81356590afc229211b2d5","venue_1":"Web Intelligence/IAT Workshops","year":"2012","title":"Personalising the iCampus: An End-User Programming Approach","authors":"Jeannette Shiaw-Yuan Chin, Victor Callaghan, Adrian Winckles","author_ids":"3057592, 1718047, 3018682","abstract":"This paper explores the possibility of facilitating better end user engagement with the iCampus by providing a platform (Pervasive-interactive-Programming) to program the functionality of iCampus intelligent environments. We first introduce Pervasive-interactive-Programming (PiP), explaining the principles and presenting some recent results. By way of an example, we discuss how end-user programming could be used to configure the functionality of a student campus dormitory. We then consider how these techniques might be expanded to cater for other iCampus' areas. Finally, we comment on the future direction of our research.","cites":"0","conferencePercentile":"31.41025641"},{"venue":"Web Intelligence/IAT Workshops","id":"cb7ab24089c55cd14beac26c4ad72dabe7129705","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"New Techniques for Data Preprocessing Based on Usage Logs for Efficient Web User Profiling at Client Side","authors":"Jinhyuk Choi, Geehyuk Lee","author_ids":"2140722, 1717371","abstract":"User profiling at client side is an important key task for intelligent information delivery in Web environment. However, several preprocessing also should be carried out prior to constructing user profiles. Moreover, the client side preprocessing should be carried out mostly based on usage logs without knowledge about contents and structures of Websites. In this perspective, we conducted an experiment in users&#8217; natural Web environments during a period of several days, and analyzed collected usage logs and user feedbacks. Based on the results, we designed three important preprocessing techniques and evaluated the performances. We found that the required data preprocessing tasks can be conducted efficiently at client side based solely on usage logs.","cites":"3","conferencePercentile":"74.48979592"},{"venue":"Web Intelligence/IAT Workshops","id":"8193061acf45f69fbe69f653dc25a90bdf306d50","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Pervasive Web News Recommendation for Visually Impaired People","authors":"Wei Chen, Lijun Zhang, Can Wang, Chun Chen, Jiajun Bu","author_ids":"3207592, 1707675, 1804563, 5371645, 8475311","abstract":"It is very difficult for blind and visually-impaired people getting information from the outside world. In this paper, we propose an adaptive Web news recommendation system named EagleRadio, designed for blind man and supports pervasive access using terminals. EagleRadio offers natural and user-friendly interface. News stories from different topics are read via a speech synthesizer to users and they can use commands to navigate inside the news space. Based on the analyzing of user&#8217;s listening history, adaptive topic navigation and news recommendation methods help users reaching relevant topics quickly and push the most relevant news to them. Finally, we evaluate the proposed algorithms and quantify the effect of EagleRadio from a user&#8217;s perspective.","cites":"0","conferencePercentile":"21.875"},{"venue":"Web Intelligence/IAT Workshops","id":"f6109da8c41b47e359e8ee317f053f9d89c67f76","venue_1":"Web Intelligence/IAT Workshops","year":"2013","title":"Vision-Based Web Page Block Segmentation and Informative Block Detection","authors":"Xuhong Zhang, Yanqing Zhang, Jing He, Frank Cobia","author_ids":"2077567, 1688104, 1730277, 2865831","abstract":"A web page usually contains various content such as main content block, navigation bars or columns, contacts information at the bottom, advertisements, or just some decoration components. Apart from the main content block, the other parts are all not related to the topic of the web page, we call them noise blocks. Content in noise blocks will seriously harm information extraction, web mining, we searching, etc. Identifying the main content block is a key issue. In this paper, we propose a new low-cost vision based web page segmentation and informative block detection algorithm. Then we apply this algorithm to develop a bids update detection system for a local bids collecting company. Our algorithm mainly utilizes the position information of HTML element, which lowers the cost of applying multiple rules in VIPS. Our proposed row-column splitting indicator helps us provide an easy-to-use partition granularity value which solves the difficulty of choosing an appropriate Degree of Coherence (DoC) value in VIPS algorithm. This row-column splitting indicator also avoids the traditional high cost clustering process in detecting informative block. Through extensive experiments, we conclude that our proposed algorithm has a comparable performance compared to the VIPS and other informative block detection algorithms, but with ease of use granularity value and lower computation cost.","cites":"2","conferencePercentile":"83.82352941"},{"venue":"Web Intelligence/IAT Workshops","id":"295931f753f3e206a04428f1c3cb3889a2fba883","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Acquiring Explicit User Goals from Search Query Logs","authors":"Markus Strohmaier, Peter Prettenhofer, Mark Kröll","author_ids":"1743043, 2780213, 1802917","abstract":"Knowledge about user goals is crucial for realizing the vision of intelligent agents acting upon user intent on the web. In a departure from existing approaches, this paper proposes a novel approach to the problem of user goal acquisition: The utilization of search query logs for this task. The paper makes the following contributions: (a) it presents an automatic method for the acquisition of user goals from search query logs with useful precision/recall scores (b) it provides insights into the nature and some characteristics of these goals and (c) it shows that the goals acquired from query logs exhibit traits of a long tail distribution.","cites":"6","conferencePercentile":"92.8125"},{"venue":"Web Intelligence/IAT Workshops","id":"a371d20dbe0c1932df17ce48038ffd79db5f8b08","venue_1":"Web Intelligence/IAT Workshops","year":"2007","title":"Investigating User Browsing Behavior","authors":"Ganesan Velayathan, Seiji Yamada","author_ids":"3356116, 1679243","abstract":"This paper describes our efforts to investigate factors in user browsing behavior to automatically evaluate Web pages that the user shows interest in. We developed a client site logging tool to monitor and log the user's browsing behavior. We performed user experiment using ten participants to collect the browsing behavior, and evaluated the behaviors by performing classification learning using C4.5. We generated common user browsing behavior rules and evaluated these common rules against the individual participant data. This paper reports those findings.","cites":"4","conferencePercentile":"76.75438596"},{"venue":"Web Intelligence/IAT Workshops","id":"eff1fd3440e135cde4ed13a9cbbe92370192ced6","venue_1":"Web Intelligence/IAT Workshops","year":"2012","title":"Real-Time Vehicular Traffic Violation Detection in Traffic Monitoring Stream","authors":"Guoyu Ou, Yang Gao, Ying Liu","author_ids":"3252039, 1725881, 1718041","abstract":"Traffic violations and offences are becoming more and more serious as the traffic volume increasing, which may bring property damage and threaten personal safety. Existing systems lack of capability to analyze high-throughput traffic monitoring stream and detect various types of violations in real-time. Thus, a real-time vehicular traffic violation detection system is in real demand. In this paper, we design and implement a real-time vehicular traffic violation detection system. Our system proposes a detection algorithm which can discover various types of violations taking place on the roadways as well as in the parking lots. In order to achieve real-time analysis, parallel computing techniques are used in our implementation. An optimization scheme as well as a well-design data structure is proposed to improve the performance of the parallel implementation. Both real data and synthetic data are applied in our experiments. Experimental results demonstrate that our proposed system can discover all the violations from the high-throughput traffic monitoring stream in real-time. Good scalability on multiple threads is also shown in the experimental results.","cites":"0","conferencePercentile":"31.41025641"},{"venue":"Web Intelligence/IAT Workshops","id":"23f520174334b8635bb6cc1134b15ce7582b433c","venue_1":"Web Intelligence/IAT Workshops","year":"2011","title":"The Implications of Interactional \"Repair\" for Human-Robot Interaction Design","authors":"Luke D. Plurkowski, Maurice Chu, Erik Vinkhuyzen","author_ids":"3081139, 2079785, 3282483","abstract":"This paper recaps a recent study in the organization of interactive practices utilized by humans in card-game activities for the purposes of informing the design of human-robot interaction with autonomous social robotic systems. The research utilized an applied Conversation Analytic (CA) approach to focus on the practices by which humans identified and dealt with interactional trouble within the game activity itself, avoiding breakdown of the interactional encounter. We conclude this paper with a brief discussion of the technical implications for future design of autonomous social robots.","cites":"0","conferencePercentile":"25.26315789"},{"venue":"Web Intelligence/IAT Workshops","id":"a6ac21c7d07727ddaf62c093ce48d704129f3b3f","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"An Approach to Ranking Participants Based on Relationship Network in E-commerce","authors":"Masao Kobayashi, Takayuki Ito","author_ids":"2474163, 1679044","abstract":"In recently years, many people easily access Internet auctions in e-commerce trading. At the same time, network structures like the WWW have become huge and are analyzed on a grand scale. In Internet auctions, users face the problem of really knowing the credit and trustworthiness of participants, and the simple rating mechanism widely used in Internet auctions fails to represent this accurately. This paper proposes participant ranking methods based on relationships in Internet auctions. Our algorithm called \"Auction Network Trust (ANT)\" employs HITS's techniques and Internet auction data. At this stage, we successfully implemented a crawler for Internet auction sites and compared our algorithm to a reputation value of Internet auctions with several approaches such as user rankings. Furthermore, our work possesses a network analyzing system on a larger trading network that predicts which buyers and sellers are active and demonstrate better behaviors. Our experiments show many behaviors in the Internet auctions and that ANT presents different scores from HITS on the WWW.","cites":"0","conferencePercentile":"21.875"},{"venue":"Web Intelligence/IAT Workshops","id":"018f789fc9eba9fbc0dd5c483ea172df057b4886","venue_1":"Web Intelligence/IAT Workshops","year":"2007","title":"User Modeling for Recommendation in Blogspace","authors":"Kangmiao Liu, Wei Chen, Jiajun Bu, Chun Chen, Lijun Zhang","author_ids":"2588017, 3207592, 8475311, 5371645, 1707675","abstract":"Weblogs (also known as blogs) have become a key tool not only for individuals to publish posts, but also for obtaining useful information on a daily basis. Compared with traditional Internet services, there is much more personalized information in blogspace. And it is an ideal place to provide personalized services such as recommendation. This paper proposes a novel scheme to model users' interests for recommendation in blogspace. It separates users' interests into long-term and short-term, and models them by integrating their preference categories reflected in individual blog post in a period of time. Interests attenuation algorithm is further introduced to model the decline of users' interests in a specific category. Experimental results show that the proposed scheme can well describe users' interests evolvement.","cites":"3","conferencePercentile":"69.73684211"},{"venue":"Web Intelligence/IAT Workshops","id":"c7bbdc32d2375383ff6639f1b3ce7ffc5730b26e","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Winner Price Monotonicity for Approximated Combinatorial Auctions","authors":"Naoki Fukuta, Takayuki Ito","author_ids":"1701012, 1679044","abstract":"Combinatorial auctions are suitable mechanisms for efficient allocation of set of items for self-interested attendees such as software agents. Since optimal winner determination problem of combinatorial auctions is NP-hard, much work focuses on tackling the computational costs for winner determination. Since it is an important issue to guarantee the quality of approximated results, we have proposed desirable properties for such approximation algorithms. In this paper, we analyze the advantages and side-effects of preserving winner price monotonicity, one of our proposed desirable properties for approximation algorithms of combinatorial auctions.","cites":"0","conferencePercentile":"21.875"},{"venue":"Web Intelligence/IAT Workshops","id":"87175f60cc22c18aab565d585745767e6760bd6e","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Extracting Key Factors to Design Applications in Ambient Intelligence Environment","authors":"Hiroaki Kimura, Tatsuo Nakajima","author_ids":"2408817, 2846273","abstract":"In an ambient intelligence environment, the design of applications influences the users behavior heavily. The purpose of this paper is to provide key factors considered necessary in developing those applications. We developed four applications applied Ambient Lifestyle Feedback Systems and evaluated those user studies. From those four user studies, we verified key factors to develop applications in an ambient intelligence environment.","cites":"1","conferencePercentile":"53.75"},{"venue":"Web Intelligence/IAT Workshops","id":"13ccc5d7d07f46fe9e0d4faff4db5d1e69841224","venue_1":"Web Intelligence/IAT Workshops","year":"2012","title":"Prototype of New Business Process Visualization Tool","authors":"Akihiko Nagai, Tatsunosuke Tsuboi, Takayuki Ito","author_ids":"1936302, 3234983, 1679044","abstract":"Since around 2000, many companies have worked to create interorganizational cooperation, which can solve the problem of a lack of resources when creating new business. In the real world, many companies cannot find the holder of necessary resources, and they cannot conduct proper interor-ganizational cooperation. To solve these problems, we propose a business process visualization tool.","cites":"0","conferencePercentile":"31.41025641"},{"venue":"Web Intelligence/IAT Workshops","id":"72bb04a1cdd0cc5f5bebceeb6cb0556f60ca68a3","venue_1":"Web Intelligence/IAT Workshops","year":"2012","title":"Evaluation of Parking Reservation System with Auction Including Electricity Trading","authors":"So Hashimoto, Ryo Kanamori, Takayuki Ito, Shantanu Chakraborty","author_ids":"2779952, 2481335, 1679044, 1753845","abstract":"Some auction systems are applied to the parking reservation system which would exert an important role in the next generation traffic systems. As an introduction evaluation of the auction systems for the parking reservation, we compare the results in case of a simultaneous auction and sequential one, and examine the influences of the strategy. Although the limited numerical experiment under the assumption that the number of parking space is only three, time zone is three, and also the total number of bidders are 25, the following results are obtained, 1) electricity trading makes a profit to both the parking manager and users 2) the average of the parking revenues would be the highest when the reservation price is a little higher than the expect bidding price.","cites":"0","conferencePercentile":"31.41025641"},{"venue":"Web Intelligence/IAT Workshops","id":"8cc27a4fea577e60f3dfa90acc71002f973640eb","venue_1":"Web Intelligence/IAT Workshops","year":"2012","title":"A Preliminary Study on Anticipatory Stigmergy for Traffic Management","authors":"Jun Takahashi, Ryo Kanamori, Takayuki Ito","author_ids":"4153909, 2481335, 1679044","abstract":"In this paper, we propose an anticipatory stigmergy model for decentralized traffic congestion management. Managing traffic congestion is one of the main issues for smart cities, and many works have been trying to address it from the IT and Transportation research perspectives. Recently, dynamic coordination methods are becoming possible using the more short-term traffic information that can be provided by probe-vehicle information or smart phones. Some approaches have been trying to handle short-term traffic information in which a stigmergy-based approach is employed as an indirect communication method for cooperation among distributed agents and for managing traffic congestion. One drawback of these approaches is that handling near-future congestion remains problematic because stigmergies are essentially based on past information. In this paper, we propose anticipatory stigmergy for sharing information on near-future traffic and allocating drivers adequately. In this model, all vehicles submit their near-future intention as anticipatory stigmergy to research their routes. Our preliminary results demonstrate that anticipatory stigmergy with allocation strategy works well.","cites":"0","conferencePercentile":"31.41025641"},{"venue":"Web Intelligence/IAT Workshops","id":"693a1ec53983074f10993de702104cf1fbcfafa1","venue_1":"Web Intelligence/IAT Workshops","year":"2013","title":"Identify Emergent Trends Based on the Blogosphere","authors":"Patrick Hennig, Philipp Berger, Christoph Meinel","author_ids":"1760108, 1764842, 1708312","abstract":"Information about upcoming trends is a valuable knowledge for both, companies and individuals. Detecting trends for a certain topic is of special interest. According to the latest information over 200 million blogs exist in the World Wide Web. Hence, every day millions of posts are published. These blogs contain an enormous think tank of open-source intelligence. Considering the continuously growing nature of the World Wide Web a primary factor of success is the ability to include the latest data and focus on the complete data set of blogs. The structured as well as unstructured data of blogs are available offline via a single database for further analyses. This paper describes and evaluates an algorithm to detect trends based on the data published in blog posts.","cites":"1","conferencePercentile":"64.70588235"},{"venue":"Web Intelligence/IAT Workshops","id":"7c7f50d2794fea0d6f4b3c267449d42576f3590a","venue_1":"Web Intelligence/IAT Workshops","year":"2012","title":"A Preliminary Experimental Analysis on Combinatorial Auction-Based Electric Power Allocation for Manufacturing Industries","authors":"Naoki Fukuta, Takayuki Ito","author_ids":"1701012, 1679044","abstract":"In this paper, we discuss about a preliminary idea and an analysis about a dynamic electric power auction for manufacturing industries. We present a preliminary idea about applying multi-unit combinatorial auctions to an electric power allocation problem that considers guaranteeing stable continuous use of the supplied power in industrial manufacturers. We try to illustrate how such a mechanism can be applied to actual electric power allocation problems when we consider the situation that each manufacturing factories produce bids based on their own plans of production and the use of electricity in a day, guaranteeing stable continuous use of them. An approximation mechanism has been applied for a large-scale auction problem to overcome its computational intractability. We discuss about a possible performance based on our proposed evaluation dataset which consider actual power use scenarios in industrial factories.","cites":"2","conferencePercentile":"89.1025641"},{"venue":"Web Intelligence/IAT Workshops","id":"80702927e05d015e233619169fc8306c13be0bdd","venue_1":"Web Intelligence/IAT Workshops","year":"2013","title":"Mining User Interests from Web History","authors":"Saurabh Kumar","author_ids":"2030055","abstract":"A user's web history provides a rich source of information regarding her temporally varying interests. In this paper, we develop a technique to extract and rank user interests from web history. Our approach is based on calculating the overall 'spread' of times at which the keyword was accessed to identify importance.","cites":"1","conferencePercentile":"64.70588235"},{"venue":"Web Intelligence/IAT Workshops","id":"54bdd3496944cd340e36856d2b0a26d5f329574b","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Effects of Autonomy, Traffic Conditions and Driver Personality Traits on Attitudes and Trust towards In-Vehicle Agents","authors":"Henriette Cramer, Vanessa Evers, Nicander A. Kemper, Bob J. Wielinga","author_ids":"3297637, 1778867, 2417020, 1733748","abstract":"In-vehicle agents can potentially avert dangerous driving situations by adapting to the driver, context and traffic conditions. However, perceptions of system autonomy, the way agents offer assistance, driving contexts and users&#8217; personality traits can all affect acceptance and trust. This paper reports on a survey-based experiment (N=100) that further investigates how these factors affect attitudes. The 2x2, between-subject, video-based design varied driving context (high, low density traffic) and type of agent (providing information, providing instructions). Both type of agent and traffic context affected attitudes towards the agent, with attitudes being most positive towards the instructive agent in a light traffic context. Participants scoring high on locus of control reported a higher intent to follow-up on the agent's instructions. Driving-related anxiety and aggression increased perceived urgency of the video scenario.","cites":"2","conferencePercentile":"71.5625"},{"venue":"Web Intelligence/IAT Workshops","id":"0c5bb1e802987b0d5c5e83fb6a9edf1349d4acf1","venue_1":"Web Intelligence/IAT Workshops","year":"2012","title":"Remote Mixed Reality Collaborative Laboratory Activities: Learning Activities within the InterReality Portal","authors":"Anasol Peña-Ríos, Victor Callaghan, Michael Gardner, Mohammed J. Alhaddad","author_ids":"2622307, 1718047, 1764695, 2922127","abstract":"Technology is changing our way to experience education from one-dimensional (physical) to multi-dimensional (physical and virtual) education using a diversity of resources such as web-based platforms (eLearning), videoconferences, eBooks and innovative technologies (e.g. mixed reality, virtual worlds, immersive technology, etc.). This represents bigger opportunities for universities and educational institutions to collaborate with partners from around the world and to be part of today's knowledge economy. This also enables greater opportunities to experience distance learning, modifying our experience of both space and time, changing specific spatial locations to ubiquitous locations and time as asynchronous/synchronous according to our necessities. The use of virtual and remote laboratory activities is an example of the application of some of these concepts. In this work-in-progress paper we propose a different approach to the integration of the physical and virtual world by creating remote mixed reality collaborative laboratory activities within an Inter Reality Portal learning environment, thereby extending our previous progress towards these goals. The learning goal of our mixed reality lab activity is to produce Internet-of-Things-based computer projects using combinations of Cross-Reality (xReality) and Virtual objects based on co-creative and collaborative interaction between geographically dispersed students.","cites":"4","conferencePercentile":"97.43589744"},{"venue":"Web Intelligence/IAT Workshops","id":"fa8e326b0d91b9ed2806d9b05d2acf14f6ee09f1","venue_1":"Web Intelligence/IAT Workshops","year":"2012","title":"Empirical Research on the Total Factor Productivity of Chinese Software Companies","authors":"Ye Wang, Caiming Zhang, Guanghua Chen, Yong Shi","author_ids":"1681196, 6643191, 2566389, 1706184","abstract":"Total Factor Productivity research is one of hot point in academe, and it is also one important index of reflecting the inner growth of state, region or industry. This paper first reviews the key domestic and overseas literatures and papers about the Total Factor Productivity research and Human Resource research. Then we put forward this paper's theory basic and demonstration method. Base on them, we choose Human Resource Data to study the Total Factor Productivity of software industry. And we give out the basic describe and explain to the demonstration result. At last, this paper also gives some policy suggestions for our state.","cites":"1","conferencePercentile":"75"},{"venue":"Web Intelligence/IAT Workshops","id":"a86ff91a51b26694c8c7d8c7a68553f5073e8b6b","venue_1":"Web Intelligence/IAT Workshops","year":"2007","title":"Tag Meaning Disambiguation through Analysis of Tripartite Structure of Folksonomies","authors":"Ching-man Au Yeung, Nicholas Gibbins, Nigel Shadbolt","author_ids":"1797101, 1708456, 1705314","abstract":"Collaborative tagging systems are becoming very popular recently. Web users use freely-chosen tags to describe shared resources, resulting in a folksonomy. One problem of folksonomies is that tags which appear in the same form may carry multiple meanings and represent different concepts. As this kind of tags are ambiguous, the precisions in both description and retrieval of the shared resources are reduced. We attempt to develop effective methods to disambiguate tags by studying the tripartite structure of folksonomies. This paper describes the network analysis techniques that we employ to discover clusters of nodes in networks and the algorithm for tag disambiguation. Experiments show that the method is very effective in performing the task.","cites":"18","conferencePercentile":"97.36842105"},{"venue":"Web Intelligence/IAT Workshops","id":"7688ed27ab155ffc6a89e94b1f3bf326e489d603","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Collective User Behaviour and Tag Contextualisation in Folksonomies","authors":"Ching-man Au Yeung, Nicholas Gibbins, Nigel Shadbolt","author_ids":"1797101, 1708456, 1705314","abstract":"Collaborative tagging systems have emerged in recent years to become popular tools for organising information on the Web. While collaborative tagging offers many advantages, they also suffer from several limitations, with a major one being the existence of ambiguous tags. To understand what an ambiguous tag is intended to mean, we need to know the contexts in which it is used. Instead of using common large scale clustering techniques on folksonomies, we believe tags can be better contextualised by the social contexts in which they are used. We propose a method to reveal semantics of ambiguous tags by studying the collective user behaviour in a tagging system. In this paper we describe our proposal and some results of our preliminary experiments. We also discuss the significance of the work and how it can be evaluated.","cites":"2","conferencePercentile":"71.5625"},{"venue":"Web Intelligence/IAT Workshops","id":"97271650dbf10785fc38e8551a765ba8d726956b","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"Experimental Results on the Aggregation Methods in Blog Distillation","authors":"Mostafa Keikha, Fabio Crestani","author_ids":"2610013, 1714210","abstract":"This paper addresses the blog distillation problem, that is, given a user query find the blogs that are most related to the query topic. We model each post as evidence about relevance of a blog to the query, and use aggregation methods like Ordered Weighted Averaging operators to combine the evidence. Our experiments on the TREC'07 data set show 42% improvement in Mean Average Precision and 21% improvement in Precision at 10 over a baseline based on the Language Model.","cites":"2","conferencePercentile":"63.60544218"},{"venue":"Web Intelligence/IAT Workshops","id":"a8894eb3b5445ff2f29ba149c6d7a588b9c2b324","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Discovering and Modelling Multiple Interests of Users in Collaborative Tagging Systems","authors":"Ching-man Au Yeung, Nicholas Gibbins, Nigel Shadbolt","author_ids":"1797101, 1708456, 1705314","abstract":"We analyse data obtained from several collaborative tagging systems and discover that user interests can be very diverse. Traditional methods for representing interests of users are usually not able to reflect such diversity. We propose a method to construct user profiles of multiple interests using data in a collaborative tagging system. Our evaluation suggests that the proposed method is able to generate user profiles which reflect the diversity of user interests and can be used to help provide more focused recommendation.","cites":"3","conferencePercentile":"82.5"},{"venue":"Web Intelligence/IAT Workshops","id":"cfa8aa89c762a82261d9ecbafe91e5b8d790db68","venue_1":"Web Intelligence/IAT Workshops","year":"2010","title":"4s-reasoner: RDFS Backward Chained Reasoning Support in 4store","authors":"Manuel Salvadores, Gianluca Correndo, Tope Omitola, Nicholas Gibbins, Steve Harris, Nigel Shadbolt","author_ids":"1709857, 3132568, 2267342, 1708456, 3203943, 1705314","abstract":"This paper describes the design and implementation of backward chained clustered RDFS reasoning in 4store. The system presented, called &#8220;4s-reasoner&#8221;, adds no overhead to the import phase and yet performs reasonably well at the query phase. We also demonstrate that our solution scales over clusters of commodity servers providing an optimal solution that balances infrastructure cost and performance over tested data sets with up to 500M triples. In addition we have shared our implementation under GNU license and a first release is available to be used by the community.","cites":"3","conferencePercentile":"87.86407767"},{"venue":"Web Intelligence/IAT Workshops","id":"4f520158d399d6ab385ba88b207e13e1588fd859","venue_1":"Web Intelligence/IAT Workshops","year":"2012","title":"Ontology Based Scope Visualisation","authors":"Julien Tscherrig, Francesco Carrino, Maria Sokhn, Elena Mugellini, Omar Abou Khaled","author_ids":"3265655, 1795032, 2143192, 1802011, 1799647","abstract":"This paper presents an original solution to visualize semantic information contained into an ontology. It is important to be able to record a large amount of data. On another hand, it is useful to be able to find a specific data among all the data recorded. The more data we have the higher is the difficulty to visualize them. The solution that is presented here below is based on a particular visualization of content based on filter. A Knowledge Management System provides the storage part. The storage is based on an ontology specifically designed for travels. The ontology provides a data structure with the creation of concepts. This structure allows at the same time the sorting of data and a clear visualization. The visualization is dynamic, it depends on the ontology relationship established.","cites":"0","conferencePercentile":"31.41025641"},{"venue":"Web Intelligence/IAT Workshops","id":"08737e1a33abc21803e79346eff82fd98a24f6b2","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"Incorporating Trust into Combinatorial Auctions: What Does Trust Cost?","authors":"Guruprasad Airy, Po-Chun Chen, Tracy Mullen, John Yen","author_ids":"2011229, 7778519, 1779108, 1722074","abstract":"As the use of automated negotiations becomes more mainstream, one key attribute that needs to be incorporated is a measure of a seller's trust or reliability. In this paper, we describe a combinatorial auction mechanism that allows buyers to specify their preferences over both an item and the seller's trustworthiness, and use it to generate a bid for a bundle of items. We consider some implications of generating a combined trust rating for a bundle of resources that are supplied by more than one seller. We show that allowing buyers to specify trust preferences leads to a higher overall utility and task completion rate than when compared with a model that does not consider seller trustworthiness.","cites":"0","conferencePercentile":"17.68707483"},{"venue":"Web Intelligence/IAT Workshops","id":"46af31efd76ea9c49078730da35200f7e65dc85f","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"Agent-Based Security System for User Verification","authors":"Erik Dovgan, Bostjan Kaluza, Tea Tusar, Matjaz Gams","author_ids":"2790548, 2982579, 1972464, 1723500","abstract":"We present a security system consisting of an arbitrary number of entries, sensors and agents. The intelligent integrated system is based on user modeling, i.e. models of their previous entries, using several levels of description and several single machine learning agents. The system is specialized for high-security tasks, e.g. controlling entry to a headquarter and for scenarios including terrorist attacks or kidnapping, when the attackers formally bypass the existing sensors, but fail to imitate normal movement of an employee. An experimental setup was implemented to verify the successfulness of the approach.","cites":"1","conferencePercentile":"46.59863946"},{"venue":"Web Intelligence/IAT Workshops","id":"6637fecf7a4d36de1638524635a684abede0f898","venue_1":"Web Intelligence/IAT Workshops","year":"2011","title":"Leveraging Social Network Analysis with Topic Models and the Semantic Web","authors":"Sebastián A. Ríos, Felipe Aguilera, Francisco Bustos, Tope Omitola, Nigel Shadbolt","author_ids":"1740954, 1731525, 2045070, 2267342, 1705314","abstract":"Social Network Analysis (SNA) and Web Mining (WM) techniques are being applied to study the structures of social networks in order to manage their dynamics and predict their evolution. This paper describes how we used Semantically-Interlinked Online Communities (SIOC) ontology to represent the (latent) semantic relationships between the members of a large community forum (about 2,500), Plexilandia. We extended SIOC, taking advantage of topic-based text mining and developed data mining algorithms that used our SIOC extensions to provide a better understanding of the social dynamics of the members of the Plexilandia community. This new understanding helped us to detect and discover the key members of Plexilandia successfuly.","cites":"0","conferencePercentile":"25.26315789"},{"venue":"Web Intelligence/IAT Workshops","id":"76c2e77d0a4f6ca4f1d6f045fcd3d5c2e97ad8fe","venue_1":"Web Intelligence/IAT Workshops","year":"2009","title":"Unsupervised Word Sense Discrimination Improves Construction of the Wordnets","authors":"Hong Zhu, Yang Liu","author_ids":"6869596, 1750084","abstract":"This paper reports an unsupervised approach we adopted for Wordnet construction. We combine ways of CBC word sense discrimination and automatic mapping measures to remove redundant senses of adjectives in Chinese Concept Dictionary. We optimize the similarity measure of adjective concepts and put forward two novel strategies to automatically evaluate the model&#8217;s performance. The experimental results show a rather fine conformance to the work based on human judgments.","cites":"0","conferencePercentile":"17.68707483"},{"venue":"Web Intelligence/IAT Workshops","id":"25d0d154a9b6b2f0f8436ff4166c75f4a6cf3958","venue_1":"Web Intelligence/IAT Workshops","year":"2008","title":"Concept Extraction and Clustering for Topic Digital Library Construction","authors":"Chengzhi Zhang, Dan Wu","author_ids":"3139627, 1808776","abstract":"This paper is to introduce a new approach to build topic digital library using concept extraction and document clustering. Firstly, documents in a special domain are automatically produced by document classification approach. Then, the keywords of each document are extracted using the machine learning approach. The keywords are used to cluster the documents subset. The clustered result is the taxonomy of the subset. Lastly, the taxonomy is modified to the hierarchical structure for user navigation by manual adjustments. The topic digital library is constructed after combining the full-text retrieval and hierarchical navigation function.","cites":"8","conferencePercentile":"95.3125"},{"venue":"Web Intelligence/IAT Workshops","id":"3a8bc0915f014f70c0f80aa1df51c29b2af5dc65","venue_1":"Web Intelligence/IAT Workshops","year":"2013","title":"Automatic Classification Methods of Photographs Based on Geographical Attentions of Crowd","authors":"Yusuke Kubo, Masao Kubo, Hiroshi Sato, Akira Namatame","author_ids":"1872711, 2821909, 1792890, 1870310","abstract":"We propose a digital photographs automatic classification method by its subject that has attracted crowd's attention. Our method can classify digital photographs without using pixel information. When an interesting event occurs, many people take photographs of the event. If we could collect digital photographs of the event and build an image database quickly, then we are able to share information in real-time with high accuracy. However, a simple method that transmits the image data may causes congestion of communication network. In this paper, we propose a highly available classification system. Our method estimates subjects of digital photographs using only information about a state of a camera when photographed, and classify the photographs based on the subject. We can suppress congestion because the system preferentially transmits photographs that meets a browse request of viewers. We verified an effectiveness of our method by an experiment using a commercially available digital camera.","cites":"0","conferencePercentile":"26.47058824"},{"venue":"Web Intelligence/IAT Workshops","id":"29a0d6e1dec067845740a246f4a81d84e81a4f4d","venue_1":"Web Intelligence/IAT Workshops","year":"2013","title":"DM-Midware: A Middleware to Enable High Performance Data Mining in Heterogeneous Cloud","authors":"Guoyu Ou, Ying Liu, Xinyv Ma, Cheng Wang","author_ids":"3252039, 1718041, 2667758, 3879731","abstract":"Cloud computing has become a popular high performance computing model where resources are provided as services over the Web. Users are starting to adopt cloud model in data mining applications. However, due to the complexity of parallel/cloud computing, it is difficult for average users to express a parallel computing paradigm for their applications in cloud. In order to isolate users from the complexity of parallel/cloud programming, a middleware to enable high performance data mining, called DM-Midware, is proposed. It hides the details of MapReduce programming from users by automatically launching mappers through a set of user programming APIs. Directive-based parallelization scheme automatically \"translates\" a serial program into a SMP or Multi-core based parallel program. Heterogeneous computing resources can be invoked to conduct parallel execution by API-based scheme. A two-step scheduling scheme is proposed to maximize the throughput of the cloud system. We evaluate DM-Midware by executing a representative data mining algorithm in a private cloud. Experimental results demonstrate good scalability and adaptability.","cites":"0","conferencePercentile":"26.47058824"},{"venue":"Web Intelligence/IAT Workshops","id":"47f6de2aef1ce26bd1869d1f891b33da232395b9","venue_1":"Web Intelligence/IAT Workshops","year":"2011","title":"When You Doubt, Abstain: From Misclassification to Epoché in Automatic Text Categorisation","authors":"Angela Locoro, Daniele Grignani, Viviana Mascardi","author_ids":"1756869, 3268334, 1719055","abstract":"This paper describes how natural language processing and ontologies are exploited for automatic text categorisation. The approach introduced is part of the MANENT system, an infrastructure for integrating, structuring and searching Digital Libraries. The procedure of structural information extraction, and of the automatic classification of the records according to natural language understanding and the WordNet Domains taxonomy is discussed. A comparison between two versions of the classification algorithm is conducted and the improvements of the new approach are articulated. In particular, using semantic connections between words refines the classification results while reducing misclassification to no classification.","cites":"1","conferencePercentile":"60.52631579"}]}