{"Web_Dynamics.csv":[{"venue":"Web Dynamics","id":"8965effbc100b457e771c982191f7023cfc794c4","venue_1":"Web Dynamics","year":"2004","title":"Navigating the World Wide Web","authors":"Mark Levene, Richard Wheeldon","author_ids":"1722499, 2897772","abstract":"Navigation (colloquially known as \" surfing \") is the activity of following links and browsing web pages. This is a time intensive activity engaging all web users seeking information. We often get \" lost in hyperspace \" when we lose the context in which we are browsing, giving rise to the infamous navigation problem. So, in this age of information overload we need navigational assistance to help us find our way through the tangled web of pages and links. Search engines partially solve this problem by locating relevant documents and finding \" good \" starting points for navigation, but more navigational assistance is needed to guide users through and between web sites. We present a model for navigation which has enabled us to develop several tools and algorithms for helping users with their navigation difficulties. Our point of view is that to help understand how users navigate the web topology we can attach probabilities to links giving rise to a probabilistic automaton, which can also be viewed as a Markov chain. These probabilities have two interpretations, namely, they can denote the proportion of times a user (or a group of users) followed a link, or alternatively they can denote the relevance (or expected utility) of following a link. We present a new metric for measuring the navigational potential of a web page, called the potential gain. This metric is used to find \" good \" starting point for an algorithm we describe in detail, called the Best Trail algorithm, which semi-automates web navigation by deriving relevant trails given a user query. We also present techniques we have developed in the area of web usage mining, detailing our algorithms for analysing records of trails that emerge from either an individual user or a group of users through navigation within the web graph over a period a time. We also give historical and current overviews of attempts to address the navigation problem, and review the various navigation tools available to the web \" surfer \". Finally, we give a brief introduction to navigating within the mobile web, and discuss new navigation techniques that have arisen from viewing the web as a social network.","cites":"9","conferencePercentile":"16.66666667"},{"venue":"Web Dynamics","id":"22d8f9af425287d4222d33c7e7beb8fffe9177bb","venue_1":"Web Dynamics","year":"2002","title":"An Event-Condition-Action Language for XML","authors":"James Bailey, George Papamarkos, Alexandra Poulovassilis, Peter T. Wood","author_ids":"6263638, 2099375, 1747099, 2986632","abstract":"XML repositories are now a widespread means for storing and exchanging information on the Web. As these repositories become increasingly used in dynamic applications such as e-commerce, there is a rapidly growing need for a mechanism to incorporate reactive functionality in an XML setting. Event-condition-action (ECA) rules are a technology from active databases and are a natural method for supporting suchfunctionality. ECA rules can be used for activities such as automatically enforcing document constraints, maintaining repository statistics, and facilitating publish/subscribe applications. An important question associated with the use of a ECA rules is how to statically predict their run-time behaviour. In this paper, we define a language for ECA rules on XML repositories. We then investigate methods for analysing the behaviour of a set of ECA rules, a task which has added complexity in this XML setting compared with conventional active databases.","cites":"73","conferencePercentile":"100"}]}