{"Web_Web-Services_and_Database_S":[{"venue":"Web, Web-Services, and Database Systems","id":"5fb0919f65a893f3d87cd452428a2f3e432521a4","venue_1":"Web, Web-Services, and Database Systems","year":"2002","title":"WS-Specification: Specifying Web Services Using UDDI Improvements","authors":"Sven Overhage, Peter Thomas","author_ids":"2306431, 5742076","abstract":"Web services are interoperable components that can be used in application-integration and component-based application development. In so doing, the appropriate specification of Web services, as the basis for discovery and configuration, becomes a critical success factor. This paper analyses the UDDI specification framework, which is part of the emerging Web service architecture, and proposes a variety of improvements referring both to the provided information and the appropriate formal notations. This leads to a more sophisticated specification framework that is called WS-Specification and provides information referring to different perspectives on Web services. It considers Web service acquisition, architecture, security, performance, conceptual concepts and processes, interface definitions, assertions, and method coordination. WS-Specification thereby maintains backward-compatibility to UDDI and is ordered using a thematic grouping that consists of white, yellow, blue, and green pages.","cites":"20","conferencePercentile":"75"},{"venue":"Web, Web-Services, and Database Systems","id":"25dc279053f9c8b5a77d66b76ca2f7072ff4826e","venue_1":"Web, Web-Services, and Database Systems","year":"2002","title":"Support for Mobile Location-Aware Applications in MAGNET","authors":"Patty Kostkova, Julie A. McCann","author_ids":"1698007, 1770523","abstract":"A key characteristic of mobile applications is the need for up-to-date location-dependent information, while the physical location changes frequently. Recent improvements in wireless communication and hardware technology and Internet-based data exchanged created a new type of mobile applications whose requirements are not met by traditional relational and object database systems. In this paper we describe MAGNET, a tuplespace-based framework for dynamic information storage and retrieval addressing the needs of application in frequently changing mobile environment and discuss how this approach could enable flexible data exchange. In addition to type-free data storage and user-customized requests for data records, MAGNET enables adaptation to a changed environment by supporting constant monitoring of selected information.","cites":"0","conferencePercentile":"9.375"}]}