{"WEBIST.csv":[{"venue":"WEBIST","id":"3a2fe9a2cb654eae5454a9bb73e18c51e3e4455a","venue_1":"WEBIST","year":"2008","title":"Towards Web 2.0 Driven Learning Environments","authors":"Mohamed Amine Chatti, Daniel Dahl, Matthias Jarke, Gottfried Vossen","author_ids":"1724546, 2560175, 1744383, 1707202","abstract":"Over the last decade, it has been widely argued that technology-enhanced learning could respond to the needs of the new knowledge society and transform the way we learn. However, despite isolated achievements, technology-enhanced learning has not really succeeded yet in revolutionizing our education and learning processes. In fact, most current initiatives do not focus on the social aspect of learning and learning content is still pushed to a pre-defined group of learners in closed environments. Recently, Web 2.0 concepts have started to open new doors for more effective learning and have the potential to overcome many of the limitations of traditional learning models. In this paper we show in which way the community-driven platform Learnr, under development at the University of Münster, puts crucial success factors for future technology enhanced learning into practice, applying well known concepts like networking and social tagging. As a consequence, a Web 2.0 perspective on learners, learning content and learning communities can be derived.","cites":"5","conferencePercentile":"90.2173913"},{"venue":"WEBIST","id":"3372ac96ed1bd92a3b9c89874d2e70553ff06d14","venue_1":"WEBIST","year":"2006","title":"Technology Enhanced Professional Learning - Process, Challenges and Requirements","authors":"Mohamed Amine Chatti, Ralf Klamma, Matthias Jarke, Vana Kamtsiou, Dimitra Pappa, Milos Kravcik, Ambjörn Naeve","author_ids":"1724546, 1790902, 1744383, 1988799, 2403548, 1772387, 3359162","abstract":"Since we cannot transfer knowledge from one person to another person, learning, also known as knowledge creation, is the social process of acquiring and applying knowledge. Our claim is that the oscillating process of knowledge acquisition and application for workplace learning can be best described by the SECI model introduced by Nonaka in 1994. In this paper, we analysis the learning process in terms of the SECI model, identify the challenges for technology enhanced professional learning and define the requirements for future applications such as personalized adaptive learning. We report the results of a roadmap survey done in the framework of PROLEARN to disclose the desired state of the art in technology enhanced professional learning in the year 2015 and show ways how to proceed on the way to the desired state.","cites":"5","conferencePercentile":"76.19047619"},{"venue":"WEBIST","id":"db9662b151b414e5c8ef16f41f84efee42572859","venue_1":"WEBIST","year":"2014","title":"From Image to Audio Watermarking Using Self-Inverting Permutations","authors":"Maria Chroni, Angelos Fylakis, Stavros D. Nikolopoulos","author_ids":"1887835, 3270802, 1701558","abstract":"The intellectual property infringement in music due to the proliferation of the internet and the ease of creating and distributing identical digital objects has brought watermarking techniques to the forefront of digital rights protection. Towards this direction, a significant number of watermarking techniques have been proposed in recent years in order to create robust and imperceptible audio watermarks. In this work we propose an audio watermarking technique which efficiently and secretly embeds information, or equivalently watermarks, into an audio digital signal. Our technique is based on the main idea of a recently proposed image water-marking technique expanding thus the digital objects that can be efficiently watermarked through the use of self-inverting permutations. More precisely, our audio watermarking technique uses the 1D representation of self-inverting permutations and utilizes marking at specific areas thanks to partial modifications of the au-dio's Discrete Fourier Transform (DFT); these modifications are made on the magnitude of specific frequency bands. We have evaluated the embedding and extracting algorithms by testing them on various and different in characteristics audio signals that were in WAV format and we have obtained positive results. The algorithms have been developed and tested using the mathematical software package Matlab.","cites":"2","conferencePercentile":"76.19047619"},{"venue":"WEBIST","id":"3b287281a6ba862b80853b7beb01fb8f8377f58a","venue_1":"WEBIST","year":"2008","title":"Web Service Composition Using the Web Services Management Layer","authors":"Niels Joncheere, Bart Verheecke, Viviane Jonckers, Sofie Van Hoecke, Gregory van Seghbroeck, Bart Dhoedt","author_ids":"3023273, 3221169, 2933748, 1790767, 2720187, 1733741","abstract":"The Web Services Management Layer (WSML) is an academic middleware platform that is placed in between clients and web services. It takes care of dynamic integration, selection, composition and client-side management of web services, thus removing the need to take care of these concerns in clients. This paper describes how the WSML can be used to express web service compositions, and presents the results of a number of experiments which evaluate the performance and scalability of the current WSML implementation. These results show that the WSML induces only a small overhead compared to systems in which the WSML has not been deployed. The advanced features of the WSML therefore come a low cost in terms of performance and scalability, which makes it a viable option in real-life web services applications.","cites":"0","conferencePercentile":"21.73913043"},{"venue":"WEBIST","id":"5ae0c6d922d9f330836bebb127aba431045d32a2","venue_1":"WEBIST","year":"2008","title":"A Descriptive Approach for the Lifecycle Support of Distributed Web-Based Systems","authors":"Frederic Majer, Martin Nussbaumer, Martin Gaedke","author_ids":"1809312, 2215691, 2974357","abstract":"Through the advancement in technology and the spreading of the internet, a wide range of different application types has evolved. To cope with the increased complexity of today's Web-based systems, approaches facilitating development, operations and evolution of these heterogeneous and distributed systems are vital. The approach, presented in this contribution, is based on a dedicated information model allowing the description of the overall system and its components characteristics. At runtime, the relevant model information is processed and provided to different in the system's lifecycle involved stakeholders and supports them to fulfill their activities. Due to this use in terms of orientation and guidance, our approach is called the Integrated Information Map (i²map). Furthermore, the descriptive information regarding the nominal status and behavior of the components is used for automated monitoring and testing to assure the quality of the overall system at deployment and throughout operations.","cites":"0","conferencePercentile":"21.73913043"},{"venue":"WEBIST","id":"5383377d8d48fbcdfd7020186c1ba8b037daf441","venue_1":"WEBIST","year":"2014","title":"Cascading Information for Public Transport Assistance","authors":"Christian Samsel, Shirley Beul-Leusmann, Maximilian Wiederhold, Karl-Heinz Krempels, Martina Ziefle, Eva-Maria Jakobs","author_ids":"1770388, 3113328, 3023367, 1749227, 1727090, 2654230","abstract":"Over the last years, public transport has become both more prominent and more diverse. Because of the complex structure of today's public transport networks, an electronic guidance is effectively required. Usually different transport modalities and service providers offer their own application to which the traveler has to adapt after changing between services. Additionally a current trend in mobile applications is the customiza-tion of GUI elements which leads to appealing looks but usually also to cluttered presentation of information. Both these problems cause a high cognitive stress on the traveler using the mobile application, especially while conducting other activities at the same time. Our approach to mitigate these issues is to create a mobile application applying the Gamification principle Cascading Information Theory to simplify the usage and additionally to use a back-end which allows to integrate data from various services hereby unifiying the presentation. A prototype of the application was evaluated in an initial user test for comparing our approach to the most popular mobile travel application in Germany.","cites":"3","conferencePercentile":"90.47619048"},{"venue":"WEBIST","id":"26312ae554ceaae8e2bc9578f7075f497e409fb2","venue_1":"WEBIST","year":"2009","title":"Timeliness for Dynamic Source Selection in Situated Public Displays","authors":"Fernando Reinaldo Silva Garcia Ribeiro, Rui José","author_ids":"2096317, 2409908","abstract":"Dynamic sources, which make regularly updated data available for use by other applications, are increasingly a key enabling feature of the web. They are extensively used in all sorts of social media applications where they are re-combined in multiple ways to generate new aggregate services. Public situated displays are an emergent area where dynamic sources can also play a key role in providing situated and frequently updated content. However, the specificities of public displays raise the need for automated selection of the most relevant sources to present. This study addresses relevance from the perspective of timeliness. We propose a timeliness model that supports the most common types of dynamic source. To validate that model, we set an experiment with a public display exhibiting content from dynamic sources and receiving from users feedback on its timeliness. The results from this experiment suggest a reasonable match between our model and the users' perspectives on timeliness. The results also show that the model is able to make comparative calculations of timeliness for different types of dynamic source. These results enable us to conclude that timeliness functions may help to significantly increase the relevance of content automatically selected from dynamic sources.","cites":"3","conferencePercentile":"65"},{"venue":"WEBIST","id":"41370e0c263de7a114e32ae3567518be7939b9ed","venue_1":"WEBIST","year":"2013","title":"An Exploratory Study to Design an Adaptive Hypermedia System for Online-advertisement","authors":"Dana Al Qudah, Alexandra I. Cristea, Lei Shi","author_ids":"2435809, 1722663, 4608232","abstract":"The revolutionary world of the World Wide Web has created an open space for a multitude of fields to develop and propagate. One of these major fields is advertisement. Online advertisement has become one of the main activities conducted on the web, heavily supported by the industry. Importantly, it is one of the main contributors to any businesses' income. However, consumers usually ignore the great majority of adverts online. This research paper studies the field of online advertisement, by conducting an exploratory study to understand end users' needs for targeted online advertisement using adaptive hypermedia techniques. Additionally, we explore social networks, one of the booming phenomena of the web, to enhance the appropriateness of the advertising to the users. The main current outcome of this research is that end users are interested in personalised advertisement that tackles their needs and that they believe that the use of social networks and social actions help in the contextualisation of advertisement.","cites":"0","conferencePercentile":"28.57142857"},{"venue":"WEBIST","id":"a94051404344f43b5da014b069b34731efeb23cd","venue_1":"WEBIST","year":"2007","title":"A Location based e-Learning System","authors":"Georg Schneider, Patrick Arnoldy, Tobias Mangerich","author_ids":"2070478, 3206033, 2199192","abstract":"Much information is inherently coupled with a certain place. Accessing this information at the given place is often the key to understand it or at least it helps understanding the information much better than accessing it elsewhere. e-Learning systems free the learners from the chains of time and place. However they are normally used with PCs or laptop computers either at home or at certain premises. Especially in a city like Trier, which is full of history, it is easy to verify that learning about the Romans and seeing a picture of a historic site is different to the real world experience of this site. This reflection leads us to the idea to extend the capabilities of a conventional E-learning system in a way that information can be accessed where it can be understood more easily, i.e. on its place. Therefore we have extended the system MOVII (Moving Images and Interfaces), which is a flexible and visually appealing E-learning Platform with a possibility to geocode information entities and to access them appropriately.","cites":"0","conferencePercentile":"15.58441558"},{"venue":"WEBIST","id":"5f48e3293dd2aa94d6367678c86ac118ff6f58a7","venue_1":"WEBIST","year":"2005","title":"A Meta-Model for the Dialog Flow Notation","authors":"Matthias Book, Volker Gruhn, Nils Mirbach","author_ids":"1739075, 1743762, 2115386","abstract":"While the separation of presentation and application logic is widely practiced in web-based applications today, many do not cleanly separate application and dialog control logic, which leads to inflexible implementations especially when multiple presentation channels shall be served by the same application logic. We therefore present a notation for specifying the complete dialog flow of an application separately from the application logic and show how to construct a formal metamodel for it using the OMG's Meta-Object Facility (MOF). This allows the validation of dialog flow models, as well as the generation of machine-readable dialog flow specifications from graphical models.","cites":"0","conferencePercentile":"21.42857143"},{"venue":"WEBIST","id":"6569e28b969ec9c29cd0e3ca96b0377b1c643e26","venue_1":"WEBIST","year":"2012","title":"Watermarking Images using 2D Representations of Self-inverting Permutations","authors":"Maria Chroni, Angelos Fylakis, Stavros D. Nikolopoulos","author_ids":"1887835, 3270802, 1701558","abstract":"In this work we propose an efficient and easily implemented codec system, which we named WaterIMAGE, for watermarking images that are intended for uploading on the web and making them public online. An important fact of our system is that it suggests a way in which an integer number can be represented in a two dimensional grid and, thus, since images are two dimensional objects that representation can be efficiently marked on them. In particular, our system uses an efficient technique which is based on a 2D representation of self-inverting permutations and mainly consists of two components: the first component contains an encoding algorithm which encodes an integer w into a self-inverting permutation π * and a decoding algorithm which extracts the integer w from π * , while the second component contains codec algorithms which are responsible for embedding a watermark into an image I, resulting the image I w , and extract it from I w. Our system incorporates important properties which allow us to successfully extract the watermark w from the image I w even if the input image has been compressed with a lossy method and/or rotated. All the system's algorithms have been developed and tested in JAVA programming environment.","cites":"4","conferencePercentile":"85.29411765"},{"venue":"WEBIST","id":"ec1c80dea23c0cfdb1024761121833f360732362","venue_1":"WEBIST","year":"2007","title":"Exploiting Mobile Devices to Support Museum Visits through Multi-Modal Interfaces and Multi-Device Games","authors":"Fabio Paternò, Carmen Santoro","author_ids":"1793926, 2606102","abstract":"Mobile devices are enabling innovative ways to enjoy museum settings. In particular, their multimodal interfaces can provide unobtrusive support while users are freely moving and new applications, such as games, can benefit from the combined availability of mobile and stationary devices. In this paper we report on our new solutions and experiences in the area of mobile support for museum visits.","cites":"3","conferencePercentile":"67.53246753"},{"venue":"WEBIST","id":"e2949075cf272cddb8a09beebdf3242cf788d048","venue_1":"WEBIST","year":"2012","title":"Community Association Map - Processing Inter-community Relationships","authors":"Dárlinton B. F. Carvalho, Hugo Fuks, Carlos José Pereira de Lucena","author_ids":"2619746, 7328178, 1698043","abstract":"The use of modern communication technology like the Internet brings a new perspective for the study of society. Following this paradigm shift, this paper presents a process to help in the analysis of social media available on the Internet, specially the analysis focused in the online community's content. The process goal is to reveal the interests of users through a map of associated communities. The user membership is utilized to establish the relationship among communities. This map shows the interests of members in other communities. An example illustrates the application of the process. A discussion about the opportunities and drawbacks of the process usage is also presented.","cites":"1","conferencePercentile":"63.23529412"},{"venue":"WEBIST","id":"ea39633e822075ce25afd351ab0406d2adeb6de2","venue_1":"WEBIST","year":"2010","title":"Modelling user Interactions in Web Service-based Business Processes","authors":"Antonio Pintus, Fabio Paternò, Carmen Santoro","author_ids":"2712261, 1793926, 2606102","abstract":"This paper presents a methodology that defines a model-based approach in composing User Interfaces for Business Processes based on Web service technology. The core concepts of the methodology are represented by an integration of modern task model notations developed in the HCI area, such as ConcurTaskTrees, with a mainstream notation for Business Process modelling (BPMN) developed in the workflow/business process area. The main advantage is to obtain thorough support in designing complex interactive business applications able to flexibly compose Web services and obtain meaningful associated user interfaces which can be not only Web interfaces but also extended to a multi-modal fruition. The proposed methodology allows a collaborative work between business process modellers and user interface modellers remaining open to iterative refinements. In this paper we also briefly compare the considered notations and discuss an example application of the proposed method.","cites":"1","conferencePercentile":"47.43589744"},{"venue":"WEBIST","id":"66064e9d9446189f35f698112fc294acc613f08f","venue_1":"WEBIST","year":"2013","title":"Semantic Matching to Achieve Software Component Discovery and Composition","authors":"Sofien Khemakhem, Khalil Drira, Mohamed Jmaiel","author_ids":"2386286, 1809322, 1709086","abstract":"In CBSE, current approaches based on software component are in short of flexibility because of lacking semantic. In this paper, we introduce an extended semantic discovery of software components in which non functional properties of components are considered. We also introduce an ontology supported automatic component composition method to realize the integration of the adequate component composite in the current project.","cites":"2","conferencePercentile":"76.19047619"},{"venue":"WEBIST","id":"a86b1f7fc1916841b69f9cb7db8381d90a0e25dd","venue_1":"WEBIST","year":"2007","title":"Log4p: An Innovative Logger Framework for Web Portals - Towards New Metrics for Web Portals","authors":"Gennaro Costagliola, Filomena Ferrucci, Vittorio Fuccella, Luigi Zurolo","author_ids":"1746674, 1760777, 1840899, 3099144","abstract":"Content Management Systems and Web Portal Frameworks are more and more widely adopted in Web development. Those kinds of software often produce web pages whose layout is divided in sections called, in the case of Web Portals, \" portlets \". Portlets can be produced by different sources and then aggregated in the same page by the portal. For Web portals, traditional web metrics based on page visits can be inadequate for fully understanding user's interest, due to the heterogeneity of content and the variety of sources. This paper proposes a system for evaluating the web traffic at a deeper level than the page visit one: the level of the sections, or of the portlets. The interest of the user in the sections of the page is gauged through implicit interest indicators, such as, section visibility, mouse movements and other client-side interactions. Our system is composed of two different products: a framework that, opportunely instantiated in a web portal, allows the production of a log, and a log analyzer. The possible uses and benefits gained by research in the fields of web traffic analysis, portal design and usability are investigated in depth.","cites":"0","conferencePercentile":"15.58441558"},{"venue":"WEBIST","id":"8f58b85aede156bf0f3902de4323ec7b0d5df3b7","venue_1":"WEBIST","year":"2009","title":"A SIP-based Web Session Migration Service","authors":"Michael Adeyeye, Neco Ventura, David Humphrey","author_ids":"3237713, 1719579, 2110218","abstract":"Web session handoff is one of the ways of improving the web browsing experience; other ways include the use of bookmarks and web history synchronization between two PCs. This paper discusses the implementation and evaluation of a SIP-based web session migration service. A graphical tool, which is called Data Flow Diagram, is used to describe how the session migration service works. This work is compared with other existing web session migration approaches. In addition, the large scale deployment and limitations of the service are also discussed. Although all web sessions could not be migrated, the session mobility service worked in a Peer-to-Peer environment and offered SIP functionalities within web browsers. That is, a web browser can now act as an adaptive User Agent Client to surf the Internet and setup multimedia sessions like a SIP client. In summary, it is a novel approach to web session migration in which SIP is used to transfer session data. It also borrowed SIP Mobility mechanisms to introduce new service, namely content sharing and session handoff, to the web browsing experience.","cites":"0","conferencePercentile":"16.66666667"},{"venue":"WEBIST","id":"faecd4fd4c42e39139b49d7fed28cc4066b2b5eb","venue_1":"WEBIST","year":"2014","title":"Towards Process-driven Mobile Data Collection Applications - Requirements, Challenges, Lessons Learned","authors":"Johannes Schobel, Marc Schickler, Rüdiger Pryss, Fabian Maier, Manfred Reichert","author_ids":"2489100, 2999100, 2052739, 2650237, 1745454","abstract":"In application domains like healthcare, psychology and e-learning, data collection is based on specifically tailored paper & pencil questionnaires. Usually, such a paper-based data collection is accomplished by a massive workload regarding the processing, analysis, and evaluation of the data collected. To relieve domain experts from these manual tasks and to increase the efficiency of the data collection process, we developed a generic approach for realizing process-driven smart mobile device applications based on process management technology. According to this approach, the logic of a questionnaire is described in terms of an explicit process model whose enactment is driven by a generic process engine. Our goal is to demonstrate that such a process-aware design of mobile business applications is useful with respect to mobile data collection. Hence, we developed a generic architecture comprising the main components of mobile data collection applications. Furthermore, we used these components for developing mobile electronic questionnaires for psychological studies. The paper presents the challenges identified in this context and discusses the lessons learned. Overall, process management technology offers promising perspectives for developing mobile business applications at a high level of abstraction.","cites":"6","conferencePercentile":"100"},{"venue":"WEBIST","id":"de3905e30377548e94160854ed425fad2c16bb42","venue_1":"WEBIST","year":"2006","title":"Participation in International Virtual Learning Communities - A Social Learning Perspective","authors":"Beverly Trayner, John D. Smith, Marco C. Bettoni","author_ids":"1910384, 2372212, 2942097","abstract":"A promise of new web-based technologies is that they provide learning opportunities for people distributed across the globe but who can participate across time and space in the same virtual learning community. How do they do it? In this paper we report on some of the experiences of a virtual learning community which has members from twenty-five countries across different time-zones and who communicate in English. Through a communities of practice perspective we focus on the social nature of learning and describe some of the challenges and design issues raised in this community as it explores and develops practices for learning in an international online environment. While our focus is on social practices, and on developing an identity of participation in relation to those practices, we also make some wishes for web-based technologies that would better support these practices in an international virtual learning community.","cites":"3","conferencePercentile":"71.42857143"},{"venue":"WEBIST","id":"747465ad05871700eb32f2b30332a225577ab0f9","venue_1":"WEBIST","year":"2010","title":"Classifying Web Pages with Visual Features","authors":"Viktor de Boer, Maarten van Someren, Tiberiu Lupascu","author_ids":"2602357, 1733088, 2836459","abstract":"To automatically classify and process web pages, current systems use the textual content of those pages, including both the displayed content and the underlying (HTML) code. However, a very important feature of a web page is its visual appearance. In this paper, we show that using generic visual features we can classify the web pages for several different types of tasks. The features used in this document are simple color and edge histograms, Gabor and texture features. These were extracted using an off-the-shelf visual feature extraction method. In three experiments, we classify web pages based on their aesthetic value, their recency and the type of website. Results show that these simple, global visual features already produce good classification results. We also introduce an online tool that uses the trained classifiers to assess new web pages.","cites":"2","conferencePercentile":"67.94871795"},{"venue":"WEBIST","id":"f27c9699a643dd6946635fd1ce9e41c01d0af72f","venue_1":"WEBIST","year":"2007","title":"Model Driven Development of Digital Libraries - Validation, Analysis and Code Generation","authors":"Esther Guerra, Juan de Lara, Alessio Malizia","author_ids":"1735434, 8492862, 1687957","abstract":"This paper shows our model-driven approach for the formal construction and validation of Digital Libraries (DLs). We have defined a Domain Specific Visual Language (DSVL) called VisMODLE, which allows the description of a DL using five different viewpoints: services, behaviour, collections, structure and society. From a meta-model based description of the different viewpoints, we have generated a modelling environment for VisMODLE. We have provided the environment with a code generator that produces XUL code for the DL's user interface and composes the application using predefined components that implement the different services. Moreover, we have also added validation and simulation capabilities to the environment. Using the behavioural models (state-machine based), we can visually animate the system. In addition, the combined behaviour of actors and services can be transformed into a Petri net for further analysis.","cites":"1","conferencePercentile":"40.90909091"},{"venue":"WEBIST","id":"604585a8657a147dee990c0771163a1a70621e57","venue_1":"WEBIST","year":"2007","title":"Logging and Analyzing User's Interactions in Web Portals","authors":"Gennaro Costagliola, Filomena Ferrucci, Vittorio Fuccella, Luigi Zurolo","author_ids":"1746674, 1760777, 1840899, 3099144","abstract":"Content Management Systems and Web Portal Frameworks are more and more widely adopted in Web development. Those kinds of software often produce Web pages whose layout is divided in sections called, in the case of Web Portals, \" portlets \". Portlets can be produced by different sources and then aggregated in the same page by the portal. For Web portals, traditional Web metrics based on page visits can be inadequate for fully understanding user's interest, due to the heterogeneity of content and the variety of sources. This paper proposes a system for evaluating the Web traffic at a deeper level than the page visit one: the level of the sections, or of the portlets. The interest of the user in the sections of the page is gauged through implicit interest indicators, such as, section visibility, mouse movements and other client-side interactions. Our system is composed of two different products: a framework that, opportunely instantiated in a Web portal, allows the production of a log, and a log analyzer. The possible uses and benefits gained by research in the fields of Web traffic analysis, portal design and usability are investigated in depth.","cites":"0","conferencePercentile":"15.58441558"},{"venue":"WEBIST","id":"cb3df42b674c556a0f40068ffe622fc31828d74e","venue_1":"WEBIST","year":"2006","title":"Context-Aware Weblog to Enhance Communication among Participants in a Conference","authors":"Kosuke Numa, Hideaki Takeda, Takuichi Nishimura, Yutaka Matsuo, Masahiro Hamasaki, Noriyuki Fujimura, Keisuke Ishida, Tom Hope, Yoshiyuki Nakamura, Satoshi Fujiyoshi, Kazuya Sakamoto, Hiroshi Nagata, Osamu Nakagawa, Eiji Shinbori","author_ids":"2607317, 1696371, 1765625, 1692267, 1783855, 2716672, 2549048, 2760903, 2260588, 2606900, 3004636, 2562603, 2943829, 2793781","abstract":"In this paper, we propose a Weblog system called ActionLog, which can associate Weblog entries to real world contexts. The real world context is not only useful for Weblog authors themselves, but also beneficial to communication among people, because people with the same or a similar context can easily find each other. ActionLog collects user actions from both Web-based and other real-world systems. Weblog contents are generated automatically from these user actions with related information. Users can browse and edit these entries as their personal action records and in addition can publish them for experience sharing. We built a practical system as an ActionLog application for conference support. Its main objective is to help people to learn about presentations and to effectively meet other people in a limited amount of time and the least amount of user commitment. There are three main features, i.e., integration of information in the real world and the cyber world, personalization in both information capturing from users and in information providing to users, and persistent assistance throughout the conference.","cites":"0","conferencePercentile":"17.85714286"},{"venue":"WEBIST","id":"1915cc53521fcc8dd79f10558c20a80b0ab6d6bc","venue_1":"WEBIST","year":"2010","title":"In-Context Annotations for Refinding and Sharing","authors":"Ricardo Kawase, Eelco Herder, George Papadakis, Wolfgang Nejdl","author_ids":"1727722, 1706210, 2764068, 1744808","abstract":"Annotations support understanding, interpretation, sensemaking and scannability. As valuable as in paper-based contexts, digital online annotations provide several benefits for annotators and collaborators. To further explore the real benefits of online annotations, we implemented a simple Web Annotation tool, SpreadCrumbs, to support our studies. The tool provides a simple annotation mechanism, simulating real-world paper-based annotations. In addition, the tool supports search, sharing capabilities and social navigation. We conducted a series of user studies that empirically demonstrates the benefits of \" in-context \" annotations for refinding and sharing.","cites":"4","conferencePercentile":"79.48717949"},{"venue":"WEBIST","id":"ca07d5acae33ee21ac8c70908e781fc19b4f962d","venue_1":"WEBIST","year":"2006","title":"Web User Interaction - Comparison of Declarative Approaches","authors":"Mikko Pohja, Mikko Honkala, Miemo Penttinen, Petri Vuorimaa, Panu Ervamaa","author_ids":"2406848, 2502987, 2900025, 1704368, 2394674","abstract":"The World Wide Web is evolving from a platform for information access into a platform for interactive services. Several applications are already used through Internet and Web browsers. User interface of such an application is defined by HTML. However, HTML has its deficiencies when used as a general UI description language. Several parties have addressed this problem by defining specific UI description languages. Thus, for instance, a web browser could be used as a user interface for any application. We have revised the requirements for a UI description language from literature and evaluated two XML-based UI description formats against the requirements through use cases.","cites":"1","conferencePercentile":"46.42857143"},{"venue":"WEBIST","id":"04fe22fcb5d7309b222e4f0cce08cda1c25f148b","venue_1":"WEBIST","year":"2007","title":"A Model for Competence Gap Analysis","authors":"Juri Luca De Coi, Eelco Herder, Arne Wolf Koesling, Christoph Lofi, Daniel Olmedilla, Odysseas Papapetrou, Wolf Siberski","author_ids":"2417581, 1706210, 1994338, 2795229, 1703435, 3251613, 1685548","abstract":"Modeling competences is an integral part of many Human Resource (HR) and e-Learning related activities. HR departments use competence descriptions to define requirements needed for performing specific tasks or jobs. The same competences are acquired by employees and applicants by e.g. experience or certifications. Typically, HR departments need to match such required and acquired competences in order to find suitable candidates. In e-Learning a similar situation arises. Curricula or training programmes need to describe prerequisites that must be fulfilled before joining and the competences that will be acquired after successful completion. This paper analyses the limitations and extends existing approaches for modeling competences in order to allow (semi-)automatic competence matching.","cites":"19","conferencePercentile":"98.7012987"},{"venue":"WEBIST","id":"723071fa690192123e1cd6262d8152e95e7bfad0","venue_1":"WEBIST","year":"2013","title":"Popularity Growth Patterns of YouTube Videos - A Category-based Study","authors":"Shaiful Alam Chowdhury, Dwight J. Makaroff","author_ids":"2993604, 2678854","abstract":"Understanding the growth pattern of content popularity has become a subject of immense interest to Internet service providers, content makers and on-line advertisers. This understanding is important for the sustainable deployment of content distribution systems. A significant amount of research has been done in analyzing the popularity growth patterns of YouTube videos. Unfortunately, little work has been done that investigates the popularity patterns of YouTube videos based on video object category. In this paper, we perform an in-depth analysis of the popularity pattern of YouTube videos, considering video categories. We find that the time varying popularity of different YouTube categories are different from each other. For some categories, views at early ages can be used to predict future popularity, whereas for some other categories, predicting future popularity is a challenging task and requires more sophisticated techniques (e.g. time-series clustering). The outcomes of these analyses can be instrumental towards designing a reliable workload generator, which can be further used to evaluate different caching policies and distribution mechanism for YouTube and similar sites.","cites":"1","conferencePercentile":"64.28571429"},{"venue":"WEBIST","id":"4635daf6d767d980543f06cb6763f07893c69cc6","venue_1":"WEBIST","year":"2013","title":"Category-Based YouTube Request Pattern Characterization","authors":"Shaiful Alam Chowdhury, Dwight J. Makaroff","author_ids":"2993604, 2678854","abstract":"Media content distribution systems make extensive use of computational resources, such as disk and network bandwidth. The use of these resources is proportional to the relative popularity of the objects and their level of replication over time. Therefore, understanding request popularity over time can inform system design decisions. As well, advertisers can target popular objects to maximize their impact. Workload characterization is especially challenging with user-generated content, such as in YouTube, where popularity is hard to predict a priori and content is uploaded at a very fast rate. In this paper, we consider category as a distinguishing feature of a video and perform an extensive analysis of a snapshot of videos uploaded over two 24-hour periods. Our results show significant differences between categories in the first 149 days of the videos' lifetimes. The lifespan of videos, relative popularity and time to reach peak popularity clearly differentiate between news/sports and music/film. Predicting popularity is a challenging task that requires sophisticated techniques (e.g. time-series clustering). From our analysis, we develop a workload generator that can be used to evaluate caching, distribution and advertising policies. This workload generator matches the empirical data on a number of statistical measurements.","cites":"0","conferencePercentile":"28.57142857"},{"venue":"WEBIST","id":"d04ecbea854dcafd96917bc248ccbc5c7f7bac35","venue_1":"WEBIST","year":"2008","title":"Launching an E-Learning System in a School - Cross-European e-/m-Learning System UNITE: A Case Study","authors":"Maja Cukusic, Andrina Granic, Ivan Marsic","author_ids":"2300341, 1728392, 1707841","abstract":"* The age range of students enrolled in Croatian eight-year elementary schools is from seven to fifteen. Abstract: The paper reports on a case study concerning the e-/m-Learning implementation of theories and practices in school settings. Within the framework of the UNITE project, organisational, pedagogical, technical and infrastructural support was provided to a network of 14 European schools. This paper describes activities preceding and those undertaken through the launch of the UNITE system from the perspective of one enrolled school and its project partner. The system implementation, presented as iterative four stage process, covers scenario planning and implementation, validation along with platform and process improvement. Achieved intermediate results from the first iteration of the implementation process are discussed.","cites":"3","conferencePercentile":"72.82608696"},{"venue":"WEBIST","id":"fb5b2861d9a360eb43b3a4bd234b921414c8d837","venue_1":"WEBIST","year":"2007","title":"Browsing a Structured Multimedia Repository","authors":"Rui Lopes, Luís Carriço","author_ids":"1786757, 1805677","abstract":"Browsing large amounts of assorted multimedia poses several challenges on creating a supporting user interface. Even further, if metadata, structures and relations are defined on top of multimedia fragments, the complexity of a multimedia repository increases. However, this is also a path for exploiting new browsing mechanisms. This paper presents insights on which aspects should be available on a task-oriented user interface for browsing a structured multimedia repository, centred on speeding up interaction through media independent navigation schemes and user advisory.","cites":"0","conferencePercentile":"15.58441558"},{"venue":"WEBIST","id":"2ee99cb3579c5a8940fac0b19402ac2ffff1b32e","venue_1":"WEBIST","year":"2013","title":"Watermarking Digital Images in the Frequency Domain: Performance and Attack Issues","authors":"Maria Chroni, Angelos Fylakis, Stavros D. Nikolopoulos","author_ids":"1887835, 3270802, 1701558","abstract":"In this work we propose an efficient model for watermarking images that are intended for uploading on the web under intellectual property protection. Headed to this direction, we recently suggested a way in which an integer number w which being transformed into a self-inverting permutation, can be represented in a two dimensional (2D) object and thus, since images are 2D structures, we propose a watermark-ing algorithm that embeds marks on them using the 2D representation of w in the frequency domain. In particular, we propose a watermarking technique that uses the 2D representation of self-inverting permutations and utilizes marking at specific areas thanks to partial modifications of the image's Discrete Fourier Transform (DFT). Those modifications are made on the magnitude of specific frequency bands and they are the least possible additive information ensuring robustness and imperceptiveness. We have experimentally evaluated our algorithms using various images of different characteristics under JPEG compression, Gaussian noise addition , and geometric transformations. The experimental results show an improvement in comparison to the previously obtained results and they also depict the validity of our proposed codec algorithms.","cites":"1","conferencePercentile":"64.28571429"},{"venue":"WEBIST","id":"6ba932d3ac852926d28136a865fcf50e1095907b","venue_1":"WEBIST","year":"2008","title":"Open Source LMS Customization - A Moodle Stadistical Control Aplication","authors":"Carlos Muñoz, Miguel Ángel Conde González, Jorge Reyero, Francisco J. García-Peñalvo","author_ids":"3081908, 1687759, 2711478, 1722931","abstract":"This paper reflects the possibility of doing adaptations on a LMS depending on the necessities of a company or institution. In this case, ACEM allows the definition of course-level and platform-level reports and the automatic generation of certificates and diplomas for Moodle LMS. These adaptations are intended to complement all the different learning platforms by contributing added-value features like the generation of customizable diplomas and certificates and reports, which allow the obtaining information about both grades and participation in every activity of a course. 1 Introducción Actualmente es cada vez más frecuente que las diferentes instituciones, tanto públicas como privadas, apuesten por soluciones eLearning para cubrir sus necesidades de formación. Cualquiera de las modalidades de formación que pueden ofertarse, presencial, blended y online, deben contar con un soporte tecnológico lo suficientemente completo y flexible, es decir, un Learning Management System (a partir de ahora LMS). En el mercado, hoy en día, pueden encontrarse diferentes LMS, entre los que deben distinguirse los de pago y aquellos de libre distribución. Los de pago, generalmente, ofrecen un mayor nivel de adecuación a necesidades de particularres. Dentro de los LMS de libre distribución debe mencionarse Moodle, proyecto de software libre diseñado para dar soporte a un marco de educación social constructivista [2], que posee una gran comunidad de usuarios y desarrolladores. El problema surge ante la necesidad particular del Centro Internacional de Tecnologías Avanzadas (CITA a partir de ahora), perteneciente a la Fundación Germán Sánchez Ruipérez, de tener una más óptima gestión de las calificaciones y un sistema que permitiera generar de forma automática diplomas y certificados para Moodle. Para resolver la necesidad expuesta se propone la creación de ACEM","cites":"0","conferencePercentile":"21.73913043"},{"venue":"WEBIST","id":"96128b93e4d9f8cad9fac538539b77c3866f2dc0","venue_1":"WEBIST","year":"2007","title":"The Effects of the Ajax Technology on Web Application Usability","authors":"Jonas Kluge, Frank Kargl, Michael Weber","author_ids":"3260760, 1728575, 1693292","abstract":"The Ajax technology is said to make the Internet faster, more interactive and user-friendly. It is spreading rapidly throughout the web. By allowing scripts being executed inside the user's browser to communicate with a remote server, it enables new forms of interaction for web-pages and-applications. In this paper we analyze Ajax usability, taking into account both advantages and imposed problems. Subsequently we present a user study with two typical scenarios in web-applications and compare Ajax-enabled and non-Ajax-enabled versions. This allows us to verify and quantify the assumed effects. As a result, we show that Ajax significantly enhances both user satisfaction and efficiency of use, at least in some scenarios. The term Ajax is an acronym for \" Asynchronous JavaScript and XML \" (Garrett, 2005) and describes a way to realize a HTTP communication from within a JavaScript program embedded into a web page. The retrieval of information or the usage of an application in traditional websites consists of loading web pages page-by-page by clicking on links or submitting forms. Once a page has been loaded, the content remains mostly unchanged until a user action triggers loading of a completely new page. In contrast to this, Ajax sites can dynamically load new data from and transmit data to the originating web server while the page stays in display. The Javascript application running inside the browser can update the content of the web page with no need to discard the whole page at every data transmission. Communication happens asynchronously in the background , the web application stays fully functional in the meantime. Figure 1 shows the control-flow of an Ajax site compared to a regular web application. The communication with a webserver in an Ajax application is controlled by the so-called XML-HttpRequest object, which offers either synchronous or asynchronous retrieval of data. In the latter case, the application is notified via callbacks, when the retrieved data is available. The XMLHttpRequest object is an API being accessible from major scripting languages, like e.g. JavaScript. Its runtime environment is the Ajax engine being embedded into a standard web browser. Using the available mechanisms, highly interactive web applications can be realized, like e.g. Google Maps (http://maps.google.com) where users can seamlessly navigate through maps or Gmail (http://www.gmail.com/) where the inbox can be updated or emails moved between folders, all without loading a new page. So Ajax-enabled web applications seem to offer huge benefits in usability compared …","cites":"4","conferencePercentile":"78.57142857"},{"venue":"WEBIST","id":"d2f670b417c188d51f6dfaa183f5a6ae5aa397e5","venue_1":"WEBIST","year":"2005","title":"Logic-based Mobile Agent Framework Using Web Technologies","authors":"Shinichi Motomura, Takao Kawamura, Kazunori Sugahara","author_ids":"3232960, 1736913, 1690446","abstract":"We have proposed Maglog which is a framework for mobile multi-agent systems. Maglog is based on Prolog, and has the concept of field. A field is an object which can contain a knowledge base. With the concept of field, Maglog provides a simple and unified interface for 1)inter-agent communication, 2)agent migration between computers, and 3)utilization of data and programs on computers. An agent migrates using HTTP as the transport protocol and XML as the encoding format itself. In this paper, we present the implementation of Maglog on Java environment, in detail. Since we have implemented both command-line shell and GUI for Maglog, users can choose them for their needs. In addition, through XML-RPC interface for Maglog which we have also implemented, other systems can easily utilize Maglog. As examples, we outline several applications developed through XML-RPC interface.","cites":"0","conferencePercentile":"21.42857143"},{"venue":"WEBIST","id":"1a2210a3fd008628ceca8173ad978934e7e059fa","venue_1":"WEBIST","year":"2007","title":"Rich Digital Books for the Web","authors":"Rui Lopes, Hugo Simões, Carlos Duarte, Luís Carriço","author_ids":"1786757, 3156490, 2289512, 1805677","abstract":"This article presents an architecture for the production and delivery of Rich Digital Books on the Web. These books are transformed and enriched with supporting media, like images and sound, pursuing the goal of reaching broader audiences and enlarging usage possibilities. The architecture affords for the production process' automation, and thus has the potential to increase digital books' availability. The architecture also enjoys a high flexibility degree, allowing the production of books that can be read with Web-based technologies, such as Web browsers.","cites":"1","conferencePercentile":"40.90909091"},{"venue":"WEBIST","id":"628cb7dce9e28754af78efa3030bf5e3f92d6e7a","venue_1":"WEBIST","year":"2011","title":"Tag Clouds for Situated Interaction and Place Profiling","authors":"Rui José, Bruno Leonardo Barros Silva, Fernando Reinaldo Silva Garcia Ribeiro","author_ids":"2409908, 2216597, 2096317","abstract":"Tag clouds have become very popular as visual representations of the main topics in document sets or as navigation tools that can provide quick access to resources related with specific topics. However, their ability to represent the information environment associated with any meaningful reality in a way that is collectively visible, actionable and easily understood may also be very relevant, even when the reality being represented is no longer a set of documents or resources, but a stream of interactions occurring within a particular ubiquitous computing environment. In this paper, we explore the use of tag clouds within the context of situated displays and services. We hypothesise that such tag clouds may have a role as dynamic representations of place and also as interaction controls, supporting the same comprehension and navigation functions of classical tag clouds. We describe two case studies in which this concept of situated tag cloud has been experimented in real-world settings. The case studies demonstrate two different applications of the tag cloud concept as the basis for place description and situated interaction. The results obtained from the case studies suggest that situated tag clouds can indeed provide valuable representations of place and situations and can also support simple interaction models, allowing people to reason about the system behaviour and how it is being influenced by new interactions.","cites":"0","conferencePercentile":"27.5"},{"venue":"WEBIST","id":"286d867756b8dc92bc51af6ac235a03b732a7228","venue_1":"WEBIST","year":"2013","title":"Watermarking Images in the Frequency Domain by Exploiting Self-inverting Permutations","authors":"Maria Chroni, Angelos Fylakis, Stavros D. Nikolopoulos","author_ids":"1887835, 3270802, 1701558","abstract":"In this work we propose efficient codec algorithms for watermarking images that are intended for uploading on the web under intellectual property protection. Headed to this direction, we recently suggested a way in which an integer number w which being transformed into a self-inverting permutation, can be represented in a two dimensional (2D) object and thus, since images are 2D structures, we have proposed a watermarking algorithm that embeds marks on them using the 2D representation of w in the spatial domain. Based on the idea behind this technique, we now expand the usage of this concept by marking the image in the frequency domain. In particular, we propose a watermarking technique that also uses the 2D representation of self-inverting permutations and utilizes marking at specific areas thanks to partial modifications of the image's Discrete Fourier Transform (DFT). Those modifications are made on the magnitude of specific frequency bands and they are the least possible additive information ensuring robustness and imperceptiveness. We have experimentally evaluated our algorithms using various images of different characteristics under JPEG compression. The experimental results show an improvement in comparison to the previously obtained results and they also depict the validity of our proposed codec algorithms.","cites":"4","conferencePercentile":"88.0952381"},{"venue":"WEBIST","id":"5bde69ca72bb008fbb5d981fcedab3489fbeec70","venue_1":"WEBIST","year":"2009","title":"2D/3D Web Transitions: Methods and Techniques","authors":"Eric Deléglise, Diponkar Paul, Morten Fjeld","author_ids":"3049324, 2597918, 1685537","abstract":"While numerous web applications exploit either 2D or 3D technology, the work presented here suggests that it is feasible to integrate 2D and 3D environments. Besides presenting methods and techniques for realizing 2D and 3D web environments, novel ways of putting corresponding technologies to work are suggested. The prospective user benefits and inherent limitations of realized models are presented in our work. Then the issues that arise when switching between 2D and 3D environments are explored. The background and justification for the three methods and corresponding techniques presented here illustrate how to enable and facilitate a fluent and effective transition between 2D and 3D web environments. While some of the methods and techniques presented are still at a conceptual stage, two techniques have been realized and the findings are presented in detail. A video presentation of realized techniques is offered. Usability of the methods and techniques realized is discussed.","cites":"1","conferencePercentile":"36.66666667"},{"venue":"WEBIST","id":"4e7c4c23470b3f984ae8e675536e8d685a46cfe2","venue_1":"WEBIST","year":"2009","title":"Crawling Deep Web Content through Query Forms","authors":"Jun Liu, Zhaohui Wu, Lu Jiang, Qinghua Zheng, Xiao Liu","author_ids":"1843598, 1687635, 1697318, 1719603, 3120768","abstract":"This paper proposes the concept of Minimum Executable Pattern (MEP), and then presents a MEP generation method and a MEP-based Deep Web adaptive query method. The query method extends query interface from single textbox to MEP set, and generates local-optimal query by choosing a MEP and a keyword vector of the MEP. Our method overcomes the problem of \" data islands \" to a certain extent which results from deficiency of current methods. The experimental results on six real-world Deep Web sites show that our method outperforms existing methods in terms of query capability and applicability.","cites":"6","conferencePercentile":"96.66666667"},{"venue":"WEBIST","id":"c7c39bfd90b29e8594ab02a6712ee05c6721c026","venue_1":"WEBIST","year":"2006","title":"Distributed E-Learning System Using P2P Technology","authors":"Shinichi Motomura, Ryosuke Nakatani, Takao Kawamura, Kazunori Sugahara","author_ids":"3232960, 1692212, 1736913, 1690446","abstract":"In this paper, we present a novel framework for asynchronous Web-based training. The proposed system has two distinguishing features. Firstly, it is based on P2P architecture for scalability and robustness. Secondly, all contents in the system are not only data but also agents so that they can mark user's answers, can tell the correct answers, and can show some extra information without human instruction. We also present a prototype implementation of the proposed system on Maglog. Maglog is a Prolog-based framework for building mobile multi-agent systems we have developed. Our system has methods for communications between learners and for recordings of their score without server computers. The user interface program of the proposed system is built on Squeak. Performance simulations demonstrate the effectiveness of the proposed system.","cites":"7","conferencePercentile":"88.0952381"},{"venue":"WEBIST","id":"bf4d92bcf0b501d9d03a6cfd7a2b53561cfeb288","venue_1":"WEBIST","year":"2006","title":"Semantic Web Technologies for Content Reutilization Strategies in Publishing Companies","authors":"Andreas Andreakis, Adrian Paschke, Alexander Benlian, Martin Bichler, Thomas Hess","author_ids":"2481808, 1709709, 3041330, 7435512, 6635677","abstract":"In recent times content reutilization in different media channels (such as in Cross Media Publishing or Windowing) is a much discussed concept in the media industry. It promises decreasing production and coordination costs by exploiting and leveraging synergy effects. First theoretical investigations emphasized the importance of efficient metadata-enriched linking and modularity techniques for a successful implementation of this multi-usage concept. However, nearly all recent approaches stop at the level of theoretical suggestions and do not include novel technological potentials provided by Semantic Web languages and tools. On the basis of previous works, this paper attempts to fill these research gaps by presenting a \" proof of concept \" implementation and by highlighting the possibilities and the potential of Semantic Web technologies in the context of media content reutilization.","cites":"2","conferencePercentile":"64.28571429"},{"venue":"WEBIST","id":"d11986c88121dbb501482d12aad04a99ccad5868","venue_1":"WEBIST","year":"2006","title":"A Logic-Based Mobile Agent Framework for Web Applications","authors":"Shinichi Motomura, Takao Kawamura, Kazunori Sugahara","author_ids":"3232960, 1736913, 1690446","abstract":"A new logic-based mobile agent framework named Maglog is proposed in this paper. In Maglog, a concept called \" field \" is introduced. By using this concept, the following functions are realized: 1) the agent migration which is the function that enables agents to migrate between computers, 2) the inter-agent communication which is the indirect communication with other agents through the field, 3) the adaptation which is the function that enables agents to execute programs stored in the field. We have implemented Maglog on Java environment. The program of an agent which is a set of Prolog clauses is translated into Java source code with our Maglog translator, and then it is compiled into Java classes with a Java compiler. In addition, through XML-RPC interface for Maglog which we have also implemented, other systems can easily utilize Maglog. The effectiveness of Maglog is confirmed through the demonstration of an application: the distributed e-Lerning system.","cites":"4","conferencePercentile":"73.80952381"},{"venue":"WEBIST","id":"1f6d5026885e39013363d376c47db7fe0163b983","venue_1":"WEBIST","year":"2007","title":"Modeling and Managing Federated Web-based Systems","authors":"Johannes Meinecke, Martin Gaedke, Frederic Majer, Alexander Brändle","author_ids":"1780390, 2974357, 1809312, 2944895","abstract":"Among the various aspects of Web applications that are subject to modeling, like navigation, interaction or business processes, the architectural aspect is receiving growing attention. This is related to the fact that the Web is increasingly used as a platform for distributed services which transcend organizational boundaries to form so-called federated applications. In this context, we use the term \" architecture \" to denote the composition of the overall solution into individual Web applications and Web services that belong to different parties and invoke each other. The design and evolution of such systems calls for models that give an overview of the federation structure and reflect the technical details of the various accesses. We introduce the WebComposition Architecture Model (WAM) as an overall modeling approach tailored to aspects of highly distributed systems with federation as an integral factor.","cites":"2","conferencePercentile":"56.49350649"},{"venue":"WEBIST","id":"e408839ce90b6cfd167293b33140cda8479703d7","venue_1":"WEBIST","year":"2005","title":"P2P Web-based Training System Using Mobile Agent Technologies","authors":"Shinichi Motomura, Takao Kawamura, Ryosuke Nakatani, Kazunori Sugahara","author_ids":"3232960, 1736913, 1692212, 1690446","abstract":"In this paper, we present a novel framework for asynchronous Web-based training. The proposed system has two distinguishing features. Firstly, it is based on P2P architecture for scalability and robustness. Secondly, all contents in the system are not only data but also agents so that they can mark user's answers, can tell the correct answers, and can show some extra information without human instruction. We also present a prototype implementation of the proposed system on Maglog. Maglog is a Prolog-based framework for building mobile multi-agent systems we have developed. The agent migrates using HTTP as transfer protocol and XML as encoding format itself. The user interface program of the proposed system is built on Squeak. Performance simulations demonstrate the effectiveness of the proposed system.","cites":"1","conferencePercentile":"51.78571429"},{"venue":"WEBIST","id":"4ed88a0e01098a71e52f9f52a914eafe1b26791f","venue_1":"WEBIST","year":"2005","title":"The Design of the Mirage Spatial Wiki","authors":"Nels Anderson, Adam Bender, Carl Hartung, Gaurav Kulkarni, Anuradha Kumar, Isaac Sanders, Dirk Grunwald, Bruce Sanders","author_ids":"8285963, 2043767, 8729489, 7484819, 3100840, 2606547, 1748465, 2757340","abstract":"Location based services can simplify information access but despite the numerous efforts and prototypes that attempt to provide location based services, there are very few such systems in wide spread use. There are three common problems that face the designers of location based systems-the basic location technology, the complexity of establishing a service for a particular location and the complexity of maintaining and presenting information to users of the systems. This paper outlines the software architecture of and experience with the Mirage Spatial Wiki. We describe the design decisions that have led to a system that is easy to deploy and use.","cites":"0","conferencePercentile":"21.42857143"},{"venue":"WEBIST","id":"6e88a70ee6d268f328aafdf707f3ca7ec7cc2a19","venue_1":"WEBIST","year":"2007","title":"User and Application Interface for a Distributed e-Learning System","authors":"Takao Kawamura, Kazuo Kuramochi, Junya Kishida, Shinichi Motomura, Kazunori Sugahara","author_ids":"1736913, 2445579, 3108064, 3232960, 1690446","abstract":"In this paper, the user and application interface of our previously proposed e-Learning system is presented to demonstrate how user interfaces for distributed systems should be composed. The proposed e-Learning system has two distinguishing features. Firstly, it is based on P2P architecture for scalability and robustness. Secondly, all exercises in the system are not only data but also agents so that they have functions, such as scoring user's answers, telling the correct answers, and showing some related information without human instruction. The interface provides three kinds of communication: communication between a user and an exercise agent, communication between an exercise agent and support applications, and communication between a user and other users. The interface consists of two parts: an interface agent and a plugin for Firefox web browser. An interface agent hides the existence of the P2P network and other agents from the Firefox plugin and users. The developed e-Learning system including the interface is examined by experiments in classroom.","cites":"0","conferencePercentile":"15.58441558"},{"venue":"WEBIST","id":"243b7869699289cedfaae9bcf247232f35b6a503","venue_1":"WEBIST","year":"2007","title":"A Performance Evaluation of Mobile Web Services Security","authors":"Satish Narayana Srirama, Matthias Jarke, Wolfgang Prinz","author_ids":"1698593, 1744383, 1678328","abstract":"It is now feasible to host basic web services on a smart phone due to the advances in wireless devices and mobile communication technologies. The market capture of mobile web services also has increased significantly, in the past years. While the applications are quite welcoming, the ability to provide secure and reliable communication in the vulnerable and volatile mobile ad-hoc topologies is vastly becoming necessary. Even though a lot of standardized security specifications like WS-Security, SAML exist for web services in the wired networks, not much has been analyzed and standardized in the wireless environments. In this paper we give our analysis of adapting some of the security standards, especially WS-Security to the cellular domain, with performance statistics. The performance latencies are obtained and analyzed while observing the performance and quality of service of our Mobile Host.","cites":"4","conferencePercentile":"78.57142857"},{"venue":"WEBIST","id":"16eb794ecd8150e01b3ece3cd998db0527ab1bbf","venue_1":"WEBIST","year":"2010","title":"TagMe!: Enhancing Social Tagging with Spatial Context","authors":"Fabian Abel, Nicola Henze, Ricardo Kawase, Daniel Krause, Patrick Siehndel","author_ids":"1714362, 1699110, 1727722, 5381157, 1743694","abstract":"TagMe! is a tagging and exploration front-end for Flickr images, which enables users to annotate specific areas of an image, i.e. users can attach tag assignments to a specific area within an image and further categorize the tag assignments. Additionally, TagMe! automatically maps tags and categories to DBpedia URIs to clearly define the meaning. In this work we discuss the differences between tags and categories and show how both facets can be applied to learn semantic relations between concepts referenced by tags and categories. We also expose the benefits of the visual (spatial) context of the tag assignments, with respect to ranking algorithms for search and retrieval of relevant items. We do so by analyzing metrics of size and position of the annotated areas. Finally, in our experiments we compare different strategies to realize semantic mappings and show that already lightweight approaches map tags and categories with high precisions (86.85% and 93.77% respectively). The TagMe! system is currently available at http://tagme.groupme.org.","cites":"0","conferencePercentile":"16.66666667"},{"venue":"WEBIST","id":"6f5c1422488147a3d51754db1524288e4abba363","venue_1":"WEBIST","year":"2007","title":"New Implementation of RMI to Protect Integrity and Confidentiality for Mobile Agents","authors":"Shinichi Motomura, Takao Kawamura, Kazunori Sugahara","author_ids":"3232960, 1736913, 1690446","abstract":"A new implementation of RMI named OnePort RMI is proposed in this paper. OnePort RMI consists of new RMI runtime, classes which are implemented interfaces by RMI specification, and MultiChannelSocketFac-tory. Using OnePort RMI, when an object on a client invokes methods of remote objects on a server, the client can use sockets of different types to connect one destination port at the same time, and the server can accept incoming call from the sockets on only the port. In order to protect integrity and confidentiality of our mobile agent framework named Maglog, OnePort RMI is introduced into Maglog. In consequence, each agent can select a socket depending on importance of data and programs which are contained in their agents. We emphasize that the proposed OnePort RMI is not only for mobile agent frameworks such as our Maglog but also for any RMI applications.","cites":"0","conferencePercentile":"15.58441558"}]}