{"WebKDDSNA-KDD_07.csv":[{"venue":"WebKDD/SNA-KDD '07","id":"1effab85b4d2683d17b9606314e5596aad085ef4","venue_1":"WebKDD/SNA-KDD '07","year":"2007","title":"Community detection in large-scale social networks","authors":"Nan Du, Bin Wu, Xin Pei, Bai Wang, Liutong Xu","author_ids":"1714086, 6023931, 4719966, 1735282, 2464254","abstract":"Recent years have seen that WWW is becoming a flourishing social media which enables individuals to easily share opinions, experiences and expertise at the push of a single button. With the pervasive usage of instant messaging systems and the fundamental shift in the ease of publishing content, social network researchers and graph theory researchers are now concerned with inferring community structures by analyzing the linkage patterns among individuals and web pages. Although the investigation of community structures has motivated many diverse algorithms, most of them are unsuitable for large-scale social networks because of the computational cost. Moreover, in addition to identify the possible community structures, how to define and explain the discovered communities is also significant in many practical scenarios.\n In this paper, we present the algorithm <i>ComTector</i>(<b>Com</b>munity De<b>Tector</b>) which is more efficient for the community detection in large-scale social networks based on the nature of overlapping communities in the real world. This algorithm does not require any priori knowledge about the number or the original division of the communities. Because real networks are often large sparse graphs, its running time is thus <i>O(C &#215; Tri<sup>2</sup></i>), where <i>C</i> is the number of the detected communities and <i>Tri</i> is the number of the triangles in the given network for the worst case. Then we propose a general naming method by combining the topological information with the entity attributes to define the discovered communities. With respected to practical applications, ComTector is challenged with several real life networks including the Zachary Karate Club, American College Football, Scientific Collaboration, and Telecommunications Call networks. Experimental results show that this algorithm can extract meaningful communities that are agreed with both of the objective facts and our intuitions.","cites":"65","conferencePercentile":"90"}]}