{"WebMedia.csv":[{"venue":"WebMedia","id":"5c8fa8bcc638ed396ec6f5aff98ac5773aac4ea6","venue_1":"WebMedia","year":"2012","title":"Improving location recommendations with temporal pattern extraction","authors":"Leandro Balby Marinho, Iury Nunes, Thomas Sandholm, Caio Nóbrega, Jordão Araújo, Carlos Eduardo S. Pires","author_ids":"1739660, 2013928, 2262272, 2024856, 2269029, 2531142","abstract":"A key challenge in mobile social media applications is how to present personalized content that is both geographically and temporally relevant. In this paper, we propose a new and generic temporal weighting function for improving location recommendations. First, we identify areas of interest to recommend by clustering geographic activity based on a trace of geotagged photos. Next, the clusters are temporally weighted using TF-IDF, in order to capture seasonality, and a decay scoring function to capture preference drift. Finally, these weights are combined with the cluster scores based on geographic relevance. We evaluate our recommender on a large dataset collected from Panoramio consisting of the top-100 most populated cities in the world and show that incorporating the proposed temporal weighting function improves recommendation quality.","cites":"4","conferencePercentile":"93.18181818"},{"venue":"WebMedia","id":"f59f5bc8eefac3589f86f25fed9f77e8739f474c","venue_1":"WebMedia","year":"2016","title":"Study of Google Popularity Times Series for Commercial Establishments of Curitiba and Chicago","authors":"Yuri C. B. Neves, Mozart P. Sindeaux, William Souza, Nádia P. Kozievitch, Antonio Alfredo Ferreira Loureiro, Thiago H. Silva","author_ids":"8117244, 7532668, 7406124, 3234428, 1757448, 2963539","abstract":"Urban computing is a recent area of study that helps us to understand the nature of urban phenomena. In this sense, an important aspect to study is the dynamics of commercial establishments popularity in the city. Recently, Google launched a new service that provides popularity time series of some commercial establishments in several cities. This is a valuable source of data that allow us to better understand the dynamics of establishments popularity, helping to change our perceived physical limits about the city, which can enable the development of new applications and urban services. The results of this study are: (1) characterization of Google popularity time series for bars and restaurants in the cities of Curitiba/Brazil and Chicago/USA. Among the results, we find cultural characteristics of these cities, as well as a favorable clustering of similar venues based on the temporal pattern of popularity; (2) evaluation of reproduction of Google popularity time series using Foursquare data. In this evaluation, we found evidence that Foursquare data might be used for this purpose. This means that for places where Google does not offer this service data from Foursquare, or other source, could be used. This enables the exploration of a greater number of establishments in, for example, a new venue recommendation engine.","cites":"0","conferencePercentile":"50.73529412"},{"venue":"WebMedia","id":"0701ed7a85a6f1896bdb4303c79a95ab28286714","venue_1":"WebMedia","year":"2013","title":"Polarity analysis of micro reviews in foursquare","authors":"Felipe Moraes, Marisa A. Vasconcelos, Patrick Prado, Jussara M. Almeida, Marcos André Gonçalves","author_ids":"2142059, 2632256, 3258947, 8118988, 7170789","abstract":"On Foursquare, one of the currently most popular location-based social networks, users can not only share which places (venues) they visit but also leave short comments (tips) about their previous experiences at specific venues. Tips may provide a valuable feedback for business owners as well as for potential new customers. Sentiment or polarity classification provides useful tools for opinion summarization, which can help both parties to quickly obtain a predominant view of the opinions posted by users at a specific venue. We here present what, to our knowledge, is the first study of polarity of Foursquare tips. We start by characterizing two datasets of collected tips with respect to their textual content. Some inherent characteristics of tips, such as short sizes as well as informal and often noisy content, pose great challenges to polarity detection. We then investigate the effectiveness of four alternative polarity classification strategies on subsets of our dataset. Three of the considered strategies are based on supervised machine learning techniques and the fourth one is an unsupervised lexicon-based approach. Our evaluation indicates that effective polarity classification can be achieved even if the simpler lexicon-based approach, which does not require costly manual tip labeling, is adopted.","cites":"4","conferencePercentile":"99.15254237"},{"venue":"WebMedia","id":"9585d3941f7ec55fb66d8eaa3f8622891134b003","venue_1":"WebMedia","year":"2012","title":"Exploiting relevance, novelty and diversity in tag recommendation","authors":"Fabiano Muniz Belém, Eder Ferreira Martins, Jussara M. Almeida, Marcos André Gonçalves","author_ids":"2810045, 2799853, 8118988, 7170789","abstract":"Tag recommendation methods have mostly focused on maximizing relevance, but other aspects may be as important for recommendation usefulness. We here define novelty and diversity for tag recommendation, and propose two new recommendation strategies that consider these aspects jointly with relevance. We evaluate the proposed strategies using real datasets from 3 popular Web 2.0 applications, achieving gains over the state-of-the-art of up to 21% in relevance, 45% in novelty and 2.5\\% in diversity.","cites":"4","conferencePercentile":"93.18181818"},{"venue":"WebMedia","id":"4d96f69fd91af359ab1bda5b6cc07ac504f1b74b","venue_1":"WebMedia","year":"2013","title":"Multimedia: from information source to components of transformational games","authors":"Michael G. Christel","author_ids":"7307726","abstract":"This summary overviews a keynote talk that the author is giving at the WebMedia conference. Christel will discuss his journey with multimedia research over the past six years, taking him from Carnegie Mellon University's Computer Science Department into the Entertainment Technology Center (ETC). The story begins with the use of speech recognition, image processing, and language technologies to automatically process large video corpora. Such processing facilitates more efficient retrieval. As demonstrated by top scores in the international TRECVID benchmarking forum, Christel's CMU Informedia research group has experienced success in finding relevant video shots quickly from large masses of material. The emphasis is on leveraging the intelligence of a human user in the interactive retrieval loop, with lessons shared in visual analytics papers. That work drew the attention of oral historians, who amassed large quantities of video stories that were not easily accessible. The value of synchronized metadata to open up these collections for the web audience illustrates the power of multimedia processing to help organize and present cultural repositories. As the user community appreciated the layers of meaning within these often riveting stories, Christel was drawn to the power of multimedia elements in entertainment technologies, including games. Transformational games are designed to change the player in some way, such as improving health habits, changing attitudes, or providing education. The ETC provides multidisciplinary teams of graduate students with skills in visual arts, design, sound, programming, and production the opportunity to create such games in the course of a semester-long project. Christel will briefly overview this development process, and then demonstrate some of the ETC-produced games, highlighting the role of multimedia elements within them and the promise of the work to positively affect the game player.","cites":"0","conferencePercentile":"34.74576271"},{"venue":"WebMedia","id":"704623682f40396da1eb4ad7d2c461d98c07466e","venue_1":"WebMedia","year":"2013","title":"Personalized presentations from community assets","authors":"Rodrigo Laiola Guimarães, Pablo César, Dick C. A. Bulterman","author_ids":"1693206, 1743507, 1726923","abstract":"Creating compelling multimedia productions is a non-trivial problem. The problem is compounded when authors want to integrate community media assets: media fragments contributed by a potentially wide and anonymous recording community. In this paper, we report on a hybrid authoring approach that provides mixed support for automated creation and manual enhancement of personalized multimedia presentations. We target small-scale events (such as a high school music concert), where lightly annotated media assets are provided. Our assumption is that enthusiastic, but less experienced, editors (e.g., parents and family members) will want to highlight personal aspects of each event: a particular child, a particular instrument or a particular solo. This places a requirement on a system that helps users to select appropriate content of personal interest, and that helps building compelling presentations with minimum user effort. Based on a 4-years user-centered evaluation process, this paper provides useful insights into how a multimedia authoring system should be designed and architected for helping users in creating personalized video stories they care about.","cites":"1","conferencePercentile":"77.96610169"},{"venue":"WebMedia","id":"4fa7282cdde2f5236eba6f9e62d6d9631fc40089","venue_1":"WebMedia","year":"2015","title":"Brazil Around the World: Characterizing and Detecting Brazilian Emigrants Using Google+","authors":"Johnnatan Messias, Gabriel Magno, Fabrício Benevenuto, Adriano Veloso, Virgílio A. F. Almeida","author_ids":"2939152, 1863896, 2810330, 1739417, 7360316","abstract":"Currently available data about people whose left their home country to live in a foreign country does not adequately capture the standards of contemporary global migration flows. A new trend for migration studies is to study the data from the Internet, either by Social Networks or other data in the WEB. In this study, we collected users data from the social network Google+ to investigate which features of Brazilian users are relevant to classify them as a possible emigrant. Our study uses machine learning techniques, SVM. We selected some features to compose our dataset. Our results show that the network features were the ones that had greater capacity for discrimination. The most relevant for the prediction of Brazilian emigrants users are, in order: reciprocity, PageRank, in-degree, clustering coefficient and ratio of incoming foreigners.","cites":"0","conferencePercentile":"38.88888889"},{"venue":"WebMedia","id":"518f399bd53a30bfda5e2ba66dab142b04116f29","venue_1":"WebMedia","year":"2012","title":"\"Let me comment on your video\": supporting personalized end-user comments within third-party online videos","authors":"Rodrigo Laiola Guimarães, Pablo César, Dick C. A. Bulterman","author_ids":"1693206, 1743507, 1726923","abstract":"Long before the first transmission in color of a World Cup in 1970, people used to gather around the few existing radio and TV sets to watch together and talk about their favorite programs. Decades later, not only the technology has significantly changed but also people's consumption and commenting habits. Nowadays, one can easily watch an online video on demand and share comments with others asynchronously. However, current video commenting facilities do not take into account the temporal nature of videos. Viewers can only add comments that will then appear statically underneath the video. Motivated by a survey research on current media watching and commenting practices, we report on our findings from the evaluation of an online video commenting system that allows users to add synchronized comments to third-party videos. Our results indicate that users appreciate the functionalities of our system and find it better to comment when compared to existing tools. Ultimately, we hope that our work can bring insights to be considered in the design of next generation online video commenting tools.","cites":"4","conferencePercentile":"93.18181818"},{"venue":"WebMedia","id":"70f9d060b71c954f340a27d908585948d357d5f7","venue_1":"WebMedia","year":"2015","title":"Sentiment Analysis Methods for Social Media","authors":"Fabrício Benevenuto, Matheus Araújo, Filipe Nunes Ribeiro","author_ids":"2810330, 2903509, 2411946","abstract":"Sentiment Analysis became an important topic in the Web recently, especially regarding to Online Social Networks. Many applications are monitoring products and brands, and even important social events like political campaigns. A large number of Sentiment Analysis methods and techniques were proposed in the literature. This short course offers an introduction to explore this theme. First, we present an overview about sentiment analysis and it's popular applications. Next, we discuss main methods from literature. Finally, we compare these methods with each other highlighting advantages and limitations.","cites":"0","conferencePercentile":"38.88888889"},{"venue":"WebMedia","id":"b2031d6bf901ca41b1c20f8d1cc49606fe72ced8","venue_1":"WebMedia","year":"2013","title":"Designing and developing interactive multimedia applications","authors":"Nuno Correia","author_ids":"1717306","abstract":"This talk presents the design and development process of interactive multimedia and multimodal systems used in diverse environments. The technologies, including new sensors, interaction surfaces and semantic information processing techniques will be described in the context where they were used. The systems result from collaborative projects in several fields, ranging from cultural heritage to contemporary art and dance. The dialogue with stakeholders from different areas and the impact on the resulting outcomes will be discussed, along with the process of setting up, specifying and developing interdisciplinary projects and the methodologies that are used. Recent work on motion annotation to help choreographic work, image analysis of paintings and digital art projects will be described. The academic and research environment and programs in which this work is done are also presented.","cites":"0","conferencePercentile":"34.74576271"},{"venue":"WebMedia","id":"5dfdc7b1403da729e3f279e38678cd96a62147b7","venue_1":"WebMedia","year":"2016","title":"A Semantic Web Approach to Low-Level Features in Images","authors":"Miguel Bento Alves, Carlos Viegas Damásio, Nuno Correia","author_ids":"2028988, 1728569, 1717306","abstract":"We present a Semantic Web based approach that meets the requirements for images retrieval based on low-level features. For that, we developed a prototypical implementation using a Semantic Web framework, linking open data ontologies and image processing libraries. We created an ontology to support the low-level features data of images. Furthermore, we created semantic rules to define concepts based on low-level features. We show how the different mechanisms of the Semantic Web may help multimedia management, both for storage and in retrieval tasks.","cites":"0","conferencePercentile":"50.73529412"},{"venue":"WebMedia","id":"03934886087d4edc0a0d38fa6f2c6ba1ea908859","venue_1":"WebMedia","year":"2005","title":"A web service for CSCW applications","authors":"Victor H. Vieira, Daniel G. Sante, André Pimenta Freire, Renata Pontin de Mattos Fortes","author_ids":"1950058, 3283542, 1721856, 1727815","abstract":"The Open Source Software (OSS) community came with a new paradigm for software development, and the tools commonly used by OSS teams to coordinate their work include version control systems and communication tools. However, there is a lack of groupware support for coordinating the development of OSS projects due to the fact that these tools are non-integrated. In this paper we describe the WS4CSCW, a web service that provides groupware support by integrating communication &amp; coordination tools under a common conceptual model. This work is part of the SAFE project, which aims to develop a framework for supporting the OSS development process.","cites":"0","conferencePercentile":"21.05263158"},{"venue":"WebMedia","id":"2008fa50bf8ca6d00970c10bd59b640454a095df","venue_1":"WebMedia","year":"2014","title":"Synchronizing Web Documents with Style","authors":"Rodrigo Laiola Guimarães, Dick C. A. Bulterman, Pablo César, Jack Jansen","author_ids":"1693206, 1726923, 1743507, 1724349","abstract":"In this paper we report on our efforts to define a set of document extensions to Cascading Style Sheets (CSS) that allow for structured timing and synchronization of elements within a Web page. Our work considers the scenario in which the temporal structure can be decoupled from the content of the Web page in a similar way that CSS does with the layout, colors and fonts. Based on the SMIL (Synchronized Multimedia Integration Language) temporal model we propose CSS document extensions and discuss the design and implementation of a proof of concept that realizes our contributions. As HTML5 seems to move away from technologies like Flash and XML (eXtensible Markup Language), we believe our approach provides a flexible declarative solution to specify rich media experiences that is more aligned with current Web practices.","cites":"1","conferencePercentile":"81.08108108"},{"venue":"WebMedia","id":"57a84a22b7038b113d7735d88c22a7f0718fe45c","venue_1":"WebMedia","year":"2013","title":"Measuring and addressing the impact of cold start on associative tag recommenders","authors":"Eder Ferreira Martins, Fabiano Muniz Belém, Jussara M. Almeida, Marcos André Gonçalves","author_ids":"2799853, 2810045, 8118988, 7170789","abstract":"Tag recommendation methods that exploit co-occurrence patterns of tags have consistently produced state of the art results. However, tags are not present in significant portions of Web 2.0 objects, which may impact the effectiveness of such methods. This problem, known as cold start, is the focus of this paper. We here evaluate the impact of the cold start on a family of methods for recommending tags. Our results show that the effectiveness of these methods suffer greatly when they cannot rely on previously assigned tags in the target object and that the use of automatic filtering strategies to alleviate the problem yields limited gains. We then propose a new strategy that exploits both positive and negative relevance feedback (RF) from the users to iteratively select input tags to these methods. The results show that the proposed strategy generates significant gains (up to 45%) over the best considered baseline. It is also shown that the proposed method is robust to the lack of user cooperation.","cites":"2","conferencePercentile":"90.6779661"},{"venue":"WebMedia","id":"004fd5dde7876855cb33230de1ba18799db4d0fc","venue_1":"WebMedia","year":"2012","title":"Dynamic and semantic web services composition for ubiquitous computing","authors":"Frederico Lopes, Thaís Vasconcelos Batista, Everton Cavalcante, Thiago Pereira, Flávia Coimbra Delicato, Paulo F. Pires, Paulo Ferreira","author_ids":"2601085, 1683833, 2387285, 4497797, 1748015, 1712738, 1709980","abstract":"The development of complex applications is one of the major current challenges of Ubiquitous Computing. Such applications are difficult to develop because they use services provided by different context-provision middleware, thus being necessary to know the models used for communication and representation of context information for each one. This paper presents the semantic composition and Web service selection mechanisms provided by OpenCOPI, a platform designed to integrate context-provision middleware. In OpenCOPI: (i) the applications are described in a high-level of abstraction by using semantic workflows; (ii) the semantic composition is responsible for composing concrete services from abstract descriptions of the applications, and; (iii) the selection is based on service quality metadata and user preferences. This paper also presents an evaluation of the semantic composition and the Web service selection mechanisms considering a ubiquitous application.","cites":"0","conferencePercentile":"28.78787879"},{"venue":"WebMedia","id":"290e1b4595113b11a88494a9b1aa2f9a48cb4cd1","venue_1":"WebMedia","year":"2005","title":"Towards an approach for multi-device interface design","authors":"Rodrigo de Oliveira, Heloisa Vieira da Rocha","author_ids":"8641731, 2147144","abstract":"This paper proposes an approach for multi-device interface design that extends pre-designed interfaces keeping the original application conceptual model without loosing its usability, The proposal reinterprets general aspects of well known Human-Computer Interaction (HCI) lifecycle models and can be extended to the design of any interactive product. When validated through a simple transformation between a large and a small screen interface in an HCI domain, it shall point to a much less maintenance cost/complexity and a better usability, ensuring the user's satisfaction.","cites":"4","conferencePercentile":"73.68421053"},{"venue":"WebMedia","id":"0361cbfabd09a233b10bd373bf39fc1d953c52cf","venue_1":"WebMedia","year":"2016","title":"Study of Gender Preferences for Locations Around the World Using Social Media Data","authors":"Willi Müller, Thiago H. Silva, Jussara M. Almeida, Antonio Alfredo Ferreira Loureiro","author_ids":"3398225, 2963539, 8118988, 1757448","abstract":"Traditional methods for obtaining data to conduct gender studies may be cumbersome because, usually, data are obtained manually through questionnaires. However, this poses challenges in conducting such studies on a large scale. Thus, available studies using traditional methods often provide analysis only at country level. In this paper, we explore the use of check-ins data collected from Foursquare to estimate the cultural gender preferences for locations in the physical world. Our results suggest that gender preferences can be captured for locations at different spatial granularity -- not just for countries. This indicates that our proposed methodology could inspire a complementary approach to conduct studies of gender preferences for locations.","cites":"0","conferencePercentile":"50.73529412"},{"venue":"WebMedia","id":"1d4d0a882ede8bd26bd19ed0475b8eaf85799465","venue_1":"WebMedia","year":"2013","title":"Measuring sentiments in online social networks","authors":"Matheus Araújo, Pollyanna Gonçalves, Fabrício Benevenuto","author_ids":"2903509, 3023470, 2810330","abstract":"Sentiment analysis has being used in several applications including the analysis of the repercussion of events in online social networks (OSNs), as well as to summarize public perception about products and brands on discussions on those systems. There are multiple methods to measure sentiments, varying from lexical-based approaches to machine learning methods. Despite the wide use and popularity of some those methods, it is unclear which method is better for identifying the polarity (i.e. positive or negative) of a message, as the current literature does not provide a comparison among existing methods. This comparison is crucial to allow us to understand the potential limitations, advantages, and disadvantages of popular methods in the context of OSNs messages. This work aims at filling this gap by presenting a comparison between 8 popular sentiment analysis methods. Our analysis compares these methods in terms of coverage and in terms of correct sentiment identification. We also develop a new method that combines existing approaches in order to provide the best coverage results with competitive accuracy. Finally, we present iFeel, a Web service which provides an open API for accessing and comparing results across different sentiment methods for a given text.","cites":"0","conferencePercentile":"34.74576271"},{"venue":"WebMedia","id":"2b935329451faaa7588cbfb486f2df79ebbc40d4","venue_1":"WebMedia","year":"2014","title":"A Characterization of Access Profiles and Navigation in E-Commerce: A Tourism Application","authors":"Ruhan Bidart, Adriano M. Pereira, Jussara M. Almeida","author_ids":"2285310, 1829773, 8118988","abstract":"Currently, it has been observed an increasing popularization of e-commerce. Thus, in areas such as tourism, online retailers are dealing with different challenges such as performance, scalability and personalization. In this context, it is fundamental to understand the characteristics of the user requests, and the access patterns of users on these systems. In this work we analyze the workload of a tourism Web system, which has on average six thousand unique daily access. We present a characterization of users sessions, their requests, and their navigation profile. As results we identify the distinct user profiles and we understand the navigation and access patterns of these users and we define a methodology of profiles and workload characterization that can be used in any other type of system, not only in tourism applications.","cites":"0","conferencePercentile":"35.13513514"},{"venue":"WebMedia","id":"3252e1af0cf951302f97f3f478c09f3db749b118","venue_1":"WebMedia","year":"2008","title":"Detectando usuários maliciosos em interações via vídeos no YouTube","authors":"Fabrício Benevenuto, Tiago Rodrigues, Virgílio A. F. Almeida, Jussara M. Almeida, Marcos André Gonçalves","author_ids":"2810330, 5033919, 7360316, 8118988, 7170789","abstract":"Various services on the Web 2.0 offer functions that allow users to post videos as response to a discussion topic. As an example, YouTube allows users to post video responses to an opening video topic. Such a video response can be a polluted video, aiming at increasing the popularity of the discussed topic, disseminating advertisements, distributing pornography or simple degrading the system reputation. Content pollution may compromise user satisfaction with the system since users cannot easily identify polluted content before watching at least a segment of it, consuming system resources, especially bandwidth.\n This work approaches the problem of detecting the malicious users who post polluted content. To do it, we construct a test collection with users from YouTube. Using attributes of users and videos, we apply a classification algorithm as approach to detect owners of polluted content. Additionally, we build a simulator to verify the applicability of our approach in different scenarios.","cites":"1","conferencePercentile":"72.72727273"},{"venue":"WebMedia","id":"19db94523816f089cbb0efda132e9f9c28d298d1","venue_1":"WebMedia","year":"2012","title":"The other side of the social web: a taxonomy for social information access","authors":"Peter Brusilovsky","author_ids":"1804693","abstract":"The power of the modern Web, which is frequently called the Social Web or Web 2.0, is frequently traced to the power of users as contributors of various kinds of contents through Wikis, blogs, and resource sharing sites. However, the community power impacts not only the production of Web content, but also the access to all kinds of Web content. A number of research groups worldwide explore what we call social information access techniques that help users get to the right information using \"collective wisdom\" distilled from actions of those who worked with this information earlier. This invited talk offers a brief introduction into this important research stream and reviews recent works on social information access performed at the University of Pittsburgh's PAWS Lab lead by the author.","cites":"0","conferencePercentile":"28.78787879"},{"venue":"WebMedia","id":"2900ddc93e6b9640e6715eb5c69ec4808bc34ded","venue_1":"WebMedia","year":"2008","title":"Automatic frame extraction for improving content-based image retrieval of historical photographs","authors":"Ana Paula Brandão Lopes, David Lunardi Flam, Natalia C. Batista, Sandra Eliza Fontes de Avila, Jussara M. Almeida, Arnaldo de Albuquerque Araújo","author_ids":"2856017, 3180371, 2282103, 3191578, 8118988, 1840904","abstract":"In this paper, we propose and evaluate a method for automatic frame extraction from a collection of historical photographs. These frames are very noisy and were demonstrated to significantly affect the results of content-based image indexing and retrieval in the photograph images. The method is based on parallelogram detection that uses a Hough transform variation called Tiled Hough Transform in which the image is split into tiles to reduce computational complexity. This detector is then extended to combine detected parallelograms into a resulting frame. Two key contributions of this work are: (1) a new effective technique to solve the photographs frame problem, and (2) the use of a set of statistical and experimental design techniques either to fine-tune the proposed method and to demonstrate its effectiveness.","cites":"0","conferencePercentile":"30.3030303"},{"venue":"WebMedia","id":"0d9a4b756c32204eb0d3a907fb086d680fd2e25e","venue_1":"WebMedia","year":"2014","title":"You Are Your Check-In: Understanding the Behavior of Tourists and Residents Using Data from Foursquare","authors":"Ana Paula Gomes Ferreira, Thiago H. Silva, Antonio Alfredo Ferreira Loureiro","author_ids":"2900022, 2963539, 1757448","abstract":"Currently the use of location-based social networks are becoming quite popular. For example, Foursquare reported 50 million users in 2014. Data from this type of system can be viewed as a source of sensing, in which the sensors are users with their mobile devices sharing data on various aspects of the city. This source of data enables large-scale study of urban social behavior and city dynamics. In this paper we show how we can use the signals emitted by Foursquare users to better understand the differences between the behavior of tourists and residents. We analyze tourists and residents in four popular cities around the world: London, New York, Rio de Janeiro and Tokyo. One of the contributions of this work is the spatio-temporal study of properties of the behavior of these two classes of users (tourists and residents). We have identified, for example, that some locations have features that are more correlated with the tourists' behavior, and also that even in places frequented by tourists as well as residents there are clear differences in the patterns of behavior of these classes. Our results could be useful in several cases, for example, to help in the development of new recommendation systems specific for tourists.","cites":"0","conferencePercentile":"35.13513514"},{"venue":"WebMedia","id":"fb3c71e0347c558c43c9a32354fdf17473747135","venue_1":"WebMedia","year":"2006","title":"Network bandwidth requirements for optimized streaming media transmission to interactive users","authors":"Marcelo Maia, Marcus V. M. Rocha, Ítalo S. Cunha, Jussara M. Almeida, Sérgio Vale Aguiar Campos","author_ids":"3596974, 3257590, 2033985, 8118988, 1808802","abstract":"In order to minimize bandwidth requirements and improve on demand streaming media distribution scalability, several distribution protocols based on stream sharing by multiple users have been proposed. Despite the great scalability of these protocols proven for workloads where users access the entire media with no interruptions, several studies show that protocol scalability is severely degraded under interactive scenarios, where users access media segments. These scenarios are commonly observed in real streaming media server workloads. In reply to these results, a number of extensions to the original protocols, optimized for interactive access, have been proposed and evaluated, indicating significant server bandwidth savings even under highly interactive scenarios. However, one of the most promissing class of optimizations may send extra streams through the network during inactive client periods. Therefore, network bandwidth requirements for these optimizations become a critical issue that has not been evaluated yet. This work presents an evaluation of the network bandwidth requirements for the interactive access optimized protocols, considering realistic workloads of different interactivity levels and canonical and real network topologies. Results indicate that the optimizations also lead to a significant reduction in the average network bandwidth requirements (peak of 60%).Visando minimizar os requisitos de banda e aumentar a escalabilidade da distribui&#231;&#227;o sob demanda de m&#297;dia cont&#297;nua, v&#180;rios protocolos de distribui&#231;&#227;o baseados em compartilhamento de fluxos por m&#250;ltiplos usu&#180;rios foram propostos. Embora esteja comprovada a grande escalabilidade desses protocolos para cargas onde os usu&#180;rios acessam toda a m&#297;dia sem interrup&#231;&#245;es, v&#180;rios estudos mostraram que a mesma &#233; severamente degradada em cen&#180;rios interativos, onde os usu&#180;rios acessam segmentos da m&#297;dia. Cen&#180;rios comumente observados em cargas de acesso a servidores reais de m&#297;dia cont&#297;nua. Em resposta a esse resultado, v&#180;rias extens&#245;es dos protocolos originais, otimizadas para acesso interativo, foram propostas e avaliadas, indicando uma grande economia de banda de servidor mesmo em cen&#180;rios com alta interatividade. Entretanto, uma das classes de otimiza&#231;&#245;es mais promissoras pode enviar fluxos extras pela rede durante per&#297;odos inativos do cliente. Assim, os requisitos de banda de rede dessas otimiza&#231;&#245;es se torna um ponto cr&#297;tico que ainda n&#227;o foi avaliado. Este artigo avalia o consumo de banda de rede pelos protocolos otimizados para acessos interativos, considerando cargas de trabalho realistas com diferentes n&#297;veis de interatividade e topologias de redes can&#244;nicas e reais. Os resultados indicam que as otimiza&#231;&#245;es tamb&#233;m levam a uma significativa redu&#231;&#227;o no consumo m&#233;dio de banda de rede (pico de at&#233; 60%).","cites":"0","conferencePercentile":"29.6875"},{"venue":"WebMedia","id":"02bddd4c0adcd7d1401a07f95ebf5917b018351e","venue_1":"WebMedia","year":"2015","title":"Big Crisis Data","authors":"Carlos Castillo","author_ids":"3747087","abstract":"The talk will be an introduction for researchers and developers to algorithms and systems for dealing with social media messages during time-critical events, with a focus on natural and man-made disasters. Current methods bring together computational methods from many disciplines, including natural language processing, data mining, and information retrieval.","cites":"2","conferencePercentile":"96.66666667"},{"venue":"WebMedia","id":"07bca8affcf65adb98219bec10c0ebda05ec8660","venue_1":"WebMedia","year":"2008","title":"TVGrid: computaçao em grid utilizando recursos de uma rede de TV digital","authors":"Carlos Eduardo Coelho Freire Batista, Thiago Curvelo dos Anjos, Derzu Omaia, Tiago Maritan Ugulino de Araújo, Francisco Vilar Brasileiro, Guido Lemos de Souza Filho","author_ids":"2375221, 1966223, 2197105, 2913392, 1732501, 3025142","abstract":"Computing platforms with voluntary approach such as those deployed for the SETI@home project have proven that it is possible to harvest massive amounts of unused bandwidth and computing power available from computers connected to the Internet. In this work we present the TVGrid architecture to explore this idea in the context of a digital TV network. In the proposed architecture, a TV station runs a scheduler that uses the unused bandwidth in the digital TV broadcast channel to send processes of a parallel (tasks) application to digital TV receivers, which may run them using their unused capacity. The output of the processing performed by the receivers are later sent back to the TV station through a return channel (a connection to the Internet). The presented architecture comprises two approaches on task scheduling, which are specified and analyzed based on data collected on representative tests. The work thus aims to define a universe of applications for which TVGrid's architecture better fits.","cites":"0","conferencePercentile":"30.3030303"},{"venue":"WebMedia","id":"2d99fc41ff179f0e2b1edb23343c61bc640cd94e","venue_1":"WebMedia","year":"2013","title":"Accessibility of web and multimedia content: techniques and examples from the educational context","authors":"André Pimenta Freire, Raphael Winckler de Bettio, Elaine G. Frade, Fernanda B. Ferrari, José Monserrat Neto, Helena Libardi","author_ids":"1721856, 2980709, 3280277, 2122711, 3185659, 2811174","abstract":"Developing accessible Websites is essential to enable disabled people to have access to content and day-to-day services. As stated by Tim Berners-Lee, the inventor of the Web, \"access to the Web by everyone regardless of disability is an essential aspect\". This paper presents a summary of a short course on techniques to help design more accessible Web and multimedia content for people with different types of disabilities, presented at the 19th Brazilian Symposium on Multimedia and The Web. The course included examples from educational contexts, including issues with text, images, audio, video, structural elements and navigation, discussing how different accessibility issues may affect users with different types of disabilities.","cites":"1","conferencePercentile":"77.96610169"},{"venue":"WebMedia","id":"644fc1847f1e55b4f4be7cf781d96eab14edd4be","venue_1":"WebMedia","year":"2015","title":"Multimodal Sentiment Analysis for Automatic Estimation of Polarity Tension of TV News in TV Newscasts Videos","authors":"Moises H. R. Pereira, Flávio Luis Cardeal Pádua, Adriano M. Pereira, Giani David Silva, Fabrício Benevenuto","author_ids":"2927873, 1780969, 1829773, 2274345, 2810330","abstract":"This paper presents a multimodal approach to perform content-based sentiment analysis in TV newscasts videos in order to assist in the automatic estimation of polarity tension of TV news. The proposed approach aims to contribute to the semiodiscoursive study relative to the construction of ethos of those TV shows. In order to achieve this goal, it is proposed the application of computational methods of state-of-the-art that, through the processing of newscasts' videos of interest, perform the automatic emotion recognition in facial expressions. Moreover, they extract modulations in the participants' speech (e.g., news anchors, reporters, among others) and apply sentiment analysis techniques in their text obtained from closed caption, therefore making possible to estimate the emotional tension level in the enunciation of the TV news. In order to evaluate the accuracy and the applicability of the system, we use an actual dataset composed by 358 videos from three Brazilian newscasts. The experimental results are promising, which indicate the potential of the approach to support the analysis of TV newscasts discourse.","cites":"0","conferencePercentile":"38.88888889"},{"venue":"WebMedia","id":"23240505570f9bfe6aa2503738519f4896ce18c0","venue_1":"WebMedia","year":"2008","title":"Ubiquitous end-user live editing of interactive multimedia programs","authors":"Maria da Graça Campos Pimentel, Renan G. Cattelan, Erick Lazaro Melo, Antônio Francisco do Prado, César A. C. Teixeira","author_ids":"1806735, 2282201, 1780175, 3077306, 1732025","abstract":"Watching TV is a practice many people enjoy and feel comfortable with. In the context of interactive TV, a program is defined by means of a structured multimedia document delivered to the viewer's digital TV equipment. While watching TV, a user can be offered the opportunity to edit the program with explicit or implicit edit operations.\n In this paper we exploit the concept of end-user live editing of interactive video programs by proposing an environment where such a live editing can take place. We contextualize our proposed approach in the context of the Brazilian Interactive Digital TV platform.","cites":"0","conferencePercentile":"30.3030303"},{"venue":"WebMedia","id":"2a916d4ab8825a28382690a77b96b20c12da215d","venue_1":"WebMedia","year":"2015","title":"An Approach to Sentiment Analysis of Web Applications in Portuguese","authors":"Renato F. Martins, Adriano M. Pereira, Fabrício Benevenuto","author_ids":"2986325, 1829773, 2810330","abstract":"Sentiment analysis has been applied in many contexts, including user reviews analysis on products and services, trends and financial market moods. Established methods for sentiment analysis present a behavior that varies according to the application and its lexical base, generating different results among them. In this paper, a new sentiment analysis technique called SentiPipe will be presented, which takes the best of a set of methods, generating a less sensitive analysis based context. For such, it was used a real Web database of financial market news in Portuguese to which was applied the new sentiment detection proposal. The results were promising, showing improvement in all metrics analyzed in relation to the methods individually applied.","cites":"3","conferencePercentile":"100"},{"venue":"WebMedia","id":"396f962cb5b96d867d4c5e582bb68ac631a87dce","venue_1":"WebMedia","year":"2013","title":"Extracting context from the web to help visually impaired pedestrians develop cognitive maps of their environments","authors":"Khai N. Truong","author_ids":"1752847","abstract":"A rich cognitive map of an environment can enhance an individual's experience within the space. However, acquiring knowledge about an environment can be challenging for people with visual impairments. They often need support by sighted people to understand what is in the environment, associate meaning to these objects and places, identify where different objects and places are positioned, and their spatial relationship with each other. In this talk, I will present how the power of the Web can be leveraged in ubiquitous computing tools to help a user learn an environment. I will discuss what information is required by visually impaired pedestrians, when and where to provide this information, and also how to collect and present it. Finally, I will describe how this work can be extended to benefit the general population.","cites":"0","conferencePercentile":"34.74576271"},{"venue":"WebMedia","id":"908939ce2fb5c429763446ecf70f583f7973e624","venue_1":"WebMedia","year":"2016","title":"Emotional Fingerprint from Authors in Classical Literature","authors":"Matheus Lima Diniz Araújo, Iuro Nascimento, Gustavo Caetano Rafael, Raquel Cardoso de Melo Minardi, Fabrício Benevenuto","author_ids":"3403188, 7880926, 8114836, 2599547, 2810330","abstract":"The Internet deeply changed the way people share their knowledge. Almost all content that people produces is now available in digital formats, like e-books, apps, newspapers, and magazines. That content has commonly some metadata available that can be used to generate complex recommendation systems that track content similarity. Since there is some effort in the literature to explore this direction, almost all use classical recommendation approaches, like collaborative filter data and information present on websites that sells books. While most efforts in the literature use features derived from the text syntax to create a recommendation model, our approach aims to trace an emotional fingerprint of authors extracted from their texts. This approach, known as psychometry, consists of the study of behavioral characteristics like positivity, negativity, sadness, fear, religiosity, sexuality, which are able to disguise individuals. Using two sentiment analysis lexicons and a collection of 641 books from the English literature written by 56 authors, we show the effectiveness of these psychometric features in order to trace those authors emotional fingerprint.","cites":"0","conferencePercentile":"50.73529412"},{"venue":"WebMedia","id":"712956aac0920a7817fbd02c9591ce2b285f0099","venue_1":"WebMedia","year":"2015","title":"Analyzing The Influence Of Pope's Tweets On His Followers' Mood","authors":"Pedro Rego Ballona, Patrick Prado, Jussara M. Almeida, Humberto Torres Marques-Neto","author_ids":"2218996, 3258947, 8118988, 2338849","abstract":"The ever-increasing usage of Social Medias, like Twitter, have enabled companies and public personalities to communicate and to influence their public. However, how to analyze and measure something as subjective as interpersonal influences? This paper presents a methodology for measuring and to analyze how Twitter's posts (tweets) can influence their readers. In our work, the interpersonal influence of user is given by the capacity of tweets on influencing or affecting positively or negatively his/her mood or state of mind. Hence, the influence of one user A on another user B is the fluctuation of B's mood when he/she reads and retweets a message posted by A. We measured the user's mood using the Subjective Well-Being (SWB) that evaluates the mood of a person based on the positive and negative sentiment pointed on their collection of authored documents, e.g. on his/her thread of tweets. We applied the proposed methodology to analyze the influence of an important Twitter account, Your Holiness the Pope Francis, on the mood of his followers. The results show the existence of the Pope's influence on his followers' mood in a short-term period: from 1 to 2 hours after he/she retweets a Pope's message.","cites":"1","conferencePercentile":"85.55555556"},{"venue":"WebMedia","id":"241cbcecd74f4dd8ad2539ac23d3b95ae1fa8e98","venue_1":"WebMedia","year":"2012","title":"A domain engineering for content sharing collaborative features","authors":"Lucas Santos de Oliveira, Marco Aurélio Gerosa","author_ids":"2323047, 2231121","abstract":"Researchers and developers still replicate ideas with low reuse when developing Web 2.0 applications. A domain engineering identify and document commonalities and variabilities of an application family fostering reuse. In this work, we used a domain engineering approach for content sharing features of social networks. We used as a method the FODA (Feature Oriented Domain Analysis) with patterns for computer-mediated interaction to describe the collaborative features and the 3C collaboration model to classify them. To implement the commonalities, a component kit was defined and developed, based on an infrastructure named Groupware Workbench. We conducted an experiment to evaluate the artifacts generated by the domain engineering.","cites":"0","conferencePercentile":"28.78787879"},{"venue":"WebMedia","id":"742de3fe6cab8abd7a2028ebe437b6071874998a","venue_1":"WebMedia","year":"2012","title":"Analysis of vulnerability to facebook users","authors":"Michelle Hanne, Cristiano M. Silva, Jussara M. Almeida, Marcos André Gonçalves","author_ids":"2704600, 2830004, 8118988, 7170789","abstract":"Facebook, the largest social network nowadays currently has 901 million active users, with 526 million of them accessing the system daily. With a very rapid growth, Facebook has become a potential site for the collection of personal information by unauthorized individuals, leaving its users vulnerable to actions of violation of privacy, spamming and phishing. This article discusses the vulnerability of Facebook users based on their exposure in the network. To this end, we propose a numerical indicator capable of estimating the degree of vulnerability of each user. This indicator is a function of both the amount of personal content published by the user and the size of her network. We demonstrate the use of the proposed indicator in real data collected from 75,000 Facebook users.","cites":"0","conferencePercentile":"28.78787879"},{"venue":"WebMedia","id":"22ec9bb148de0e4295c0d7da51432036f47fbf84","venue_1":"WebMedia","year":"2008","title":"Um ambiente baseado na web 2.0 para educaçao médica construtivista","authors":"Luiz H. Z. Santana, Wanderley Lopes de Souza, Antônio Francisco do Prado","author_ids":"2571332, 7405992, 3077306","abstract":"This paper presents the Electronic Reflexive Portfolio (ERP), a collaborative content creation environment, which supports the teaching/learning process in constructivism-based medical courses. The ERP was developed under the concepts of Web 2.0, having a social network, AJAX tools for the content creation, and a folksonomy-based mechanism for content indexing and recovering. An evaluation of the use of PRE in the support of the medical course of Universidade Federal de Sao Carlos (UFSCar) is presented.","cites":"1","conferencePercentile":"72.72727273"}]}