{"WebNet.csv":[{"venue":"WebNet","id":"c8d2e1bfd3a6d7816d77518978f6dfc757df39e7","venue_1":"WebNet","year":"2000","title":"Signed Preservation Of Online References","authors":"Andreas Heuer, Frank Losemann, Christoph Meinel","author_ids":"2370248, 1918860, 1708312","abstract":"Since online-available documents are more and more outclassing paper based documents, the use of online references is constantly growing. Online references suffer strongly from their often only temporarily character. With the slightest modification-not to mention a complete removal of its online references-the scientific value of the referencing document would decline. Therefore, mechanisms are needed that strive to preserve the value of the documents in digital libraries. In this paper, we will discuss the concept and prototype implementation of a service that can help to minimize this problem. The service produces files which contain signed data referring to the online documents. These files will be used as fall back online references. Offering this data-file analogously to the link that points to the orig i-nal online reference gives every user the opportunity to recover the respective online doc u-ment even if the original reference was modified or is not available anymore.","cites":"0","conferencePercentile":"21.15384615"},{"venue":"WebNet","id":"6816d8c9fe727e7d75537b901dfe7ce63821a66a","venue_1":"WebNet","year":"1999","title":"Making Peer Review in Large Undergraduate Courses an Option","authors":"Per Asberg, Urban Nuldén","author_ids":"2765952, 1710576","abstract":"In this paper we describe research in progress on web-based peer review of reports and essays. The research is a part of a larger research project on computer supported examination. We have developed an application for administrating peer review of essays and reports in large university courses. The application was evaluated in an undergraduate course with eighty students. This paper discusses our experiences and findings, and we outline further research.","cites":"1","conferencePercentile":"61.81818182"},{"venue":"WebNet","id":"94e88bb5e07006fd213361e5c7c3d169823b570f","venue_1":"WebNet","year":"1998","title":"Moving Usability Testing Onto the Web","authors":"Martin Svensson, Arnold Johansson, Anna-Lena Ereback, Kristina Höök, Jussi Karlgren, Ivan Bretan","author_ids":"2587325, 2108827, 3282784, 1724769, 1742359, 1692618","abstract":"In order to remotely obtain detailed usability data by tracking user behaviors within a given web site, a server-based usability testing environment has been created. Web pages are annotated in such a way that arbitrary user actions (such as \" mouse over link \" or \" click back button \") can be selected for logging. In addition, the system allows the experiment designer to interleave interactive questions into the usability evaluation, which for instance could be triggered by a particular sequence of actions. The system works in conjunction with clustering and visualiza-tion algorithms that can be applied to the resulting log file data. A first version of the system has been used successfully to carry out a web usability evaluation.","cites":"0","conferencePercentile":"26.13636364"},{"venue":"WebNet","id":"79c02ef2b9107533c4e12438d7637a2a2e99bc11","venue_1":"WebNet","year":"2000","title":"Merged Structural Equation Model of Online Retailer's Customer Preference and Stickiness","authors":"Sri Hastuti Kurniawan","author_ids":"1777424","abstract":"Rapid explosion of the number of online retailers as well as online customers has been observed in these past few years. Comparable growth in sellers and buyers means that Internet retailers have to understand how to make customers prefer them to the competitors and make the customers loyal to their stores. Previous structural equation modeling study of customer preference and stickiness in online retail business revealed that some of the aspects that contributed to customer stickiness and customer preference were community involvement, convenience, site's appeal, entertainment aspect of online shopping and customer satisfaction and that these five factors contributed to customer preference and customer stickiness in similar fashion. The objective of this study was to investigate whether the two models could be merged. The analysis revealed that a merged model with customer stickiness as the indigenous construct could parsimoniously reproduce the pattern of covariation in the measurement model.","cites":"1","conferencePercentile":"50"},{"venue":"WebNet","id":"04ae22f0ec3e3d5b985bb2adf6482f15f94982ba","venue_1":"WebNet","year":"2001","title":"Managing Distributed Personal Firewalls with Smart Data Servers","authors":"Ernst Georg Haffner, Uwe Roth, Andreas Heuer, Thomas Engel, Christoph Meinel","author_ids":"1831056, 2026047, 2370248, 1745623, 1708312","abstract":"Modern security architectures tend to become more and more complex. Not only the chances to improve Web applications using several data channels and diverse (TCP-)ports are very promising, but also the risks for criminal attacks and an intrusion into the corporate network are increasing. The classical solution to protect networks against criminal attacks with firewalls is problematic, though. On the one hand, attacks from the inside are hardly prevented by firewalls, on the other, mobile computing poses additional security risks to the corporate networks. Personal firewalls solve some of those problems, but their central administration is very difficult. In this paper, we will discuss a possible strategy to manage distributed personal firewalls with a central tool, the Smart Data Server.","cites":"1","conferencePercentile":"45.12195122"},{"venue":"WebNet","id":"9409c1ffc7c63d159e06495f204549904098484d","venue_1":"WebNet","year":"2000","title":"Concept-Based Courseware Engineering for Large Scale Web-based Education","authors":"Peter Brusilovsky","author_ids":"1804693","abstract":"This paper describes a concept-based course maintenance system that we have developed for Carnegie Technology Education. The system can check the consistency and quality of a course at any moment of its life and also assist course developers in some routine operations. The core of this system is a refined approach to indexing the course material and a set of \" scripts \" for performing different operations.","cites":"5","conferencePercentile":"82.69230769"},{"venue":"WebNet","id":"9035a1d17e244ea225780202e224d875b04bd5d2","venue_1":"WebNet","year":"2000","title":"Modeling Computer Users' Interest in the World Wide Web across the Adult Life Span: The Role of Age, Education, Ability, and Discontentment","authors":"Sri Hastuti Kurniawan","author_ids":"1777424","abstract":"The current study examined the factors related to the interest in Web related activities across the adult life span. Using the mediation model put forth by Ellis and Allaire (in press), the extent to which age, education, Web ability, and Web discontentment are related to computer users' interest in the World Wide Web was examined. It was hypothesized that Web ability and discontentment would fully mediate the effects of age and education on Web interest. Six hundred surveys, sampled from the Project 2000 data (Novak & Hoffman, 1997), were used to examine this model. Using structural equation modeling techniques, the mediation model was largely supported. The Web discontentment was found to fully mediate the effect of Web ability, age and education on Web interest. INTRODUCTION The adoption of computer technology in general and the World Wide Web (Web) in particular have recently expanded. Once the domain of younger adults, the Web now hosts something of interest to computer users at all stages of the life span. Although a general increase in the use of computer and the Web has been documented, there is scare and sometimes conflicting evidence on what caused computer users to show interest in adopting computer technology and the Web as a part of their daily life. Previous literatures have mentioned age, education, computer anxiety, and computer skill to be some of the important factors contributing to the interest of using computers and Ellis and Allaire (in press) developed a mediation model, which described the effect of age and education on computer ability, computer anxiety, and computer interest. Their research focused exclusively on prospective older users. In their study, Ellis and Allaire (in press) found that Computer Anxiety fully mediated the effects of education and Computer Knowledge on Computer Interest. However, not all of the age-related variance in Computer Interest was explained by Computer Anxiety or Computer Knowledge. Significant age differences in computer interest, a positive cross-sectional age gradient for computer anxiety and that higher computer knowledge was related to less computer anxiety. The present research extends the applicability of the mediation model in three ways: First, the model was fit to data from current computer users across the adult life span. Second, instead of investigating the general use of computers, the focus of the present study is on the use of the Web in","cites":"1","conferencePercentile":"50"},{"venue":"WebNet","id":"05862c4a652845defceeb985a96d62b6724bea75","venue_1":"WebNet","year":"2001","title":"Panel on Special Topics of Web Usability","authors":"Panayiotis Zaphiris, Jantawan Noiwan, Sri Hastuti Kurniawan, Athanasis Karoulis","author_ids":"1795005, 1866795, 1777424, 2660407","abstract":"Special web usability issues, like senior-centered design and cultural considerations when providing information on the web, are getting more and more attention from the design and academic community. Furthermore, new applications (especially e-learning) are gaining more and more popularity and create new opportunities but also new challenges for the design community. The objectives of this panel are: (1) To briefly introduce the general topic of web usability, (2) To present a selection of special issues related to the general topic of web usability (3) To become a forum for open discussion on these topics among the WebNet community. Usability of a product or system – whether a web site, software application, mobile technology or any user-operated device can be defined as \"a measure of the ease with which a system can be learned or used, its safety, effectiveness and efficiency, and attitude of its users towards it.\" (Preece et al., 1994) In other words Usability is a combination of factors that affect the user's experience with the product or system, including (http://www.usability.gov) : 1. Ease of learning: How fast can a user who has never seen the user interface before learn it sufficiently well to accomplish basic tasks? Once an experienced user has learned to use the system, how fast can he or she accomplish tasks? 2. Memorability: If a user has used the system before, can he or she remember enough to use it effectively the next time or does the user have to start over again learning everything? 3. Error frequency and severity: How often do users make errors while using the system, how serious are these errors and how do users recover from these errors? 4. Subjective satisfaction: How much does the user like using the system? Through out the years a series of methodologies have been developed for achieving a user-centered design that can achieve the design of usable, effective and efficient to use products. Also a series of methods and tools have been developed to qualitatively and quantitatively measure the usability of these products and services.","cites":"0","conferencePercentile":"20.73170732"},{"venue":"WebNet","id":"b1bb1085b04499cf6476c76cc1ef61931296758e","venue_1":"WebNet","year":"2000","title":"Adaptive User Interface of a Web Search Engine by Organizing Page Information Agents","authors":"Seiji Yamada, Fumihiko Murase","author_ids":"1679243, 2418453","abstract":"In this paper, we develop an organization method of page information agents for adap-tive interface between a user and a Web search engine. Though a Web search engine indicates a hit list of Web pages to user's query, it includes many useless ones. Thus a user has to select useful pages with page information indicated on the hit list, and actually fetch the page for investigating the relevance. Unfortunately the page information is insufficient for a user, and which information is adequate depends on a user and a task. Hence we propose adaptive interface AOAI in which different page information agents are organized with user's evaluation. As results, different organizations are achieved depending on a user and a task.","cites":"1","conferencePercentile":"50"},{"venue":"WebNet","id":"6a8f06fcb197da14f90231798d94a5fadb4e8ba8","venue_1":"WebNet","year":"2000","title":"Link Proposals with Case-Based Reasoning Techniques","authors":"Ernst Georg Haffner, Andreas Heuer, Uwe Roth, Thomas Engel, Christoph Meinel","author_ids":"1831056, 2370248, 2026047, 1745623, 1708312","abstract":"In this paper, we will discuss the problem of proposing links for hypertexts based on Case-Based Reasoning (CBR) techniques. These proposals can be used in addition to traditional textual based methods. At first, we will focus on the basic ideas of CBR. Next, its modeling for Hyperlink-Management Systems will be discussed, and finally the usefulness of CBR in the area of link proposals will be evaluated. The measuring of the quality of link proposals in terms of \"recall\" and \"precision\" has to be refined in order to describe the performance of the system adequately.","cites":"1","conferencePercentile":"50"},{"venue":"WebNet","id":"43a8fe2d716cf7ecad74461db61c440a751078aa","venue_1":"WebNet","year":"2000","title":"Evolution of the Walden's Paths Authoring Tools","authors":"Unmil Karadkar, Luis Francisco-Revilla, Richard Furuta, Hao-wei Hsieh, Frank M. Shipman","author_ids":"1823068, 3237975, 1763643, 1822063, 1749811","abstract":"Changing user skills, available infrastructure, and work practices have caused many differences in the authoring support provided by the Walden's Paths project since its conception. In this paper we trace these changes and the transition from the earlier authoring tools that supported an integrated authoring process, to the more recent tools designed to work with the Web applications that teachers have become accustomed to.","cites":"9","conferencePercentile":"88.46153846"},{"venue":"WebNet","id":"5493803b9a847d62f27f5c1ba66bece673ca9baa","venue_1":"WebNet","year":"1996","title":"Browsing 3D bookmarks in BED","authors":"Serge Rezzonico, Daniel Thalmann","author_ids":"1937550, 1689760","abstract":"In this paper BED, a prototype of a 3D bookmarks generator, is presented. This work tries to show a way of improving navigation in the Web using a cyberspatial[*] representation based on VRML. First, the general problem of creating a visual representation of abstract data is discussed and existing systems are reviewed. Then, some 3D space characteristics are explained and finally our generator is introduced and some examples shown.","cites":"5","conferencePercentile":"54.16666667"},{"venue":"WebNet","id":"a1479413417201b22bfa179275afc89d0611e100","venue_1":"WebNet","year":"2000","title":"Adjusting to Specialties of Search Engines Using MetaWeaver","authors":"Mikihiko Mori, Seiji Yamada","author_ids":"2852348, 1679243","abstract":"In this paper, we propose MetaWeaver which can selectively utilize effective ones from registered search engines depending on queries. Traditional meta-search engines use all the registered search engines without considering which search engines are appropriate, and often return many irrelevant Web pages in the hit list. In contrast with that, MetaWeaver is able to evaluate the specialties of each search engine by analyzing the hit list for sample queries, and to utilize them for selecting adequate search engines for current queries. Also we found out our approach is promising by making preliminary experiments.","cites":"3","conferencePercentile":"76.92307692"},{"venue":"WebNet","id":"7bb81a285cadf79b0e54114e24d7fec027190c2b","venue_1":"WebNet","year":"2000","title":"A Search-Engine-Topologie to Improve Document Retrieval on the Web","authors":"Uwe Roth, Andreas Heuer, Ernst Georg Haffner, Christoph Meinel","author_ids":"2026047, 2370248, 1831056, 1708312","abstract":"Nowadays, search-engines are the only reasonable solution for searching and finding data on the Internet. Search-engines are confronted, though, with four major problems: The Internet is growing rapidly. Search-engines cannot keep up with indexing new servers. It is becoming harder and harder to keep indexed web-pages up to date. It is difficult (or even impossible) for search-engines to index dynamically generated web-documents. Internet documents which are not based on plain text cannot be indexed. All of these problems are related to the fact that search-engines are only able to \"act\" towards web-servers like normal users. They can only obtain information via HTTP. This paper aims at presenting an alternative approach. We will describe a topology of search-engines. The basic module is a local search-engine on the corresponding web-server and a protocol for creating the topology. Existing search-engines may use the topology in order to obtain better and faster results from web-sites.","cites":"1","conferencePercentile":"50"},{"venue":"WebNet","id":"b46bfb668965472a9bd94413d89fa63041660d31","venue_1":"WebNet","year":"2000","title":"Sharing Bookmarks Among Same Interest Persons","authors":"Mikihiko Mori, Seiji Yamada","author_ids":"2852348, 1679243","abstract":"We propose Bookmark-agent system that enables users to share information in each user's bookmarks with others. This system is more effective in finding specific information that is a common interest of all the members in a group than existing search engines, such as Yahoo and AltaVista. When a user wants to find certain URLs, the Bookmark-agent will find them on behalf of the user. In addition to that, the Bookmark agent requests other Bookmark agents to search their own bookmarks. As a result, the user can obtain information that best matches his/her needs from the Bookmark-agent. Since users filter the selected information beforehand, it is possible for the Bookmark-agent to satisfy a users' requests more precisely than existing search engines. After conducting experiments on six users, we have found that the Bookmark-agent system is a promising approach to share URLs in a small community.","cites":"0","conferencePercentile":"21.15384615"},{"venue":"WebNet","id":"0d5d38ff2d4fb7ca18b9207ca2110a3842b18d4a","venue_1":"WebNet","year":"2001","title":"User-Centered Evaluation of an On-Line Modern Greek Language Course","authors":"Panayiotis Zaphiris, Giorgos Zacharia","author_ids":"1795005, 2213789","abstract":"In this paper, a set of user-centered evaluation methods, used to construct a richer conception of the audience of an online Modern Greek online course, are presented. First an analysis of the design methodology employed in this specific case study is provided and then examples of how valuable usability information can be extracted from different user-center evaluation methods is presented. Conclusions, related to the analysis of the information obtained through the different evaluation methods and about the usability of the course, are also provided.","cites":"1","conferencePercentile":"45.12195122"},{"venue":"WebNet","id":"4636f44acca9333890c7d0ce6c214055cc0844b0","venue_1":"WebNet","year":"2000","title":"TopBlend: An Efficient Implementation of HtmlDiff in Java","authors":"Yih-Farn Robin Chen, Fred Douglis, Huale Huang, Kiem-Phong Vo","author_ids":"2231574, 1782350, 3347585, 2152908","abstract":"The World Wide Web is growing rapidly with new and changing web content. Detecting changes in web pages is crucial for website masters who care about website integrity. It is also convenient for web surfers who are constantly looking for new products, services, or information. This paper describes TopBlend, a new HTML differencing tool implemented in Java. TopBlend uses the fast Jacobson-Vo algorithm, which solves the Heaviest Common Subsequence problem, for page comparison. Performance results indicate that TopBlend significantly outperforms a previous HTML differencing tool in most time-consuming jobs, often by 1-2 orders of magnitude. TopBlend allows comparisons to be performed either on the server or client side, and can present the results in either a merged HTML view or a more convenient side-by-side view for web pages with complex graphics designs.","cites":"11","conferencePercentile":"90.38461538"},{"venue":"WebNet","id":"b6fdbe73918e12534fab75c793ee49a9abda3fa0","venue_1":"WebNet","year":"1999","title":"HALPIN: A Natural Language Information Retrieval System for a Digital Library on the World Wide Web","authors":"José Rouillard","author_ids":"1717701","abstract":"Designing computers with the ability to talk and understand a natural language (NL) conversation is a major field of research. We have developed the HALPIN 1 system to implement our multimodal conversational model for information retrieval in a digital library via the World Wide Web. This dialogue-oriented interface allows access to INRIA's 2 database, on the Internet, in a natural language mode. The inputs from the user, could be either oral sentences or mouse/keyboard actions. The results of the first experiments show that the HALPIN system provides interesting dialogues, in particular with beginners. It gives oral responses via standard browsers, for a more natural human-machine interaction according to the user's goals and skills. This leads to successful information retrieval, while searches with the original user interface (traditional web form) failed.","cites":"1","conferencePercentile":"61.81818182"},{"venue":"WebNet","id":"1a93922baa811bacebe6f146419bea02f232175b","venue_1":"WebNet","year":"1997","title":"WebCiao: A Website Visualization and Tracking System","authors":"Yih-Farn Robin Chen, Eleftherios Koutsofios","author_ids":"2231574, 2621476","abstract":"WebCiao is a system for visualizing and tracking the structures of websites by creating, differencing, and analyzing archived website databases. The architecture of WebCiao allows users to create customized website analysis tools by combining a set of query and analysis operators on a virtual database pipeline. Each virtual database sent on the pipe can be converted to directed graphs, database views, or HTML reports. Within a graph view, operators can be fired from any graph node to study a selected neighborhood. WebCiao helps creators of large websites to monitor the dynamics of structural changes closely. It also helps web surfers to quickly identify new products and services from a website. An on-line demo, Website News, based on the WebCiao technology, has helped sharpen our focus with its daily analysis of new web contents from the internet and telecommunications industries.","cites":"18","conferencePercentile":"100"},{"venue":"WebNet","id":"2b074fb32ed99cd87261216c0b66693661882e10","venue_1":"WebNet","year":"1999","title":"An Approach to Distributed Functionality - The Smart Data Server","authors":"Uwe Roth, Ernst Georg Haffner, Thomas Engel, Christoph Meinel","author_ids":"2026047, 1831056, 1745623, 1708312","abstract":"This paper introduces a new kind of Java-server, the Smart Data Server (SDS). It offers the accessing of data with function-calls to SDS-networks. This allows the building of lean clients with the shifting of functionality to the SDS-network. The server builds the middle-tier in a multi-tier architecture (Client-SDS-Network-Database). It offers a frame for easy-to-build environment-independent SDS-modules with multiple functionality. It is modular and easily scalable for different kinds of requirement.","cites":"6","conferencePercentile":"88.18181818"},{"venue":"WebNet","id":"9aa6e8631aad6e45a220ed791b7866ddccc6fe75","venue_1":"WebNet","year":"1998","title":"Searchers, The Subjects They Search, And Sufficiency: A Study Of A Large Sample Of Excite Searches","authors":"Bernard J. Jansen, Amanda Spink, Judy Bateman, Tefko Saracevic","author_ids":"1692872, 1750645, 2945965, 2760429","abstract":"In apparently the largest study of actual Web searches, we analyzed transaction logs of a set of 51,453 queries posed by 18,113 users of Excite, a major Internet search service. This study focuses on three areas. First, we examined the query construction, providing data on the number of terms in queries, the use of Boolean logic, use of term modifiers, and the modifications to queries by users. Second, we examine the search terms, including the most commonly used search terms and the rank/frequency distribution of search terms. Finally, in order to get an indication of the level of user satisfaction with the search engine performance and searching technique, we supplement the quantitative analysis with the results of a survey of Excite users. This indication of performance is one of the components of sufficiency, a metric that measures how well a search engine satisfies a user's information desire. Implications of the findings for Web interface design are discussed.","cites":"33","conferencePercentile":"100"},{"venue":"WebNet","id":"580980d7e82efb6bb004e25f336ef5731c0ffe29","venue_1":"WebNet","year":"2001","title":"Website Usability and Content Accessibility of the top USA Universities","authors":"Panayiotis Zaphiris, R. Darin Ellis","author_ids":"1795005, 2008101","abstract":"This study investigates whether the websites of the top USA universities are ranked high in terms of accessibility and usability and if these two measures are correlated. The usability and accessibility of the top fifty USA universities (USNews, 2001) were measured using two automatic evaluation tools: Bobby and LIFT. The results show a low compliance (30%) with Web site Content Accessibility Guide and a low usability rating for most of the university websi tes. The accessibility approval was found to correlate significantly with overall usability ratings of the websites. The size (in Kb) of the website was found to be a driving variable both for usability and accessibility.","cites":"10","conferencePercentile":"93.90243902"},{"venue":"WebNet","id":"efd6bc4284899ddf927801517defd4e894ce33f6","venue_1":"WebNet","year":"1999","title":"The Use of Relevance Feedback on the Web: Implications for Web IR System Design","authors":"Bernard J. Jansen, Amanda Spink, Tefko Saracevic","author_ids":"1692872, 1750645, 2760429","abstract":"We conducted a transaction log analysis of 51,473 queries from 18,113 users of Excite, a major Web search engine. Approximately 2,500 (approximately 5%) of these queries were from the use of relevance feedback. Given the high level of research activity and historical success of relevance feedback in assisting users in locating relevant information, this is a surprising small percentage of usage. In order to investigate this phenomenon on the Web, we analyzed users sessions that contained relevance feedback queries. We identified states and patterns in these sessions. We also attempt to classify the sessions as successfully or not. This analysis provides insight on the current use of relevance feedback on the Web, its success or failure, and why it is so seldom utilized. We relate our conclusions to system design of information retrieval systems on the Web.","cites":"12","conferencePercentile":"96.36363636"},{"venue":"WebNet","id":"b701ecb4ad39ad6c65d907b5d80021050285103b","venue_1":"WebNet","year":"1996","title":"The MARBLE Project: A collaborative framework for educational courseware design","authors":"Sarah Price, Patrick McAndrew, Roger Rist, J. Terry Mayes, Eric Bonharme, Ray Land, Mary Cuttle, Jeff Haywood, Hamish Macleod","author_ids":"4142209, 2309304, 3300180, 8676594, 3130010, 2062774, 2895835, 1784967, 2941670","abstract":"The MARBLE Project is a collaborative venture that provides on-line resource-based learning materials to students at three higher education institutions in Scotland. As per capita funding from central government decreases without a decline in graduate quality, new methods are sought in universities to cope with this challenge. This paper discusses the collaborative beginnings and implementation of MARBLE and then focuses on one of the 10 components of the range of on-line courseware, the Computers in Teaching and Learning subproject. The extent to which MARBLE's collaborative nature causes efficiency gains while enabling the student to advance in the learning process is assessed. Topics covered include: background, including the use of the Metropolitan Area Networks (MANs) in Scotland for effective courseware design and dissemination across the World Wide Web; the collaborative framework; convincing the teachers; the core problems associated with effective distributed courseware design; maintaining standards on a decreased budget; innovative use of resources; and feedback and analysis, including results of a questionnaire aimed at student and tutor participants. An extract from a HyperNews session is included. Reproductions supplied by EDRS are the best that can be made from the original document. EDUCATIONAL RESOURCES INFORMATION CENTER (ERIC) ID This document has been reproduced as received from the person or organization originating it. O Minor changes have been made to improve reproduction quality. Points of view or opinions stated in this document do not necessarily represent official OERI position or policy. Abstract: The MARBLE Project is a collaborative venture which provides on-line resource-based learning materials to students at three Higher Education Institutions in Scotland. As per capita funding from central government decreases without a decline in graduate quality, new methods are sought in Universities to cope with this challenge. This paper discusses the collaborative beginnings and implementation of MARBLE, and then focuses specifically on one of the ten components of the range of on-line courseware. Since one influential report into Higher Education in the early 90s claimed that \"Duplication of effort is wasted effort\", we assess to what extent MARBLE's collaborative nature causes efficiency gains and yet, crucially, still enables the student to advance in the learning process. This paper describes the MARBLE Project, which is an innovative, collaborative attempt to use the power of the Metropolitan Area Networks (MANs) in Scotland for effective courseware design and dissemination across the World Wide Web. The MANs have provided the technical motivation for MARBLE: each …","cites":"0","conferencePercentile":"8.333333333"},{"venue":"WebNet","id":"8776abe3506379cec38328d1f8c62648c8a1def7","venue_1":"WebNet","year":"2000","title":"Mining the Most Interesting Web Access Associations","authors":"Li Shen, Ling Cheng, James Ford, Fillia Makedon, Vasileios Megalooikonomou, Tilmann Steinberg","author_ids":"1712125, 1904492, 2228347, 1728274, 8263860, 3073842","abstract":"Web access patterns can provide valuable information for website designers in making website-based communication more efficient. To extract interesting or useful web access patterns, we use data mining techniques which analyze historical web access logs. In this paper, we present an efficient approach to mine the most interesting web access associations, where the word \"interesting\" denotes patterns that are supported by a high fraction of access activities with strong confidence. Our approach consists of three steps: 1) transform raw web logs to a relational table; 2) convert the relational table to a collection of access transactions; 3) mine the transaction collection to extract associations and rules. In both step 1 and step 2, we provide users with an effective mechanism to help them generate only \"interesting\" access records and transactions for mining. In the third step, we present a new efficient data mining algorithm to find the most interesting web access associations. We evaluate this approach using both synthetic data sets and real web logs and show the efficacy, efficiency and good scalability of the proposed mining methods.","cites":"8","conferencePercentile":"86.53846154"},{"venue":"WebNet","id":"082b67f563c492d61aaece4d4cbaa00f39cebd2c","venue_1":"WebNet","year":"1998","title":"Web-Specific Genre Visualization","authors":"Ivan Bretan, Johan Dewe, Anders Hallberg, Niklas Wolkert, Jussi Karlgren","author_ids":"1692618, 2987245, 1756194, 2924347, 1742359","abstract":"User interfaces to WWW search engines typically present results as ranked lists of documents. Such lists give users little help in understanding document variation: we propose a richer representation of retrieval results in the search interface. Fundamental to us is the notion of document grouping. We use both stylistic genre-based document categorization and statistical content-based clustering, and organize documents along these criteria in a highly interactive visualization front-end to WWW search engines, enabling quick overview and incremental query refinement.","cites":"21","conferencePercentile":"95.45454545"},{"venue":"WebNet","id":"cc81c94fd05b9da7b7d9578b7d7c41f30ea75227","venue_1":"WebNet","year":"1997","title":"Agora: Shaping Social Space from Information Space","authors":"Byron Long, Ronald Baecker","author_ids":"1739115, 1715312","abstract":"Agora is a Java based client-server tool that provides for both synchronous and asynchronous communication within the context of a web page. Real-time text based 'chat' is augmented by shared news, personal mail, recent visitor history and user profiles.","cites":"1","conferencePercentile":"37.5"},{"venue":"WebNet","id":"1ed6561b399cadc54e5837025474f4871e482c57","venue_1":"WebNet","year":"2001","title":"Personal Information Organization using Web Annotations","authors":"Laurent Denoue, Laurence Vignollet","author_ids":"1788661, 1685045","abstract":"As more information is made available online, users collect information in personal information spaces like bookmarks and emails. While most users feel that organizing these collections is crucial to improve access, studies have shown that this activity is time consuming and highly cognitive. Automatic classification has been used but by relying on the full text of the documents, they do not generate personalized classifications. Our approach is to give users the ability to annotate their documents as they first access them. This annotation tool is unobtrusive and welcome by most users who generally miss this facility when dealing with digital documents. Our experiments show that these annotations can be used to generate personalized classifications of annotated Web pages. Introduction Organizing Web pages collected in our bookmarks is a long and highly cognitive task. Most users would be happy to delegate this activity to an automatic classifier [ABR 98] [COC 99]. User studies also show that the number of bookmarks grow linearly with time and that most users do not organize their bookmarks at creation time. Because they do not classify at creation time, they have to organize a large number of bookmarks and typically do not remember what was interesting in a particular page. Remembering what was interesting can also be impossible when the Web page has been modified or is not longer available, which is typical on the Web. One solution used in Vistabar is to index every Web page loaded in the browser [MAR 97] and [LI 98]. The other approach is to store a signature of each page which can help to retrieve the page from the Web when its url has changed [PHE 00]. But indexing or being able to retrieve the same page on a different location does not necessarily help the user to remember why this page has been saved as a bookmark. We believe that being able to annotate the document would certainly help users remember their activities around this document and thus help them classify it.","cites":"11","conferencePercentile":"97.56097561"},{"venue":"WebNet","id":"917bf23ffd1511eec5a0756084a3f284f6eedc7b","venue_1":"WebNet","year":"2001","title":"Using Online Tools to Enhance Classrooms: A Case Study with MaSH (Making Serendipity Happen)","authors":"Dan Cosley","author_ids":"3314625","abstract":"The middle ground between distance learning and standard-issue classroom education is ripe for exploration. In particular, the Open Directory Project shows that groups of people can create their own portals onto the Web. MaSH (Making Serendipity Happen) is a system similar to ODP that also allows users to rank and comment on information, allowing students and teachers to quickly create course-specific resources, with the best information found by one shared by all. A case study using MaSH to support a computer science course for pre-majors suggests it encourages students to spend more time and learn more about course topics while providing an easy way for instructors to get feedback and assignments from students and learn more about their interests.","cites":"1","conferencePercentile":"45.12195122"},{"venue":"WebNet","id":"87928e5d54db940783e87d59e62f3852ff8fd020","venue_1":"WebNet","year":"1998","title":"A Corporate Application to the Process of Environmental Management","authors":"Claudia de Castro, Hugo Fuks","author_ids":"3101375, 7328178","abstract":"This paper's purpose is to present a functional description of a groupware-type application that controls the environmental management process [Michelis] [Dix 1996]. The application, named SIGMA, was developed for PETROBRAS and has three main objectives: to provide the users information on the process of environmental licensing; to help users conduct this work and allow a better interaction between them and the community concerned with a given environment – either PETROBRAS workers or not –, and to disseminate information in a differentiated way according each user's profile.","cites":"0","conferencePercentile":"26.13636364"},{"venue":"WebNet","id":"05ebf4386de7613e78de4ded348ba6a3cc240217","venue_1":"WebNet","year":"1998","title":"Rio Internet TV - AulaNet(tm) Using Videoconference in Web-Based Learning","authors":"Carlos Laufer, Hugo Fuks, Carlos José Pereira de Lucena","author_ids":"2723599, 7328178, 1698043","abstract":"This paper presents the results of an experiment using videoconference as a teaching resource in distance courses. CU-SeeMe and Real technology were tested for transmitting lessons live and recording lessons for asynchronous attendance. The results were assessed for later use in AulaNet™—an environment for web-based learning.","cites":"3","conferencePercentile":"75"},{"venue":"WebNet","id":"153384152100d431502554d27e1ff486404e1dd3","venue_1":"WebNet","year":"2000","title":"Models for User Access Patterns on the Web: Semantic Content versus Access History","authors":"Arun Ross, Charles B. Owen, Aditya Vailaya","author_ids":"1698707, 1787354, 2277853","abstract":"This work focuses on clustering a site into groups of documents that are predictive of future user accesses. Two approaches have been developed and tested. The first approach uses semantic information inherent in the documents to facilitate the clustering process. User access history is then used to reorganize the clusters iteratively so as to better indicate access patterns. This method was found to not be an effective solution to the problem. Hence, a second method based on hierarchical clustering of trail information was developed. This method is shown to be far more effective than the first method.","cites":"0","conferencePercentile":"21.15384615"},{"venue":"WebNet","id":"2b892af97df207134139f85a672312c5f6f59642","venue_1":"WebNet","year":"2001","title":"XML to XML through XML","authors":"Pim Lemmens, Geert-Jan Houben","author_ids":"2565631, 1703821","abstract":"When transforming an XML document for a given purpose, specifying the desired output format allows greater control over the transformation result than is possible using XSLT, especially when the format specification reflects the structure of the document to be produced. This also allows transformations to be transformed themselves, which may be useful to adapt them for application in different circumstances.","cites":"3","conferencePercentile":"56.09756098"},{"venue":"WebNet","id":"4966bace2e846a3e2a50fdb2d1f4be5e369a7a04","venue_1":"WebNet","year":"1998","title":"QUEST: An Assessment Tool for Web-Based Learning","authors":"Ricardo Choren, Marcelo Blois, Hugo Fuks","author_ids":"1748583, 3084745, 7328178","abstract":"The Internet has great potential for educational purposes. In 1997, the Software Engineering Laboratory at PUC-Rio implemented a first version of AulaNet™, a web-based educational environment. This year, some of the teaching staff will be using this environment to offer regular term disciplines through the Web. This paper introduces Quest, a tool for quiz generation and automatic correction incorporated into AulaNet™. Its purpose is to support the educational assessment process through the Web and to grab the results of this process.","cites":"8","conferencePercentile":"84.09090909"},{"venue":"WebNet","id":"2dc55384a5fbc81e1f1e40ab2492c4a647cf12ce","venue_1":"WebNet","year":"1997","title":"Cineast - An Extensible Web Browser","authors":"Eckhart Köppen, Gustaf Neumann, Stefan Nusser","author_ids":"2021824, 1715599, 1772974","abstract":"Cineast is a freely available, extensible Web browser which intends to provide an environment for prototyping new client side Internet technologies. Cineast has built-in support for HTML 3.2, fill-out forms, tables and incremental loading of documents. The browser itself uses the interpreted Wafe environment for implementing the high level control structures. The basic functionality is integrated into the Wafe package and coded in C, which means that the browser gains performance from the speed of compiled code while main aspects of the application can still be changed without recompilation. The network functionality is provided through the integration of the W3C Reference Library. The presentation of HTML documents is handled by the new Kino widget class which provides a flexible and extensible mechanism for parsing and rendering SGML like languages.","cites":"5","conferencePercentile":"68.75"},{"venue":"WebNet","id":"16162e9090b00ab63598265c5ae6980ca55c275a","venue_1":"WebNet","year":"2001","title":"XML-Based Automatic Web Presentation Generation","authors":"Flavius Frasincar, Geert-Jan Houben","author_ids":"1729599, 1703821","abstract":"This paper presents a method that automates hypermedia presentation generation on the Web. The method is based on RMM (Relationship Management Methodology) for aspects of hypermedia design. It distinguishes between the logical representation of the data and its actual presentation. Using new emerging Web technologies like XML (Extensible Markup Language) and XSLT (XML Stylesheet Language Transformation), we have implemented a prototype to experiment with the proposed method. Data filters written in XSLT prove to facilitate the multi-phase hypermedia presentation generation method.","cites":"7","conferencePercentile":"76.82926829"},{"venue":"WebNet","id":"ac426c7a785d3bd9cddd26bad96ea519eca9cccf","venue_1":"WebNet","year":"1999","title":"Scriba - A Tool for Developing Java Based Web Applications","authors":"Marcelo Blois, Ricardo Choren, Carlos Laufer, Fabio Ferraz, Hugo Fuks","author_ids":"3084745, 1748583, 2723599, 2949337, 7328178","abstract":"This paper presents Scriba — a tool that facilities the development of Java based Web applications. The tool allows the creation of script languages that can be embedded in HTML pages in order to process data dynamically. As well as the advantages of the use of Java technology, the structure in the tool's software components allows its users to redefine its functions, expanding or recreating its basic language. The AulaNet environment is an example of application developed with Scriba.","cites":"0","conferencePercentile":"27.27272727"},{"venue":"WebNet","id":"d9fb1b8ff50f60f93350e74fab7f7803615fa0c5","venue_1":"WebNet","year":"1998","title":"HyperAT : Addressing Usability Issues In Web Authoring","authors":"Yin Leng Theng, Harold W. Thimbleby","author_ids":"6086997, 1779970","abstract":"Usable web pages that subscribe to end-users' needs should be developed. This is uncontentious wisdom, but doing this is not easy. This paper suggests a framework to understand usability issues, and discusses HyperAT, a prototype web authoring tool implemented to test these ideas. The approach taken in HyperAT is novel in that multidisciplinary approaches drawn from current technologies in sub-disciplines of hypertext, human-computer interaction, cognitive psychology and software engineering are integrated and culminated into a practical authoring tool.","cites":"3","conferencePercentile":"75"},{"venue":"WebNet","id":"1f1c471a8a85df6ae9f3a9c286b2d13aa5f52c31","venue_1":"WebNet","year":"1997","title":"World Wide Web Presentations for Volatile Hypermedia Database Output","authors":"Geert-Jan Houben, Paul De Bra","author_ids":"1703821, 1831425","abstract":"The use of databases in current information systems is changing rapidly. The information contained in the database shows less structure, and contains multi-media objects and free-text, as well as hypertext links. To represent the information from a database a hypermedia platform such as World Wide Web often appears to be a right choice. Typical examples of such hypermedia applications are employee databases that include both administrative and personal information, museum databases that offer guided tours as well as query facilities for their collection, geographic information systems as used in tourist applications, and mail-order catalogs and services. The Relationship Management Methodology (RMM) [Isakowitz et al. 1995] is a hypermedia design method for generating hypermedia navigation and presentations of database information. However, most of the output of databases is the result of queries. Such output does not have a predefined structure for which a representation could be designed using RMM. In this paper we present an approach for extending the principles of RMM in order to generate hypermedia (HTML) presentations and navigational structures for query answers. First, we propose heuris-tics that are based on Relationship Management Design Model (RMDM) structures generated through RMM to provide presentational and navigational cues in a database query. Moreover, we give ways to override these defaults through extensions to the SQL query language.","cites":"7","conferencePercentile":"79.16666667"},{"venue":"WebNet","id":"487085d964253899f6bffcfaa73e2042b76608a1","venue_1":"WebNet","year":"2000","title":"Making General-Purpose Adaptive Hypermedia Work","authors":"Paul De Bra, A. T. M. Aerts, Geert-Jan Houben, Hongjing Wu","author_ids":"1831425, 2495562, 1703821, 1703429","abstract":"Adaptive hypermedia systems (AHS) have typically been geared towards one specific application or application area, in most cases related to education. The AHA (Adaptive Hypermedia Architecture) system is a Web-based adaptive hypermedia system specifically intended to serve many different purposes. As such AHA must be able to perform adaptation that is based on the user's browsing actions, regardless of the interpretation of browsing as learning. A general-purpose adaptive hypermedia system must be able to handle cycles in adaptation rules and non monotonic user model updates. (An educational system in which a user's knowledge about a hierarchical concept structure can only increase is much simpler.) This paper describes how AHA handles these aspects and indicates how other adaptive hypermedia systems may be turned into more general-purpose tools as well.","cites":"29","conferencePercentile":"96.15384615"},{"venue":"WebNet","id":"52a23d16d313ac8a5d0ed1da03402c81f1e455f4","venue_1":"WebNet","year":"1998","title":"Generating Hypermedia Applications for Volatile Database Output","authors":"Geert-Jan Houben, Paul De Bra","author_ids":"1703821, 1831425","abstract":"This paper reports on work in progress on the generation of hypermedia (Web) presentations for the results of arbitrary queries to multimedia databases. In [Houben & De Bra 1997] we have proposed a heuristic algorithm for generating navigation structures for multimedia database output, based on ideas from RMM [see Isakowitz et al. 1995]. We have shown that only part of the RMM design methodology can be automated deterministically, and have provided both heuristics and a way to override them through additional specifications in a database query. This paper describes our approach to automatically generate a presentation for multimedia database output, in addition to the generation of navigation for such output described in [Houben & De Bra 1997].","cites":"0","conferencePercentile":"26.13636364"},{"venue":"WebNet","id":"3849193d29bb5ce7763df1cfb1c9ce73ee77abc0","venue_1":"WebNet","year":"1998","title":"Customized Web-Based Data Presentation","authors":"Francisco Saiz, Pedro A. Szekely, Patel Devang","author_ids":"2121164, 2628881, 2669221","abstract":"This paper presents a language for specifying the presentation of data in Web pages. The language is an extension of HTML that includes constructs for specifying how to present one or more instances of a given class of data, and constructs for tailoring the presentation to the features of the data, to information in user profiles and to the capabilities of the user​ s platform. We describe the architecture of the system, the features of the page specification language, and present examples of generated pages.","cites":"0","conferencePercentile":"26.13636364"},{"venue":"WebNet","id":"ce3db7f7d28de20ec87977c685c719c373f37ba6","venue_1":"WebNet","year":"2000","title":"Creating corporate knowledge with the PADDLE system","authors":"Klaus Tochtermann, Andreas Kussmaul, David L. Hicks","author_ids":"1716776, 2171291, 1771998","abstract":"The integration of dispersed knowledge available in an organization is often referred to as corporate knowledge. The corporate knowledge of an organization can be built up, shared and maintained most efficiently if modern Internet technologies are applied by knowledge workers. As different knowledge workers have different perspectives on corporate knowledge, customization concepts are needed to tailor knowledge objects according to different needs. Additionally, the acceptance of the corporate knowledge depends mainly on the quality of the knowledge stored therein. Against this background this paper presents concepts to create corporate knowledge, to customize it according to different requirements and to ensure a high level of quality. These concepts and their implementation are discussed in the context of the PADDLE system.","cites":"2","conferencePercentile":"66.34615385"},{"venue":"WebNet","id":"ec67b89f6500aee37dbbb44c08286e7033a40ef4","venue_1":"WebNet","year":"1996","title":"Building Internet-based electronic performance support for teaching and learning","authors":"James M. Laffey, Dale Musser","author_ids":"1730980, 2615854","abstract":"The College of Education, University of Missouri-Columbia is developing and testing a suite of tools that utilize the Internet and work as a system to support learning from field experiences. These tools are built to support preservice teachers, field-based mentors, and college faculty as they collaborate, engage in practice, document their efforts, share their experiences, and assess outcomes. The journal system enables preservice teachers to record their observations and reflections about experiences, maintain these records on a central server, and organize the records to meet a variety of needs. Among the resource types are World Wide Web pages, electronic messaging, and conferencing. The field test version of the journal system will implement a Macintosh client and Silicon Graphics Indy servers. The clients and servers communicate on the Internet using TCP/IP connections. Three figures present the opening screen, a journal entry, and an author profile. Reproductions supplied by EDRS are the best that can be made from the original document. received from the person or organization originating it. 0 Minor changes have been made to improve reproduction quality. Points of view or opinions stated in this document do not necessarily represent official OERI position or policy. Abstract: The College of Education, University of Missouri-Columbia is developing and testing a suite of tools that utilize the Internet and work as a system to support learning from field experiences. These tools are built to support pre-service teachers, field-based mentors and college faculty as they collaborate, engage in practice, document their efforts, share their experiences, and assess outcomes. The journal system enables the preservice teacher to record their observations and reflections about experiences, maintain these records on a central server, and organize the records to meet a variety of needs. Among the resource types are web pages, electronic messaging and conferencing. The field test version of the journal system will implement a Macintosh client and Silicon Graphics Indy servers. The clients and servers communicate over the internet using TCP/IP connections.","cites":"2","conferencePercentile":"20.83333333"},{"venue":"WebNet","id":"350c0028fdbbaef210fe0e49cce317deb5e6461f","venue_1":"WebNet","year":"2000","title":"Enhancing Interactivity for Self-Evaluation in XML-based Courseware","authors":"Florin Bota, Fulvio Corno, Laura Farinetti","author_ids":"2269404, 1712546, 3141797","abstract":"The paper describes an educational application, oriented to university students, to help them to learn the SQL language in the ambit of a course on database systems and applications. This tool is integrated with a XML-based framework for courseware authoring, whose main characteristic is flexibility, since contents are presented to the students in different ways, depending on their previous knowledge, on the kind of hardware used to access the content, and on some preferences of the user. The implemented application is interactive, and allows the students to practice their understanding and their skills about the SQL language, following the approach of \" leaning by doing \" .","cites":"0","conferencePercentile":"21.15384615"},{"venue":"WebNet","id":"606190e0e367505ffd668b90940f02e341aff9e3","venue_1":"WebNet","year":"1999","title":"Adapting Web Information to Disabled and Elderly Users","authors":"Alfred Kobsa","author_ids":"1715227","abstract":"Substantial research and standardization efforts already exist to make it easier for people with physical impairments to perceive and interact with web pages. This paper describes work aimed at catering the content of web pages to the needs of different users, including elderly people and users with vision and motor impairments. The AVANTI system and related efforts in the AVANTI project will be discussed and experiences reported.","cites":"6","conferencePercentile":"88.18181818"},{"venue":"WebNet","id":"4e9cec27109824475db65b0ef8abe0880c763341","venue_1":"WebNet","year":"2000","title":"Extending IOS's Collaboration via Web-Enabled Whiteboards","authors":"Christopher A. Egert, Mary Flanagan, Deborah Walters","author_ids":"3102219, 8369740, 3111224","abstract":"The purpose of this paper is to discuss the development of a web-based asynchronous whiteboard system used as part of an online collaborative system. The whiteboard system has been designed to perform in a manner similar to that of threaded newsgroup systems; users can post new whiteboard messages and reply to others via a content layering mechanism. As part of the whiteboard's development, we needed an easy to use method for both storing whiteboard content and defining the relationships between layers used in a reply. In order to accommodate these needs, we decided to use the Extensible Markup Language (XML) (World Wide Web Consortium 99). Using XML, we were able to define a language capable of expressing both content and relationships within the whiteboard application. This paper explains the need for the whiteboard system within our online collaborative system, the functionality of the whiteboard, and design choices pertaining to the implementation. The paper also examines initial assessment and additional evaluation plans for the whiteboard system.","cites":"0","conferencePercentile":"21.15384615"},{"venue":"WebNet","id":"013f2e61eca72d4fc33c5bf4009d413482ba2214","venue_1":"WebNet","year":"1997","title":"A Taxonomy of Internet Communication Tools","authors":"Byron Long, Ronald Baecker","author_ids":"1739115, 1715312","abstract":"When looking at the social phenomenon that are arise from the use of Internet communications tools, one must consider the properties of the tool that influence human-to-human interaction. This paper presents a number of such properties and discusses their importance. In addition, existing Internet communications tools are described both in general and with respect to the properties.","cites":"4","conferencePercentile":"60.41666667"},{"venue":"WebNet","id":"1cd28d5977b88cf3ea75a85694aa36605616a58c","venue_1":"WebNet","year":"1999","title":"Academic Information Management: an Open Linking Approach","authors":"Gareth V. Hughes, Wendy Hall, Anthony J. G. Hey, Les Carr","author_ids":"1798953, 1685385, 1720066, 1727183","abstract":"This paper describes a Web based document management system developed as a Lotus Domino application and the continuing research work of providing users with a variety of link services and agents that enhance the basic content of the system. The system is designed for use by administration personnel in an academic environment taking into account the wide variety of systems and methods already in use. Users do not need to know how to author Web pages as the source material for the system are files produced by common word processors. The system features a number of management tools to complement this concept written into the Domino application. The document management system is complemented by the use of an open linking service to dynamically cross-reference the documents.","cites":"0","conferencePercentile":"27.27272727"},{"venue":"WebNet","id":"52bfb491d8c03242d17dcbd440eda187d59029b6","venue_1":"WebNet","year":"1999","title":"Mandatory Participation as Examination","authors":"Christian Hardless, Urban Nuldén","author_ids":"2266993, 1710576","abstract":"This paper discusses examination, focusing on the possibilities available in ALN based learning. ALN is an acronym for asynchronous learning networks and in this research this means a web based learning environment supporting anywhere/anytime learning. The notion of mandatory participation in learning activities is argued to be more viable in ALNs rather than traditional classrooms. Mandatory participation as the primary examination criteria is used and evaluated in a higher education ALN based course, resulting in several key experiences which are presented and discussed. These experiences contribute to a richer understanding of problems and difficulties involved in ALN based courses.","cites":"0","conferencePercentile":"27.27272727"}]}