{"WebQuality_12.csv":[{"venue":"WebQuality '12","id":"18552dbac3df395226e59348db3be502cd131aa1","venue_1":"WebQuality '12","year":"2012","title":"A deformation analysis method for artificial maps based on geographical accuracy and its applications","authors":"Daisuke Kitayama, Kazutoshi Sumiya","author_ids":"1720718, 1678794","abstract":"Artificial maps are widely used for a variety of purposes, including as tourist guides to help people find geographical objects using simple figures. We aim to develop an editing system and a navigation system for artificial maps. Artificial maps made for tourists show suitable objects for traveling users. Therefore, if the artificial map has a navigation system, users can get geographical information such as object positions and routes without performing any operations. However, artificial maps might contain incorrect or superfluous information, such as some objects on the map being intentionally enlarged or omitted. For developing the system, there are two problems: 1. extraction of geographical information from the raster graphics of the artificial map and 2. revision of inaccurate geographical information on the artificial map. We propose a deformation-analyzing method based on geographical accuracy using optical character recognition techniques and comparing gazetteer information. That is, our proposed method detects the tolerance level for deformation according to the purpose of the artificial map. Then, we detect a certain position on the artificial map using deformation analysis. In this paper, we develop a prototype system and we evaluate the accuracy of extracting information from the artificial map and detecting positions.","cites":"0","conferencePercentile":"15"},{"venue":"WebQuality '12","id":"6cc08f66d5aa7a144df0854332229600d5dc5af8","venue_1":"WebQuality '12","year":"2012","title":"On measuring the lexical quality of the web","authors":"Ricardo Baeza-Yates, Luz Rello","author_ids":"1747635, 1680197","abstract":"In this paper we propose a measure for estimating the lexical quality of the Web, that is, the representational aspect of the textual web content. Our lexical quality measure is based in a small corpus of spelling errors and we apply it to English and Spanish. We first compute the correlation of our measure with web popularity measures to show that gives independent information and then we apply it to different web segments, including social media. Our results shed a light on the lexical quality of the Web and show that authoritative websites have several orders of magnitude less misspellings than the overall Web. We also present an analysis of the geographical distribution of lexical quality throughout English and Spanish speaking countries as well as how this measure changes in about one year.","cites":"9","conferencePercentile":"65"},{"venue":"WebQuality '12","id":"0d1a6637f31ab5621ee449afe1ae7eb342c9dc46","venue_1":"WebQuality '12","year":"2012","title":"Game-theoretic models of web credibility","authors":"Thanasis G. Papaioannou, Karl Aberer, Katarzyna Abramczuk, Paulina Adamska, Adam Wierzbicki","author_ids":"1766169, 1751802, 2886794, 2272734, 1746304","abstract":"Research on Web credibility assessment can significantly benefit from new models that are better suited for evaluation and study of adversary strategies. Currently employed models lack several important aspects, such as the explicit modeling of Web content properties (e.g. presentation quality), the user economic incentives and assessment capabilities. In this paper, we introduce a new, game-theoretic model of credibility, referred to as the Credibility Game. We perform equilibrium and stability analysis of a simple variant of the game and then study it as a signaling game against na&#239;ve and expert information consumers. By a generic economic model of the player payoffs, we study, via simulation experiments, more complex variants of the Credibility Game and demonstrate the effect of consumer expertise and of the signal for credibility evaluation on the evolutionary stable strategies of the information producers and consumers.","cites":"1","conferencePercentile":"30"}]}