{"WebSci.csv":[{"venue":"WebSci","id":"3de2972503b0611ab81eddedfe13bd6268ad3587","venue_1":"WebSci","year":"2012","title":"Four degrees of separation","authors":"Lars Backstrom, Paolo Boldi, Marco Rosa, Johan Ugander, Sebastiano Vigna","author_ids":"2612372, 1733343, 1876236, 1760812, 1737624","abstract":"Frigyes Karinthy, in his 1929 short story \"L&#225;ncszemek\" (in English, \"Chains\") suggested that any two persons are distanced by at most six friendship links.<sup>1</sup> Stanley Milgram in his famous experiments challenged people to route postcards to a fixed recipient by passing them only through direct acquaintances. Milgram found that the average number of intermediaries on the path of the postcards lay between 4:4 and 5:7, depending on the sample of people chosen. We report the results of the first world-scale social-network graph-distance computations, using the entire Facebook network of active users (&asymp; 721 million users, &asymp; 69 billion friendship links). The average distance we observe is 4:74, corresponding to 3:74 intermediaries or \"degrees of separation\", prompting the title of this paper. More generally, we study the distance distribution of Facebook and of some interesting geographic subgraphs, looking also at their evolution over time. The networks we are able to explore are almost two orders of magnitude larger than those analysed in the previous literature. We report detailed statistical metadata showing that our measurements (which rely on probabilistic algorithms) are very accurate.","cites":"121","conferencePercentile":"100"},{"venue":"WebSci","id":"6c882f912bdff36c8e5e8ba6272c07809fb2d0cb","venue_1":"WebSci","year":"2011","title":"The effect of user features on churn in social networks","authors":"Marcel Karnstedt, Matthew Rowe, Jeffrey Chan, Harith Alani, Conor Hayes","author_ids":"1734216, 1782451, 6273657, 2798006, 2653825","abstract":"Social sites and services rely on the continuing activity, good will and behaviour of the contributors to remain viable. There has been little empirical study of the mechanisms by which social sites maintain a viable user base. Such studies would provide a scientific understanding of the patterns that lead to user churn (i.e. users leaving the community) and the community dynamics that are associated with reduction of community members -- primary threats to the sustainability of any service. In this paper, we explore the relation between a user's value within a community - constituted from various user features - and the probability of a user churning.","cites":"20","conferencePercentile":"89.28571429"},{"venue":"WebSci","id":"f724aa77a426219b0c9f16ff1e82e3b6f45e9e39","venue_1":"WebSci","year":"2016","title":"Information dissemination in heterogeneous-intent networks","authors":"Abhimanyu Das, Sreenivas Gollapudi, Emre Kiciman, Onur Varol","author_ids":"2512591, 1695567, 1754874, 2307347","abstract":"Many qualitative studies of communication practices on social media have recognized that people's motivation for participating in social networks can vary greatly. Some people participate for fame and fortune, while others simply wish to chat with friends. In this paper, we study the implications of such heterogeneous intent for modeling information diffusion in social networks. We <i>experiment</i> with user-level perception of messages, <i>analyze</i> large-scale information cascades, and <i>model</i> information diffusion in heterogeneous-intent networks. We perform carefully designed user studies to establish the relationship between the intent and language style of a message sender. Style of the user appear to adapt their language to achieve different intents. We perform a large-scale data analysis on Twitter message cascades and confirm that message propagation through a network is correlated with historical representations of individuals' intents. Finally, we posit a simple analytical model of information diffusion in social networks that takes heterogeneous intents into account and find that this model is able to explain empirically observed properties of structural virality that are not explained by current models.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"b23b8bdfdf6953af05ba31ab9f3d76597d572221","venue_1":"WebSci","year":"2014","title":"Observing the web","authors":"Wendy Hall","author_ids":"1685385","abstract":"It is ten years since the concept of Web Science was conceived against a backdrop of a dramatically evolving Web. At the time social networks were in their infancy and linked data was only talked about in the research labs. Today as we celebrate the 25th anniversary of the birth of the Web and we become increasingly aware of the pressures on it going forwards, I see Web Science as more significant to the evolution of the Web than ever. It is so important we can present real evidence to the major stakeholders in the development of the Web to demonstrate the likely consequences of decisions they might take. It is my hypothesis that we cannot achieve this without establishing an international project to observe what is happening on the Web and to set this in the wider social context and what has happened before. This means developing mechanisms to share data and data analytics across different projects and cultures over time -- including the creation of \"safe harbours\" in which private and public data can be integrated with out compromising privacy, confidentiality, or data security issues. This thinking has led to the establishment of the Web Observatory project, the latest incarnation of which will be presented in this talk. There are many such observatories in existence. The grand challenge is to create a distributed framework to facilitate the virtual integration of the data that resides in the various repositories and the sharing of data analysis tools as well as the results of the research that such international collaboration will engender.","cites":"1","conferencePercentile":"49.19354839"},{"venue":"WebSci","id":"14ebfca1754771946e49b2c4a69ab25c797b27d8","venue_1":"WebSci","year":"2014","title":"Reading the Source Code of Social Ties","authors":"Luca Maria Aiello, Rossano Schifanella, Bogdan State","author_ids":"2905635, 2251027, 2632078","abstract":"Though online social network research has exploded during the past years, not much thought has been given to the exploration of the nature of social links. Online interactions have been interpreted as indicative of one social process or another (e.g., status exchange or trust), often with little systematic justification regarding the relation between observed data and theoretical concept. Our research aims to breach this gap in computational social science by proposing an unsupervised, parameter-free method to discover, with high accuracy, the fundamental domains of interaction occurring in social networks. By applying this method on two online datasets different by scope and type of interaction (aNobii and Flickr) we observe the spontaneous emergence of three domains of interaction representing the exchange of status, knowledge and social support. By finding significant relations between the domains of interaction and classic social network analysis issues (e.g., tie strength, dyadic interaction over time) we show how the network of interactions induced by the extracted domains can be used as a starting point for more nuanced analysis of online social data that may one day incorporate the normative grammar of social interaction. Our methods finds applications in online social media services ranging from recommendation to visual link summarization.","cites":"5","conferencePercentile":"80.64516129"},{"venue":"WebSci","id":"38898ccf83ca190e2d4bb4160b5664a8a9e570e6","venue_1":"WebSci","year":"2014","title":"Race, religion or sex: what makes a superbowl ad controversial?","authors":"Rumi Ghosh, Sitaram Asur","author_ids":"2620560, 1806968","abstract":"Advertisements that generate undue controversies can destroy an advertising campaign. However it is difficult to estimate the potential of controversies in advertisements through traditional methods such as customer surveys and market research. In this paper, we develop a controversy detection system based on initial comments on online advertisements posted on YouTube. We extract early YouTube comments on a collection of Superbowl advertisements and generate a comprehensive set of over 2500 semantic and linguistic features for automatically detecting controversies. Our results show good accuracy in early detection of controversies. The proposed data-driven approach can complement and greatly aid traditional approaches of market research.","cites":"0","conferencePercentile":"20.96774194"},{"venue":"WebSci","id":"21eca7e3d85784b0ce27e7a188bc9aa0f5d22465","venue_1":"WebSci","year":"2013","title":"Social media as a measurement tool of depression in populations","authors":"Munmun De Choudhury, Scott Counts, Eric Horvitz","author_ids":"2583473, 1721345, 1688884","abstract":"Depression is a serious and widespread public health challenge. We examine the potential for leveraging social media postings as a new type of lens in understanding depression in populations. Information gleaned from social media bears potential to complement traditional survey techniques in its ability to provide finer grained measurements over time while radically expanding population sample sizes. We present work on using a crowdsourcing methodology to build a large corpus of postings on Twitter that have been shared by individuals diagnosed with clinical depression. Next, we develop a probabilistic model trained on this corpus to determine if posts could indicate depression. The model leverages signals of social activity, emotion, and language manifested on Twitter. Using the model, we introduce a social media depression index that may serve to characterize levels of depression in populations. Geographical, demographic and seasonal patterns of depression given by the measure confirm psychiatric findings and correlate highly with depression statistics reported by the Centers for Disease Control and Prevention (CDC).","cites":"23","conferencePercentile":"100"},{"venue":"WebSci","id":"02df82e45cf9685607e3bec77fd8e4b22335640c","venue_1":"WebSci","year":"2015","title":"Habits vs Environment: What Really Causes Asthma?","authors":"Mengfan Tang, Pranav Agrawal, Ramesh Jain","author_ids":"3057568, 2836587, 4521564","abstract":"Despite considerable number of studies on risk factors for asthma onset, very little is known about their relative importance. To have a full picture of these factors, both categories, personal and environmental data, have to be taken into account simultaneously, which is missing in previous studies. We propose a framework to rank the risk factors from heterogeneous data sources of the two categories. Established on top of EventShop and Personal EventShop, this framework extracts about 400 features, and analyzes them by employing a gradient boosting tree. The features come from sources including personal profile and life-event data, and environmental data on air pollution, weather and PM2.5 emission sources. The top ranked risk factors derived from our framework agree well with the general medical consensus. Thus, our framework is a reliable approach, and the discovered rankings of relative importance of risk factors can provide insights for the prevention of asthma.","cites":"2","conferencePercentile":"88.63636364"},{"venue":"WebSci","id":"cf1e6f4e1d708cbcb2d1fb2dc8381ceaf63aecbc","venue_1":"WebSci","year":"2015","title":"Twitter as a Political Network: Predicting the Following and Unfollowing Behavior of German Politicians","authors":"Julia Perl, Claudia Wagner, Jérôme Kunegis, Steffen Staab","author_ids":"3379675, 7942200, 1697769, 1752093","abstract":"It has widely been observed that many public figures and in particular politicians use Twitter as a medium for communication with their fans or followers. However, Twitter is also used by public figures for communication among themselves, allowing Twitter to be used as a tool to observe the social network among such public figures -- a network which is otherwise much more difficult to observe. Accordingly, we study in this paper the behavior of German politicians with respect to their social interconnections on Twitter, by way of asking the question whether the following and unfollowing between them can be predicted with accuracy. We show which measures are useful for predicting the formation and dissolution of social ties in the network of German politicians, and quantify the added value of unlinking information for both prediction tasks. Our results show that interesting differences exist in the factors that are related with the formation and dissolution of social ties.","cites":"0","conferencePercentile":"31.81818182"},{"venue":"WebSci","id":"4a8ed9caa4b8e210707598b0fe6024b8f3049e99","venue_1":"WebSci","year":"2014","title":"Twitter: who gets caught? observed trends in social micro-blogging spam","authors":"Abdullah Almaatouq, Ahmad Alabdulkareem, Mariam Nouh, Erez Shmueli, Mansour Alsaleh, Vivek K. Singh, Abdulrahman Alarifi, Anas Alfaris, Alex Pentland","author_ids":"3085084, 2139286, 1738646, 1824816, 3129812, 4685302, 2329378, 1854176, 1682773","abstract":"Spam in Online Social Networks (OSNs) is a systemic problem that imposes a threat to these services in terms of undermining their value to advertisers and potential investors, as well as negatively affecting users' engagement. In this work, we present a unique analysis of spam accounts in OSNs viewed through the lens of their behavioral characteristics (i.e., profile properties and social interactions). Our analysis includes over 100 million tweets collected over the course of one month, generated by approximately 30 million distinct user accounts, of which over 7% are suspended or removed due to abusive behaviors and other violations. We show that there exist two behaviorally distinct categories of twitter spammers and that they employ different spamming strategies. The users in these two categories demonstrate different individual properties as well as social interaction patterns. As the Twitter spammers continuously keep creating newer accounts upon being caught, a behavioral understanding of their spamming behavior will be vital in the design of future social media defense mechanisms.","cites":"8","conferencePercentile":"93.5483871"},{"venue":"WebSci","id":"b484753da8cf088300a1c20d3731e4300175c0c6","venue_1":"WebSci","year":"2012","title":"Rumoring during extreme events: a case study of deepwater horizon 2010","authors":"Emma S. Spiro, Sean Fitzhugh, Jeannette Sutton, Nicole Pierski, Matt Greczek, Carter T. Butts","author_ids":"3003737, 2849207, 2607320, 2824242, 2762777, 3014984","abstract":"Social scientists have proposed many different factors thought to influence rumoring behavior. Classical rumor theory points to the perceived importance, the level of uncertainty or ambiguity, and the potential to impact decision making as influential in determining the extent of rumoring. In this work, we test some of these proposed rumor determinants in the context of the the 2010 Deepwater Horizon oil spill, using data on communication dynamics from the popular microblogging service Twitter. Using a latent factor model, we measure rates of hazard-related conversation by exploiting joint variation in multiple conversation streams. Time series analysis of the resulting rates suggests that media coverage of the event is a major driver of rumoring behavior, supporting importance/saliency theories and disconfirming theories of information substitution for this event. Relevance of the event to decision making behavior also turns out to be an influential predictor in this case. Since information diffusion via serial transmission is a fundamental process by which rumors spread, we compare rates of serial transmission between control and hazard-related communication. Twitter posts are much more likely to be retweeted when they contain hazard-related keywords (versus control words). Implications of these findings for disaster response are discussed.","cites":"11","conferencePercentile":"75"},{"venue":"WebSci","id":"a8b2d95148059ef65bd6a51ba3b44dc6c7195086","venue_1":"WebSci","year":"2012","title":"The evolution of a crawling strategy for an academic document search engine: whitelists and blacklists","authors":"Jian Wu, Pradeep B. Teregowda, Juan Pablo Fernández Ramírez, Prasenjit Mitra, Shuyi Zheng, C. Lee Giles","author_ids":"1734550, 1712873, 2037978, 1714911, 3049801, 1749125","abstract":"We present a preliminary study of the evolution of a crawling strategy for an academic document search engine, in particular CiteSeerX. CiteSeerX actively crawls the web for academic and research documents primarily in computer and information sciences, and then performs unique information extraction and indexing extracting information such as OAI metadata, citations, tables and others. As such CiteSeerX could be considered a specialty or vertical search engine. To improve precision in resources expended, we replace a blacklist with a whitelist and compare the crawling efficiencies before and after this change. A blacklist means the crawl is forbidden from a certain list of URLs such as publisher domains but is otherwise unlimited. A whitelist means only certain domains are considered and others are not crawled The whitelist is generated based on domain ranking scores of approximately five million parent URLs harvested by the CiteSeerX crawler in the past four years. We calculate the <i>F</i><sub>1</sub> scores for each domain by applying equal weights to document numbers and citation rates. The whitelist is then generated by re-ordering parent URLs based on their domain ranking scores. We found that crawling the whitelist significantly increases the crawl precision by reducing a large amount of irrelevant requests and downloads.","cites":"8","conferencePercentile":"64.13043478"},{"venue":"WebSci","id":"6f3032e94f760f7115571d3b72631741ca5c7290","venue_1":"WebSci","year":"2013","title":"Why forums?: an empirical analysis into the facilitating factors of carding forums","authors":"Michael Yip, Nigel Shadbolt, Craig Webber","author_ids":"2235208, 1705314, 2515095","abstract":"Over the last decade, the nature of cybercrime has transformed from naive vandalism to profit-driven, leading to the emergence of a global underground economy. A noticeable trend which has surfaced in this economy is the repeated use of forums to operate online stolen data markets. Using interaction data from three prominent carding forums: Shadowcrew, Cardersmarket and Darkmarket, this study sets out to understand why forums are repeatedly chosen to operate online stolen data markets despite numerous successful infiltrations by law enforcement in the past. Drawing on theories from criminology, social psychology, economics and network science, this study has identified four fundamental socio-economic mechanisms offered by carding forums: (1) formal control and coordination; (2) social networking; (3) identity uncertainty mitigation; (4) quality uncertainty mitigation. Together, they give rise to a sophisticated underground market regulatory system that facilitates underground trading over the Internet and thus drives the expansion of the underground economy.","cites":"8","conferencePercentile":"78.94736842"},{"venue":"WebSci","id":"109c1678b54ed5a512fb4afe6dfcb6300bbd0337","venue_1":"WebSci","year":"2015","title":"/Command' and Conquer: Analysing Discussion in a Citizen Science Game","authors":"Ramine Tinati, Markus Luczak-Rösch, Elena Paslaru Bontas Simperl, Nigel Shadbolt, Wendy Hall","author_ids":"2050678, 1709485, 2927032, 1705314, 1685385","abstract":"Citizen science is changing the process of scientific knowledge discovery. Successful projects rely on an active and able collection of volunteers. In order to attract, and sustain citizen scientists, designers are faced with the task of transforming complex scientific tasks into something accessible, interesting, and hopefully, engaging. In this paper, we examine the citizen science game EyeWire. Our analysis draws up a dataset of over 4,000,000 completed game and 885,000 chat entries, made by over 90,000 players. The analysis provides a detailed understanding of how features of the system facilitate player interaction and communication alongside completing the gamified scientific task. Based on the analysis we describe a set of behavioural characteristics which identify different types of players within the EyeWire platform.","cites":"1","conferencePercentile":"72.72727273"},{"venue":"WebSci","id":"161427b1c5be434ed6f8a52402dfa94a8f8d0310","venue_1":"WebSci","year":"2012","title":"Colonel Blotto on Facebook: the effect of social relations on strategic interaction","authors":"Pushmeet Kohli, Michael Kearns, Yoram Bachrach, Ralf Herbrich, David Stillwell, Thore Graepel","author_ids":"1685185, 1799212, 1698412, 3234984, 3069657, 1686971","abstract":"We study how social relations between people affect the way they play the famous resource allocation game called Colonel Blotto. We report the deployment of a Facebook application called \"Project Waterloo\" which allows users to invite both friends and strangers to play Colonel Blotto against them. Most previous empirical studies of Blotto have been performed in a laboratory environment and have typically employed monetary incentives to attract human subjects to play games. In contrast, our framework relies on reputation and entertainment incentives to attract players. Deploying the game on a social network allows us to capture the social relations between players and analyze their impact on the used strategies.\n Following [1] we examine player strategies and contrast them with game theoretic predictions. We then investigate how strategies are affected by social relations. Our analysis reveals that knowledge of the opponent affects the strategies chosen by players and how well they perform in the game. We show that players with few Facebook friends tend to play more games and have a higher probability of winning, that players responding to a challenge in the game have a higher probability of winning than those initiating the game, and that the initiators of a game have a higher probability of defeating their friends than strangers.","cites":"7","conferencePercentile":"58.69565217"},{"venue":"WebSci","id":"72b1e4039d6f61079591781955fd03a445f78d3d","venue_1":"WebSci","year":"2016","title":"Social machines in practice: solutions, stakeholders and scopes","authors":"Clare J. Hooper, Brian Bailey, Hugh Glaser, James Hendler","author_ids":"1866599, 5249151, 2907424, 2204510","abstract":"This paper frames social machines as problem solving entities, demonstrating how their ecosystems address multiple stakeholders' problems. It enumerates aspects relevant to the theory and real-world practice of social machines, based on qualitative observations from our experiences building them. We frame evolving issues including: changing functionality, users, data and context; geographical and temporal scope (considering data granularity and visibility); and social scope. The latter is wide-ranging, including motivation, trust, experience, security, governance, control, provenance, privacy and law. We provide suggestions about building flexibility into social machines to allow for change, and defining social machines in terms of problems and stakeholders.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"18d9a2056ace629cedaf1673fdcacd9840db6c6e","venue_1":"WebSci","year":"2011","title":"The web as an adaptive network: coevolution of web behavior and web structure","authors":"Connor McCabe, Richard A. Watson, Jane Prichard, Wendy Hall","author_ids":"7557598, 1698640, 1923273, 1685385","abstract":"Much is known about the complex network structure of the Web, and about behavioral dynamics on the Web. A number of studies address how behaviors on the Web are affected by different network topologies, whilst others address how the behavior of users on the Web alters network topology. These represent complementary directions of influence, but they are generally not combined within any one study. In network science, the study of the coupled interaction between topology and behavior, or state-topology coevolution, is known as 'adaptive networks', and is a rapidly developing area of research. In this paper, we review the case for considering the Web as an adaptive network and several examples of state-topology coevolution on the Web. We also review some abstract results from recent literature in adaptive networks and discuss their implications for Web Science. We conclude that adaptive networks provide a formal framework for characterizing processes acting 'on' and 'of' the Web, and offers potential for identifying general organizing principles that seem otherwise illusive in Web Science.","cites":"2","conferencePercentile":"39.28571429"},{"venue":"WebSci","id":"09b6b45e3597cb6b0ba32a7d83a9fb385d7f9aac","venue_1":"WebSci","year":"2012","title":"Topical anomaly detection from Twitter stream","authors":"Pramod Anantharam, Krishnaprasad Thirunarayan, Amit P. Sheth","author_ids":"2446751, 3195814, 1709950","abstract":"In this paper, we spot topically anomalous tweets in twitter streams by analyzing the content of the document pointed to by the URLs in the tweets in preference to their textual content. Existing approaches to anomaly detection ignore such URLs thereby missing opportunities to detect off-topic tweets. Specifically, we determine the divergence of claimed topic of a tweet as reflected by the hashtags and the actual topic as reflected by the referenced document content. Our approach avoids the need for labeled samples by selecting documents from reliable sources gleaned from the URLs present in the tweets. These documents are used for comparison against documents associated with unknown URLs in incoming tweets improving reliability, scalability and adaptability to rapidly changing topics. We evaluate our approach on three events and show that it can find topical inconsistencies not detectable by existing approaches.","cites":"5","conferencePercentile":"42.39130435"},{"venue":"WebSci","id":"fa232dda218580f871fc7a5b596ffbb298830be1","venue_1":"WebSci","year":"2014","title":"Noticing the other gender on Google+","authors":"Diego Couto de Las Casas, Gabriel Magno, Evandro Cunha, Marcos André Gonçalves, César Cambraia, Virgílio A. F. Almeida","author_ids":"1863006, 1863896, 2601182, 7170789, 2980346, 7360316","abstract":"Google+ provides a feature that has been overlooked in social media studies: the possibility of users setting their gender information not only as female or male, but as other instead. In this paper, we discuss this particularity and, more broadly, the issue of non-binary gender roles in the Web. By analyzing a large dataset, we characterize some aspects of self presentation, word use, network information and country of residence among users who choose different alternatives in the field Gender. On the whole, our main contributions are to present preliminary results and to shed light into the topic considered here - namely, the implications of having a third gender option to present oneself in an online social networking service.","cites":"1","conferencePercentile":"49.19354839"},{"venue":"WebSci","id":"eca67f92686d676d3b90ff14ae9b9bda4d13048d","venue_1":"WebSci","year":"2012","title":"A network pruning based approach for subset-specific influential detection","authors":"Praphul Chandra, Arun Kalyanasundaram","author_ids":"2397475, 3143456","abstract":"Identifying the most influential nodes in a network is a well known problem which has received significant attention in the research community. However, as networks grow larger, an interesting variation of the problem becomes relevant where in the aim is to maximize the influence not in the whole network but only on a sub-set of the nodes in the network. We approach the <b><i>subset specific top-k influential problem</i></b> standalone and show that, unlike traditional approaches, a search for subset specific top-k influentials can be terminated earlier based on a parameter &#947; - thus allowing a trade-off between efficiency and effectiveness. For social networks, this parameter has a behavioral interpretation: it captures the ease of influencing nodes in the network. This work makes three key contributions. First, we propose an iterative network pruning algorithm to find subset specific top-k influentials and compare its performance to subset-adapted existing algorithms for various values of &#947; on real world data sets. Second, we extend the existing analytical framework for top-k influential detection to incorporate &#947;. Third, we analyze our algorithm under our analytical framework and show that the influence spread function continues to be sub-modular. Though our work has been motivated by online social networks, we believe that it is useful in other domains where diffusion over networks is considered.","cites":"1","conferencePercentile":"13.04347826"},{"venue":"WebSci","id":"d7776eb4cf42af8fcb0e28d50dcea06f68b32e2e","venue_1":"WebSci","year":"2015","title":"Emotional States vs. Emotional Words in Social Media","authors":"Asaf Beasley, Winter Mason","author_ids":"3430772, 8742260","abstract":"A number of social media studies have equated people's emotional states with the frequency with which they use affectively positive and negative words in their posts. We explore how such word frequencies relate to a ground truth measure of both positive and negative emotion for 515 Facebook users and 448 Twitter users. We find statistically significant but very weak (&rho; in the 0.1 to 0.2 range) correlations between positive and negative emotion-related words from the Linguistic Inquiry Word Count (LIWC) dictionary and a well-validated scale of trait emotionality called the Positive and Negative Affect Schedule (PANAS). We test this for tweets and Facebook status updates, focus on different time slices around the completion of the survey, and consider participants who report expressing emotions frequently on social media. With rare exception, this pattern of low correlation persists, suggesting that for the typical user, dictionary-based sentiment analysis tools may not be sufficient to infer how they truly feel.","cites":"1","conferencePercentile":"72.72727273"},{"venue":"WebSci","id":"8f41f8e2a12c196e1407191ae33bd23b97a9ad88","venue_1":"WebSci","year":"2014","title":"Assisting coordination during crisis: a domain ontology based approach to infer resource needs from tweets","authors":"Shreyansh P. Bhatt, Hemant Purohit, Andrew Hampton, Valerie L. Shalin, Amit P. Sheth, John M. Flach","author_ids":"2196617, 7147418, 3243586, 2890773, 1709950, 7327341","abstract":"Ubiquitous social media during crises provides citizen reports on the situation, needs and supplies. Previous research extracts resource needs directly from the text (e.g. \"Power cut to Coney Island and Brighton beach\" indicates a power need). This approach assumes that citizens derive and write about specific needs from their observations, properly specified for the emergency response system, an assumption that is not consistent with general conversational behavior. In our study, Twitter messages (tweets) from Hurricane Sandy in 2012 clearly indicate power blackouts, but not their probable implications (e.g. loss of power to hospital life support systems). We use a domain model to capture such interdependencies between resources and needs. We represent these dependencies in an ontology that specifies the functional association between resources. Accurate interpretation of resource need/supply also depends on the location of a message. We show how inference based on a domain model combined with location detection and interpretation in the social data can enhance situational awareness, e.g., predicting a medical emergency before it is reported as critical.","cites":"0","conferencePercentile":"20.96774194"},{"venue":"WebSci","id":"07c42afa5ee520a146918aa9ee76a8eb51b00e00","venue_1":"WebSci","year":"2015","title":"Time to Introduce Myself!: Impact of Self-disclosure Timing of Newcomers in Online Discussion Forums","authors":"Di Lu, Rosta Farzan","author_ids":"3181515, 1899509","abstract":"Newcomers face various difficulties entering any communities and online forums are no exception. Due to the lack of familiarity and commitment to the group, newcomers are particularly sensitive to their early-on experiences in the forums. As a support mechanism to help newcomers blend into the group, online forums often encourage newcomers to introduce themselves upon joining the group. In this work we explored how the timing of these introduction influences newcomers' incorporation to the group. We found that providing introduction after some initial activities in the forum is associated with positive outcomes in terms of newcomers' contribution and commitment.","cites":"3","conferencePercentile":"96.96969697"},{"venue":"WebSci","id":"bc614ec8df9417676b817a95e34bee9216b8984f","venue_1":"WebSci","year":"2015","title":"Men eat on Mars, Women on Venus?: An Empirical Study of Food-Images","authors":"Claudia Wagner, Luca Maria Aiello","author_ids":"7942200, 2905635","abstract":"Culinary preferences contribute significantly to the sense of ourself [2]. While gender, race, sexuality and ethnicity describe our \"major identity\", preferences in music, style and food define our \"minor identity\". However, we find that only certain parts of them can be explained by gender-specific differences in the food consumption behavior, while other parts can be better explained by the media portrayal of food consumption.","cites":"1","conferencePercentile":"72.72727273"},{"venue":"WebSci","id":"9a648759b5f06c2b6816610148dbf9751c309ed4","venue_1":"WebSci","year":"2015","title":"Mining cross-cultural relations from Wikipedia - A study of 31 European food cultures","authors":"Paul Laufer, Claudia Wagner, Fabian Flöck, Markus Strohmaier","author_ids":"8263349, 7942200, 1724463, 1743043","abstract":"For many people, Wikipedia represents one of the primary sources of knowledge about foreign cultures. Yet, different Wikipedia language editions offer different descriptions of cultural practices. Unveiling diverging representations of cultures provides an important insight, since they may foster the formation of cross-cultural stereotypes, misunderstandings and potentially even conflict. In this work, we explore to what extent the descriptions of cultural practices in various European language editions of Wikipedia differ on the example of culinary practices and propose an approach to mine cultural relations between different language communities trough their description of and interest in their own and other communities' food culture. We assess the validity of the extracted relations using 1) various external reference data sources (i.e., the European Social Survey, migration statistics), 2) crowdsourcing methods and 3) simulations.","cites":"5","conferencePercentile":"100"},{"venue":"WebSci","id":"6a07be55da841aff5ef60fd92cf4fc81e521bbc5","venue_1":"WebSci","year":"2013","title":"The utility of social and topical factors in anticipating repliers in Twitter conversations","authors":"Johannes Schantl, Rene Kaiser, Claudia Wagner, Markus Strohmaier","author_ids":"1953664, 1721180, 7942200, 1743043","abstract":"Anticipating repliers in online conversations is a fundamental challenge for computer mediated communication systems which aim to make textual, audio and/or video communication as natural as face to face communication. The massive amounts of data that social media generates has facilitated the study of online conversations on a scale unimaginable a few years ago. In this work we use data from Twitter to explore the predictability of repliers, and investigate the factors which influence who will reply to a message. Our results suggest that social factors, which describe the strength of relations between users, are more useful than topical factors. This indicates that Twitter users' reply behavior is more impacted by social relations than by topics. Finally, we show that a binary classification model, which differentiates between users who will and users who will not reply to a certain message, may achieve an F1-score of 0.74 when using social features.","cites":"7","conferencePercentile":"76.31578947"},{"venue":"WebSci","id":"2093fd2bdf68bd9dcb9e8d3273c4eed4eb8d8d25","venue_1":"WebSci","year":"2015","title":"Digital Wildfires': a challenge to the governance of social media?","authors":"Helena Webb, Marina Jirotka, Bernd Carsten Stahl, William Housley, Adam Edwards, Matthew L. Williams, Rob Procter, Omer F. Rana, Pete Burnap","author_ids":"3373736, 1771117, 1792014, 2923143, 8663986, 1893703, 1695506, 1751264, 3098080","abstract":"The increasing popularity of social media platforms such as Facebook, Twitter, Instagram and Tumblr has been accompanied by concerns over the growing prevalence of 'harmful' online interactions. The term 'digital wildfire' has been coined to characterise the capacity for provocative content on social media to propagate rapidly and cause offline harm. The apparent risks posed by digital wildfires create questions over the suitable governance of digital social spaces. This paper provides an overview of some preliminary findings of an ongoing research project that seeks to build an empirically grounded methodology for the study and advancement of the responsible governance of social media.","cites":"0","conferencePercentile":"31.81818182"},{"venue":"WebSci","id":"2e6cf3c8d40c0dc22e4dda241ef22cc7c1d5467b","venue_1":"WebSci","year":"2016","title":"Understanding video-ad consumption on YouTube: a measurement study on user behavior, popularity, and content properties","authors":"Mariana Arantes, Flavio Figueiredo, Jussara M. Almeida","author_ids":"3393699, 1734617, 8118988","abstract":"Faced with the challenge of attracting user attention and revenue, social media websites have turned to video advertisements (video-ads). While in traditional media the video-ad market is mostly based on an interaction between content providers and marketers, the use of video-ads in social media has enabled a more complex interaction, that also includes content creator and viewer preferences. To better understand this novel setting, we present the first data-driven analysis of video-ad exhibitions on YouTube.","cites":"1","conferencePercentile":"87.82051282"},{"venue":"WebSci","id":"f1aabfd93c711ee11d48015798d5351c1f8abfea","venue_1":"WebSci","year":"2013","title":"Semantic tagging on historical maps","authors":"Bernhard Haslhofer, Werner Robitza, François Guimbretière, Carl Lagoze","author_ids":"1679379, 2334038, 2539134, 1692450","abstract":"Tags assigned by users to shared content can be ambiguous. As a possible solution, we propose <i>semantic tagging</i> as a collaborative process in which a user selects and associates Web resources drawn from a knowledge context. We applied this general technique in the specific context of online historical maps and allowed users to annotate and tag them. To study the effects of semantic tagging on tag production, the types and categories of obtained tags, and user task load, we conducted an in-lab within-subject experiment with 24 participants who annotated and tagged two distinct maps. We found that the semantic tagging implementation does not affect these parameters, while providing tagging relationships to well-defined concept definitions. Compared to label-based tagging, our technique also gathers positive and negative tagging relationships. We believe that our findings carry implications for designers who want to adopt semantic tagging in other contexts and systems on the Web.","cites":"2","conferencePercentile":"41.22807018"},{"venue":"WebSci","id":"b8f013f6e0300babf103b5bcfba318c3a3f292e3","venue_1":"WebSci","year":"2014","title":"How \"big vs\" dominate chinese microblog: a comparison of verified and unverified users on sina weibo","authors":"Ning Wang, James She, Junting Chen","author_ids":"1692369, 1913358, 3353537","abstract":"Sina Weibo has become the most popular microblogging platform in the Chinese-speaking community. Verification scheme is a distinctive element of Weibo with an aim to help the public to identify genuine accounts and select trustworthy information sources. Verified users are also known as \"Big Vs\", who are identified by a verification badge, a capitalised letter \"V\" added alongside account name. By comparing statistical characteristics of both verified and unverified users, this paper presents that a minority of verified users are largely consider as influentials, who tend to be more central in the networks and play vital roles in keeping connectivity as well as network robustness. Although the verification scheme is likely to draw more users to become influentials, user behaviours are still considerably more influenced by user roles rather than by verification scheme.","cites":"1","conferencePercentile":"49.19354839"},{"venue":"WebSci","id":"47c73257b2ddeeebdac9e10fad2277fe2066f7ce","venue_1":"WebSci","year":"2014","title":"Multimodal communication on tumblr: \"i have so many feels!\"","authors":"Elli Bourlai, Susan C. Herring","author_ids":"3325344, 2961462","abstract":"We manually analyzed a corpus of Tumblr posts for sentiment, looking at images, text, and their combination. A dataset was constructed of posts with both text and images, as well as a dataset of posts containing only text, along with a codebook for classifying and counting the content in each. This paper reports on the construction of the overall corpus and the codebook, and presents the results of a preliminary analysis that focuses on emotion. Posts containing images expressed more emotion, more intense emotion, and were more positive in valence than posts containing only text. The study contributes a micro-level analysis of multimodal communication in a social media platform, as well as a gold standard corpus that can be used to train learning algorithms to identify sentiment in multimodal Tumblr data.","cites":"2","conferencePercentile":"63.70967742"},{"venue":"WebSci","id":"6f4b00783bd55d4cd3912b64737d9e426438a0e6","venue_1":"WebSci","year":"2014","title":"The new blocs on the block: using community forums to foster new neighbourhoods","authors":"Elizabeth M. Daly, Dominik Dahlem, Daniele Quercia","author_ids":"3315498, 2679426, 1757126","abstract":"Research has consistently shown that online tools increase social capital. In the context of neighbourhoods Hampton and Wellman have shown that in newly developed areas residents effectively used mailing lists to connect with each other, circulate information, and ask for help. The research question of whether similar findings would hold in the larger context of a city for a long period of time is still open. To tackle this research question, we have gathered the complete dataset of the most popular neighbourhood online forum in Dublin. In this dataset, we have people sharing a common purpose (blocs) who live in the same neighbourhood and interact online to ask for help, engage in local activities, and, more generally, have a better understanding of their physical community. Our analysis highlights the particularly concentrated usage in newly established developments where a pre-existing community may be absent. Additionally, these communications provide a valuable resource to understand local issues relevant to the community.","cites":"1","conferencePercentile":"49.19354839"},{"venue":"WebSci","id":"4e6711135963e5dad37e75ced83062ae33d7acbc","venue_1":"WebSci","year":"2015","title":"Wikipedia Page View Reflects Web Search Trend","authors":"Mitsuo Yoshida, Yuki Arase, Takaaki Tsunoda, Mikio Yamamoto","author_ids":"2833811, 3043844, 2771110, 2191153","abstract":"The frequency of a web search keyword generally reflects the degree of public interest in a particular subject matter. Search logs are therefore useful resources for trend analysis. However, access to search logs is typically restricted to search engine providers. In this paper, we investigate whether search frequency can be estimated from a different resource such as Wikipedia page views of open data. We found frequently searched keywords to have remarkably high correlations with Wikipedia page views. This suggests that Wikipedia page views can be an effective tool for determining popular global web search trends.","cites":"3","conferencePercentile":"96.96969697"},{"venue":"WebSci","id":"82f6d1b8f6a7bce9d9ce04b746713854a0877c46","venue_1":"WebSci","year":"2012","title":"Crowd IQ: measuring the intelligence of crowdsourcing platforms","authors":"Michal Kosinski, Yoram Bachrach, Gjergji Kasneci, Jurgen Van Gael, Thore Graepel","author_ids":"2835380, 1698412, 1686448, 1689857, 1686971","abstract":"We measure crowdsourcing performance based on a standard IQ questionnaire, and examine Amazon's Mechanical Turk (AMT) performance under different conditions. These include variations of the payment amount offered, the way incorrect responses affect workers' reputations, threshold reputation scores of participating AMT workers, and the number of workers per task. We show that crowds composed of workers of high reputation achieve higher performance than low reputation crowds, and the effect of the amount of payment is non-monotone---both paying too much and too little affects performance. Furthermore, higher performance is achieved when the task is designed such that incorrect responses can decrease workers' reputation scores. Using majority vote to aggregate multiple responses to the same task can significantly improve performance, which can be further boosted by dynamically allocating workers to tasks in order to break ties.","cites":"15","conferencePercentile":"86.95652174"},{"venue":"WebSci","id":"fd2d0b34c4e52d6ab86fae4280759980dc041ac7","venue_1":"WebSci","year":"2016","title":"The social ties of immigrant communities in the United States","authors":"Amac Herdagdelen, Bogdan State, Lada A. Adamic, Winter Mason","author_ids":"2642122, 2632078, 1778398, 8742260","abstract":"Moving to a new country can be difficult, but relationships made there can ease the integration into the new environment. The social ties can be formed with different groups: compatriots from their home country, people originally from their new country (locals), and also immigrants from other countries. Yet very little research on immigration has addressed this important aspect, primarily because large-scale studies of social networks are impractical using traditional methods such as surveys. In this study we provide the first comprehensive view into the composition of immigrants' social networks in the United States using data from the social networking site Facebook. We measure the integration of immigrant populations through the structure of friendship ties, and contrast it with the spatial density of immigrant communities. Beyond friendships with compatriots and locals, we look at friendships between immigrant groups, deriving a map of cultural friendship affinities.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"3bccdb7380132c86f16e80168e6e34bf4738a2f6","venue_1":"WebSci","year":"2013","title":"Don't worry, be happy: the geography of happiness on Facebook","authors":"Daniele Quercia","author_ids":"1757126","abstract":"Social media sites have been used to track the expression of emotion words across nations. A question left unexplored is whether, at a similar scale, these sites can be used to collect reliable well-being data. To tackle this question, we collect Satisfaction With Life (<i>SWL</i>) test results from a Facebook application and show that aggregate country-level results significantly vary across twelve rich countries and strongly correlate with official well-being scores. To then show that collecting data on Facebook offers an informative look at the sociology of well-being, we study the impact of (un)happiness on the twelve countries by relating the test results on Facebook to reputable international indicators of social and health problems. We find that countries where happiness is lower have increased problems across the board: decreasing well-being is associated with increasing homicide, obesity, drug use, mental illness, and anxiety. In addition to offering these findings, this work hints at the conditions under which social media could be used for data-driven social science research.","cites":"4","conferencePercentile":"61.40350877"},{"venue":"WebSci","id":"02846a937dde14fbdbe5e1a2604499f844444aaa","venue_1":"WebSci","year":"2013","title":"Why individuals seek diverse opinions (or why they don't)","authors":"Jisun An, Daniele Quercia, Jon Crowcroft","author_ids":"1782067, 1757126, 1726850","abstract":"Fact checking has been hard enough to do in traditional settings, but, as news consumption is moving on the Internet and sources multiply, it is almost unmanageable. To solve this problem, researchers have created applications that expose people to diverse opinions and, as a result, expose them to balanced information. The wisdom of this solution is, however, placed in doubt by this paper. Survey responses of 60 individuals in the UK and South Korea and in-depth structured interviews of 10 respondents suggest that exposure to diverse opinions would not always work. That is partly because not all individuals equally value opinion diversity, and mainly because the same individual benefits from it only at times. We find that whether one looks for diverse opinions largely depends on three factors--one's prior convictions, emotional state, and social context.","cites":"5","conferencePercentile":"69.29824561"},{"venue":"WebSci","id":"0fa7023fe2e61b96cbb82011c467620807e031cf","venue_1":"WebSci","year":"2012","title":"Loosing \"friends\" on Facebook","authors":"Daniele Quercia, Mansoureh Bodaghi, Jon Crowcroft","author_ids":"1757126, 2594525, 1726850","abstract":"Recent analyses of self-reported data (mainly survey data) seem to suggest that social rules for ending relationships are transformed on Facebook. There seem to be a radical difference between offline and online worlds: reasons for ending online relationships are different than those for ending offline ones. These preliminary findings are, however, not supported by any quantitative evidence, and that is why we put them to test. We consider a variety of factors (e.g., age, gender, personality traits) that studies in sociology have found to be associated with friendship dissolution in the real world and study whether these factors are still important in the context of Facebook. Upon analyzing 34,012 Facebook relationships, we found that, on average, a relationship is more likely to break if it is not embedded in the same social circle, if it is between two people whose ages differ, and if one of the two is neurotic or introvert. Interestingly, we also found that a relationship with a common female friend is more robust than that with a common male friend. These findings are in line with previous analyses of another popular social-networking platform, that of Twitter. All this goes to suggest that there is not much difference between offline and online worlds and, given this predictability, one could easily build tools for monitoring online relations.","cites":"12","conferencePercentile":"80.43478261"},{"venue":"WebSci","id":"eb35f54e1943e5b5bdcfe22030604e0dd4b356b8","venue_1":"WebSci","year":"2012","title":"TweetLDA: supervised topic classification and link prediction in Twitter","authors":"Daniele Quercia, Harry Askham, Jon Crowcroft","author_ids":"1757126, 2792386, 1726850","abstract":"<i>L-LDA</i> is a new supervised topic model for assigning \"topics\" to a collection of documents (e.g., Twitter profiles). User studies have shown that <i>L-LDA</i> effectively performs a variety of tasks in Twitter that include not only assigning topics to profiles, but also re-ranking feeds, and suggesting new users to follow. Building upon these promising qualitative results, we here run an extensive quantitative evaluation of <i>L-LDA</i>. We test the extent to which, compared to the competitive baseline of Support Vector Machines (<i>SVM</i>), <i>L-LDA</i> is effective at two tasks: 1) assigning the correct topics to profiles; and 2) measuring the similarity of a profile pair. We find that <i>L-LDA</i> generally performs as well as <i>SVM</i>, and it clearly outperforms <i>SVM</i> when training data is limited, making it an ideal classification technique for infrequent topics and for (short) profiles of moderately active users. We have also built a web application that uses <i>L-LDA</i> to classify any given profile and graphically map predominant topics in specific geographic regions.","cites":"27","conferencePercentile":"93.47826087"},{"venue":"WebSci","id":"934b1309a5ee24de555c53e7321ce013e577e3cf","venue_1":"WebSci","year":"2012","title":"Web supported emplotment: using object and event descriptions to facilitate storytelling online and in galleries","authors":"Trevor D. Collins, Paul Mulholland, Annika Wolff","author_ids":"1722711, 1715412, 1701595","abstract":"The process of emplotment refers to the selection of significant events in a story and the identification of pertinent relations between them, in order to produce a plot providing an interpretation of those events. We are investigating how models of emplotment can be applied to develop web-based tools for creating and interpreting narratives. In particular, we are focusing on the process undertaken by art gallery professionals to design and present exhibitions. This paper presents a set of plot relations developed in collaboration with museum professionals from two national galleries in Ireland, and shows how theories of narrative and digital cultural heritage research have informed the development of an ontology and system to support the authoring of curatorial narratives.","cites":"2","conferencePercentile":"25"},{"venue":"WebSci","id":"70c84128b7fad8ba5099d9a75c563548edf9cfc5","venue_1":"WebSci","year":"2012","title":"You are where you e-mail: using e-mail data to estimate international migration rates","authors":"Emilio Zagheni, Ingmar Weber","author_ids":"2140221, 1684687","abstract":"International migration is one of the major determinants of demographic change. Although efforts to produce comparable statistics are underway, estimates of demographic flows are inexistent, outdated, or largely inconsistent, for most countries. We estimate age and gender-specific migration rates using data extracted from a large sample of Yahoo! e-mail messages. Self-reported age and gender of anonymized e-mail users were linked to the geographic locations (mapped from IP addresses) from where users sent e-mail messages over time (2009-2011). The users' country of residence over time was inferred as the one from where most e-mail messages were sent. Our estimates of age profiles of migration are qualitatively consistent with existing administrative data sources. Selection bias generates uncertainty for estimates at one point in time, especially for developing countries. However, our approach allows us to compare in a reliable way migration trends of females and males. We document the recent increase in human mobility and we observe that female mobility has been increasing at a faster pace. Our findings suggest that e-mail data may complement existing migration data, resolve inconsistencies arising from different definitions of migration, and provide new and rich information on mobility patterns and social networks of migrants. The use of digital records for demographic research has the potential to become particularly important for developing countries, where the diffusion of Internet will be faster than the development of mature demographic registration systems.","cites":"11","conferencePercentile":"75"},{"venue":"WebSci","id":"963d97acaccbb4b62178822358f2df86e70cb531","venue_1":"WebSci","year":"2013","title":"Why don't we trust health websites that help us help each other?: an analysis of online peer-to-peer healthcare","authors":"Elizabeth Sillence, Claire Hardy, Pamela Briggs","author_ids":"2991771, 3208980, 1866129","abstract":"Shared patient experience (PEx) has become common on the medical Internet and is a potentially valuable source of health information and advice, but little is known about how we choose to incorporate PEx in our information gathering and health decision-making. An online questionnaire revealed a paradox: patients like PEx and are drawn to sites containing PEx, but are then less likely to trust the information and advice they find there. Subsequent analysis suggests that this paradox may be related to the prevalence of advertising as a funding-model for online patient communities. To better understand these issues we explored one health domain (smoking cessation) in greater depth, inviting participants to search for relevant material and then discuss the different kinds of patient experience they found online. We report on the selection and rejection factors involved in choosing sites containing PEx and explore the notion of credible design in this space.","cites":"3","conferencePercentile":"53.50877193"},{"venue":"WebSci","id":"7dffa56366440bb9fa7eb9e836af2bfd9dfaef23","venue_1":"WebSci","year":"2011","title":"Visualising the past: annotating a life with linked open data","authors":"Ashley Smith, Kieron O'Hara, Paul Lewis","author_ids":"2085715, 1800173, 7499110","abstract":"This paper introduces a novel lifelogging system. The novelty of our system is that it uses open linked data to reduce the burden on the user to an absolute minimum by combining the user's private logs with data obtained automatically from the web. This in turn is annotated with data generated by the latest version of the author's portable 'life annotation' software to generate a detailed, interactive, user-friendly visual representation of the user's life experiences with little or no manual work required. This paper covers several key parts of the system that make it work. Specifically, the analysis of linked data, entity comparison with known objects and events from the user's own logs in order to determine relevance, and careful annotation of the user's data ensuring that the data's provenance is stored alongside the annotations generated.","cites":"4","conferencePercentile":"57.14285714"},{"venue":"WebSci","id":"d3d0125fad26b360db7877b5584e854be0e49fcb","venue_1":"WebSci","year":"2014","title":"Country-level spatial dynamics of user activity: a case study in location-based social networks","authors":"Anh Le, Konstantinos Pelechrinis, Prashant Krishnamurthy","author_ids":"2883794, 2096978, 3220609","abstract":"Identifying and understanding the emerging patterns in user activity is an important step in designing and developing features for online social networks. With the explosive growth of user-generated data in such networks, the recorded user activities are no more sparse snapshots but are close to a live reflection of real life. This allows us to extract patterns which are tied to the time and space context of real life activity from such recorded data. In this work, we analyze two rich datasets obtained from two major location-based social networks (Foursquare and Gowalla) and show how users change their activity patterns depending on the country they currently reside on. We also compare activity patterns between foreign users from different countries and local users. The detailed results may not automatically generalize but this kind of analysis can be repeated on different datasets and the outcomes of such analyses can benefit social and behavioral scientists as well as designers of online social media.","cites":"1","conferencePercentile":"49.19354839"},{"venue":"WebSci","id":"4cae1a8a684f85f81319da93ec47eb6554f004d0","venue_1":"WebSci","year":"2014","title":"Quantifying cross-platform engagement through large-scale user alignment","authors":"Jiejun Xu, Tsai-Ching Lu, Ryan Compton, David Allen","author_ids":"1684988, 1692592, 2230514, 6856457","abstract":"As online social media becomes prevalent as part of our daily life, it is increasingly common for a user to have accounts on multiple social media platforms. In this work, we present our findings on quantifying the extent of user engagement of different platforms as well as their correlations. The study is conducted based on a large-scale user alignment on 6 major social media platforms. Specifically, we identify both explicit and implicit mentions of social media accounts from the Twitter Decahose stream over a period of 22 months. During the process, we have aligned a total of 21,456,808 Twitter users to their alternative accounts on different platforms. Subsequently, we extract the number of overlapping users between any combination of these social media platforms exhaustively.","cites":"2","conferencePercentile":"63.70967742"},{"venue":"WebSci","id":"96ab8bc0ccb739f9ceb7fe64e5a03b15ad7fba9b","venue_1":"WebSci","year":"2012","title":"Mixing methods and theory to explore web activity","authors":"Ramine Tinati, Susan Halford, Les Carr, Catherine Pope","author_ids":"2050678, 2020931, 1727183, 2964305","abstract":"Web Science is now well recognized as an interdisciplinary field, drawing on research from the computational, natural and social sciences. These disciplines bring diverse theoretical and methodological approaches, providing alternative perspectives and insight into Web activity. Consequently, Web Science faces the challenge of developing research methods that transcend disciplines, not least in dealing with the epistemological tensions between different methodological approaches. As a start, this paper argues that, a mixed methods approach is required. To demonstrate the affordances of this, the activities of the UK Open Government Data community are analyzed by combining quantitative computational science techniques with qualitative social science methods underpinned by social theory. This provides a richer and more detailed analysis than either approach alone could offer and one which enables us to apprehend the Web as a complex socio-technical phenomenon.","cites":"2","conferencePercentile":"25"},{"venue":"WebSci","id":"f134cb8477e97ce9954bdf577b1b13949a6d9f8d","venue_1":"WebSci","year":"2016","title":"Can we predict eat-out preference of a person from tweets?","authors":"Md. Mahabur Rahman, Md Taksir Hasan Majumder, Md. Saddam Hossain Mukta, Mohammed Eunus Ali, Jalal Mahmud","author_ids":"3403683, 3404444, 1806836, 2532195, 1748477","abstract":"Twitter, a microblogging site, has become a major platform of communication of users on the web. Recently, location based social networking sites such as Foursquare have become popular which enable users to publish their visited places through check-ins. In this paper, we present a study of users' eat-out preferences who share their Foursquare restaurant check-ins through Twitter. Our study reveals a strong correlation of a user's eat-out preference and the linguistic features of her tweets, i.e., word use. Hence, our proposed model enables one to predict a user's eat-out preference from her word-use in Twitter.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"856a9c10b80c17a8f097e2e90fe1ffb835d03182","venue_1":"WebSci","year":"2014","title":"Challenging social media analytics: web science perspectives","authors":"Ramine Tinati, Olivier Phillipe, Catherine Pope, Les Carr, Susan Halford","author_ids":"2050678, 2125462, 2964305, 1727183, 2020931","abstract":"In this paper we outline some of the challenges for social media analytics and -- at the same time - challenge existing approaches to social media analysis. Specifically, we suggest that there is an unhelpful gulf between social scientific approaches, which offer rich theoretical and methodological understandings of the social; and computational approaches which offer sophisticated methods for data harvesting, interrogation and modelling. Brought together these approaches might meet the challenges facing social media analytics and produce a different order of understanding. We offer two preliminary examples of this synthesis in practice: first, we show how established computational tools might be harnessed to address theoretically grounded empirical questions about the social; and second we consider social theories might inspire the development of new methodological tools for social media analytics. In doing so, we aim to contribute to the development of interdisciplinary social media analytics with in a broader framework of Web Science.","cites":"0","conferencePercentile":"20.96774194"},{"venue":"WebSci","id":"704aa18698eab94fbd7969ae201739ecdb1f9a31","venue_1":"WebSci","year":"2015","title":"Ranking Buildings and Mining the Web for Popular Architectural Patterns","authors":"Ujwal Gadiraju, Stefan Dietze, Ernesto Diaz-Aviles","author_ids":"2516584, 3081683, 1774930","abstract":"Knowledge about the reception of architectural structures is crucial for architects and urban planners. Yet obtaining such information has been a challenging and costly activity. However, with the advent of the Web, a vast amount of structured and unstructured data describing architectural structures has become available publicly. This includes information about the perception and use of buildings (for instance, through social media), and structured information about the building's features and characteristics (for instance, through public Linked Data). Hence, first mining (i) the popularity of buildings from the social Web and (ii) then correlating such rankings with certain features of buildings, can provide an efficient method to identify successful architectural patterns. In this paper we propose an approach to rank buildings through the automated mining of Flickr metadata. By further correlating such rankings with building properties described in Linked Data we are able to identify popular patterns for particular building types (airports, bridges, churches, halls, and skyscrapers). Our approach combines crowdsourcing with Web mining techniques to establish influential factors, as well as ground truth to evaluate our rankings. Our extensive experimental results depict that methods tailored to specific structure types allow an accurate measurement of their public perception.","cites":"1","conferencePercentile":"72.72727273"},{"venue":"WebSci","id":"d4c9710553c9bf8705e659adc0b3f49ec7cb5467","venue_1":"WebSci","year":"2016","title":"Estimating domain specificity for effective crowdsourcing of link prediction and schema mapping","authors":"Ujwal Gadiraju, Patrick Siehndel, Stefan Dietze","author_ids":"2516584, 1743694, 3081683","abstract":"Crowdsourcing has been widely adopted in research and practice over the last decade. In this work, we first investigate the extent to which crowd workers can substitute expert-based judgments in the task of link prediction and schema mapping, which is the creation of explicit links between resources on the Semantic Web at the instance and schema level. This is important since human input is required to evaluate and improve automated approaches for these tasks. We present a novel method to assess the inherent specificity of the link prediction task, and the impact of task specificity on quality of the results. We propose a Wikipedia-based mechanism to estimate specificity and show the influence of concept familiarity in producing high quality link prediction. Our findings indicate that the effectiveness of crowdsourcing the task of link prediction can improve by estimating the specificity.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"6aa7110eecfe717501d900333005115287452867","venue_1":"WebSci","year":"2015","title":"Taming a Menagerie of Heavy Tails with Skew Path Analysis","authors":"Joshua Introne, Sean P. Goggins","author_ids":"2325832, 1682547","abstract":"The discovery of stable, heavy-tailed distributions of activity on the web has inspired many researchers to search for simple mechanisms that can cut through the complexity of countless social interactions to yield powerful new theories about human behavior. A dominant mode of investigation involves fitting a mathematical model to an observed distribution, and then inferring the behaviors that generate the modeled distribution. Yet, distributions of activity are not always stable, and the process of fitting a mathematical model to empirical distributions can be highly uncertain, especially for smaller and highly variable datasets.\n In this paper, we introduce an approach called skew-path analysis, which measures how concentrated information production is along different dimensions in community-generated data. The approach scales from small to large datasets, and is suitable for investigating the dynamics of online behavior. We offer a preliminary demonstration of the approach by using it to analyze six years of data from an online health community, and show that the technique offers interesting insights into the dynamics of information production. In particular, we find evidence for two distinct point attractors within a subset of the forums analyzed, demonstrating the utility of the approach.","cites":"0","conferencePercentile":"31.81818182"},{"venue":"WebSci","id":"5ee42833218f309e8f90138735f6ca60f55d2ff9","venue_1":"WebSci","year":"2016","title":"Reconceptualizing imitation in social tagging: a reflective search model of human web interaction","authors":"Paul Seitlinger, Tobias Ley","author_ids":"1800363, 1790612","abstract":"We analyze psychological dynamics of human-Web interaction exemplified by social tagging. Whereas previous models assumed tagging was driven by individual knowledge and social imitation, we introduce a reflective search framework that assumes user behavior (e.g., exploration and tagging of web resources) to arise from an iterative search of human memory shaped continuously by past and present learning episodes. We formalize this framework by means of a mathematical model of search of human memory which interrelates episodic and semantic memory processes. This allows us to simulate both temporal macro dynamics (stabilization of tag distribution) and underlying temporal micro dynamics (reflecting and tagging a resource). While the former are well covered by previous models, these models are not able to explain the latter. We claim that shifting away from imitation to reflective search holds great potential for understanding and designing human web interaction more generally, and to validate models of human memory in large-scale web environments.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"bf1e284689a4663a405cc309be2c4d501193f4e5","venue_1":"WebSci","year":"2016","title":"Teens are from mars, adults are from venus: analyzing and predicting age groups with behavioral characteristics in instagram","authors":"Kyungsik Han, Sanghack Lee, Jin Yea Jang, Yong Jung, Dongwon Lee","author_ids":"3316692, 3151746, 1835709, 7211784, 1784227","abstract":"We present behavioral characteristics of teens and adults in Instagram and prediction of them from their behaviors. Based on two independently created datasets from user profiles and tags, we identify teens and adults, and carry out comparative analyses on their online behaviors. Our study reveals: (1) significant behavioral differences between two age groups; (2) the empirical evidence of classifying teens and adults with up to 82% accuracy, using traditional predictive models, while two baseline methods achieve 68% at best; and (3) the robustness of our models by achieving 76%---81% when tested against an independent dataset obtained without using user profiles or tags. Our datasets are available at: https://goo.gl/LqTYNv","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"c346604f0468347b79d820ee02b9951306ade34f","venue_1":"WebSci","year":"2014","title":"Motivating online engagement and debates on energy consumption","authors":"Lara Schibelsky G. Piccolo, Harith Alani, Anna De Liddo, Maria Cecília Calani Baranauskas","author_ids":"2359298, 2798006, 2654388, 3277372","abstract":"Several studies and official reports argue that changing people's behavior towards energy consumption is a vital part of our fight against climate change. Engaging people into this issue is the first step towards a social change. However, it has been shown that information campaigns and technology alone are insufficient to achieve such engagement. Understanding what motivate people, in which contexts and combinations, and for which individuals, is therefore key to engaging the public more successfully in such crucial debates. This work investigates the role and impact of motivational strategies on promoting engagement in online energy debates. We report our results from running an experiment in the workplace, in which 33 people contributed to an online discussion on reducing energy consumption. A public and tangible feedback of contributions to the online debate, as well as social comparison and competition were analyzed as motivational strategies. Our results point out that engagement goes beyond intrinsic motivation, and that a set of interplaying factors influenced by the social context was found to be the stronger motivational force of engagement.","cites":"5","conferencePercentile":"80.64516129"},{"venue":"WebSci","id":"825d7b04d4255832f1cefe5be9143332a1030335","venue_1":"WebSci","year":"2014","title":"Crowdsourcing knowledge-intensive tasks in cultural heritage","authors":"Jasper Oosterman, Archana Nottamkandath, Chris Dijkshoorn, Alessandro Bozzon, Geert-Jan Houben, Lora Aroyo","author_ids":"2828604, 2233668, 2865549, 1710630, 1703821, 1745337","abstract":"Large datasets such as Cultural Heritage collections require detailed annotations when digitised and made available online. Annotating different aspects of such collections requires a variety of knowledge and expertise which is not always possessed by the collection curators. Artwork annotation is an example of a knowledge intensive image annotation task, i.e. a task that demands annotators to have domain-specific knowledge in order to be successfully completed.\n This paper describes the results of a study aimed at investigating the applicability of crowdsourcing techniques to knowledge intensive image annotation tasks. We observed a clear relationship between the annotation difficulty of an image, in terms of number of items to identify and annotate, and the performance of the recruited workers.","cites":"4","conferencePercentile":"75"},{"venue":"WebSci","id":"a3cf985f010c5ef72abdc9b8007578a98535fb64","venue_1":"WebSci","year":"2016","title":"Using social media to reveal social and collective perspectives on music","authors":"Deniz Iren, Cynthia C. S. Liem, Jie Yang, Alessandro Bozzon","author_ids":"1778890, 1968667, 1690374, 1710630","abstract":"How can social media be used to reveal latent social and collective perspectives on music? Our work addresses this question by introducing a Twitter dataset surrounding the Top 2000, a yearly national broadcasting event in The Netherlands. The Top 2000 is recognised as a valuable case study into the role of music as a social nostalgia-inducing phenomenon, triggering collective and autobiographical memories. Our dataset, containing enriched Twitter information over the Top 2000 voting and broadcasting timeline in 2015, demonstrates how the broad audience support of the event enables data-oriented studies of the public response to and public significance of the aired songs.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"8054c7c863f38ba861b867a464c09f944c038786","venue_1":"WebSci","year":"2013","title":"Collabmap: crowdsourcing maps for emergency planning","authors":"Sarvapali D. Ramchurn, Trung Dong Huynh, Matteo Venanzi, Bing Shi","author_ids":"1805612, 1791030, 2789322, 3336308","abstract":"In this paper, we present a software tool to help emergency planners at Hampshire County Council in the UK to create maps for high-fidelity crowd simulations that require evacuation routes from buildings to roads. The main feature of the system is a crowdsourcing mechanism that breaks down the problem of creating evacuation routes into microtasks that a contributor to the platform can execute in less than a minute. As part of the mechanism we developed a concensus-based trust mechanism that filters out incorrect contributions and ensures that the individual tasks are complete and correct. To drive people to contribute to the platform, we experimented with different incentive mechanisms and applied these over different time scales, the aim being to evaluate what incentives work with different types of crowds, including anonymous contributors from Amazon Mechanical Turk. The results of the 'in the wild' deployment of the system show that the system is effective at engaging contributors to perform tasks correctly and that users respond to incentives in different ways. More specifically, we show that purely social motives are not good enough to attract a large number of contributors and that contributors are averse to the uncertainty in winning rewards. When taken altogether, our results suggest that a combination of incentives may be the best approach to harnessing the maximum number of resources to get socially valuable tasks (such for planning applications) performed on a large scale.","cites":"9","conferencePercentile":"82.45614035"},{"venue":"WebSci","id":"699e43009f798946f5cda686d90f30cc156b28fd","venue_1":"WebSci","year":"2014","title":"Detecting and forecasting domestic political crises: a graph-based approach","authors":"Yaser Keneshloo, Jose Cadena, Gizem Korkmaz, Naren Ramakrishnan","author_ids":"2180949, 2855367, 2387439, 1755938","abstract":"Forecasting a domestic political crisis (DPC) in a country of interest is a very useful tool for social scientists and policy makers. A wealth of event data is now available for historical as well as prospective analysis. Using the publicly available GDELT dataset, we illustrate the use of frequent subgraph mining to identify signatures preceding DPCs, and the predictive utility of these signatures through both qualitative and quantitative results.","cites":"5","conferencePercentile":"80.64516129"},{"venue":"WebSci","id":"a349aca266f06f68e51975d84393cc27bd6e6b69","venue_1":"WebSci","year":"2012","title":"The configuration of networked publics on the web: evidence from the Greek Indignados movement","authors":"Xuesong Lu, Giorgos Cheliotis, Xiyue Cao, Yi Song, Stéphane Bressan","author_ids":"1792406, 3023172, 2511256, 1791825, 1735321","abstract":"The Internet, and social media in particular, are frequently credited in public discourse with being instrumental for the development and coordination of various contemporary social movements. We examine the evolution of Facebook activity in relation to the movement of the Greek Indignados of 2011, by collecting the electronic traces of their public communications on Facebook pages for a period of 8 months. We analyze the resulting bipartite graphs consisting of users posting to pages, using social network analysis. We reveal some of the dynamics of structural properties of the network over time and explain what these mean for the configuration of networked publics on social network sites. We conclude that the very early stages of activity are essential in determining this configuration, because users converge quickly and exclusively on a small number of pages. When gradually activity is reduced, the reduction is strongest in the most active users and the most popular pages, but when activity resumes, users return to the same pages. We discuss implications for the organization of collective action on social network sites.","cites":"2","conferencePercentile":"25"},{"venue":"WebSci","id":"9b5db06b61a0954b5781bd8d89ef5c759f74c646","venue_1":"WebSci","year":"2012","title":"When daily deal services meet Twitter: understanding Twitter as a daily deal marketing platform","authors":"Jaimie Yejean Park, Chin-Wan Chung","author_ids":"3013402, 1733783","abstract":"Twitter, a microblogging service which enables users to build social networks and share information, has been recognized as a potentially powerful marketing platform. Daily deal service is one of the many types of businesses that leverage Twitter for marketing purpose; daily deal providers such as Groupon and LivingSocial are not only engaged in active interactions with their potential customers on Twitter but are also encouraging the customers to participate in advertising products through Twitter. Despite the recent surge of interest in studying Twitter as a medium of information diffusion, little is understood about the daily deal information sharing behavior on Twitter. In this research we pose following questions: what kind of daily deals are being talked about in Twitter, when, and how? In order to answer these questions we crawl and analyze a large-scale Twitter and Groupon data to understand the characteristics of the user-generated tweets containing the URL links to daily deals. We also examine the relationship between the sharing of tweets and the actual sales performance of the daily deal service based on the data collected from LivingSocial. We discover the demands of users reflected through Twitter and characterize the customers' information sharing patterns across Twitter. Further, we provide evidence that sharing daily deals on Twitter contributes to the improved sales performance. These findings shed light on the significance of Twitter as a marketing platform, providing key insights for businesses to consider in formulating social marketing strategies.","cites":"5","conferencePercentile":"42.39130435"},{"venue":"WebSci","id":"38c01d9b305101ffec6b73d4e2e2e36b500b4ab6","venue_1":"WebSci","year":"2015","title":"Linguistic influence patterns within the global network of Wikipedia language editions","authors":"Anna Samoilenko, Fariba Karimi, Jérôme Kunegis, Daniel Edler, Markus Strohmaier","author_ids":"2803839, 7873698, 1697769, 3379817, 1743043","abstract":"The Internet is highly multilingual, and its content is created, shared, debated and shaped within many different language-speaking communities. These communities do not exist in isolation, but communicate and influence each other's interests, just as in the offline world. Quantifying this influence is however a non-trivial task, as these communities are usually spread across multiple heterogeneous platforms. In this work, we set out to measure the influence of languages on each other by observing concept overlap between the 110 largest Wikipedia language editions. We describe experiments to test if language overlap in concept coverage is a random process, and find that edition size is a strong predictor of higher concept overlap, with English--German being the most frequently co-occurring pair (45%). Both small and large editions co-occur more frequently than expected with editions of similar size, but co-occurrences across groups are below what is expected by chance. Additionally, by applying network analysis, we find that the hierarchy of language interconnections differs depending on the locality of topics: for interlingually popular topics, the dominance of English, German and French is pronounced, while for topics with a local reach, geographical and cultural proximity as well as common heritage are better explanators of co-occurrence.","cites":"0","conferencePercentile":"31.81818182"},{"venue":"WebSci","id":"f26f91e3e722fc59e6f718876c4f9bd1f77f8b14","venue_1":"WebSci","year":"2016","title":"#ISISisNotIslam or #DeportAllMuslims?: predicting unspoken views","authors":"Walid Magdy, Kareem Darwish, Norah Abokhodair, Afshin Rahimi, Timothy Baldwin","author_ids":"1745226, 1680260, 1847907, 2953039, 8582835","abstract":"This paper examines the effect of online social network interactions on future attitudes. Specifically, we focus on how a person's online content and network dynamics can be used to predict future attitudes and stances in the aftermath of a major event. In this study, we focus on the attitudes of US Twitter users towards Islam and Muslims subsequent to the tragic Paris terrorist attacks that occurred on November 13, 2015. We quantitatively analyze 44K users' network interactions and historical tweets to predict their attitudes. We provide a description of the quantitative results based on the content (hashtags) and network interaction (retweets, replies, and mentions). We analyze two types of data: (1) we use post-event tweets to learn users' stated stances towards Muslims based on sampling methods and crowd-sourced annotations; and (2) we employ pre-event interactions on Twitter to build a classifier to predict post-event stances. We found that pre-event network interactions can predict someone' s attitudes towards Muslims with 82% macro F-measure, even in the absence of prior mentions of Islam, Muslims, or related terms.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"0ec3903d12be9e69a1bf64547d77fd8414ff7f35","venue_1":"WebSci","year":"2015","title":"Assembling thefacebook: Using Heterogeneity to Understand Online Social Network Assembly","authors":"Abigail Z. Jacobs, Samuel F. Way, Johan Ugander, Aaron Clauset","author_ids":"3307845, 1925560, 1760812, 1978989","abstract":"Online social networks represent a popular and diverse class of social media systems. Despite this variety, each of these systems undergoes a general process of online social network assembly, which represents the complicated and heterogeneous changes that transform newly born systems into mature platforms. However, little is known about this process. For example, how much of a network's assembly is driven by simple growth? How does a network's structure change as it matures? How does network structure vary with adoption rates and user heterogeneity, and do these properties play different roles at different points in the assembly? We investigate these and other questions using a unique dataset of online connections among the roughly one million users at the first 100 colleges admitted to Facebook, captured just 20 months after its launch. We first show that different vintages and adoption rates across this population of networks reveal temporal dynamics of the assembly process, and that assembly is only loosely related to network growth. We then exploit natural experiments embedded in this dataset and complementary data obtained via Internet archaeology to show that different subnetworks matured at different rates toward similar end states. These results shed light on the processes and patterns of online social network assembly, and may facilitate more effective design for online social systems.","cites":"2","conferencePercentile":"88.63636364"},{"venue":"WebSci","id":"4c89fd64a27bd081a5edb8528c16fec14567bdb1","venue_1":"WebSci","year":"2016","title":"Privacy and twitter in qatar: traditional values in the digital world","authors":"Norah Abokhodair, Sofiane Abbar, Sarah Vieweg, Yelena Mejova","author_ids":"1847907, 3009678, 3681090, 3329961","abstract":"We explore the meaning of \"privacy\" from the perspective of Qatari nationals as it manifests in digital environments. Although privacy is an essential and widely respected value in many cultures, the way in which it is understood and enacted depends on context. It is especially vital to understand user behaviors regarding privacy in the digital sphere, where individuals increasingly publish personal information. Our mixed-methods analysis of 18K Twitter posts that mention \"privacy\" focuses on the face-to-face and digital contexts in which privacy is mentioned, and how those contexts lead to varied ideologies regarding privacy. We find that in the Arab Gulf, the need for privacy is often supported by Quranic text, advice on how to protect privacy is frequently discussed, and the use of paternalistic language by men when discussing women's privacy is common. Above all, privacy is framed as a <i>communal</i> attribute, including not only the individual, but the behavior of those around them; it even extends beyond one's lifespan. We contribute an analysis and description of these previously unexplored interpretations of privacy, which play a role in how users navigate social media.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"0e3599d687726b14cdbc782490f78c95a2f0186c","venue_1":"WebSci","year":"2011","title":"Dengue surveillance based on a computational model of spatio-temporal locality of Twitter","authors":"Janaína Gomide, Adriano Veloso, Wagner Meira, Virgílio A. F. Almeida, Fabrício Benevenuto, Fernanda Ferraz, Mauro Teixeira","author_ids":"2460985, 1739417, 1691267, 7360316, 2810330, 3025023, 7993427","abstract":"Twitter is a unique social media channel, in the sense that users discuss and talk about the most diverse topics, including their health conditions. In this paper we analyze how Dengue epidemic is reflected on Twitter and to what extent that information can be used for the sake of surveillance. Dengue is a mosquito-borne infectious disease that is a leading cause of illness and death in tropical and subtropical regions, including Brazil. We propose an active surveillance methodology that is based on four dimensions: volume, location, time and public perception. First we explore the public perception dimension by performing sentiment analysis. This analysis enables us to filter out content that is not relevant for the sake of Dengue surveillance. Then, we verify the high correlation between the number of cases reported by official statistics and the number of tweets posted during the same time period (i.e., <i>R</i><sup>2</sup> = 0.9578). A clustering approach was used in order to exploit the spatio-temporal dimension, and the quality of the clusters obtained becomes evident when they are compared to official data (i.e., <i>RandIndex</i> = 0.8914). As an application, we propose a Dengue surveillance system that shows the evolution of the dengue situation reported in tweets, which is implemented in www.observatorio.inweb.org.br/dengue/.","cites":"37","conferencePercentile":"96.42857143"},{"venue":"WebSci","id":"f4bc132f4501e2c73646b4210d0d018cd1677f15","venue_1":"WebSci","year":"2014","title":"\"Supertagger\" behavior in building folksonomies","authors":"Jared Lorince, Sam Zorowitz, Jaimie Murdock, Peter M. Todd","author_ids":"2958080, 3255869, 2222418, 2336293","abstract":"A folksonomy is ostensibly an information structure built up by the \"wisdom of the crowds\", but is the \"crowd\" really doing the work? Tagging is in fact a sharply skewed process in which a small minority of users generate an overwhelming majority of the annotations. Using data from the social music site Last.fm as a case study, this paper explores the implications of this tagging imbalance. Partitioning the folksonomy into two halves - one created by the prolific minority and the other by the non-prolific majority of taggers - we examine the large-scale differences in these two sub-folksonomies and the users generating them, and then explore several possible accounts of what might be driving these differences. We find that prolific taggers preferentially annotate content in the long-tail of less popular items, use tags with higher information content, and show greater tagging expertise. These results indicate that \"supertaggers\" not only tag more than their counterparts, but in quantifiably different ways.","cites":"2","conferencePercentile":"63.70967742"},{"venue":"WebSci","id":"214eff45ec18eb45cfd5c7268f29911b46df97d7","venue_1":"WebSci","year":"2012","title":"Web science and human-computer interaction: when disciplines collide","authors":"Clare J. Hooper, Alan J. Dix","author_ids":"1866599, 1784351","abstract":"Web Science and Human-Computer Interaction (HCI) are interdisciplinary arenas concerned with the intersection of people and technology. After introducing the two disciplines we discuss overlaps and notable differences between them, covering subject matter, scope and methodology. Given the longer history of HCI, we identify and discuss some potential lessons that the Web Science community may be able to take from this field. These concern: the division between interpretivist and positivist approaches; methods and methodology; evaluation; and design focus and methods. In summary, this paper clarifies the relationship between the communities, signposting complementary aspects and ways in which they might collaborate in future.","cites":"3","conferencePercentile":"31.52173913"},{"venue":"WebSci","id":"4914c64682fa79e6209dfed139b1bb7c43b965a8","venue_1":"WebSci","year":"2013","title":"Can simple social copying heuristics explain tag popularity in a collaborative tagging system?","authors":"Jared Lorince, Peter M. Todd","author_ids":"2958080, 2336293","abstract":"While research on collaborative tagging systems has largely been the purview of computer scientists, the behavior of these systems is driven by the psychology of their users. Here we explore how simple models of boundedly rational human decision making may partly account for the high-level properties of a collaborative tagging environment, in particular with respect to the distribution of tags used across the folksonomy. We discuss several plausible heuristics people might employ to decide on tags to use for a given item, and then describe methods for testing evidence of such strategies in real collaborative tagging data. Using a large dataset of annotations collected from users of the social music website Last.fm with a novel crawling methodology (approximately one millions total users), we extract the parameters for our decision-making models from the data. We then describe a set of simple multi-agent simulations that test our heuristic models, and compare their results to the extracted parameters from the tagging dataset. Results indicate that simple social copying mechanisms can generate surprisingly good fits to the empirical data, with implications for the design and study of tagging systems.","cites":"7","conferencePercentile":"76.31578947"},{"venue":"WebSci","id":"f43a39bfea82d95fbde638f5dad0fedd0680752b","venue_1":"WebSci","year":"2014","title":"Rolling through tumblr: characterizing behavioral patterns of the microblogging platform","authors":"Jiejun Xu, Ryan Compton, Tsai-Ching Lu, David Allen","author_ids":"1684988, 2230514, 1692592, 6856457","abstract":"Tumblr, a microblogging platform and social media website, has been gaining popularity over the past few years. Despite its success, little has been studied on the human behavior and interaction on this platform. This is important as it sheds light on the driving force behind Tumblr's growth. In this work, we present a quantitative study of Tumblr based on the complete data coverage for four consecutive months consisting of 23.2 million users and 10.2 billion posts. We first explore various attributes of users, posts, and tags in detail and extract behavioral patterns based on the user generated content. We then construct a massive reblog network based on the primary user interactions on Tumblr and present findings on analyzing its topological structure and properties. Finally, we show substantial results on providing location-specific usage patterns from Tumblr, despite no built-in support for geo-tagging or user location functionality. Essentially this is done by conducting a large-scale user alignment with a different social media platform (e.g., Twitter) and subsequently propagating geo-information across platforms. To the best of our knowledge, this work is the first attempt to carry out large-scale measurement-driven analysis on Tumblr.","cites":"5","conferencePercentile":"80.64516129"},{"venue":"WebSci","id":"be0f118c66b782b53207eaceb4c1cd1be489c81b","venue_1":"WebSci","year":"2013","title":"An empirical analysis of characteristics of useful comments in social media","authors":"Elaheh Momeni, Gerhard Sageder","author_ids":"2563487, 1772958","abstract":"User-generated comments in online social media have recently attracted increasing attention with regard to the integration of end users' knowledge with the creation of new descriptive annotations for media resources (such as exploiting a comment written on a Flickr photo in order to create descriptive annotations for the photo). However, users have different levels of expertise and the content quality of comments varies from useful to useless. In this paper, we compare the characteristics of useful comments on different platforms (YouTube and Flickr) and we propose a method for inferring useful comments. We provide an analysis of the impact of different textual, semantic, and user features on the proposed inference method.","cites":"3","conferencePercentile":"53.50877193"},{"venue":"WebSci","id":"0db215825f9b4964dd5b8d06a27e35a64295f5d4","venue_1":"WebSci","year":"2011","title":"Towards a diversity-minded Wikipedia","authors":"Fabian Flöck, Denny Vrandecic, Elena Paslaru Bontas Simperl","author_ids":"1724463, 1808632, 2927032","abstract":"Wikipedia is a top-ten Web site providing a free encyclopedia created by an open community of volunteer contributors. As investigated in various studies over the past years, contributors have different backgrounds, mindsets and biases; however, the effects - positive and negative - of this diversity on the quality of the Wikipedia content, and on the sustainability of the overall project are yet only partially understood. In this paper we discuss these effects through an analysis of existing scholarly literature in the area and identify directions for future research and development; we also present an approach for diversity-minded content management within Wikipedia that combines techniques from semantic technologies, data and text mining and quantitative social dynamics analysis to create greater awareness of diversity-related issues within the Wikipedia community, give readers access to indicators and metrics to understand biases and their impact on the quality of Wikipedia articles, and support editors in achieving balanced versions of these articles that leverage the wealth of knowledge and perspectives inherent to large-scale collaboration.","cites":"8","conferencePercentile":"69.64285714"},{"venue":"WebSci","id":"5ebbadb6faf3ca0e4ad5a07ff50638ba0b19b1d3","venue_1":"WebSci","year":"2015","title":"How much is said in a microblog?: A multilingual inquiry based on Weibo and Twitter","authors":"Han-Teng Liao, King-wa Fu, Scott A. Hale","author_ids":"2696154, 2274410, 1801223","abstract":"This paper presents a multilingual study on, per single post of microblog text, (a) how much can be said, (b) how much is written in terms of characters and bytes, and (c) how much is said in terms of information content in posts by different organizations in different languages. Focusing on three different languages (English, Chinese, and Japanese), this research analyses Weibo and Twitter accounts of major embassies and news agencies. We first establish our criterion for quantifying \"how much can be said\" in a digital text based on the openly available Universal Declaration of Human Rights and the translated subtitles from TED talks. These parallel corpora allow us to determine the number of characters and bits needed to represent the same content in different languages and character encodings. We then derive the amount of information that is actually contained in microblog posts authored by selected accounts on Weibo and Twitter. Our results confirm that languages with larger character sets such as Chinese and Japanese contain more information per character than English, but the actual information content contained within a microblog text varies depending on both the type of organization and the language of the post. We conclude with a discussion on the design implications of microblog text limits for different languages.","cites":"1","conferencePercentile":"72.72727273"},{"venue":"WebSci","id":"7d5e793bee8632f80317090a736210b4a41ddcd1","venue_1":"WebSci","year":"2011","title":"Negotiating the web science curriculum through shared educational artefacts","authors":"Su White, Madalina Croitoru, Stéphane Bernard Bazan, Stefano A. Cerri, Hugh C. Davis, Raffaella Folgieri, Clement Jonquet, François Scharffe, Steffen Staab, Thanassis Tiropanis, Michalis Vafopoulos","author_ids":"1688840, 1775412, 1850962, 1728656, 1760621, 1808500, 1800186, 1713609, 1752093, 1726746, 1729065","abstract":"The far-reaching impact of the Web on society is widely recognised. The interdisciplinary study of this impact has crystallised in the field of study known as Web Science. However, defining an agreed, shared understanding of what constitutes web science requires complex negotiation and translations of understandings across component disciplines, national cultures and educational traditions. Some individual institutions have already established particular curricula, and discussions in the Web Science Curriculum Workshop series have marked the territory to some extent. This paper reports on a process being adopted across a consortium of partners to systematically create a shared understanding of what constitutes web science. It records and critiques the processes instantiated to agree a common curriculum, and presents a framework for future discussion and development.","cites":"4","conferencePercentile":"57.14285714"},{"venue":"WebSci","id":"01de5057bc78667a40a83c2bce87649e0a4b1692","venue_1":"WebSci","year":"2012","title":"Recipe recommendation using ingredient networks","authors":"ChunYuen Teng, Yu-Ru Lin, Lada A. Adamic","author_ids":"2444631, 2133006, 1778398","abstract":"The recording and sharing of cooking recipes, a human activity dating back thousands of years, naturally became an early and prominent social use of the web. The resulting online recipe collections are repositories of ingredient combinations and cooking methods whose large-scale and variety yield interesting insights about both the fundamentals of cooking and user preferences. At the level of an individual ingredient we measure whether it tends to be essential or can be dropped or added, and whether its quantity can be modified. We also construct two types of networks to capture the relationships between ingredients. The complement network captures which ingredients tend to co-occur frequently, and is composed of two large communities: one savory, the other sweet. The substitute network, derived from user-generated suggestions for modifications, can be decomposed into many communities of functionally equivalent ingredients, and captures users' preference for healthier variants of a recipe. Our experiments reveal that recipe ratings can be well predicted with features derived from combinations of ingredient networks and nutrition information.","cites":"29","conferencePercentile":"95.65217391"},{"venue":"WebSci","id":"bbf4704c1085021f82a7e4a7234ba2e5df5a602a","venue_1":"WebSci","year":"2013","title":"Web science and the two (hundred) cultures: representation of disciplines publishing in web science","authors":"Clare J. Hooper, Georgeta Bordea, Paul Buitelaar","author_ids":"1866599, 2459957, 3338131","abstract":"Web Science is an interdisciplinary field. Motivated by the unforeseen scale and impact of the web, it addresses web-related research questions in a holistic manner, incorporating epistemologies from a broad set of disciplines. There has been ongoing discussion about which disciplines are more or less present in the community, and about defining Web Science itself: there is, however, a dearth of empirical work in this area.\n This paper presents an analysis of the presence of different disciplines in Web Science. We applied Natural Language Processing and topic extraction to a corpus of Web Science material, analysing it with graphing and visualisation tools, MatLab and an expert survey. We discovered four communities within Web Science, and trends in the conference series over time (a strong impact from collocation) and format (posters covering a broader range of topics than papers). The expert survey linked highly ranked terms with disciplines, yielding strong links with Communication, Computer Science, Psychology, and Sociology. Controversially, experts described highly ranked topics and suggested disciplines (extracted from WebSci CFPs) as not reflecting the nature of Web Science.","cites":"3","conferencePercentile":"53.50877193"},{"venue":"WebSci","id":"0f8c014a2feb37177939a8f3f31d5e452289b8c5","venue_1":"WebSci","year":"2016","title":"Because science is awesome: studying participation in a citizen science game","authors":"Ramine Tinati, Markus Luczak-Rösch, Elena Paslaru Bontas Simperl, Wendy Hall","author_ids":"2050678, 1709485, 2927032, 1685385","abstract":"In this paper, we examine the motivations for participation in Eye-Wire, a Web-based gamified citizen science platform. Our study is based on a large-scale survey to which we conducted a qualitative analysis of survey responses in order to understand what drives individuals to participate. Based on our analysis, we derive 18 motivations related to participation, and group them into 4 motivational themes related to engagement. We contextualize our findings against the broader literature on online communities, and compare our findings with other citizen science platforms, in order to understand the implications of gamification within the context of citizen science.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"06bf02db4a06c52fbce30e96f010ddfa0d5fd591","venue_1":"WebSci","year":"2012","title":"Transparency, open data and trust in government: shaping the infosphere","authors":"Kieron O'Hara","author_ids":"1800173","abstract":"This paper examines the ways in which using the World Wide Web to promote transparency and to disseminate open data will affect warranted and unwarranted trust in politics and within societies. It is argued that transparency and open data will be damaging for unwarranted trust, but this will open up a space for warranted trust to flourish. Three types of theory about trust and decision-making in politics are discussed: social capital theories, rational choice theories and deliberative democracy theories. Using the UK government's transparency programme in crime and criminal justice as an example, it is argued that mechanisms being pioneered to disseminate open data online, such as sites like data.gov and data.gov.uk, promote trust on each theory, although the supply of data is necessary but not sufficient. It is also necessary to consider the wider infosphere, putting deliberative processes in place to foster trust.","cites":"10","conferencePercentile":"68.47826087"},{"venue":"WebSci","id":"08545a1109d23d9228e400e66f759d8113349de2","venue_1":"WebSci","year":"2011","title":"Survey on governance of user-generated content in web communities","authors":"Felix Schwagereit, Ansgar Scherp, Steffen Staab","author_ids":"2668326, 1753135, 1752093","abstract":"Web communities court for the users' favor. Maintaining a high quality of the user-generated content is a foundation of a healthy and flourishing community. In order to maintain this quality, the community platform needs governance. Governance of a web community can be understood as steering and coordinating the activities of community members. This includes viewing and reviewing of already existing content but also limitations for creating and sharing new content. In this paper, we systematically review successful web communities for creating and sharing user-generated content. To this end, we have grouped the communities into the following four categories: Social Media, News, Social Reviewing, and Social Networking, we have chosen the five most prominent web platforms from Alexa Page Rank. For our survey of these platforms, we have analyzed the functionality they offer for governing the user-generated content. The result is a description of best practices for governance of user-generated content in different categories of web communities.","cites":"2","conferencePercentile":"39.28571429"},{"venue":"WebSci","id":"5291943af1311dc421cb7f44b9ecb68e7cd5681a","venue_1":"WebSci","year":"2014","title":"Evolution of online user behavior during a social upheaval","authors":"Onur Varol, Emilio Ferrara, Christine L. Ogan, Filippo Menczer, Alessandro Flammini","author_ids":"2307347, 1784579, 3062472, 1727649, 1965386","abstract":"Social media represent powerful tools of mass communication and information diffusion. They played a pivotal role during recent social uprisings and political mobilizations across the world. Here we present a study of the Gezi Park movement in Turkey through the lens of Twitter. We analyze over 2.3 million tweets produced during the 25 days of protest occurred between May and June 2013. We first characterize the spatio-temporal nature of the conversation about the Gezi Park demonstrations, showing that similarity in trends of discussion mirrors geographic cues. We then describe the characteristics of the users involved in this conversation and what roles they played. We study how roles and individual influence evolved during the period of the upheaval. This analysis reveals that the conversation becomes more democratic as events unfold, with a redistribution of influence over time in the user population. We conclude by observing how the online and offline worlds are tightly intertwined, showing that exogenous events, such as political speeches or police actions, affect social media conversations and trigger changes in individual behavior.","cites":"15","conferencePercentile":"98.38709677"},{"venue":"WebSci","id":"b4b2fc7d94cb40d1a12759952d9110cf62640c22","venue_1":"WebSci","year":"2016","title":"Modeling Twitter acceptance and use under the risk of antisocial behavior","authors":"Nora AlMuhanna, Wendy Hall, David E. Millard","author_ids":"3404057, 1685385, 1731056","abstract":"The problem of online antisocial behavior is increasingly attracting public attention and is compromising the quality of online communities. Previous research on online hostility looked at different aspects of the problem such as its definition, classification, or studying specific case studies, however, the impact is still not clear. In this paper, we propose a new model to investigate the impact of antisocial behavior online, the model is based on the Unified Theory of Acceptance and Use of Technology (UTAUT), our model integrates the perception of antisocial behavior as a risk factor along with other factors drawn from sociology. Initial validation of our model was conducted through expert reviews, the reviews include interviews with experts from computer science, sociology, and psychology, who were asked to consider its application to Twitter (as one of the controversial cyberspaces when it comes to antisocial behavior). The results of both quantitative and qualitative analysis of the expert reviews show strong support to the proposed model.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"4e791279a21780134eff1b1fceeee7ee9f3359dd","venue_1":"WebSci","year":"2016","title":"10 Years of Web Science","authors":"Wendy Hall","author_ids":"1685385","abstract":"The term Web Science was unveiled to the world by the publication of the article \"Creating a Science of the Web\" in Science, August 2006 and the launch of the Web Science Research Initiative in November 2006 at MIT. Over the last ten years Web Science has evolved into a research and education discipline in it's own right with an annual research conference, at least two journals, a track in the International WWW Conference, and multitude of degree courses around the world bearing the name. The Web Science Trust, which evolved from WSRI, has established an international network of research laboratories and a number of multi-stake holder projects such as the Web Observatory.\n But it is also important to recognise how much the digital world has changed in ten years. When Web Science was announced as a new idea, we didn't put an announcement on Facebook or Tweet about it as both were still in their infancy at that time. Terms such as Computational Social Science and Big Data were not in common use at the time. Ten years on it is important to consider the impact and relevance of Web Science. What is unique about Web Science compared to other related disciplines and what are the likely developments over the next ten years for which Web Science will be an essential tool in the armoury of a researcher? Or alternatively have other memes overtaken us and is Web Science an out-dated way of looking at the digital world?","cites":"1","conferencePercentile":"87.82051282"},{"venue":"WebSci","id":"50ca8326bcdd6cab5fb772a54b6e752e465ab318","venue_1":"WebSci","year":"2016","title":"Spreading the news: how can journalists gain more engagement for their tweets?","authors":"Claudia Orellana-Rodriguez, Derek Greene, Mark T. Keane","author_ids":"2817339, 8560326, 1733913","abstract":"News media face many serious concerns as their distribution channels are gradually being taken over by third parties (e.g., people sharing news on Twitter and Facebook, and GoogleNews acting as a news aggregator). If traditional media is to survive at all, it needs to develop innovative strategies around these channels, to maximize audience engagement with the news they provide. In this paper, we focus on the issue of developing one such strategy for spreading news on Twitter. Using a corpus of 1M tweets from 200 journalist Twitter accounts and audience responses to these tweets, we develop predictive models to identify the features of both journalists and news tweets that impact audience attention. These analyses reveal that different combinations of features influence audience engagement differentially from one news category to the next (e.g., sport versus business). From these findings, we propose a set of guidelines for journalists, designed to maximize engagement with the news they tweet. Finally, we discuss how such analyses can inform innovative dissemination strategies in digital media.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"4d0bbb5a66a4936d31bae08819c4858d1ef88ef6","venue_1":"WebSci","year":"2013","title":"Unpicking the privacy paradox: can structuration theory help to explain location-based privacy decisions?","authors":"Aristea M. Zafeiropoulou, David E. Millard, Craig Webber, Kieron O'Hara","author_ids":"2200422, 1731056, 2515095, 1800173","abstract":"Social Media and Web 2.0 tools have dramatically increased the amount of previously private data that users share on the Web; now with the advent of GPS-enabled smartphones users are also actively sharing their location data through a variety of applications and services. Existing research has explored people's privacy attitudes, and shown that the way people trade their personal data for services of value can be inconsistent with their stated privacy preferences (a phenomenon known as the privacy paradox). In this paper we present a study into privacy and location sharing, using quantitative analysis to show the presence of the paradox, and qualitative analysis in order to reveal the factors that lie behind it. Our analysis indicates that privacy decision-making can be seen as a process of structuration, in that people do not make location-sharing decisions as entirely free agents and are instead heavily influenced by contextual factors (external structures) during trade-off decisions. Collectively these decisions may themselves become new structures influencing future decisions. Our work has important consequences both for the understanding of how users arrive at privacy decisions, and also for the potential design of privacy systems.","cites":"1","conferencePercentile":"28.07017544"},{"venue":"WebSci","id":"6e1488672d36eebfe1b583dbbb98cc3f4cdd3211","venue_1":"WebSci","year":"2012","title":"How to translate a book within an hour: towards general purpose programmable human computers with CrowdLang","authors":"Patrick Minder, Abraham Bernstein","author_ids":"3044930, 1780758","abstract":"In this paper we present the programming language and framework <i>CrowdLang</i> for engineering complex computation systems incorporating large numbers of networked humans and machines agents. We evaluate <i>CrowdLang</i> by developing a text translation program incorporating human and machine agents. The evaluation shows that we are able to simply explore a large design space of possible problem solving programs with the simple variation of the used abstractions. Furthermore, an experiment, involving 1918 different human actors, shows that the developed mixed human-machine translation program significantly outperforms a pure machine translation in terms of adequacy and fluency whilst translating more than 30 pages per hour and that the program approximates the professional translated gold-standard to 75% using the automatic evaluation metric METEOR. Last but not least, our evaluation illustrates that our new human computation pattern <i>staged-contest with pruning</i> outperforms all other refinements in the translation task.","cites":"6","conferencePercentile":"52.17391304"},{"venue":"WebSci","id":"29df15fa5af98bcac9dd42c05fd9f5daae7faac8","venue_1":"WebSci","year":"2011","title":"ATT: analyzing temporal dynamics of topics and authors in social media","authors":"Nasir Naveed, Sergej Sizov, Steffen Staab","author_ids":"1746987, 1704989, 1752093","abstract":"Understanding Topical trends and user roles in topic evolution is an important challenge in the field of information retrieval. In this contribution, we present a novel model for analyzing evolution of user's interests with respect to produced content over time. Our approach Author-Topic-Time model (ATT) addresses this problem by means of Bayesian modeling of relations between authors, latent topics and temporal information. We extend state of the art Latent Dirichlet Allocation (LDA) topic model to incorporate the author and timestamp information for capturing changes in user interest over time with respect to evolving latent topics. We present results of application of the model to the 9 years of scientific publication datasets from CiteSeer showing improved semantically cohesive topic detection and capturing shift in authors interest in relation to topic evolution. We also discuss opportunities of model use in novel mining and recommendation scenarios.","cites":"4","conferencePercentile":"57.14285714"},{"venue":"WebSci","id":"86802de042401c63fae884ac792b992fb5098fcc","venue_1":"WebSci","year":"2016","title":"Internet use, in- and exclusion in decision-making processes within political parties","authors":"Gefion Thuermer, Silke Roth, Markus Luczak-Rösch, Kieron O'Hara","author_ids":"3403621, 3403994, 1709485, 1800173","abstract":"This paper investigates the effect of internet-use on democratic decision-making processes within political parties. Through two case studies of the Green Party and the Pirate Party Germany, the influence of internet-use on these processes and their inclusiveness are shown. We argue that how the internet is used in democratic processes impacts on participation and inclusion.\n How internet technology interacts with decision making processes within parties depends on the existing party structure and culture. Thus, in order to achieve meaningful and inclusive participation, the institutional framework and the influence it has must be considered in process and tool design. Whereas the affordances of specific online tools have been evaluated, the institutional context in which they are embedded have so far been widely ignored. We offer a structure for analysis of these foundations.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"2bbb3188044f3ddf80c7283575c8d5750c913057","venue_1":"WebSci","year":"2012","title":"Network, personality and social capital","authors":"Jayant Venkatanathan, Evangelos Karapanos, Vassilis Kostakos, Jorge Gonçalves","author_ids":"1987640, 1766666, 1781697, 6536876","abstract":"We present a study on the relationship between social network structure on Facebook and social capital, and how this relationship is moderated by personality traits. The findings suggest that one's number of friends does not necessarily have an effect on the amount of bridging social capital. Conversely, the extent of structural holes and isolated friends in the network have an effect on bridging social capital. In addition, individuals low on agreeableness benefit more from isolated friends in terms of bridging social capital. In terms of bonding social capital, introverts benefit more from networks with higher transitivity. Women overall report higher bonding social capital, but there are no significant gender differences when it comes to leveraging one's network structure for bridging or bonding social capital.","cites":"5","conferencePercentile":"42.39130435"},{"venue":"WebSci","id":"39d33b7f579deb1824fa056ddcb6610a1ccc6a98","venue_1":"WebSci","year":"2011","title":"Digital hermeneutics: Agora and the online understanding of cultural heritage","authors":"Chiel van den Akker, Susan Legêne, Marieke van Erp, Lora Aroyo, Roxane Segers, Lourens van der Meij, Jacco van Ossenbruggen, Guus Schreiber, Bob J. Wielinga, Johan Oomen, Geertje Jacobs","author_ids":"3314868, 1854187, 2481826, 1745337, 1974670, 1864695, 1708506, 1705565, 1733748, 1736482, 2153865","abstract":"Cultural heritage institutions are currently rethinking access to their collections to allow the public to interpret and contribute to their collections. In this work, we present the Agora project, an interdisciplinary project in which Web technology and theory of interpretation meet. This we call digital hermeneutics. The Agora project facilitates the understanding of historical events and improves the access to integrated online history collections. In this contribution, we focus on defining and modeling prototypical object-event and event-event relationships that support the interpretation of objects in cultural heritage collections. We present a use case in which we model historical events as well as relations between objects and events for a set of paintings from the Rijksmuseum Amsterdam collection. Our use case shows how Web technology and theory of interpretation meet in the present, and what technological hurdles still need to be taken to fully support digital hermeneutics.","cites":"19","conferencePercentile":"85.71428571"},{"venue":"WebSci","id":"b06677d22fbb7f6cc7bd2e4c32d8323c9a2ab152","venue_1":"WebSci","year":"2014","title":"From media reporting to international relations: a case study of asia-pacific economic cooperation (apec)","authors":"Chun-Hua Tsai, Yu-Ru Lin","author_ids":"2250062, 2133006","abstract":"Network analysis has brought new perspectives in studying emergent structure in international relations. Prior work on networks of international relations has mostly relied on data derived from formal alliances and trade flows, which can hardly capture the rapidly evolving international relations due to globalization and recent advances in information technology. In this work, we propose a novel research design that aims at capturing ``real-time'' international relations through news reporting. We collect worldwide news on a daily basis, and characterize the relationship between any two countries through analyzing the similarity of their news content. Our empirical results based on news about the APEC (Asia-Pacific Economic Cooperation) CEO Summit in 2013 revealed interesting and meaningful international relations among member countries.","cites":"0","conferencePercentile":"20.96774194"},{"venue":"WebSci","id":"9c31111ff7e65440fd1c1bdca169017cc94ddc18","venue_1":"WebSci","year":"2013","title":"The performativity of data: reconceptualizing the web of data","authors":"Marie Joan Kristine Gloria, Dominic DiFranzo, Marco Fernando Navarro, James A. Hendler","author_ids":"2358834, 1771597, 2111795, 1701341","abstract":"As the discipline of Web Science matures, its interdisciplinary claim has many researchers unsure about its core theory and methodology. Instead, we often see results that are more multi-disciplinary than interdisciplinary. The following contribution attempts to recast our understanding of the current methodologies and tools leveraged by the Web Science community. Specifically, we review the Semantic Web and Linked Data technologies not just from a technical perspective; but, through a critical reading of key social theories such as Goffman's theory of performance. Our goal is to reconceptualize the performativity of semantic web tools, their boundaries, and any potential avenues for future research.","cites":"0","conferencePercentile":"12.28070175"},{"venue":"WebSci","id":"38b48b570691ee7f5019bdafff577438d6e1f585","venue_1":"WebSci","year":"2012","title":"Political speech in social media streams: YouTube comments and Twitter posts","authors":"Yelena Mejova, Padmini Srinivasan","author_ids":"3329961, 2072078","abstract":"Recently, political sentiment on social media websites has been receiving much attention both in research circles and in the news. However, political sentiment analysis has been largely performed on only a single social media source. It is unclear what outcomes would result if more than one source were used. We present a unique comparison of the textual content of two popular social media -- Twitter posts and YouTube comments -- over a common set of queries which include politicians, issues, and events. We show Twitter as a stream driven by news and outside sources with 40% share of its content lacking any sentiment, and YouTube as an outlet for opinionated speech. Specifically in YouTube, we find that the author's political stance and the sentiment of the document do not always match, and should be treated separately in analysis of political documents. We also examine the connection between social media sentiment and that of general population by comparing our findings to the Gallup poll, and show that neither discussion volume or sentiment expressed in the two social media were able to predict the republican Presidential nominee frontrunner.","cites":"3","conferencePercentile":"31.52173913"},{"venue":"WebSci","id":"08ba7b3cb1c2794ac3412fe21821bfff4c6417f5","venue_1":"WebSci","year":"2011","title":"The communication infrastructure during the learning process in web based collaborative learning systems","authors":"Cathleen M. Stützer, Kathleen M. Carley, Thomas Köhler, Gerhard Thiem","author_ids":"2049761, 1702030, 3006452, 2485031","abstract":"As people adopt <i>lifelong learning</i> as a key strategy to succeed in the modern knowledge society and conventional teaching styles of classroom lecturing are supplemented by computer-supported collaborative distance learning opportunities, traditional roles of learners and educators may change. The identification and meaning of actor roles and their embeddedness in social systems have a long tradition in social sciences [Freeman 2004; Simmel 1984]. In education sciences, learning is traditionally conceptualized as an adaptive knowledge construction process [Bruner and Piaget 2009]. This view has started to be extended by also taking the network structure and group dynamics during the interaction process of teachers and learners into account [Gergen 1985]. Based on this theoretical background, in this research teachers and students are examined by their embeddedness in different communication networks in macro and micro perspective in remote e-learning communities. By performing structural analysis on the relational data we identified the role structure of actors with three common communication roles, and five emergent network roles of actors as well as the relationship between network structure and learning processes. The results of the study put us in a position to describe the impact of actor positions for the communication behavior in the digital knowledge process in collaborative learning communities.","cites":"0","conferencePercentile":"10.71428571"},{"venue":"WebSci","id":"0633db4af6fdb2faee06d5e5ec39312339178109","venue_1":"WebSci","year":"2012","title":"Behaviour analysis across different types of enterprise online communities","authors":"Matthew Rowe, Miriam Fernández, Harith Alani, Inbal Ronen, Conor Hayes, Marcel Karnstedt","author_ids":"1782451, 2461710, 2798006, 2311836, 2653825, 1734216","abstract":"Online communities in the enterprise are designed to fulfil some economic purpose, for example for supporting products or enabling work-collaboration between knowledge workers. The intentions of such communities allow them to be labelled based on their type - i.e. communities of practice, team communities, technical support communities, etc. Despite the disparate nature and explicit intention of community types, little is known of how the types differ in terms of a) the participation and activity, and b) the behaviour of community users. Such insights could provide community managers with an understanding of <i>normality</i> and a diagnosis of <i>healthiness</i> in their community, given its type and corresponding user needs. In this paper, we present an empirical analysis of community types from the enterprise social software system IBM Connections. We assess the micro (user-level) and macro (community-level) characteristics of differing community types and identify key differences in the behaviour that users exhibit in these communities. We further qualify our empirical findings with user questionnaires by identifying links between the objectives of the users and the characteristics of the community types.","cites":"5","conferencePercentile":"42.39130435"},{"venue":"WebSci","id":"c018a6cb1d3980cf935d7b30e6fe89d458497e89","venue_1":"WebSci","year":"2013","title":"Mechanical turk as an ontology engineer?: using microtasks as a component of an ontology-engineering workflow","authors":"Natalya Fridman Noy, Jonathan Mortensen, Mark A. Musen, Paul R. Alexander","author_ids":"2105209, 4243867, 8691132, 2048024","abstract":"Ontology evaluation has proven to be one of the more difficult problems in ontology engineering. Researchers proposed numerous methods to evaluate logical correctness of an ontology, its structure, or coverage of a domain represented by a corpus. However, evaluating whether or not ontology assertions correspond to the real world remains a manual and time-consuming task. In this paper, we explore the feasibility of using microtask crowdsourcing through Amazon Mechanical Turk to evaluate ontologies. Specifically, we look at the task of verifying the subclass--superclass hierarchy in ontologies. We demonstrate that the performance of Amazon Mechanical Turk workers (turkers) on this task is comparable to the performance of undergraduate students in a formal study. We explore the effects of the type of the ontology on the performance of turkers and demonstrate that turkers can achieve accuracy as high as 90% on verifying hierarchy statements form common-sense ontologies such as WordNet. Finally, we compare the performance of turkers to the performance of domain experts on verifying statements from an ontology in the biomedical domain. We report on lessons learned about designing ontology-evaluation experiments on Amazon Mechanical Turk. Our results demonstrate that microtask crowdsourcing can become a scalable and efficient component in ontology-engineering workflows.","cites":"18","conferencePercentile":"97.36842105"},{"venue":"WebSci","id":"543c38d6e7b388ccbbde2a5dc03c8f79928c7154","venue_1":"WebSci","year":"2013","title":"Petition Growth and Success Rates on the UK No. 10 Downing Street Website","authors":"Scott A. Hale, Helen Margetts, Taha Yasseri","author_ids":"1801223, 1791413, 1985987","abstract":"Now that so much of collective action takes place online, web-generated data can further understanding of the mechanics of Internet-based mobilisation. This trace data offers social science researchers the potential for new forms of analysis, using real-time transactional data based on entire populations, rather than sample-based surveys of what people think they did or might do. This paper uses a 'big data' approach to track the growth of over 8,000 petitions to the UK Government on the No. 10 Downing Street website for two years, analysing the rate of growth per day and testing the hypothesis that the distribution of daily change will be leptokurtic (rather than normal) as previous research on agenda setting would suggest. This hypothesis is confirmed, suggesting that Internet-based mobilisation is characterized by tipping points (or punctuated equilibria) and explaining some of the volatility in online collective action. We find also that most successful petitions grow quickly and that the number of signatures a petition receives on its first day is a significant factor in explaining the overall number of signatures a petition receives during its lifetime. These findings have implications for the strategies of those initiating petitions and the design of web sites with the aim of maximising citizen engagement with policy issues.","cites":"10","conferencePercentile":"87.71929825"},{"venue":"WebSci","id":"1c1a49e8e90afd5641676ecdbf577042634a1ed3","venue_1":"WebSci","year":"2014","title":"Mapping the UK Webspace: Fifteen Years of British Universities on the Web","authors":"Scott A. Hale, Taha Yasseri, Josh Cowls, Eric T. Meyer, Ralph Schroeder, Helen Margetts","author_ids":"1801223, 1985987, 3011486, 1679051, 2226190, 1791413","abstract":"This paper maps the national UK web presence on the basis of an analysis of the .uk domain from 1996 to 2010. It reviews previous attempts to use web archives to understand national web domains and describes the dataset. Next, it presents an analysis of the .uk domain, including the overall number of links in the archive and changes in the link density of different second-level domains over time. We then explore changes over time within a particular second-level domain, the academic subdomain .ac.uk, and compare linking practices with variables, including institutional affiliation, league table ranking, and geographic location. We do not detect institutional affiliation affecting linking practices and find only partial evidence of league table ranking affecting network centrality, but find a clear inverse relationship between the density of links and the geographical distance between universities. This echoes prior findings regarding offline academic activity, which allows us to argue that real-world factors like geography continue to shape academic relationships even in the Internet age. We conclude with directions for future uses of web archive resources in this emerging area of research.","cites":"2","conferencePercentile":"63.70967742"},{"venue":"WebSci","id":"12aa202961ad16251ed30a5766da5bdf68087f43","venue_1":"WebSci","year":"2012","title":"Personality and patterns of Facebook usage","authors":"Yoram Bachrach, Michal Kosinski, Thore Graepel, Pushmeet Kohli, David Stillwell","author_ids":"1698412, 2835380, 1686971, 1685185, 3069657","abstract":"We show how users' activity on Facebook relates to their personality, as measured by the standard Five Factor Model. Our dataset consists of the personality profiles and Facebook profile data of 180,000 users. We examine correlations between users' personality and the properties of their Facebook profiles such as the size and density of their friendship network, number uploaded photos, number of events attended, number of group memberships, and number of times user has been tagged in photos. Our results show significant relationships between personality traits and various features of Facebook profiles. We then show how multivariate regression allows <i>prediction</i> of the personality traits of an individual user given their Facebook profile. The best accuracy of such predictions is achieved for Extraversion and Neuroticism, the lowest accuracy is obtained for Agreeableness, with Openness and Conscientiousness lying in the middle.","cites":"47","conferencePercentile":"97.82608696"},{"venue":"WebSci","id":"3cf477fcc4e9ba59fedd7fb02c54f54efc35ccef","venue_1":"WebSci","year":"2014","title":"Multilinguals and Wikipedia Editing","authors":"Scott A. Hale","author_ids":"1801223","abstract":"This article analyzes one month of edits to Wikipedia in order to examine the role of users editing multiple language editions (referred to as multilingual users). Such multilingual users may serve an important function in diffusing information across different language editions of the encyclopedia, and prior work has suggested this could reduce the level of self-focus bias in each edition. This study finds multilingual users are much more active than their single-edition (monolingual) counterparts. They are found in all language editions, but smaller-sized editions with fewer users have a higher percentage of multilingual users than larger-sized editions. About a quarter of multilingual users always edit the same articles in multiple languages, while just over 40% of multilingual users edit different articles in different languages. When non-English users do edit a second language edition, that edition is most frequently English. Nonetheless, several regional and linguistic cross-editing patterns are also present.","cites":"21","conferencePercentile":"100"},{"venue":"WebSci","id":"831907ea42404be8d7771557c2126a6a6b940582","venue_1":"WebSci","year":"2016","title":"Identity assurance in the UK: technical implementation and legal implications under the eIDAS regulation","authors":"Niko Tsakalakis, Kieron O'Hara, Sophie Stalla-Bourdillon","author_ids":"3404277, 1800173, 2388699","abstract":"The UK Government has been designing a new Electronic Identity Management (eIDM) system that, once rolled--out, will take over how citizens authenticate against online public services. This system, Gov.UK Verify, has been promoted as a state--of--the--art privacy--preserving system, tailored to meet the requirements of UK citizens and is the first eIDM interoperability in which the government does not act as an identity provider itself, delegating the provision of identity to competing third parties. According to the recently enacted EU eIDAS Regulation, member states can allow their citizens to transact with foreign services by notifying their national eID scheme. Once a scheme is notified, all other member states are obligated to incorporate it into their electronic identification procedures. The UK Government is contemplating at the moment whether it would be beneficial to notify. This article examines Gov.UK Verify 's compliance with the requirements set forth by the Regulation and the impact on privacy and data protection. It then explores potential interoperability issues with other national eID schemes, using the German nPA, an eIDM based on national identity cards, as a reference point. The article highlights areas of attention, should the UK decide to notify Gov.UK Verify. It also contributes to relevant literature of privacy--preserving eID management by offering policy and technical recommendations for compliance with the new Regulation and an evaluation of interoperability under eIDAS between systems of different architecture.","cites":"2","conferencePercentile":"99.35897436"},{"venue":"WebSci","id":"1dd28007b37bf46eae64b4a180f65764aa7fafe8","venue_1":"WebSci","year":"2012","title":"Coevolution of Network Structure and Content","authors":"Liuling Gong, ChunYuen Teng, Avishay Livne, Celso Brunetti, Lada A. Adamic","author_ids":"2221965, 2444631, 2463614, 2383432, 1778398","abstract":"As individuals communicate, their exchanges form a dynamic network. We demonstrate, using time series analysis of communication in three online settings, that network structure alone can be highly revealing of the diversity and novelty of the information being communicated. Our approach uses both standard and novel network metrics to characterize how unexpected a network configuration is, and to capture a network's ability to conduct information. We find that networks with a higher conductance in link structure exhibit higher information entropy, while unexpected network configurations can be tied to information novelty. We use a simulation model to explain the observed correspondence between the evolution of a network's structure and the information it carries.","cites":"5","conferencePercentile":"42.39130435"},{"venue":"WebSci","id":"98ee6b683c9edfc4631ab5be8c2134e9031c2d6d","venue_1":"WebSci","year":"2015","title":"DNA: From Search to Observation Revisited","authors":"Ian C. Brown, Lisa Harris, Wendy Hall","author_ids":"3072949, 8491022, 1685385","abstract":"In this paper, we describe extensions to the process model first described in the paper \"From Search to Observation\" based on additional field interview work. This process model forms part of a triad of perspectives under the banner of a methodology known as DNA, which looks at structure (Definition), process (Nature) and motivations of actors (Archetypes) for Web Observatories (hereafter WO) and more generally the class of Social Machines. We discuss the rationale for the model enhancements, enumerate and summarise the changes and close with an introduction to future work around use of open source tools and languages for implementing and analyzing social machine processes using this model. The additional perspectives we are now considering are an extensive revision to the model (which now addresses more than three times the number of factors in the previous model) and hence a revised paper is called for in this space.","cites":"0","conferencePercentile":"31.81818182"},{"venue":"WebSci","id":"75c408d230caf7d8fe5efb4049cb61c498255b1a","venue_1":"WebSci","year":"2012","title":"Designing for vigilance during intermittent use","authors":"M. Giles Phillips","author_ids":"2620925","abstract":"Internet usage is shifting towards a persistent and pervasive engagement through connected mobile devices. In Social Media, this engagement is mediated by an online profile, through which our interactions with online social worlds are framed. By adapting and mediating the embodied acts of Identify Performance and Impression Management, the online profile informs socialization and self-identity. This research posits that the particular use case for maintaining an online profile creates an unprecedented, technology-driven form of human vigilance during intermittent use. Scholarship into the nature of online profiles will be examined, as well as the instinctual basis for human vigilance. A review of Human Factors (HF) research concerning vigilance, and the Human-Computer Interactions (HCI) that support vigilance today, are also provided. A set of design principles is subsequently proposed in order to guide the design of more effective and sustainable interactions that support vigilance during cases of intermittent use. These principles can be generalized from social networking into numerous domains of HCI.","cites":"2","conferencePercentile":"25"},{"venue":"WebSci","id":"1f310dfe9d43ed1c7ea61df02a9f092c1bc7f389","venue_1":"WebSci","year":"2011","title":"Analyzing temporal dynamics in Twitter profiles for personalized recommendations in the social web","authors":"Fabian Abel, Qi Gao, Geert-Jan Houben, Ke Tao","author_ids":"1714362, 1773611, 1703821, 2981519","abstract":"Social Web describes a new culture of participation on the Web where more and more people actively participate in publishing and organizing Web content. As part of this culture, people leave a variety of traces when interacting with (other people via) Social Web systems. In this paper, we investigate user modeling strategies for inferring personal interest profiles from Social Web interactions. In particular, we analyze individual micro-blogging activities on Twitter. We compare different strategies for creating user profiles based on the Twitter messages a user has published and study how these profiles change over time. Moreover, we evaluate the quality of the user modeling strategies in the context of personalized recommender systems and show that those strategies which consider the temporal dynamics of the individual profiles allow for the best performance.","cites":"34","conferencePercentile":"92.85714286"},{"venue":"WebSci","id":"115fa9b80214f1bfe7c0a21c61962d9624af36ed","venue_1":"WebSci","year":"2011","title":"Sic transit gloria mundi virtuali?: promise and peril in the computational social science of clandestine organizing","authors":"Brian Keegan, Muhammad Aurangzeb Ahmad, Dmitri Williams, Jaideep Srivastava, Noshir S. Contractor","author_ids":"5451329, 2074962, 1801272, 1744014, 6203716","abstract":"Massively multiplayer online games (MMOGs) maintain archival databases of all player actions and attributes including activity by accounts engaged in illicit behavior. If individuals in online worlds operate under similar social and psychological motivations and constraints as the offline world, online behavioral data could inform theories about offline behavior. We examine high risk trading relationships in a MMOG to illuminate the structures online clandestine organizations employ to balance security with efficiency and compare this to an offline drug trafficking network. This data offers the possibility of performing social research on a scale that would be unethical or impracticable to do in the offline world. However, analyzing and generalizing from clandestine behavior in online settings raises complex epistemological and methodological questions about the validity of such mappings and what methods and metrics are appropriate in these contexts. We conclude by discussing how computational social science can be applied to online and offline criminological concerns and highlight the \"dual use\" implications of these technologies.","cites":"9","conferencePercentile":"76.78571429"},{"venue":"WebSci","id":"3b54dcdf077376389377cd6e36f97aa4b11a5bf4","venue_1":"WebSci","year":"2015","title":"Building a Social Machine: Co-designing a TimeBank for Inclusive Research","authors":"Clare J. Hooper, Melanie Nind, Sarah Parsons, Andrew Power, Anne Collis","author_ids":"1866599, 3426750, 5351830, 3427310, 3427129","abstract":"This paper discusses the construction of a Social Machine, a socio-technical system in which people achieve new, creative goals enabled by automated processes that are handled by technology. Specifically, the Social Machine is an online TimeBank, a time-based way for people to give and receive services; it is designed for use in the context of inclusive research (initially) with people with learning disabilities.\n We describe the use of physical and digital (online) focus groups to gather inputs to drive the construction of the TimeBank, and the processes by which we analysed the data to inform the design of the TimeBank. Our goal is to create an online community with a sense of connectedness, and we discuss this work through that lens, presenting insights gained towards: building the TimeBank itself; methodological implications of related but separate physical and digital focus groups; and building Social Machines.","cites":"1","conferencePercentile":"72.72727273"},{"venue":"WebSci","id":"d6877412578d31904bd2064f72c04679788d2efb","venue_1":"WebSci","year":"2016","title":"Likeology: modeling, predicting, and aggregating likes in social media","authors":"Dongwon Lee","author_ids":"1784227","abstract":"The recent dramatic increase in the usage and prevalence of social media has led to the creation and sharing of a significant amount of user-generated contents (UGCs) in various formats (e.g., photos, videos, blogs). Users not only generate and access UGCs in social media, but also actively evaluate and interact with them by adding comments or expressing their preferences toward the UGCs.\n In particular, recently, user preferences by means of a \"Like\" button have prevailed. Such a Like button appears in different names too (e.g., Like in Facebook, +1 in Google+, re-pin in Pinterest, and favorite in Flickr). Despite such massive social media data with rich Like-like relationships therein, however, there has not been a dedicated tutorial that covered the diverse aspects of Likes in a comprehensive and cohesive manner. As understanding user preferences (via Likes) and providing further personalized services such as recommendation thereof in social media has keen implications in businesses, the topic of Likes has become increasingly important in recent years.\n In this tutorial, as such, to address this important and timely topic, we aim to provide a 3-hour tutorial, named as \"Likeology\" that presents a comprehensive overview of Likes in social media and covers mainly 3 topics: (1) how to model Likes, (2) how to predict the evolution of Likes, and (3) how to aggregate Likes. This tutorial is partially based on our earlier version [9].","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"34927cfa8fe5552abc72823d6d53d8656f3a800b","venue_1":"WebSci","year":"2013","title":"Sentiment and topic analysis on social media: a multi-task multi-label classification approach","authors":"Shu Huang, Wei Peng, Jingxuan Li, Dongwon Lee","author_ids":"6077893, 1716703, 8549633, 1784227","abstract":"Both <i>sentiment</i> analysis and <i>topic classification</i> are frequently used in customer care and marketing. They can help people understand the brand perception and customer opinions from social media, such as online posts, tweets, forums, and blogs. As such, in recent years, many solutions have been proposed for both tasks. However, we believe that the following two problems have not been addressed adequately: (1) Conventional solutions usually treat the two tasks in isolation. When the two tasks are closely related (e.g., posts about \"customer care\" often have a \"negative\" tone), exploring their correlation may yield a better accuracy; (2) Each post is usually assigned with only one sentiment label and one topic label. Since social media is, compared to traditional document corpus, more noisy, ambiguous, and sparser, single label classification may not be able to capture the post classes accurately. To address these two problems, in this paper, we propose a <i>multi-task multi-label</i> (MTML) classification model that performs classification of both sentiments and topics concurrently. It incorporates results of each task from prior steps to promote and reinforce the other iteratively. For each task, the model is trained with multiple labels so that they can help address class ambiguity. In the empirical validation, we compare the accuracy of MTML model against four competing methods in two different settings. Results show that MTML produces a much higher accuracy of both sentiment and topic classifications.","cites":"2","conferencePercentile":"41.22807018"},{"venue":"WebSci","id":"59fd77c374dcb7ba2b354c02c249b9d8feff3269","venue_1":"WebSci","year":"2016","title":"Quote RTs on Twitter: usage of the new feature for political discourse","authors":"Venkata Rama Kiran Garimella, Ingmar Weber, Munmun De Choudhury","author_ids":"1699369, 1684687, 2583473","abstract":"Social media platforms provide several social interactional features. Due to the large scale reach of social media, these interactional features help enable various types of political discourse. Constructive and diversified discourse is important for sustaining healthy communities and reducing the impact of echo chambers. In this paper, we empirically examine the role of a newly introduced Twitter feature, 'quote retweets' (or 'quote RTs') in political discourse, specifically whether it has led to improved, civil, and balanced exchange. Quote RTs allow users to quote the tweet they retweet, while adding a short comment. Our analysis using content, network and crowd labeled data indicates that the feature has increased political discourse and its diffusion, compared to existing features. We discuss the implications of our findings in understanding and reducing online polarization.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"3da7fa55f715d9d26f671bc223cefd5030818050","venue_1":"WebSci","year":"2011","title":"Accountability and deterrence in online life","authors":"Joan Feigenbaum, James A. Hendler, Aaron D. Jaggard, Daniel J. Weitzner, Rebecca N. Wright","author_ids":"1751820, 1701341, 1737906, 3152129, 1701402","abstract":"The standard technical approach to privacy and security in online life is <i>preventive</i>: Before someone can access confidential data or take any other action that implicates privacy or security, he should be required to prove that he is authorized to do so. As the scale and complexity of online activity has grown, it has become apparent that the preventive approach is inadequate; thus, a growing set of information-security researchers has embraced greater reliance on <i>accountability mechanisms</i> to complement preventive measures. Despite widespread agreement that \"accountability\" is important in online life, the term has no standard definition. We make three contributions to the study of accountability: (1) We flesh out with realistic examples our claim that a purely preventive approach to security is inadequate; (2) We present, compare, and contrast some existing formal frameworks for accountability; (3) We explore the question of whether \"deterrence\" may be a better general term in this context than \"accountability.\"","cites":"9","conferencePercentile":"76.78571429"},{"venue":"WebSci","id":"a511623973f6c846c8ac6e0e4ea812065a303c85","venue_1":"WebSci","year":"2012","title":"Mining web query logs to analyze political issues","authors":"Ingmar Weber, Venkata Rama Kiran Garimella, Erik Borra","author_ids":"1684687, 1699369, 3118494","abstract":"We present a novel approach to using anonymized web search query logs to analyze and visualize political issues. Our starting point is a list of politically annotated blogs (left vs. right). We use this list to assign a numerical political leaning to queries leading to clicks on these blogs. Furthermore, we map queries to Wikipedia articles and to fact-checked statements from politifact.com, as well as applying sentiment analysis to search results. With this rich, multi-faceted data set we obtain novel graphical visualizations of issues and discover connections between the different variables.\n Our findings include (i) an interest in \"the other side\" where queries about Democrat politicians have a right leaning and vice versa, (ii) evidence that \"lies are catchy\" and that queries pertaining to false statements are more likely to attract large volumes, and (iii) the observation that the more right-leaning a query it is, the more negative sentiments can be found in its search results.","cites":"14","conferencePercentile":"84.7826087"},{"venue":"WebSci","id":"f89a7788114e6230cbcbde26468c50be1c6eb880","venue_1":"WebSci","year":"2016","title":"A content-linking-context model for \"notice-and-take-down\" procedures","authors":"Pei Zhang, Sophie Stalla-Bourdillon, Lester Gilbert","author_ids":"1678979, 2388699, 1734903","abstract":"The US Digital Millennium Copyright Act (DMCA) of 1998 [1] adopted a notice-and-take-down procedure to help tackle alleged online infringements through online service providers' actions. The European Directive 2000/31/EC (e-Commerce Directive) [2] introduced similar liability exemptions, but did not specify any take-down procedure. Many intermediary (host, and online search engine) service providers even in Europe have followed this notice-and-take-down procedure to enable copyright owners to issue notices to take down allegedly infringing Web resources. However, the accuracy of take-down is not known, and notice receivers do not reveal clear information about how they check the legitimacy of these requests, about whether and how they check the lawfulness of allegedly infringing content, or what criteria they use for these actions. In this paper, we use Google's Transparency Report as the benchmark to investigate the information content of take-down notices and the accuracy of the resulting take-downs of allegedly infringing Web resources. The analysis of copyright infringement is limited to the five scenarios most frequently encountered in our study of Web resources. Based on our investigation, we propose a Content-Linking-Context (CLC) model of the criteria to be considered by intermediary service providers to achieve more accurate take-down.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"3218f51e22a20c635d585e636ba88ce8fc32ca6d","venue_1":"WebSci","year":"2015","title":"On Publication Usage in a Social Bookmarking System","authors":"Daniel Zoller, Stephan Doerfel, Robert Jäschke, Gerd Stumme, Andreas Hotho","author_ids":"3400655, 2674255, 2977847, 1705932, 1792623","abstract":"Scholarly success is traditionally measured in terms of citations to publications. With the advent of publication management and digital libraries on the web, scholarly usage data has become a target of investigation and new impact metrics computed on such usage data have been proposed -- so called altmetrics. In scholarly social bookmarking systems, scientists collect and manage publication meta data and thus reveal their interest in these publications. In this work, we investigate connections between usage metrics and citations, and find posts, exports, and page views of publications to be correlated to citations.","cites":"1","conferencePercentile":"72.72727273"},{"venue":"WebSci","id":"6349ccf30f00763bc8b9c895703ebf90a2dd5e45","venue_1":"WebSci","year":"2016","title":"The psychology of job loss: using social media data to characterize and predict unemployment","authors":"Davide Proserpio, Scott Counts, Apurv Jain","author_ids":"2655413, 1721345, 3403678","abstract":"Using data from social media, we study the relationship between the macroeconomic shock of employment instability and psychological well-being. We analyze more than 1.2B Twitter posts from over 230,000 U.S. users who either lost a job or gained a new job over a period spanning five years, from 2010 to 2015. First we quantify the magnitude and length of effects of job loss/gain on psychological variables such as anxiety, sadness, and anger. We then define a behavioral macroeconomic model that leverages these changes in psychological state to predict levels of unemployment in the U.S. Our results show that our psychological well-being measures are leading indicators, predicting economic indices weeks in advance with higher accuracy than baseline models. Taken together, these findings suggest that by capturing the human experience of a shock like job loss, social media data can augment current economic models to generate a better understanding of the overall causes and consequences of macroeconomic performance.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"df901288e645d0fc11d3d69c0a3352d292b2455b","venue_1":"WebSci","year":"2016","title":"It's getting crowded!: how to use crowdsourcing effectively for web science research","authors":"Ujwal Gadiraju, Gianluca Demartini, Djellel Eddine Difallah, Michele Catasta","author_ids":"2516584, 1694274, 1695677, 1754926","abstract":"Since the term <i>crowdsourcing</i> was coined in 2006 [1], we have witnessed a surge in the adoption of the crowdsourcing paradigm. Crowdsourcing solutions are highly sought-after to solve problems that require human intelligence at a large scale. In the last decade there have been numerous applications of crowdsourcing spanning several domains in both research and for practical benefits across disciplines (from sociology to computer science). In the realm of research practice, crowdsourcing has unmistakably broken the barriers of qualitative and quantitative studies by providing a means to scale-up previously constrained laboratory studies and controlled experiments. Today, one can easily build ground truths for evaluation and access potential participants around the clock with diverse demographics at will, all within an unprecedentedly short amount of time. This comes with a number of challenges related to lack of control on research subjects and with respect to data quality.\n A core characteristic of Web Science over the last decade has been its interdisciplinary approach to understand the behavior of people on and off the Web, using a wide range of data sources. It is at this confluence that crowdsourcing provides an important opportunity to explore previously unfeasible experimental grounds.\n In this tutorial, we will introduce the crowdsourcing paradigm in its entirety. We will discuss altruistic and reward-based crowdsourcing, eclipsing the needs of task requesters, as well as the behavior of crowd workers. The tutorial will focus on paid microtask crowdsourcing, and reflect on the challenges and opportunities that confront us. In an interactive demonstration session, we will run the audience through the entire lifecycle of creating and deploying microtasks on an established crowdsourcing platform, optimizing task settings in order to meet task needs, and aggregating results thereafter. We will present a selection of state-of-the-art methods to ensure high-quality results and inhibit malicious activity. The tutorial will be framed within the context of Web Science. The interdisciplinary nature of Web Science breeds a rich ground for crowdsourcing, and we aim to spread the virtues of this growing field.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"964a2d65aad5235b8c333c1932bd331528a608cb","venue_1":"WebSci","year":"2016","title":"Beyond the MOOC platform: gaining insights about learners from the social web","authors":"Guanliang Chen, Dan Davis, Jun Lin, Claudia Hauff, Geert-Jan Houben","author_ids":"5671907, 2222855, 1689752, 2731925, 1703821","abstract":"Massive Open Online Courses (MOOCs) have enabled millions of learners across the globe to increase their levels of expertise in a wide variety of subjects. Research efforts surrounding MOOCs are typically focused on improving the learning experience, as the current retention rates (less than 7% of registered learners complete a MOOC) show a large gap between vision and reality in MOOC learning.\n Current data-driven approaches to MOOC adaptations rely on data traces learners generate <i>within</i> a MOOC platform such as edX or Coursera. As a MOOC typically lasts between five and eight weeks and with many MOOC learners being rather passive consumers of the learning material, this exclusive use of MOOC platform data traces limits the insights that can be gained from them.\n The Social Web potentially offers a rich source of data to <i>supplement</i> the MOOC platform data traces, as many learners are also likely to be active on one or more Social Web platforms. In this work, we present a first exploratory analysis of the Social Web platforms MOOC learners are active on --- we consider more than 320,000 learners that registered for 18 MOOCs on the edX platform and explore their user profiles and activities on StackExchange, GitHub, Twitter and LinkedIn.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"5a77c62bdaf664475717e3f3b0c90cd52df2cbe5","venue_1":"WebSci","year":"2013","title":"Traditional media seen from social media","authors":"Jisun An, Daniele Quercia, Meeyoung Cha, Krishna P. Gummadi, Jon Crowcroft","author_ids":"1782067, 1757126, 1775511, 1958921, 1726850","abstract":"With the advent of social media services, media outlets have started reaching audiences on social-networking sites. On Twitter, users actively follow a wide set of media sources, form interpersonal networks, and propagate interesting stories to their peers. These media subscription and interaction patterns, which had previously been hidden behind media corporations' databases, offer new opportunities to understand media supply and demand on a large scale. Through a map that connects 77 media outlets based on Twitter subscription patterns, we are able to answer a variety of questions: to what extent New York Times and the Wall Street Journal readers overlap? Are they competitors or potential collaborators? Are people who know each other more likely to subscribe to similar outlets?","cites":"0","conferencePercentile":"12.28070175"},{"venue":"WebSci","id":"32698b79371d6ca8f1b36c49206196f54d12eaa4","venue_1":"WebSci","year":"2013","title":"Location tracking via social networking sites","authors":"Lisa A. Thomas, Pamela Briggs, Linda Little","author_ids":"2373726, 1866129, 3127699","abstract":"The use of social media has steadily grown in recent years, and now more than ever, people are logging on to websites like Facebook, Twitter, Foursquare, and Google Latitude with the aim of broadcasting their location information. The ability to 'check in' has enabled social network site users to broadcast detailed information about their whereabouts and also what they are doing there. This is encouraged by the implementation of location-based services (LBS) - technology which uses information about the geographical position of a mobile device. To date, little academic research has focused on perceptions of, or intentions to use these systems. This paper describes a study which utilised a psychological framework originally designed to predict intentions to use LBS, which was modified to assess intentions to use LBS within a social networking site (SNS) context. Participants completed an online survey, assessing their beliefs surrounding, and intentions to use, LBS via SNS. We find that trust of the social network provider as well as disclosure preferences influence intentions to use SNS with friends, family, and colleagues. This work highlights an important area of psychological research that has not previously been considered, and provides a theoretical foundation from which further work could explore location-tracking aspects of SNS.","cites":"1","conferencePercentile":"28.07017544"},{"venue":"WebSci","id":"8c24cd8b304d8d6e8d94a5bc2e8697c53bd82eb8","venue_1":"WebSci","year":"2015","title":"Automatic Identification of Personal Life Events in Twitter","authors":"Thomas Dickinson, Miriam Fernández, Lisa A. Thomas, Paul Mulholland, Pamela Briggs, Harith Alani","author_ids":"2501634, 2461710, 2373726, 1715412, 1866129, 2798006","abstract":"New social media has led to an explosion in personal digital data that encompasses both those expressions of self chosen by the individual as well as reflections of self provided by other, third parties. The resulting Digital Personhood (DP) data is complex and for many users it is too easy to become lost in the mire of digital data. This paper studies the automatic detection of personal life events in Twitter. Six relevant life events are considered from psychological research including: beginning school; first full time job; falling in love; marriage; having children and parent's death. We define a variety of features (user, content, semantic and interaction) to capture the characteristics of those life events and present the results of several classification methods to automatically identify these events in Twitter.","cites":"0","conferencePercentile":"31.81818182"},{"venue":"WebSci","id":"460bb961aea716acafa3930fe4763ac101d3a026","venue_1":"WebSci","year":"2013","title":"Are user-contributed reviews community property?: exploring the beliefs and practices of reviewers","authors":"Frank M. Shipman, Catherine C. Marshall","author_ids":"1749811, 1685379","abstract":"User-contributed reviews form the cornerstone of many Web communities and online services. People rely on reviews as a source of information about products, services, creative efforts, and the reputation of other buyers and sellers. Although specific rights about the ownership and control of these reviews are spelled out in licensing agreements and by copyright law, most reviewers' actions are guided instead by evolving social norms. In this paper, we report on 203 responses to a questionnaire offered to reliable US-based Mechanical Turk workers who have written different types of online reviews. The questionnaire uses a series of realistic scenarios and specific questions about recent practice to probe participants about how online reviews may be reused, archived, re-purposed, deleted, and otherwise manipulated. We use these collective attitudes and behaviors to arrive at a picture of current social norms and examine user-contributed reviews as a counterpart to other types of online content, including photos and tweets.","cites":"4","conferencePercentile":"61.40350877"},{"venue":"WebSci","id":"399e059b4b4f507373d252868bf71b96032b2274","venue_1":"WebSci","year":"2013","title":"Experiences surveying the crowd: reflections on methods, participation, and reliability","authors":"Catherine C. Marshall, Frank M. Shipman","author_ids":"1685379, 1749811","abstract":"Crowdsourcing services such as Amazon's Mechanical Turk (MTurk) provide new venues for recruiting participants and conducting studies; hundreds of surveys may be offered to workers at any given time. We reflect on the results of six related studies we performed on MTurk over a two year period. The studies used a combination of open-ended questions and structured hypothetical statements about story-like scenarios to engage the efforts of 1252 participants. We describe the method used in the studies and reflect on what we have learned about identified best practices. We analyze the aggregated data to profile the types of Turkers who take surveys and examine how the characteristics of the surveys may influence data reliability. The results point to the value of participant engagement, identify potential changes in MTurk as a study venue, and highlight how communication among Turkers influences the data that researchers collect.","cites":"18","conferencePercentile":"97.36842105"},{"venue":"WebSci","id":"8a4901f5fef8f5f3a2309988d29c3d17fd623f43","venue_1":"WebSci","year":"2013","title":"BlueFinder: recommending wikipedia links using DBpedia properties","authors":"Diego Torres, Hala Skaf-Molli, Pascal Molli, Alicia Díaz","author_ids":"8048128, 1830003, 3025899, 2813225","abstract":"DBpedia knowledge base has been built from data extracted from Wikipedia. However, many existing relations among resources in DBpedia are missing links among articles from Wikipedia. In some cases, adding these links into Wikipedia will enrich Wikipedia content and therefore will enable better navigation. In previous work, we proposed PIA algorithm that predicts the best link to connect two articles in Wikipedia corresponding to those related by a semantic property in DBpedia and respecting the Wikipedia convention. PIA calculates this link as a path query. After introducing PIA results in Wikipedia, most of them were accepted by the Wikipedia community. However, some were rejected because PIA predicts path queries that are too general. In this paper, we report the BlueFinder collaborative filtering algorithm that fixes PIA miscalculation. It is sensible to the specificity of the resource types. According to the conducted experimentation we found out that BlueFinder is a better solution than PIA because it solves more cases with a better recall.","cites":"0","conferencePercentile":"12.28070175"},{"venue":"WebSci","id":"3c67cd499186371fbda3ffa93aa0c6bd4e6eefc6","venue_1":"WebSci","year":"2013","title":"Toward Google borders","authors":"Antoine Mazières, Samuel Huron","author_ids":"2560510, 1813823","abstract":"Query logs let by user on search-engines have helped create efficient tools for trend analysis, from commercial use to forecasting epidemics. In this paper, we propose a new method and system for cultural trends analysis based on Google auto-complete suggestions. We present <i>Zeitgeist Borders</i>, a toolkit enabling any user to collect and analyze associations between queries, suggestions and various regions of the world. We report unexpected observations about several behavioural and geographical trends along with promising uses.","cites":"0","conferencePercentile":"12.28070175"},{"venue":"WebSci","id":"f401aa9a3496d1052f5edd0e57c8f7ddc08bee46","venue_1":"WebSci","year":"2013","title":"Debanalizing Twitter: the transformation of an object of study","authors":"Richard Rogers","author_ids":"8567042","abstract":"This paper enquires into how Twitter has been studied since it was launched in 2006 as an ambient friend-following and messaging utility, modelled after dispatch communications. As Jack Dorsey, the Twitter co-founder, phrased it, Twitter also did rather well during disasters and elections, and subsequently became an event-following tool, at once shedding at least in part its image as a what-I-had-for-lunch medium. Most recently, Twitter has settled into a data set, one that is of value for Twitter, Inc. and also is archived by the Library of Congress. Each of these objects, described here as Twitter I, Twitter II, and Twitter III, have elicited particular approaches to its study, surveyed below. The paper takes each object in turn, describing the debates and scholarship around them, and provides a framework to situate past, current and future Twitter research.","cites":"6","conferencePercentile":"73.68421053"},{"venue":"WebSci","id":"f02e5550bf2f9265f8d09bf59d11c264e11211d2","venue_1":"WebSci","year":"2013","title":"Who wants to get fired?","authors":"Ricardo Kawase, Bernardo Pereira Nunes, Eelco Herder, Wolfgang Nejdl, Marco A. Casanova","author_ids":"1727722, 2988251, 1706210, 1744808, 1788336","abstract":"Microblogging services like Twitter have witnessed a flood of users and short updates (tweets). Although this phenomenon brings new possibilities of communication, it also brings dangerous consequences. From time to time, people post tweets guided by strong emotions. By default, tweets are public and anyone, anywhere can instantly see your updates, creating high exposure and lack of awareness about privacy issues. In many cases, this may lead to consequences that can be harmful to one's personal and professional life. In this paper, we investigate the posting behavior of people who tweet that they hate their jobs and bosses and their responses to alerts about the potential damage that such a tweet may cause. We show that, in many cases, people are not aware about the dimension of their audience, and once alerted, they often regret what they have publicly said. Our analysis leads us to believe that many users could benefit from a 'give a second thought before posting' tool that may save their jobs.","cites":"2","conferencePercentile":"41.22807018"},{"venue":"WebSci","id":"eadf2e7f51bb08d8c70f10ed6f325c90489301bd","venue_1":"WebSci","year":"2016","title":"Using the web to support political analysis: identifying legislative bill ideology in the chilean parliament","authors":"Pablo Loyola, Francisco Szederkenyi, Yutaka Matsuo","author_ids":"2915459, 3404490, 1692267","abstract":"In this work we propose a Web-centric approach for estimating legislative bill tendency. Our main assumption is that the current state of the Web represents a complex system that reflects human thinking and behavior. Today's Web services are characterized by user generated content, allowing everyone to interact and share their view about almost any topic, in the form of posts, comments, reviews, etc. If that data is extracted and efficiently aggregated, it could be possible to obtain a general estimation or view of a given phenomenon or event. We perform semi supervised classification of legislative bill by generating vector representations using three methods, Term Frequency vectors, Topic Models and Word Embeddings with the goal of estimating the tendency of a bill to favor corporations and industries over common good. The output, which can be seen as an estimation of the <i>ideology</i> of a bill, is then used to support political analysis, specifically, to study the relationship between campaign funding and voting behavior.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"131d9db2448deb6134c0468c78c6f29ac101e7ec","venue_1":"WebSci","year":"2016","title":"Search as research practices on the web: the SaR-Web platform for cross-language engine results analysis","authors":"Davide Taibi, Richard Rogers, Ivana Marenzi, Wolfgang Nejdl, Qazi Asim Ijaz Ahmad, Giovanni Fulantelli","author_ids":"1766982, 8567042, 3168230, 1744808, 3404385, 2240181","abstract":"Search engines are the most utilized tools to access information on the Web. The success of large companies such as Google owes to their capacity to conduct users through the vast troves of knowledge and information online. Recently, the concept of <i>search as research</i> has been used to shift the research focus from workings of information-seeking tools towards methods for the social study of Web and particularly the social meanings of engine results. In this paper, we present SaR-Web, a web search tool that provides an automatic means to carry out <i>search as research</i> on the Web. It compares the results of same (translated) queries across search engine language domains, thereby enabling cross-linguistic and cross-cultural comparisons of results. SaR-Web outputs enable the comparative study of cultural mores as well as societal associations and concerns, interpreted through search engine results.","cites":"1","conferencePercentile":"87.82051282"},{"venue":"WebSci","id":"eb5523efb02c007a222c0cd8fe2884bd48c55c42","venue_1":"WebSci","year":"2013","title":"Assessing the educational linked data landscape","authors":"Mathieu d'Aquin, Alessandro Adamou, Stefan Dietze","author_ids":"1714243, 1864666, 3081683","abstract":"In this research note, we present a preliminary study of available web datasets related to education, providing an overview of this area and, more importantly, highlighting how such linked datasets form a globally addressable network of resources for education. As expected, a certain level of heterogeneity was found. We therefore also show how a minor integration effort can improve the global cohesion of such a network of educational web data.","cites":"14","conferencePercentile":"92.98245614"},{"venue":"WebSci","id":"d52642173a68c5267e59e0f1e137be365c048505","venue_1":"WebSci","year":"2013","title":"Challenges and opportunities of local journalism: a case study of the 2012 Korean general election","authors":"Souneil Park, Minsam Ko, Jaeung Lee, Aram Choi, Junehwa Song","author_ids":"2474998, 2352657, 3029114, 2064722, 1789470","abstract":"Local journalism is a vital element for governance and civic engagement in local communities. It not only serves as an accountability mechanism for key local institutions but also enhances communities' problem solving skills by setting important agendas and opening public discussions. However, the Internet is posing serious challenges to local news outlets that lead to a significant reduction of accountability reporting and decreasing revenue. In this paper, we study the challenges and opportunities of local journalism in online communication space. We first observe the status of local journalism in online discourse by analyzing the public attention to local news outlets. Using Twitter to capture online public discourse, the study provides a large-scale quantitative analysis of the public's attention to local journalism. We also explore the potential to promote local journalism with information systems through a real deployment study. We propose a context-specific, decision-oriented design approach for local journalism, and evaluate it using Informed Citizen, a web portal to local journalistic contents of electoral districts.","cites":"4","conferencePercentile":"61.40350877"},{"venue":"WebSci","id":"bc22de02707f66cb4b8217a009c35fa485432539","venue_1":"WebSci","year":"2014","title":"Data-driven web entertainment: the data collection and analysis practices of fantasy sports players","authors":"Gabriel S. Dzodom, Frank M. Shipman","author_ids":"2283584, 1749811","abstract":"More and more data is available on the Internet. This data can provide the context for new forms of entertainment and edutainment. Here we study fantasy sports as an example of how this happens and how users bound their data-oriented activities. Fantasy sports are enjoyed by many tens of millions of players around the world. But how engaged are these players and how do they manage the information-rich nature of the game? To start to answer these questions, we are investigating players' fantasy sports practices. How much time do they spend playing? What information do they use to make decisions? How do they interact with other players? In this paper, we report on 160 responses to a questionnaire of US-based Amazon Mechanical Turk workers who are self-identified fantasy sports players.","cites":"0","conferencePercentile":"20.96774194"},{"venue":"WebSci","id":"5133b3e8c2db4b33f759d8366eb0e24e396a157f","venue_1":"WebSci","year":"2016","title":"Seeing the forest for the trees: new approaches to forecasting cascades","authors":"Siddharth Krishnan, Patrick Butler, Ravi Tandon, Jure Leskovec, Naren Ramakrishnan","author_ids":"3385913, 3092974, 1744761, 1702139, 1755938","abstract":"Cascades are a popular construct to observe and study information propagation (or diffusion) in social media such as Twitter. and are defined using notions of influence, activity, or discourse commonality (e.g., hashtags). While these notions of cascades lead to different perspectives, primarily cascades are modeled as trees. We argue in this paper an alternative viewpoint of cascades as forests (of trees) which yields a richer vocabulary of features to understand information propagation. We develop a framework to extract forests and analyze their growth by studying their evolution at the tree-level and at the node-level. Moreover, we demonstrate how the structural features of forests, properties of the underlying network, and temporal features of the cascades provide significant predictive value in forecasting the future trajectory of both size and shape of forests. We observe that the forecasting performance increases with observations, that the temporal features are highly indicative of cascade size, and that the features extracted from the underlying connected graph best forecast the shape of the cascade.","cites":"0","conferencePercentile":"39.1025641"},{"venue":"WebSci","id":"7b0de7a7c4e8ffbf0fcf1da217b676c28e910152","venue_1":"WebSci","year":"2011","title":"A shifting boundary: the dynamics of internal cognition and the web as external representation","authors":"Alan J. Dix","author_ids":"1784351","abstract":"Various disciplines have begun to emphasise the role of the external environment in human cognition. While initially focused on physical interactions, these theories are also of clear relevance to the web, especially in its role as external representation of human knowledge, potentially obviating the need to remember basic facts. Internal representation and cognition remain important, but change in the face of a pervasive digital environment. This paper explores the evolving dynamic between internal and external cognition, in particular the shift from knowledge to meta-knowledge and the way this impacts learning, society and, perhaps, the very nature of our own minds.","cites":"3","conferencePercentile":"50"},{"venue":"WebSci","id":"0a584a29e76cdaf5e1fc151bad51cdb7e3bca70f","venue_1":"WebSci","year":"2012","title":"Dissecting the butterfly: representation of disciplines publishing at the web science conference series","authors":"Clare J. Hooper, Nicolas Marie, Evangelos Kalampokis","author_ids":"1866599, 3207061, 3297060","abstract":"Web Science is an interdisciplinary arena. Motivated by the unforeseen scale and impact of the web, it addresses web-related research questions in a holistic manner, incorporating perspectives from a broad set of disciplines. There has been ongoing discussion about which disciplines are more or less present in the community, and about defining Web Science itself: there is, however, a dearth of empirical work in this area.\n This research note presents an early analysis of the presence of different disciplines in the Web Science community. To gain insight into this area, we applied Natural Language Processing and topic extraction to Web Science papers from 2009 to 2011. We compare the results to two current representations of Web Science: the 'Web Science butterfly' diagram and the Web Science Subject Categorization. We discuss the benefits of such an exploratory analysis, our early results, and steps for producing more robust results.","cites":"7","conferencePercentile":"58.69565217"},{"venue":"WebSci","id":"93c01504288f3a813da1e1a25802e5455d9d0602","venue_1":"WebSci","year":"2012","title":"Eventshop: from heterogeneous web streams to personalized situation detection and control","authors":"Mingyan Gao, Vivek K. Singh, Ramesh Jain","author_ids":"1700498, 4685302, 4521564","abstract":"The Web now has enormous volume of heterogeneous data being continuously reported by different sensors and humans from different locations. These data flows can be considered as spatio-temporal-thematic streams. Combined effectively, these streams can be used for detecting situations and saving lives and resources. We describe a system to combine streams from heterogeneous data sources, process them to detect situations, and use the detected situations to aid millions of users. This system uses a unified data model to integrate different web streams, and provides a set of generic operators to detect spatio-temporal characteristics of individual or combined data streams to detect complex situations. The detected situations can be combined with user parameters to provide personalized information and action alerts.","cites":"11","conferencePercentile":"75"},{"venue":"WebSci","id":"c19e0b508ee768d4eb938ca3e8c9eb8826b0827f","venue_1":"WebSci","year":"2015","title":"Diversity Analysis of Web Search Results","authors":"Suneel Kumar Kingrani, Mark Levene, Dell Zhang","author_ids":"2332269, 1722499, 1725070","abstract":"Are web search results usually dominated by major websites and therefore lacking diversity? In this paper, we aim to answer this question by quantitatively modelling the diversity of search results for popular queries using two diversity measures well-studied in ecology, namely Simpson's diversity index and Shannon's diversity index. Our theoretical analysis shows how the diversity of search results is determined by the Zipfian distribution of websites. Our empirical analysis reveals that comparing Google and Bing, the former is more diverse in the top-50 search results, while the latter is more diverse in the top-10 search results.","cites":"1","conferencePercentile":"72.72727273"},{"venue":"WebSci","id":"6fb4f1be4c07882e996948dfa461d4504d72f987","venue_1":"WebSci","year":"2013","title":"Considering people with disabilities as überusers for eliciting generalisable coping strategies on the web","authors":"Markel Vigo, Simon Harper","author_ids":"1727424, 3739189","abstract":"When users struggle on the Web they employ extreme adaptations to tackle problematic situations, namely coping strategies. If we are able to automatically detect such situations we can provide the means to bypass or pre-empt them. However, isolating these coping strategies is a challenging task: coping occurs seldom and when it happens, coping is not always overtly manifested. Therefore, in order to identify the coping strategies employed by users <i>in situ</i> longitudinal observations have to be conducted, which are resource intensive. We propose a more economical method that transfers the coping strategies employed by groups of users that cope frequently and overtly, such as people with disabilities, to broader populations. To do so, we first identify the coping strategies employed by people with disabilities; then we code these strategies and convert them into coping detection algorithms that are injected into web pages. Remote longitudinal studies are run with broader populations to measure the detection rate of the algorithms. Based on participants' feedback we iteratively modify the algorithms to adjust them to the coping strategies users employ. We illustrate this method with a case study that transfers the strategies employed by visually disabled users to able-bodied users. We discover that different populations do not only face the same problems, but also exhibit similar strategies to tackle them.","cites":"1","conferencePercentile":"28.07017544"},{"venue":"WebSci","id":"6ceacd889559cfcf0009e914d47f915167231846","venue_1":"WebSci","year":"2014","title":"The impact of visual attributes on online image diffusion","authors":"Luam C. Totti, Felipe Almeida Costa, Sandra Eliza Fontes de Avila, Eduardo Valle, Wagner Meira, Virgílio A. F. Almeida","author_ids":"2501616, 2075540, 3191578, 3136516, 1691267, 7360316","abstract":"Little is known on how visual content affects the popularity on social networks, despite images being now ubiquitous on the Web, and currently accounting for a considerable fraction of all content shared. Existing art on image sharing focuses mainly on non-visual attributes. In this work we take a complementary approach, and investigate resharing from a mainly visual perspective. Two sets of visual features are proposed, encoding both aesthetical properties (brightness, contrast, sharpness, etc.), and semantical content (concepts represented by the images). We collected data from a large image-sharing service (Pinterest) and evaluated the predictive power of different features on popularity (number of reshares). We found that visual properties have low predictive power compared that of social cues. However, after factoring-out social influence, visual features show considerable predictive power, especially for images with higher exposure, with over 3:1 accuracy odds when classifying highly exposed images between very popular and unpopular.","cites":"2","conferencePercentile":"63.70967742"}]}