{"WECWIS.csv":[{"venue":"WECWIS","id":"265f4da7a1cea04a85bb753af7fa213f68c01b94","venue_1":"WECWIS","year":"1999","title":"Mirror: A State-Conscious Concurrency Control Protocol for Replicated Real-Time Databases","authors":"Ming Xiong, Krithi Ramamritham, Jayant R. Haritsa, John A. Stankovic","author_ids":"3136517, 1704729, 1724642, 7230666","abstract":"Data replication can help database systems meet the stringent temporal constraints of current real-time applications, especially Web-based directory and electronic commerce services. A prerequisite for realizing the benefits of replication, however, is the development of high-performance concurrency control mechanisms. In this paper, we present MIRROR (Managing Isolation in Replicated Real-time Object Repositories), a con-currency control protocol specifically designed for firm-deadline applications operating on replicated real-time databases. MIRROR augments the classical O2PL concurrency control protocol with a novel state-based real-time conflict resolution mechanism. In this scheme, the choice of conflict resolution method is a dynamic function of the states of the distributed transactions involved in the conflict. A feature of the design is that acquiring the state knowledge does not require inter-site communication or synchronization, nor does it require modifications to the two-phase commit protocol. Using a detailed simulation model, we compare MIRROR's performance against the real-time versions of a representative set of classical replica concurrency control protocols for a range of transaction workloads and system configurations. Our performance studies show that (a) the relative performance characteristics of these protocols in the real-time environment can be significantly different from their performance in a traditional 1 (non-real-time) database system, (b) MIRROR provides the best performance in both fully and partially repli-cated environments for real-time applications with low to moderate update frequencies, and (c) MIRROR's simple to implement conflict resolution mechanism works almost as well as more sophisticated strategies.","cites":"27","conferencePercentile":"100"},{"venue":"WECWIS","id":"0b476006725a0634040e6268f18a9ec359ec429e","venue_1":"WECWIS","year":"1999","title":"A Quantitative Analysis of the User Behavior of a Large E-Broker","authors":"Virgílio A. F. Almeida, Wagner Meira, Victor F. Ribeiro, Nivio Ziviani","author_ids":"7360316, 1691267, 3014287, 1705422","abstract":"The Internet and the World Wide Web provide a global virtual marketplace. However, there is little information about the behavior of e-commerce users worldwide. The goal of the paper is twofold. First, we give an overview of the architecture and implementation of the Miner Family of Web Agents for e-commerce. Then, we present a quantitative study of the user behavior of a large e-broker (i.e., the BookMiner). Considering that the e-broker is used by a large number of users that only speak Portuguese and live in Brazil, we discuss the influence of regional and cultural issues on the e-commerce activities. Although the Web opens a company to a global market, our findings clearly indicate that e-commerce is strongly tied to regional issues, such as language, national customs and regulations, currency conversion and logistics. Also, the Internet infrastructure , mainly the intercontinental links, affects the user behavior.","cites":"1","conferencePercentile":"27.77777778"},{"venue":"WECWIS","id":"10940343fce77e139a38ef40ea663004f842f70f","venue_1":"WECWIS","year":"2002","title":"QoS Management in Web-based Real-Time Data Services","authors":"Sang Hyuk Son, Kyoung-Don Kang","author_ids":"1806873, 2825907","abstract":"The demand for real-time data services has been increasing recently. Many e-commerce applications and web-based information services are becoming very sophisticated in their data needs. They span the spectrum from low level status data, e.g., stock prices, to high level aggregated data, e.g., recommended selling/buying point. In these applications , it is desired to process user requests within their deadlines using fresh data, which reflect the current market status. Current web-based data services are poor at processing user requests in a timely manner using fresh data. To address this problem, we present a framework for guaranteed real-time data services in unpredictable environments. We also introduce a possible application of our approach in the distributed environment.","cites":"8","conferencePercentile":"87.5"},{"venue":"WECWIS","id":"445ba8a86aec7b704428fb4611681cfe6cdcaa58","venue_1":"WECWIS","year":"2002","title":"Modular Content Personalization Service Architecture for E-Commerce Applications","authors":"Susanne Boll","author_ids":"1714281","abstract":"Personalized Web portals are becoming more and more popular. What is unsatisfying with existing sites is that the scope of the personalized content they provide is typically that of the underlying site. Providers of such personalized content typically develop their own, proprietary personal-ized Web portal. To use different personalization features of different sites users have to hop from one personalized site to another and provide different user profile information there. Therefore, we propose a flexible architecture in which a personalization mediator acts as a broker of modular personalization services between providers of person-alized content and users that are interested in such person-alized content. In this architecture, the providers of person-alized content publish their personalization services via a unified interface to this mediator. A user provides its profile information to the mediator which in turn finds and calls the most suitable service which finally delivers the most targeted personalized content. The benefit of our approach is that users get an easier and unified access to a notional unlimited collection of personalization services by the mediator. For the providers, the approach allows different sites with different personalization capabilities to embed their personalization services in a generic infrastructure for applications like personalized Web portals.","cites":"2","conferencePercentile":"59.375"},{"venue":"WECWIS","id":"bfb83941482f77ec82573cdd6486ee1deddb0f42","venue_1":"WECWIS","year":"2001","title":"A Language for Information Commerce Processes","authors":"Karl Aberer, Andreas Wombacher","author_ids":"1751802, 1747956","abstract":"Automatizing information commerce requires languages to represent the typical information commerce processes. Existing languages and standards cover either only very specific types of business models or are too general to capture in a concise way the specific properties of information commerce processes. We introduce a language that is specifically designed for information commerce. It can be directly used for the implementation of the processes and communication required in information commerce. It allows to cover existing business models that are known either from standard proposals or existing information commerce applications on the Internet. The language has a concise logical semantics. In this paper we present the language concepts and an implementation architecture.","cites":"7","conferencePercentile":"50"},{"venue":"WECWIS","id":"3a8f107d24a9d8258c6fd6aa6fbbf4b67b2268c8","venue_1":"WECWIS","year":"2000","title":"E-Representative: A Scalability Scheme for E-Commerce","authors":"Wagner Meira, Daniel A. Menascé, Virgílio A. F. Almeida, Rodrigo Fonseca","author_ids":"1691267, 1758079, 7360316, 8478485","abstract":"In order to meet the quality of service demanded by a growing number of online customers, e-commerce services need to use scalability techniques. This paper introduces the concept of e-commerce representatives, a means of scaling the performance of e-commerce services. E-representatives are programs that execute on a cache server or at nearby machines. E-representatives can be implemented using redirection, a mechanism available in popular cache servers. Using analytical and simulation models , we show the potential performance gains obtained by e-commerce sites that distribute their services among e-representatives and contribute to reduce bandwidth consumption and network latency.","cites":"6","conferencePercentile":"33.33333333"},{"venue":"WECWIS","id":"6790d63029dfb01914cbe64993d8dfc72ce67953","venue_1":"WECWIS","year":"2002","title":"Separating Business Process from User Interaction Utilizing Process-Aware XSLT Style-Sheets","authors":"Karl Aberer, Anwitaman Datta, Zoran Despotovic","author_ids":"1751802, 1716678, 1779291","abstract":"In the web context, it is difficult to disentangle presentation from process logic, and sometimes even data is not separate from the presentation. Consequently, it becomes crucial to define an abstract model for business processes, and their mapping into an active user interface presentation , using the principle of separation of concern between the process logic, data and its presentation aspects. We endeavor to extend declarative (rule based) XSLT to accommodate the separation of process information from the data structure and presentation, and thus propose to design process aware stylesheets, in a minimally invasive manner. The isolation of the three otherwise entangled aspects of web-processes makes it easy to develop and maintain web-applications in a more independent manner, where each individual developer can focus on his/her primary responsibility , like describing the process, maintaining a database, or creating user interface (web-pages) without being levied any substantial effort to learn new technology. Keywords. Web-based information systems, e-commerce systems, user interface, XSLT, workflow management, information commerce.","cites":"0","conferencePercentile":"18.75"},{"venue":"WECWIS","id":"cc1c7c9dfb830240e69b033dab5800570763ea6d","venue_1":"WECWIS","year":"2000","title":"An Architecture to Support Distributed Data Mining Services in E-Commerce Environments","authors":"Shonali Krishnaswamy, Arkady B. Zaslavsky, Seng Wai Loke","author_ids":"1781256, 1750387, 1704577","abstract":"This paper presents our hybrid architectural model for Distributed Data Mining (DDM) which is tailored to meet the needs of e-businesses where application service providers sell DDM services to e-commerce users and systems. The hybrid architecture integrates the client-server and the mobile agent technologies. This model focuses on the optimisation and costing issues of DDM which are particularly relevant in the context of billing users for data mining services.","cites":"18","conferencePercentile":"66.66666667"}]}