{"WEDELMUSIC.csv":[{"venue":"WEDELMUSIC","id":"11b16caa10d2ce1694731a80c7a2171303133b2b","venue_1":"WEDELMUSIC","year":"2002","title":"Personal Orchestra: Conducting Audio/Video Music Recordings","authors":"Wolfgang Samminger, Max Mühlhäuser, Jan O. Borchers","author_ids":"3309454, 1725964, 1692837","abstract":"Personal Orchestra lets anybody conduct an electronic orchestra at a new level of realism: users interact not with a synthetic, but an original audio and video recording of a real orchestra—the Vienna Philharmonic. Nevertheless, they can interactively control not only volume and instru-mentation, but also tempo of the orchestra, using natural conducting gestures. A gesture-tracking and-predicting algorithm interprets user input, and a high-fidelity playback algorithm renders audio and video at variable speed without time-stretching artifacts such as pitch changes. The system was designed following a set of user interface design patterns for interactive exhibits. It is being used as the \" Virtual Conductor \" exhibit in the HOUSE OF MUSIC VIENNA by hundreds of visitors every day.","cites":"5","conferencePercentile":"61.11111111"},{"venue":"WEDELMUSIC","id":"212771f7d814eaf3bd3256fabb90de2aa695b4a8","venue_1":"WEDELMUSIC","year":"2001","title":"GlobeMusic: The Internet Scale of eMusic -Making","authors":"Max Mühlhäuser, Michael Welzl, Rainer Gutkas, Jan O. Borchers","author_ids":"1725964, 3341860, 3092726, 1692837","abstract":"The Internet is not only the global data highway but also the upcoming fourth mass medium. In this role, it procreates new musical genres and new roles of musical content providers and consumers. In an attempt to contribute to and explore this exciting (r)evolution, we developed GlobeMusic, a novel system and concept for eMu-sic-Making. Major ingredients of GlobeMusic were developed and exposed to a large public in the last four years. GlobeMusic and its components mainly address the following issues: computer-human interaction, individual eMusic-making, appropriate computer network protocols, musical data formats, and cooperative eMusic-making. The paper sketches the four major evolution steps of GlobeMusic because each of these steps represents a key aspect and system component.","cites":"1","conferencePercentile":"29.16666667"},{"venue":"WEDELMUSIC","id":"7670b1403e67952155a528dd853c15f044b125ae","venue_1":"WEDELMUSIC","year":"2001","title":"The Recording Studio that Spanned a Continent","authors":"Jeremy R. Cooperstock, Stephen P. Spackman","author_ids":"2242019, 3030365","abstract":"On September 23, 2000, a jazz group performed in a concert hall at McGill University in Montreal and the recording engineers mixing the 12 channels of uncompressed PCM audio during the performance were not in a booth at the back of the hall, but rather in a theatre at the University of Southern California in Los Angeles. To our knowledge, this is the first time that live audio of this quality has been streamed over the Internet. This paper describes the hardware configuration and software system used for the demonstration, explaining the motivation for our approach and summarizing some of the important lessons learned during the development process. 1 INTRODUCTION Real-time transmission of audio data over the Internet has become relatively commonplace, but the quality and number of channels has so far been severely limited by bandwidth constraints. With the ongoing growth of new, high speed networks comes the potential for high-fidelity, multi-channel audio distribution.","cites":"12","conferencePercentile":"83.33333333"},{"venue":"WEDELMUSIC","id":"893b6cd7c7b191160bfd49c0bb0945a881ccf710","venue_1":"WEDELMUSIC","year":"2003","title":"CBS: a concept-based sequencer for soundtrack composition","authors":"Michael O. Jewell, Mark S. Nixon, Adam Prügel-Bennett","author_ids":"3084706, 1727698, 1699301","abstract":"Existing methods of music composition vary from probability-based techniques to grammatical generation methods, yet the majority focus on the creation of independent pieces with no ties to other media. Our Concept-Based Sequencer (CBS) aims to use semantic markup of temporal media in combination with Genetic Algorithms to generate music that can fit scripted content such as film and radio. Genetic Algorithms offer an evolutionary approach which allows mutation but within a specified context. The concept here allows for linkage between media. This paper describes the techniques behind the CBS, and the construction of a web-based repository for concept mappings.","cites":"5","conferencePercentile":"44.44444444"},{"venue":"WEDELMUSIC","id":"648e3e6ca25ebec7b7ba0c7f768e20c4a431c8b5","venue_1":"WEDELMUSIC","year":"2004","title":"r-MUSIC, A Collaborative Music DJ for Ad Hoc Networks","authors":"Ursula Wolz, Michael Massimi, Eric Tarn","author_ids":"1686623, 3344938, 1878460","abstract":"We present r-MUSIC, client-server architecture for sharing music through a persistent resource in which the music data is not shared among users, but is streamed from personal digital music players to a stationary high fidelity speaker system. The client side of this system is installed on the personal digital music players. Users' music selections are transmitted through a wireless interface to the r-MUSIC server, which mediates a song title queue. Users call referenda on songs in the queue, and then vote on the popularity of songs, to mediate if and when they will be played. Our architecture includes a vote balancing mechanism that prevents users and their songs from becoming either too dominant or isolated. The power of this system is that an ad hoc group can share music without the need for a formal mediator. Mediation occurs entirely through collaboration.","cites":"2","conferencePercentile":"45"},{"venue":"WEDELMUSIC","id":"1126293c3cfb0c3de363b650416465089aa562f5","venue_1":"WEDELMUSIC","year":"2001","title":"Musical Data Mining for Electronic Music Distribution","authors":"François Pachet, Gert Westermann, Damien Laigre","author_ids":"1986454, 1776211, 1818398","abstract":"Music classification is a key ingredient for electronic music distribution. Because of the lack of standards in music classification – or the lack of enforcement of existing standards – there is a huge amount of unclassified titles of music in the world. In this paper we propose a method of classification based on musical data mining techniques that uses co-occurrence and correlation analysis for classification. This method allows for the rapid extraction of similarities between musical titles or artists. We investigate the usability of radio playlists and compilation CD databases for our data mining technique, and we compare the generated results with human similarity judgments. Based on a clustering technique, we show that interesting clusters can reveal specific music genres and allow classifying titles of music in a kind of objective manner.","cites":"45","conferencePercentile":"100"}]}