{"Wei_sheng_yan_jiu__Journal_of_h":[{"venue":"Wei sheng yan jiu = Journal of hygiene research","id":"895aa7dcba75d33da045fe260a53a371d63afea1","venue_1":"Wei sheng yan jiu = Journal of hygiene research","year":"1999","title":"[Changes of neurobehavioral functions in workers exposed to manganese].","authors":"Y Zheng, X Zhou, J Pan, Z Ma","author_ids":"1713117, 4872627, 7588906, 4743970","abstract":"The aim of this study was to assess the neurotoxic effects associated with the level of airborne manganese in the work place. A cumulative exposure index(CEI) was calculated for each subject. The neurobehavioral test battery, in terms of choosing reaction time, finger tapping, digit symbol, stylus in hole, Benton visual retention and Santa Ana dexterity was applied in the study. The manganese exposed workers had slower motor and response speed, poorer visuomotor coordination and steadiness. There was a dose-response relationship tendency between the cumulative exposure index and the behavioral function. Hence the neurobehavioral test may be a sensitive method in detecting early changes in motor and cognitive function among manganese-exposed workers. The study also demonstrates that the cumulative exposure of manganese about 1 mg/m3 per year may induce subclinical signs of intoxication.","cites":"0","conferencePercentile":"41.66666667"},{"venue":"Wei sheng yan jiu = Journal of hygiene research","id":"437faee9fe65caaec321848bf980aaf41eaf288d","venue_1":"Wei sheng yan jiu = Journal of hygiene research","year":"2004","title":"[Changes of cholecystokinin and nitric oxide synthase positive neurons of hippocampus in zinc-deficiency rat].","authors":"Jisheng Li, Bei Yan, Xin Zhao, Chao Wang","author_ids":"8549488, 5301307, 5245201, 6250419","abstract":"OBJECTIVE\nTo investigate the relationship between the effect of zinc deficiency on cholecystokinin (CCK) and nitric oxide synthase (NOS) positive neurons in rats hippocampus and changes of animal behavior, and to analyze the mechanism of zinc deficiency on learning memory.\n\n\nMETHODS\nZinc deficiency rat models were duplicated by intubation feeding low-zinc liquid for two weeks. Y-maze test was applied to study the learning and memory ability in rats; NADPH-d histochemistry method and ABC immunohistochemistry were used to investigate changes of NOS and CCK positive neurons in different hippocampal subfields.\n\n\nRESULTS\nCompared with the control group, the learning and memory ability of zinc deficiency rats was significantly decreased (P < 0.05); the serum zinc content was obviously reduced (P < 0.05), no change of hippocampal zinc content was found; the number of CCK and NOS positive neurons in hippocampal CA1 and CA3 area of zinc deficiency rats were significantly decreased (P < 0.05).\n\n\nCONCLUSION\nZinc deficiency may damage the learning-memory ability of the rats; the effects might be related to the low of CCK and NOS positive neurons in hippocampal CA1 and CA3 area in zinc deficiency rats.","cites":"2","conferencePercentile":"91.66666667"}]}