{"WEILEREC-TEL.csv":[{"venue":"WEILER@EC-TEL","id":"e017e5d3e45d859eeb46a912a693005d6b5acea6","venue_1":"WEILER@EC-TEL","year":"2013","title":"Managing Informal Learning in professional contexts: the learner's perspective","authors":"Arcelina Marques, Maria Clara Viegas, Gustavo Ribeiro Alves, Valentina Zangrando, Nikolas Galanis, José Janssen, Elwira Waszkiewicz, Miguel Ángel Conde González, Francisco J. García-Peñalvo","author_ids":"3025602, 3253820, 1719426, 1684614, 2570966, 2237384, 3311431, 1687759, 1722931","abstract":"Informal Learning is present in everyone's life but its awareness only recently has been reported. The need to keep track of the knowledge acquired this way is increasing as its sources diversity also increases. This work presents the pilots trials on the use of a tool developed to help keeping track of the learners' informal learning, within a number of companies spread out in three countries. This tool developed through the European Commission funded project TRAILER, is still under development, which will allow integrating the set of improving suggestions obtained from users during the piloting phase. The overall idea of managing one's informal learning was well accepted and welcomed, which validated the emerging need for a tool with this purpose. 5 Introduction The distinction between formal, informal and non-formal learning started being fostered in mid last century [1-2]. According to recent studies, informal learning (IL) can account for over 75% of one's continuous learning through life [3-4]. Even though most of the methods of developing IL were always used, their awareness as far as contributors to learning and enhancer of competence development is more recent [2]. Most companies still focus only on formal learning programs loosing valuable knowhow employees develop [3]. Nevertheless, in companies many practices have been reported in literature as being equally or even more productive, such as informal","cites":"3","conferencePercentile":"92.85714286"},{"venue":"WEILER@EC-TEL","id":"14c599e357dd2613c09240517ef914a6381dc12a","venue_1":"WEILER@EC-TEL","year":"2013","title":"Enhancing informal learning recognition through TRAILER project","authors":"Miguel Ángel Conde González, Francisco J. García-Peñalvo, Valentina Zangrando, Alicia García Holgado, Antonio M. Seoane-Pardo, Marc Alier Forment, Nikolas Galanis, Dai Griffiths, Mark William Johnson, José Janssen, Francis Brouns, Hubert Vogten, Anton Finders, Peter B. Sloep, Arcelina Marques, Maria Clara Viegas, Gustavo Ribeiro Alves, Elwira Waszkiewicz, Aleksandra Mykowska, Miroslav Minovic, Milos Milovanovic","author_ids":"1687759, 1722931, 1684614, 2641298, 1703383, 1690030, 2570966, 1782102, 1725456, 2237384, 2815970, 7204360, 2159020, 1700060, 3025602, 3253820, 1719426, 3311431, 1932447, 1696421, 1735256","abstract":"The evolution of new technology and its increasing use, has for some years been making the existence of informal learning more and more transparent, especially among young and older adults in both Higher Education and workplace contexts. However, the nature of formal and non-formal, course-based, approaches to learning has made it hard to accommodate these informal processes satisfactorily. The project aims to facilitate first the identification by the learner (as the last responsible of the learning process), and then the recognition by the institution, in dialogue with the learner, of this learning. To do so a methodology and a technological framework to support it have been implemented. This project have been tested in several context and it is possible to say that an informal learning dialogue between learners and people in chargé of the institutions is possible","cites":"3","conferencePercentile":"92.85714286"},{"venue":"WEILER@EC-TEL","id":"634773b1c5631b8bda31319defa8e160a62cbad8","venue_1":"WEILER@EC-TEL","year":"2013","title":"WEILER 2013: Workshop on solutions that enhance informal learning recognition","authors":"Miguel Ángel Conde González, Francisco J. García-Peñalvo, Dai Griffiths","author_ids":"1687759, 1722931, 1782102","abstract":"The increasing presence of Web 2.0 media and tools in the workplace makes informal learning increasingly important and its recognition there becomes especially relevant since this can enhance employability, producing positive benefits for managers and companies, and give employees opportunities to learn and keep their skills up-to-date, etc. Thus, taking into account the technological and organizational innovation and the affordances of the Internet, it is necessary to define new methodologies and tools to make visible and manage this informal learning. This workshop will gather experiences about informal learning recognition, focusing on, but not limited to: validation of informal learning experiences, institutional management of informal knowledge, making use of representations of informal learning, decision making informed by informal learning experiences and using of learning analytics to document or promote informal learning. 1 Rationale The increasing adoption of both web-based and mobile technologies, and their convergence, has for some years been making the existence of informal learning more and more transparent, especially among young and older adults in both Higher Education (HE) and workplace contexts [1]. The individual, as a social animal, learns in a range of different contexts, from her interaction with other persons, from her experience, etc. In many contexts the learning is neither planned nor structured. The concept of informal learning was coined in the middle of the twentieth century there are several definitions [2, 3], and more recent ones [4, 5]. Today, informal learning is becoming again the centre of discussion for several reasons: 1) The recognition that Bologna process is giving to informal learning [6] as a basic element in lifelong learning; 2) The pressing need to be able to demonstrate learning that in many cases is obtained by observation and experience","cites":"0","conferencePercentile":"35.71428571"}]}