{"WEIS.csv":[{"venue":"WEIS","id":"3ceffa9552c9cc5ea91e609d565f37942a9a8941","venue_1":"WEIS","year":"2010","title":"Guns, Privacy, and Crime","authors":"Alessandro Acquisti, Catherine Tucker","author_ids":"1683053, 2595331","abstract":"We investigate the impact of an information shock – the public exposure of the names and addresses of holders of handgun carry permits – on criminals' propensity to commit crimes. In December 2008, a Memphis, TN newspaper published a searchable online database of names, zip codes, and ages of Tennessee handgun carry permit holders. Once news of the database publication spread, an intense and acrimonious debate arose. Permit holders flooded the newspaper demanding its removal, on the grounds that the database invaded their privacy. Gun rights associations argued that the newspaper had put law-abiding gun owners at risk, giving criminals a pathway to burglarize their homes. The newspaper responded by suggesting that any criminal who perused the database would, in fact, be more likely to avoid households they believed to contain guns. We use detailed crime and handgun carry permit data for Memphis to estimate the impact of the database publication on different types of crime. We find that crimes more likely to be affected by knowledge of gun ownership-such as burglaries-increased more significantly, after the database was publicized, in zip codes with fewer gun permits, and decreased in those with more gun permits. We find no comparable effect for crimes that are usually not premeditated, like assaults or shootings, or in nearby areas and comparable cities that were not covered by the published database. We also find no evidence that publishing the identities of gun permit holders led to a relative increase in crimes aimed at stealing their weapons. Our findings contribute to the debate on gun control and crime, and to the debate on the privacy and security trade-offs associated with the public dissemination of governmental data.","cites":"1","conferencePercentile":"11.36363636"},{"venue":"WEIS","id":"68a30f73c52f0fde790aa7487a7a72a9a425933f","venue_1":"WEIS","year":"2009","title":"Social Insecurity: The Unintended Consequences of Identity Fraud Prevention Policies","authors":"Alessandro Acquisti, Ralph Gross","author_ids":"1683053, 1741233","abstract":"Designed as identifiers of accounts tracking US residents' earnings, Social Security numbers (SSNs) have become over time sensitive authenticators for private sector services. Since their abuse is a major vector of identity theft, numerous initiatives have attempted to reduce their public availability. However, recent research has shown that unavailable SSNs may still be accurately predicted from publicly available data. Such predictability may undermine the effectiveness of current strategies aimed at curtailing identity theft. This manuscript examines the policy initiatives that made SSNs predictable, the extent to which their predictability heightens the risks of identity theft for US residents, and the effectiveness of current identity theft prevention strategies in light of said predictability. We find that, surprisingly, a number of past policy initiatives designed to combat identity fraud actually created the conditions for the predictability of SSNs. We also find that current policies aimed at enhancing privacy and security of SSNs, while well-meaning, may too prove countereffective. Our results support alternative identity management solutions, such as banning the usage of SSNs for authentication and replacing them with credential systems based on usable cryptographic protocols.","cites":"3","conferencePercentile":"25"},{"venue":"WEIS","id":"6d3857fe3e62a400768fb6f51366add5f9ea4889","venue_1":"WEIS","year":"2007","title":"When 25 Cents is Too Much: An Experiment on Willingness-To-Sell and Willingness-To-Protect Personal Information","authors":"Jens Grossklags, Alessandro Acquisti","author_ids":"1718732, 1683053","abstract":"We present an empirical study of willingness-to-pay for protecting information (we term it willingness-to-protect) and willingness-to-accept a proposal to sell information (willingness-to-accept). We conducted the study in two parts. In the first part we presented the study participants with two single closed-ended yes-no questions, asking them to protect themselves against information release for a fixed amount of money, or offering them to release their information for a fixed amount of money. In the second part we asked subjects to specify their maximum willingness-to-protect for personal data and their minimum willingness-to-accept for the release of personal information. Our results show a clear preference across the vast majority of participants for money in exchange for data in both the protection and release scenarios, even if the actual monetary advantage of selling or not protecting in the close-ended choice situations is very small. In all hypothetical scenarios, we find that the average willingness-to-accept is dramatically higher than the average willingness-to-protect.","cites":"61","conferencePercentile":"95"},{"venue":"WEIS","id":"a3221df61847f98e29bf498b22a99d35892d0ca0","venue_1":"WEIS","year":"2008","title":"Do Data Breaches Disclosure Laws Reduce Identity Theft?","authors":"Sasha Romanosky, Rahul Telang, Alessandro Acquisti","author_ids":"2952105, 1840673, 1683053","abstract":"Identity theft resulted in corporate and consumer losses of $56 billion dollars in 2005, with about 30% of known identity thefts caused by corporate data breaches. Many US states have responded by adopting data breach disclosure laws that require firms to notify consumers if their personal information has been lost or stolen. While the laws are expected to reduce identity theft, their full effects have yet to be empirically measured. We use panel from the US Federal Trade Commission with state and time fixed-effects regression to estimate the impact of data breach disclosure laws on identity theft over the years 2002 to 2007. We find that adoption of data breach disclosure laws have marginal effect on the incidences of identity thefts and reduce the rate by just under 2%, on average. While this effect is marginal, reducing identity theft is only one means by which these laws can be evaluated: we appreciate that they may have other benefits such as reducing the average victim's losses or improving a firm's security and operational practices.","cites":"0","conferencePercentile":"18.18181818"},{"venue":"WEIS","id":"0db651bb7f0a05cb88bd85137a7576185cc40481","venue_1":"WEIS","year":"2010","title":"Misplaced Confidences: Privacy and the Control Paradox","authors":"Laura Brandimarte, Alessandro Acquisti, George Loewenstein","author_ids":"2856650, 1683053, 3070352","abstract":"We introduce and test the hypothesis that mere control over publication of private information affects individuals' privacy concerns and their propensity to disclose sensitive information even when the objective risks associated with such disclosures do not change or, in fact, worsen. We designed three experiments in the form of online surveys administered to students at a North-American University. In all experiments we manipulated the participants' control over information publication, but not their control over the actual access to and usage by others of the published information. Our findings suggest, paradoxically, that more control over the publication of their private information decreases individuals' privacy concerns and increases their willingness to publish sensitive information, even when the probability that strangers will access and use that information stays the same or, in fact, increases. On the other hand, less control over the publication of personal information increases individuals' privacy concerns and decreases their willingness to publish sensitive information, even when the probability that strangers will access and use that information actually decreases. Our findings have both behavioral and policy implications, as they highlight how technologies that make individuals feel more in control over the publication of personal information may have the paradoxical and unintended consequence of eliciting their disclosure of more sensitive information.","cites":"66","conferencePercentile":"95.45454545"},{"venue":"WEIS","id":"d79604c190d0670f30e4912ea4083cf9d60d9125","venue_1":"WEIS","year":"2015","title":"User Acceptance Factors for Anonymous Credentials: An Empirical Investigation","authors":"Zinaida Benenson, Anna Girard, Ioannis Krontiris","author_ids":"2916039, 2190753, 3124531","abstract":"We describe theoretical development of a user acceptance model for anonymous credentials and its evaluation in a real-world trial. Although anonymous credentials and other advanced privacy-enhanced technologies (PETs) reached technical maturity , they are not widely adopted so far, such that understanding user adoption factors is one of the most important goals on the way to better privacy management with the help of PETs. Our model integrates the Technology Acceptance Model (TAM) with the considerations that are specific for security-and privacy-enhancing technologies, in particular, with their \" secondary goal \" property that means that these technologies are expected to work in the background, facilitating the execution of users' primary, functional goals. We introduce five new constructs into the TAM: Perceived Usefulness for the Primary Task (PU1), Perceived Usefulness for the Secondary Task (PU2), Situation Awareness, Perceived Anonymity and Understanding of the PET. We conduct an evaluation of our model in the concrete scenario of a university course evaluation. Although the sample size (30 participants) is prohibitively small for deeper statistical analysis such as multiple regressions or structural equation modeling, we are still able to derive useful conclusions from the correlation analysis of the constructs in our model. Especially, PU1 is the most important factor of user adoption, outweighing the usability and the usefulness of the deployed PET (PU2). Moreover, correct Understanding of the underlying PET seems to play a much less important role than a user interface of the system that clearly conveys to the user which data are transmitted when and to which party (Situation Awareness).","cites":"1","conferencePercentile":"47.61904762"},{"venue":"WEIS","id":"504b3c3d02b633f4790b7e9af0e611805570b182","venue_1":"WEIS","year":"2006","title":"A Model for Opportunistic Network Exploits: The Case of P2P Worms","authors":"Michael P. Collins, Carrie Gates, Gaurav Kataria","author_ids":"7636176, 1723990, 2778439","abstract":"We segregate attacks into two categories – targeted and opportunistic – based on whether the attacker compromises a specific target (targeted) or a number of intermediate targets to fulfill his end goal (opportunistic). We assume that opportunistic attackers consider targets indistinguishable except for their vulnerabilities, and are interested in acquiring as many targets as possible. We therefore hypothesize that opportunistic attackers will develop attacks involving services which have the largest number of potential targets. We test this hypothesis in a limited way by correlating worm releases on P2P file sharing networks with the number of users on the networks being targeted. Our results demonstrate that this relationship exists only for variants of worms and not for new worms. We further demonstrate that the results are service specific, and that there is no general model that represents the entire file sharing vector.","cites":"5","conferencePercentile":"24"},{"venue":"WEIS","id":"186817f4cce9043a7926482c69fdc6ea74dd0768","venue_1":"WEIS","year":"2007","title":"Optimally Securing Enterprise Information Systems and Assets","authors":"Vineet Kumar, Rahul Telang, Tridas Mukhopadhyay","author_ids":"1740059, 1840673, 1794433","abstract":"Information security is a growing priority for organizations, many of which are struggling to decide the appropriate amounts of investments to counter threats to availability, confidentiality and integrity of information systems that put interlinked business processes at risk. The investments in security countermeasures usually have the characteristics of externalities since one entity's investment decision affects the utility of other entities that are connected to it. We specifically characterize the nature of the externalities that lead to divergence of interests between a central planner (or CIO) and division managers, where the former does not fully understand the nature of information systems deployed at different divisions within the enterprise. Also, most economics based prior research has considered information security to be a black box here we demonstrate the utility of opening up the black box by illustrating the differing strategic effects of availability and confidentiality losses in an interconnected enterprise and many of the findings turn out to be counterintuitive. Overall, we provide a rigorously derived framework to help firms design optimal mechanisms to deploy both protection and cryptographic countermeasures for availability and confidentiality losses. Several managerial implications that translate the research insights obtained in the paper to actionable recommendations are provided.","cites":"0","conferencePercentile":"7.5"},{"venue":"WEIS","id":"fbacfbf013bae9077165280e1da04438d0b0c1d8","venue_1":"WEIS","year":"2005","title":"Cyber-insurance As A Market-Based Solution To The Problem Of Cybersecurity","authors":"Jay P. Kesan, Ruperto P. Majuca, William Yurcik","author_ids":"2310753, 2037272, 1713112","abstract":"We conduct a case study of the cyberinsurance industry. We examine the developing cyberliability legislation and the emerging cyberinsurance market. We conclude that cyberinsurers are able to find ways to deal with several problems that could result in the failure of market solution. Although some issues still need to be worked out, we suggest that the direction to be taken should be towards resolving these issues, rather than giving up the market solution. When these obstacles are fully worked out, the full market solution can result in the following benefits. First, cyberinsurance would result in higher security investment, increasing the level of safety for information technology (IT) infrastructure. Second, cyberinsurance can facilitate standards for best practices as cyberinsurers seek benchmark security levels for risk management decision-making. Third, the creation of an IT security insurance market will result in higher overall societal welfare.","cites":"22","conferencePercentile":"82.85714286"},{"venue":"WEIS","id":"776884d844f406fbfd82ad67b85ebaabd2b0e360","venue_1":"WEIS","year":"2010","title":"Modeling Cyber-Insurance: Towards a Unifying Framework","authors":"Rainer Böhme, Galina Schwartz","author_ids":"1748910, 1734701","abstract":"We propose a comprehensive formal framework to classify all market models of cyber-insurance we are aware of. The framework features a common terminology and deals with the specific properties of cyber-risk in a unified way: interdependent security, correlated risk, and information asymmetries. A survey of existing models, tabulated according to our framework, reveals a discrepancy between informal arguments in favor of cyber-insurance as a tool to align incentives for better network security, and analytical results questioning the viability of a market for cyber-insurance. Using our framework, we show which parameters should be considered and endogenized in future models to close this gap.","cites":"52","conferencePercentile":"90.90909091"},{"venue":"WEIS","id":"532a45960f622a64a356f543b1cc032d78eb77d5","venue_1":"WEIS","year":"2015","title":"No Please, After You: Detecting Fraud in Affiliate Marketing Networks","authors":"Peter Snyder, Chris Kanich","author_ids":"5554100, 3110399","abstract":"Cookie stuffing is an activity which allows unscrupulous actors online to defraud affiliate marketing programs by causing themselves to receive credit for purchases made by web users, even if the affiliate marketer did not actively perform any marketing for the affiliate program. Using two months of HTTP request logs from a large public university, we present an empirical study of fraud in affiliate marketing programs. First, we develop an efficient, decision-tree based technique for detecting cookie-stuffing in HTTP request logs. Our technique replicates domain-informed human labeling of the same data with 93.3% accuracy. Second, we find that over one-third of publishers in affiliate marketing programs use fraudulent cookie-stuffing techniques in an attempt to claim credit from online retailers for illicit referrals. However, most realized conversions are credited to honest publishers. Finally, we present a stake holder analysis of affiliate marketing fraud and find that the costs and rewards of affiliate marketing program are spread across all parties involved in affiliate marketing programs.","cites":"2","conferencePercentile":"64.28571429"},{"venue":"WEIS","id":"053738ecc872d1d748c41867e1098261cf9cc3f8","venue_1":"WEIS","year":"2015","title":"What is a Cookie Worth?","authors":"Arslan Aziz, Rahul Telang","author_ids":"8644739, 1840673","abstract":"Tracking a user's online browsing behavior to target her with relevant ads has become pervasive. There is an ongoing debate about the value of such tracking and the associated loss of privacy experienced by users. We inform this debate by quantifying the value of using different kinds of potentially privacy-intrusive information in targeted advertising. We find that using increasingly privacy-intrusive information increases the accuracy of prediction of purchases, but at a decreasing rate. We also find that targeted advertising is effective in increasing purchase probability and that this effect increases with the baseline purchase probability of a user. Finally, we simulate different privacy policy regimes by restricting different kinds of user information from being used for targeted advertising and quantify the impact such restrictions have on sales. We find that using privacy-intrusive user information can increase ad effectiveness by over 30% compared to random targeting. Using temporal information such as time spent by a user on an advertiser's website and time period since last visit increase ad effectiveness by over 20%. Other privacy-intrusive information, such as time spent on different types of product pages or number of unique products searched do not increase ad effectiveness significantly.","cites":"0","conferencePercentile":"21.42857143"},{"venue":"WEIS","id":"7dc60bd4dacecc6203a57eec59f9fea0e31a9b99","venue_1":"WEIS","year":"2015","title":"Prioritizing Security Spending: A Quantitative Analysis of Risk Distributions for Different Business Profiles","authors":"Armin Sarabi, Parinaz Naghizadeh Ardabili, Yang Liu, Mingyan Liu","author_ids":"2437891, 2876746, 1750084, 1724680","abstract":"This paper aims to understand if, and to what extent, business details about an organization can help provide guidelines for better resource allocation across different preventive measures, in order to effectively protect, detect , and recover from, different forms of security incidents. Existing work on analyzing the distribution of risk across different incident categories, most notably Verizon's latest Data Breach Investigations Report, provide recommendations based solely on business sector information. In this paper, we leverage a broader set of publicly available business details to provide a more fine-grained analysis. Specifically, we use incident reports collected in the VERIS Community Database (VCDB), as well as data from Alexa Web Information Service (AWIS), to train and test a sequence of classi-fiers/predictors. We show that compared to using business sector information alone, our method can achieve the same accuracy by allowing organizations to focus on a sparser set of incident types, thus achieving the same level of protection by spending less resources on security through more judicious prioritization.","cites":"1","conferencePercentile":"47.61904762"},{"venue":"WEIS","id":"6a913312fd3072c7beae91d0b164862018aed374","venue_1":"WEIS","year":"2009","title":"The Iterated Weakest Link - A Model of Adaptive Security Investment","authors":"Rainer Böhme, Tyler Moore","author_ids":"1748910, 2345093","abstract":"Introduction Model description Analytical results Motivation Motivating example 1: online crime Motivating example 2: payment card security Motivation We read about security breaches in the news almost daily, each bigger and more costly than the last Is such unending failure a consequence of flawed technology, policy, or simply ineptitude? Or does it reflect rational behavior? Up-front security investment can be expensive Deciding which threats to protect against is hard, and prone to miscalculations and oversights Might it be easier to wait for an attacker to act, and then respond? Introduction Model description Analytical results Motivation Motivating example 1: online crime Motivating example 2: payment card security The iterated weakest link model Information systems are often structured so that a system's overall security depends on its weakest link The most careless programmer introduces a vulnerability Botnet herders run command-and-control from most lax ISPs Varian (WEIS 2004) studied the static case of weakest links But what about the dynamic case? Attackers exploit the weakest link; defenders plug the hole; attackers move on to the next-weakest link Our model captures this iterative nature In our model, defender uncertainty regarding which links are weakest helps justify reactive, delayed security investment Rainer Böhme and Tyler Moore The Iterated Weakest Link Introduction Model description Analytical results Motivation Motivating example 1: online crime Motivating example 2: payment card security Phishing and online crime Due to its open, distributed architecture, the Internet's overall security depends on the weakest link Substantial evidence that attackers shift operations from one ISP to the next Once ISPs act to clean up malware-infected webservers, attackers move on to other ISPs (Day et. al WEIS 2008) Bot command and control quickly adapted once protective ISPs/registrars shut down (RBN, McColo, EstDomains,. . .) Rock-phish gang iterate over unsuspecting registrars (Moore and Clayton 2007) Introduction Model description Analytical results Motivation Motivating example 1: online crime Motivating example 2: payment card security Payment card security and the iterated weakest link Many security mechanisms have been introduced over the past few decades to combat card fraud The latest defense, Chip & PIN, has substantially reduced face-to-face transaction fraud in the UK Yet aggregate fraud losses have increased since Chip & PIN's introduction Why? Fraudsters have found other weaknesses to exploit Introduction Model description Analytical results Motivation Motivating example 1: online crime Motivating example 2: payment card security The rise of card-not-present fraud Fraud type 2004 2006 Face-to-face retail …","cites":"27","conferencePercentile":"83.33333333"},{"venue":"WEIS","id":"d6c278d438620dc8b64dd19a86a5d84094faf24c","venue_1":"WEIS","year":"2012","title":"The Effect of Fraud Investigation Cost on Pay-Per-Click Advertising","authors":"Min Chen, Varghese S. Jacob, Suresh Radhakrishnan, Young U. Ryu","author_ids":"1711628, 2390928, 1705447, 7962802","abstract":"Click fraud is a critical problem in pay-per-click (PPC) advertising industry wherein advertisers pay a service provider (SP) when their ad is clicked. While both SPs and advertisers employ technologies to identify fraudulent clicks, prior work shows that they cannot be induced to make further improvements to their respective technologies and suggests that PPC industry would benefit from using other mechanisms, such as reputation and third party investigation , to deter click fraud. In this paper, we consider the use of third-party investigation to address this problem. In particular, we model the problem of identifying click fraud in a three stage process where the SP first classifies clicks as fraudulent or not using a detection technology, and then the advertiser does the same for those clicks classified as valid using a verification technology and if there are disagreements, a third party inspects them using an investigation technology and his conclusion is considered binding. The SP and advertiser can choose a high-or low-precision technology to identify click fraud, but the choices are not observable to the other, leading to a double moral hazard problem. On the other hand, the quality of the third-party's investigation technology is observable and known to both the SP and the advertiser. We consider two payment schemes for the third party's investigation cost, the SP-pay scheme (SS), where SP pays for third party investigation, and the advertiser-pay scheme (AS), where the advertiser pays the investigation cost. In this paper, we examine the question of who has the incentive to pay the investigation cost (i.e., finance the third party) when a third party handles the investigation of contestable clicks? We show that when the cost of SP's detection technology is large, the SP would choose not to pay for the investigation cost even though he may receive a higher payment from the advertiser. Nevertheless, the SP would be willing to pay for third party investigation when the cost of his detection technology is small. This happens because if the advertiser pays for the investigation in this case, then the responsibility of payments to the third party will help mitigate the advertiser's incentive problem. This leads to a large decrease in PPC and overall less rent to the SP. Therefore, the SP may still choose to pay for third party investigation for a higher payment from the advertiser even though this would incur a direct cost to the SP.","cites":"2","conferencePercentile":"26.47058824"},{"venue":"WEIS","id":"30bf2252a83fbd566a7c7011cd56d82c32832aef","venue_1":"WEIS","year":"2012","title":"Choice Architecture and Smartphone Privacy: There's a Price for That","authors":"Serge Egelman, Adrienne Porter Felt, David Wagner","author_ids":"2645852, 2838694, 4073051","abstract":"Under certain circumstances, consumers are willing to pay a premium for privacy. We explore how choice architecture affects smartphone users' stated willingness to install applications that request varying permissions. We performed two experiments to gauge smartphone users' stated willingness to pay premiums to limit their personal information exposure when installing new applications. We found that when participants were comparison shopping between multiple applications that performed similar functionality, a quarter of our sample responded that they were willing to pay a $1.50 premium for the application that requested the fewest permissions—though only when viewing the requested permissions of each application side-by-side. In a second experiment, we more closely simulated the user experience by asking them to valuate a single application that featured multiple sets of permissions based on five between-subjects conditions. In this scenario, the requested permissions had a much smaller impact on participants' responses. Our results suggest that many smartphone users are concerned with their privacy and are willing to pay premiums for applications that are less likely to request access to personal information. We propose improvements in choice architecture for smartphone application markets that could result in decreased satisficing and increased rational behavior.","cites":"35","conferencePercentile":"94.11764706"},{"venue":"WEIS","id":"72c7226ad9824676590319ab55d183603e5df115","venue_1":"WEIS","year":"2010","title":"Security Games in Online Advertising: Can Ads Help Secure the Web?","authors":"Nevena Vratonjic, Jean-Pierre Hubaux, Maxim Raya, David C. Parkes","author_ids":"3265338, 1757221, 2152296, 1702994","abstract":"Some ISPs are trying to become part of the online advertising market. Such ISPs either: (i) cooperate with online advertising entities (e.g., ad networks) by providing users' private information to achieve better ad targeting in exchange for a share of the revenue, or (ii) modify the ad traffic on-the-fly such that they divert part of the online advertising revenue for themselves. This is a very important issue because online advertising is at the core of today's business model and it fuels many \" free \" applications and services. We study this behavior using game theory to model the interactions between ISPs and ad networks, and we analyze the effects on the Web caused by ISPs taking part in online advertising. Our results show that if the users' private information can improve ad targeting significantly and if ad networks do not have to pay a high share of revenue to the ISPs, ad networks and ISPs will cooperate to jointly provide targeted online ads. Otherwise, ISPs will divert part of the online ad revenue for themselves. In that case, if the diverted revenue is small, ad networks will not react. However, if their revenue loss is significant, the ad networks will invest into improving the security of the Web and protecting their ad revenue.","cites":"10","conferencePercentile":"50"},{"venue":"WEIS","id":"abb031348316d789fbf37376e53a9b6a299f8d4e","venue_1":"WEIS","year":"2008","title":"Conformity or Diversity: Social Implications of Transparency in Personal Data Processing","authors":"Rainer Böhme","author_ids":"1748910","abstract":"Consider the hypothetical situation of a society with virtually unconstrained storage and exchange of personal information and shameless exploitation thereof for decision making, for example in contract negotiation. In this paper we develop a stylised formal model to tackle the question if public knowledge about how exactly personal information is used in decision making changes aggregate behaviour. Simulation results suggest a slightly positive relationship between transparency and conformity, i.e., people tend to behave alike. This has implications on the common conjecture that collection and processing of personal information is tolerable as long as transparency is warranted.","cites":"0","conferencePercentile":"18.18181818"},{"venue":"WEIS","id":"6fd04e5f8712ebabf46a50dde767c98b0d58213b","venue_1":"WEIS","year":"2008","title":"Security Economics and European Policy","authors":"Ross J. Anderson, Rainer Böhme, Richard Clayton, Tyler Moore","author_ids":"2381794, 1748910, 1892117, 2345093","abstract":"In September 2007, we were awarded a contract by the European Network and Information Security Agency (ENISA) to investigate failures in the market for secure electronic communications within the European Union, and come up with policy recommendations. In the process, we spoke to a large number of stakeholders, and held a consultative meeting in December 2007 in Brussels to present draft proposals, which established most had wide stakeholder support. The formal outcome of our work was a detailed report, ―Security Economics and the Internal Market‖, published by ENISA in March 2008. This paper presents a much abridged version: in it, we present the recommendations we made, along with a summary of our reasoning.","cites":"29","conferencePercentile":"86.36363636"},{"venue":"WEIS","id":"3f9426bf2c0b1808db4b5ce940ed36f476bc6d61","venue_1":"WEIS","year":"2012","title":"The Privacy Economics of Voluntary Over-disclosure in Web Forms","authors":"Sören Preibusch, Kat Krol, Alastair R. Beresford","author_ids":"1779051, 2008824, 2619693","abstract":"The Web form is the primary mechanism to collect personal data from individuals on the Web. Privacy concerns, time spent, and typing effort act as a major deterrent to completing Web forms. Yet consumers regularly provide more data than required. In a field experiment , we recruited 1500 Web users to complete a form asking for ten items of identity and profile information of varying levels of sensitivity. We manipulated the number of mandatory fields (none vs. two) and the compensation for participation ($0.25 vs. $0.50) to quantify the extent of over-disclosure, the motives behind it, and the resulting costs and privacy invasion. We benchmarked the efficiency of compulsion and incentives in soliciting data against voluntary disclosure alone. We observed a high prevalence of deliberate and unpaid over-disclosure of data. Participants regularly completed more form fields than required, or provided more details than requested. Through careful experimental design, we verified that participants understood that additional data disclosure was voluntary, and the information provided was considered sensitive. In our experiment, we found that making some fields mandatory jeopardised voluntary disclosure for the remaining optional fields. Conversely , monetary incentives for disclosing those same fields yielded positive spillover by increasing revelation ratios for other optional fields. We discuss the implications for commercial Website operators, regulators, privacy-enhancing browser standards, and further experimental research in privacy economics. Web users have been typing data into Web forms since they were added to the HTML standard [1] in 1995. Web forms allow interactive search and retrieval requests to servers, and to submit data to the Web server for further processing and storage. The HTML5 working draft proposes richer semantics for Web forms, including typed input fields which will only accept data of a specific type, such as valid telephone numbers or email addresses. The new draft standard also recognises that Web forms may be used \" for purposes other than submitting data to a server \" [2]. Indeed, the use of form elements to collect data and process it locally inside the Web browser itself—typically using JavaScript—is already common on the Web today. In a few cases, data processed in this way remains","cites":"10","conferencePercentile":"76.47058824"},{"venue":"WEIS","id":"ce28c448613e71a9aec886566bb3f7eea543c6f9","venue_1":"WEIS","year":"2012","title":"Analysis of eCrime in Crowd-sourced Labor Markets: Mechanical Turk vs. Freelancer","authors":"Vaibhav Garg, Chris Kanich, L. Jean Camp","author_ids":"3031889, 3110399, 1911185","abstract":"Research in the economics of security has contributed more than a decade of empirical findings to the understanding of the microeconomics of (in)security, privacy, and ecrime. Here we build on insights from previous macro-level research on crime, and microeconomic analyses of ecrime to develop a set of hypotheses to predict which variables are correlated with national participation levels in crowd-sourced ecrime. Some hypotheses appear to hold, e.g. Internet penetration, English literacy, size of the labor market, and government policy all are significant indicators of crowd-sourced ecrime market participation. Greater governmental transparency, less corruption, and more consistent rule of law lower the participation rate in ecrime. Other results are counter-intuitive. GDP per person is not significant, and unusually for crime, a greater percentage of women does not correlate to decreased crime. One finding relevant to policymaking is that deterring bidders in crowd-sourced labor markets is an ineffective approach to decreasing demand and in turn market size.","cites":"7","conferencePercentile":"70.58823529"},{"venue":"WEIS","id":"8e0174b687d6fbeae7563588c2a9bc5936fce3ca","venue_1":"WEIS","year":"2011","title":"Health Disclosure Laws and Health Information Exchanges","authors":"Idris Adjerid, Alessandro Acquisti, Rema Padman, Rahul Telang, Julia Adler-Milstein","author_ids":"2587281, 1683053, 1732864, 1840673, 2599872","abstract":"Health information exchanges (HIEs) are expected to facilitate collaboration between healthcare entities and improve efficiency and quality of care through enhanced information sharing capabilities. Privacy concerns have been consistently cited as one of the primary challenges to HIE development and adoption. Currently, it is unclear how privacy laws – in particular, legislation restricting the disclosure of health records – have impacted the adoption of HIEs intended to facilitate sharing of health information. This study explores the landscape of health privacy legislation at the State level and examines the impact of variations in such privacy and confidentiality laws across the United States on the progress of HIEs.","cites":"0","conferencePercentile":"7.894736842"},{"venue":"WEIS","id":"77e5a4a3c953e592011ff99ab6155773617c77fc","venue_1":"WEIS","year":"2009","title":"Nobody Sells Gold for the Price of Silver: Dishonesty, Uncertainty and the Underground Economy","authors":"Cormac Herley, Dinei A. F. Florêncio","author_ids":"1679146, 1882479","abstract":"Much attention has been devoted recently to the underground economy, and in particular to the IRC markets for stolen identities, phishing kits, botnets, and cyber-crime related services. It is suggested that sophisticated underground markets show great specialization and maturity. There are complex divisions of labor and service offerings for every need. Stolen credentials are traded in bulk for pennies on the dollar. It is suggested that large sums move on these markets. We argue that this makes very little sense. Using basic arguments from economics we show that the IRC markets studied represent classic examples of lemon markets. The ever-present rippers who cheat other participants ensure that the market cannot operate effectively. Their presence represents a tax on every transaction. Those who form gangs and alliances avoid this tax, enjoy a lower cost basis and higher profit. This suggests a two tier underground economy where organization is the route to profit. The IRC markets appear to be the lower tier, and are occupied by those without skills or alliances, newcomers, and those who seek to cheat them. The goods offered for sale on these markets are those that are easy to acquire, but hard to monetize. We find that estimates of the size of the IRC markets are enormously exaggerated. Finally, we find that defenders recruit their own opponents by publicizing exaggerated estimates of the rewards of cybercrime. Those so recruited inhabit the lower tier; they produce very little profit, but contribute greatly to the externalities of cybercrime.","cites":"55","conferencePercentile":"94.44444444"},{"venue":"WEIS","id":"22318cb36fcad6d0c3f00e87b394ede95c749db6","venue_1":"WEIS","year":"2010","title":"The Plight of the Targeted Attacker in a World of Scale","authors":"Cormac Herley","author_ids":"1679146","abstract":"Despite neglecting even basic security measures, close to two billion people use the Internet, and only a small fraction appear to be victimized each year. This paper suggests that an explanation lies in the economics of attacks. We distinguish between scalable attacks, where costs are almost independent of the number of users attacked , and non-scalable (or targeted) attacks, which involve per-user effort. Scalable attacks reach orders of magnitude more users. To compensate for her disadvantage in terms of reach the targeted attacker must target users with higher than average value. To accomplish this she needs that value be both visible and very concentrated, with few users having very high value while most have little. In this she is fortunate: power-law longtail distributions that describe the distributions of wealth, fame and other phenomena are extremely concentrated. However, in these distributions only a tiny fraction of the population have above average value. For example, fewer than 2% of people have above average wealth in the US. Thus, when attacking assets where value is concentrated, the targeted attacker ignores the vast majority of users, since attacking them hurts rather than helps her requirement to extract greater than average value. This helps explain why many users escape harm, even when they neglect security precautions: most users never experience most attacks. Attacks that involve per-user effort will be seen by only a tiny fraction of users. No matter how clever the exploit, unless the expected value is high, there is little place for per-user effort in this world of mass-produced attacks.","cites":"23","conferencePercentile":"77.27272727"},{"venue":"WEIS","id":"39e85ff3a883db3b5c2639b8c91b0704b462f497","venue_1":"WEIS","year":"2007","title":"On the Viability of Privacy-Enhancing Technologies in a Self-Regulated Business-to-Consumer Market: Will Privacy Remain a Luxury Good?","authors":"Rainer Böhme, Sven Koble","author_ids":"1748910, 3303854","abstract":"The collection of personal data in business-to-consumer transactions and respecting the consumers' privacy preferences are fundamentally competing goals. This paper studies the effects of emerging user-controlled privacy-enhancing technologies on supply-side decision making with respect to technology adoption and pricing strategies. In particular, identity management systems that allow buyers to interact pseudonymously with online stores thwart the sellers' efforts to discriminate prices based on personal data. We present stylised micro-economic models (1) to compare self-regulated and government-enforced regimes towards the adoption of privacy-enhancing technologies, (2) to analyse the conditions under which it is profitable for sellers to support such technologies, and (3) to study implication on social welfare and consumer prices.","cites":"14","conferencePercentile":"70"},{"venue":"WEIS","id":"24af7e7832277628c9fa108e31c31d75d3c494bc","venue_1":"WEIS","year":"2006","title":"Models and Measures for Correlation in Cyber-Insurance","authors":"Rainer Böhme, Gaurav Kataria","author_ids":"1748910, 2778439","abstract":"High correlation in failure of information systems due to worms and viruses has been cited as major impediment to cyber-insurance. However, of the many cyber-risk classes that influence failure of information systems, not all exhibit similar correlation properties. In this paper, we introduce a new classification of correlation properties of cyber-risks based on a twin-tier approach. At the first tier, is the correlation of cyber-risks within a firm i.e. correlated failure of multiple systems on its internal network. At second tier, is the correlation in risk at a global level i.e. correlation across independent firms in an insurer's portfolio. Various classes of cyber-risks exhibit different level of correlation at two tiers, for instance, insider attacks exhibit high internal but low global correlation. While internal risk correlation within a firm influences its decision to seek insurance, the global correlation influences insurers' decision in setting the premium. Citing real data we study the combined dynamics of the two-step risk arrival process to determine conditions conducive to the existence of cyber-insurance market. We address technical, managerial and policy choices influencing the correlation at both steps and the business implications thereof.","cites":"44","conferencePercentile":"92"},{"venue":"WEIS","id":"90751247356a78db1d757b5e3d3b0ab4acc26cc9","venue_1":"WEIS","year":"2011","title":"Sex, Lies and Cyber-crime Survey","authors":"Dinei A. F. Florêncio, Cormac Herley","author_ids":"1882479, 1679146","abstract":"Much of the information we have on cyber-crime losses is derived from surveys. We examine some of the difficulties of forming an accurate estimate by survey. First, losses are extremely concentrated, so that representative sampling of the population does not give representative sampling of the losses. Second, losses are based on unverified self-reported numbers. Not only is it possible for a single outlier to distort the result, we find evidence that most surveys are dominated by a minority of responses in the upper tail (i.e., a majority of the estimate is coming from as few as one or two responses). Finally, the fact that losses are confined to a small segment of the population magnifies the difficulties of refusal rate and small sample sizes. Far from being broadly-based estimates of losses across the population , the cyber-crime estimates that we have appear to be largely the answers of a handful of people extrapolated to the whole population. A single individual who claims $50,000 losses, in an N = 1000 person survey, is all it takes to generate a $10 billion loss over the population. One unverified claim of $7,500 in phishing losses translates into $1.5 billion.","cites":"5","conferencePercentile":"42.10526316"},{"venue":"WEIS","id":"9c72a3720a12778536a8af4042d815377da3626b","venue_1":"WEIS","year":"2015","title":"Concentrating Correctly on Cybercrime Concentration","authors":"Richard Clayton, Tyler Moore, Nicolas Christin","author_ids":"1892117, 2345093, 2637728","abstract":"We review the cybercrime literature to draw attention to the many occasions on which authors have identified concentrations within criminal activity. We note that the existence of concentrations often leads authors to suggest that concentrations , or 'choke points' are amenable to effective intervention. We then discuss the reasons that concentrations are observed – it is often the result of the criminals being economically efficient, but there are other possible explanations. We then set out a methodology for establishing whether a specific concentration might be the opportunity for a successful intervention. We also argue that the mere possibility of a successful intervention on a specific concentration point does not necessarily mean that incentives of the various stakeholders will be sufficiently well aligned for that intervention to occur.","cites":"2","conferencePercentile":"64.28571429"},{"venue":"WEIS","id":"20433efb49c1e9c1660beb4eef07810b3206fc05","venue_1":"WEIS","year":"2015","title":"Caviar and Yachts: How Your Purchase Data May Come Back to Haunt You","authors":"Benjamin Johnson, Paul Laskowski, Thomas Maillart, John C.-I. Chuang, Nicolas Christin","author_ids":"4631041, 2935960, 2450475, 1924565, 2637728","abstract":"A new generation of technologies allows firms to track online consumer behavior with increasing granularity, and to share this information with other firms. This promise of information sharing has driven considerable interest from firms; and its potential for mone-tization has allowed a large number of online and web services to be available free of charge to consumers (in exchange for behavioral tracking). At the same time, information sharing is not without risks, according to a variety of consumer advocates. We examine these risks and benefits using a game-theoretic model of information sharing. Online consumers decide whether to buy a product from two firms in sequence. Depending on the regulatory regime, the first firm may be allowed to sell its purchase information to the second firm. Unlike previous studies, our model employs a continuum of consumer types, revealing effects that have not been highlighted previously. Market outcomes depend critically on whether consumers are myopic, considering each purchase in isolation, or fully rational, considering the effect a purchase will have on future price discrimination. Myopic consumers always lose utility when firms are allowed to share information, though total welfare increases. On the other hand, fully rational consumers behave in a way that drastically limits firms' abilities to price discriminate. As a result, both consumer surplus and overall welfare are higher when firms are allowed to share information. Surprisingly, firms actually earn less profit than they would if information sharing were forbidden , as long as consumers are fully rational. The fact that firms do not often offer strong privacy guarantees provides some evidence that many of today's consumers are myopic.","cites":"0","conferencePercentile":"21.42857143"},{"venue":"WEIS","id":"165fd9777670f218336ce5cc70fd91637473a9dd","venue_1":"WEIS","year":"2009","title":"The Price of Uncertainty in Security Games","authors":"Jens Grossklags, Benjamin Johnson, Nicolas Christin","author_ids":"1718732, 4631041, 2637728","abstract":"In the realm of information security, lack of information about other users' incentives in a network can lead to inefficient security choices and reductions in individuals' payoffs. We propose, contrast and compare three metrics for measuring the price of uncertainty due to the departure from the payoff-optimal security outcomes under complete information. Per the analogy with other efficiency metrics, such as the price of anarchy, we define the price of uncertainty as the maximum discrepancy in expected payoff in a complete information environment versus the payoff in an incomplete information environment. We consider difference, payoff-ratio, and cost-ratio metrics as canonical nontrivial measurements of the price of uncertainty. We conduct an algebraic, numerical, and graphical analysis of these metrics applied to different well-studied security scenarios proposed in prior work (i.e., best shot, weakest-link, and total effort). In these scenarios, we study how a fully rational expert agent could utilize the metrics to decide whether to gather information about the economic incentives of multiple nearsighted and na¨ıve agents. We find substantial differences between the various metrics and evaluate the appropriateness for security choices in networked systems.","cites":"17","conferencePercentile":"63.88888889"},{"venue":"WEIS","id":"4b1a0507119e4e7651759509a53827f4b247018c","venue_1":"WEIS","year":"2005","title":"Cyber-Insurance Revisited","authors":"Rainer Böhme","author_ids":"1748910","abstract":"Cyber-insurance is considered as appropriate means to absorb financial losses caused by computer security breaches. Since insurance markets at the same time create incentives to construct more secure systems, they are regarded as particularly desirable tools. However, this paper argues that the typical market structure in IT businesses may thwart the formation of a proper insurance market for cyber-risks: The worldwide dominance of a few system platforms leads to correlated losses, which require premium surcharges and are thus hard to insure. This paper refers to an indem-nity insurance model to evaluate the conditions under which coverage for cyber-risks can be granted despite monocultures of installed platforms. Different premiums for users of dominant and alternative platforms are also addressed. Acting as a counterweight to the market leader's strong economies of scale, a cost advantage for users of less widespread platforms could foster a more balanced market structure.","cites":"26","conferencePercentile":"88.57142857"},{"venue":"WEIS","id":"7ab6ac2ebcb9c5c59a47c875a5e1360a071a59bb","venue_1":"WEIS","year":"2011","title":"The Inconvenient Truth about Web Certificates","authors":"Nevena Vratonjic, Julien Freudiger, Vincent Bindschaedler, Jean-Pierre Hubaux","author_ids":"3265338, 1706269, 3094927, 1757221","abstract":"HTTPS is the de facto standard for securing Internet communications. Although it is widely deployed, the security provided with HTTPS in practice is dubious. HTTPS may fail to provide security for multiple reasons, mostly due to certificate-based authentication failures. Given the importance of HTTPS, we investigate the current scale and practices of HTTPS and certificate-based deployment. We provide a large-scale empirical analysis that considers the top one million most popular websites. Our results show that very few websites implement certificate-based authentication properly. In most cases, domain mismatches between certificates and websites are observed. We study the economic, legal and social aspects of the problem. We identify causes and implications of the profit-oriented attitude of CAs and show how the current economic model leads to the distribution of cheap certificates for cheap security. Finally, we suggest possible changes to improve certificate-based authentication.","cites":"37","conferencePercentile":"89.47368421"},{"venue":"WEIS","id":"bfdb45ecd932b0d917e8335d19e5506a144d2369","venue_1":"WEIS","year":"2011","title":"Where Do All the Attacks Go?","authors":"Dinei A. F. Florêncio, Cormac Herley","author_ids":"1882479, 1679146","abstract":"The fact that a majority of Internet users appear unharmed each year is difficult to reconcile with a weakest-link analysis. We seek to explain this enormous gap between potential and actual harm. The answer, we find, lies in the fact that an Internet attacker, who attacks en masse, faces a sum-of-effort rather than a weakest-link defense. Large-scale attacks must be profitable in expectation, not merely in particular scenarios. For example , knowing the dog's name may open an occasional bank account, but the cost of determining one million users' dogs' names is far greater than that information is worth. The strategy that appears simple in isolation leads to bankruptcy in expectation. Many attacks cannot be made profitable, even when many profitable targets exist. We give several examples of insecure practices which should be exploited by a weakest-link attacker but are extremely difficult to turn into profitable attacks.","cites":"18","conferencePercentile":"84.21052632"},{"venue":"WEIS","id":"30c6e4074826c8ca3b9f931fdb49cf3aef7595f9","venue_1":"WEIS","year":"2012","title":"Why do Nigerian Scammers Say They are From Nigeria?","authors":"Cormac Herley","author_ids":"1679146","abstract":"False positives cause many promising detection technologies to be unworkable in practice. Attackers, we show, face this problem too. In deciding who to attack true positives are targets successfully attacked, while false positives are those that are attacked but yield nothing. This allows us to view the attacker's problem as a binary classification. The most profitable strategy requires accurately distinguishing viable from non-viable users, and balancing the relative costs of true and false positives. We show that as victim density decreases the fraction of viable users than can be profitably attacked drops dramatically. For example, a 10× reduction in density can produce a 1000× reduction in the number of victims found. At very low victim densities the attacker faces a seemingly intractable Catch-22: unless he can distinguish viable from non-viable users with great accuracy the attacker cannot find enough victims to be profitable. However, only by finding large numbers of victims can he learn how to accurately distinguish the two. Finally, this approach suggests an answer to the question in the title. Far-fetched tales of West African riches strike most as comical. Our analysis suggests that is an advantage to the attacker, not a disadvantage. Since his attack has a low density of victims the Nigerian scammer has an overriding need to reduce false posi-tives. By sending an email that repels all but the most gullible the scammer gets the most promising marks to self-select, and tilts the true to false positive ratio in his favor.","cites":"18","conferencePercentile":"88.23529412"},{"venue":"WEIS","id":"58ef3f3e12443581761f159a90f27f28952f9879","venue_1":"WEIS","year":"2012","title":"Can We Afford Integrity by Proof-of-Work? Scenarios Inspired by the Bitcoin Currency","authors":"Jörg Becker, Dominic Breuker, Tobias Heide, Justus Holler, Hans Peter Rauer, Rainer Böhme","author_ids":"1678210, 2974656, 2930070, 1736811, 2425680, 1748910","abstract":"Proof-of-Work (PoW), a well-known principle to ration resource access in client-server relations, is about to experience a renaissance as a mechanism to protect the integrity of a global state in distributed transaction systems under decentralized control. Most prominently, the Bitcoin cryptographic currency protocol leverages PoW to 1) prevent double spending and 2) establish scarcity, two essential properties of any electronic currency. This paper asks the important question whether this approach is generally viable. Citing actual data, it provides a first cut of an answer by estimating the resource requirements, in terms of operating cost and ecological footprint, of a suitably dimensioned PoW infrastructure and comparing them to three attack scenarios. The analysis is inspired by Bitcoin, but generalizes to potential successors, which fix Bitcoin's technical and economic teething troubles discussed in the literature.","cites":"11","conferencePercentile":"82.35294118"},{"venue":"WEIS","id":"2a9e564d6ed5c689fd5afeb14ed4de76b6da2246","venue_1":"WEIS","year":"2012","title":"Measuring the Cost of Cybercrime","authors":"Ross J. Anderson, Chris Barton, Rainer Böhme, Richard Clayton, Michel van Eeten, Michael Levi, Tyler Moore, Stefan Savage","author_ids":"2381794, 2634099, 1748910, 1892117, 1682795, 2008183, 2345093, 1727599","abstract":"This chapter documents what we believe to be the first systematic study of the costs of cybercrime. The initial workshop paper was prepared in response to a request from the UK Ministry of Defence following scepticism that previous studies had hyped the problem. For each of the main categories of cybercrime we set out what is and is not known of the direct costs, indirect costs and defence costs – both to the UK and to the world as a whole. We distinguish carefully between traditional crimes that are now \" cyber \" because they are conducted online (such","cites":"61","conferencePercentile":"100"},{"venue":"WEIS","id":"83c60d7ee5d873de1f728782d549db0b92f81e81","venue_1":"WEIS","year":"2009","title":"HIPAA Compliance: An Examination of Institutional and Market Forces","authors":"Ajit Appari, Denise L. Anthony, M. Eric Johnson","author_ids":"2003414, 8441116, 1773629","abstract":"One would think that the enactment of the HIPAA, with its mandates on data security and privacy, would have brought a major shift in the security management practices within the US healthcare. Unfortunately, recent industry reports indicate low levels of regulatory compliance, thus raising security concerns for the US health IT infrastructure. This research develops a regulatory compliance model by drawing insights from the institutional theory literature to identify the key drivers influencing HIPAA compliance, both institutional and market forces (e.g., variability in state-level privacy laws comprehensiveness, interdependency between privacy and security rules, pressure from compliance leaders in the region, compliance officer \" s functional background, and the consumer concern for privacy). We validate the model using a national sample of acute-care hospitals and find partial support. The primary contribution of this research lies in the novel application of institutional theory to explain the variability in regulatory compliance prevalent in the US healthcare sector.","cites":"5","conferencePercentile":"33.33333333"},{"venue":"WEIS","id":"34ffcc435b1e4fa095f4a2785f37b0e0999a7e21","venue_1":"WEIS","year":"2010","title":"Inglorious Installers: Security in the Application Marketplace","authors":"Jonathan Anderson, Joseph Bonneau, Frank Stajano","author_ids":"2410054, 5919191, 2389090","abstract":"From mobile phones to social networks, installing and running third-party applications can be risky. Installing applications often requires running unverified, untrustworthy code with the privilege of a system administrator, allowing it to compromise the security of user data and the operating system. Once installed, applications on most platforms can access anything that a user can: a web browser can read users' e-mail and an e-mail client can access browsing history. Computer scientists have been developing systems for decades which follow the \" principle of least authority, \" yet few consumer computing platforms adopt their techniques. In this paper, we examine the application markets for ten computing platforms, including personal computers, mobile phones, social networks and web browsers. We identify economic causes for the wide variation in their installation and sandboxing techniques, and we propose measures to align the incentives of market actors such that providing better application security guarantees is in everyone's interest.","cites":"14","conferencePercentile":"65.90909091"},{"venue":"WEIS","id":"915784ec45e2eb0caa8e5810dcfcd6bf71e9682b","venue_1":"WEIS","year":"2015","title":"Online Self-Disclosure and Offline Threat Detection","authors":"Alessandro Acquisti, Laura Brandimarte, Jeff Hancock","author_ids":"1683053, 2856650, 3243493","abstract":"Human beings have evolved to detect and react to threats in their physical environment, and have developed perceptual systems to assess physical, sensorial stimuli for current, material risks. In cyberspace, those stimuli can be absent, subdued, or deliberately manipulated by antagonistic third parties. Security and privacy concerns that would normally be activated in the offline world, therefore, can remain muted, and defense behaviors can be hampered, online. In order to start understanding the interrelationships between online and offline threat detection and online decision making, we investigate the extent to which \" visceral \" stimuli in the physical world can impact security and privacy behavior in cyberspace. In particular, we present the design and results of a stream of controlled human subject experiments that explore the influence of sensorial stimuli (indicating the presence of other human beings in the proximal space of a subject) on subjects' online disclosure of personal, and highly sensitive, behaviors.","cites":"0","conferencePercentile":"21.42857143"},{"venue":"WEIS","id":"82953b3f24cc94d667d46649f33748924d83f298","venue_1":"WEIS","year":"2011","title":"Empirical Analysis of Data Breach Litigation","authors":"Sasha Romanosky, David Hoffman, Alessandro Acquisti","author_ids":"2952105, 1751451, 1683053","abstract":"and 7 anonymous attorneys for their valuable insights and suggestions. Abstract In recent years, many individuals have sought legal redress for harms caused by the loss or theft of their personal information. However, very little is known about the drivers, mechanics, and outcomes of these lawsuits, making it difficult to assess the effectiveness of litigation at balancing organizations' usage of personal data with individual privacy rights. Using a unique database of manually collected lawsuits, we analyze court dockets for over 230 federal data breach lawsuits from 2000 to 2010. We investigate two research questions: Which data breaches are being litigated? Which data breach lawsuits are settling? Our results suggest that the odds of a firm being sued are 3.5 times greater when individuals suffer financial harm, but 6 times lower when the firm provides free credit monitoring. Moreover, defendants settle 30% more often when plaintiffs allege financial loss, or when faced with a certified class action suit. By providing the first comprehensive empirical analysis of data breach litigation, these findings offer insights in the debate over privacy litigation versus privacy regulation.","cites":"11","conferencePercentile":"65.78947368"},{"venue":"WEIS","id":"8061c9fb4245ed9190a10be60a4d588546c7e129","venue_1":"WEIS","year":"2010","title":"Please Continue to Hold: An Empirical Study on User Tolerance of Security Delays","authors":"Serge Egelman, David Molnar, Nicolas Christin, Alessandro Acquisti, Cormac Herley, Shriram Krishnamurthi","author_ids":"2645852, 2804783, 2637728, 1683053, 1679146, 1724479","abstract":"We present the results of an experiment examining the extent to which individuals will tolerate delays when told that such delays are for security purposes. 1 In our experiment, we asked 800 Amazon Mechanical Turk users to count the total number of times a certain term was repeated in a multi-page document. The task was designed to be conducive to cheating. We assigned subjects to eight between-subjects conditions: one of these offered a concrete security reason (virus-scanning) for the delay, another offered only a vague security explanation, while the remaining conditions either offered non-security explanations for the delay or no delay at all—in the case of the control condition. We found that subjects were significantly more likely to cheat or abandon the task when provided with non-security explanations or a vague security explanation for the delay. However, when subjects were provided more explanation about the threat model and the protection ensured by the delay, they were not more likely to cheat than subjects in the control condition who faced no such delay. Our results thus contribute to the nascent literature on soft paternalis-tic solutions to security and privacy problems by suggesting that, when security mitigations cannot be made \" free \" for users, designers may incentivize compliant users' behavior by intentionally drawing attention to the mitigation itself.","cites":"14","conferencePercentile":"65.90909091"},{"venue":"WEIS","id":"57d7004e6577a62b135ebec2f68d404128b9191d","venue_1":"WEIS","year":"2008","title":"Security Investment (Failures) in Five Economic Environments: A Comparison of Homogeneous and Heterogeneous User Agents","authors":"Jens Grossklags, Nicolas Christin, John C.-I. Chuang","author_ids":"1718732, 2637728, 1924565","abstract":"Security interactions in networked systems, and the associated user choices, due to their complexity , are notoriously difficult to predict, and sometimes even harder to rationalize. We argue that users often underestimate the strong mutual dependence between their security strategies and the economic environment (e.g., threat model) in which these choices are made and evaluated. This misunderstanding weakens the effectiveness of users' security investments. We study how economic agents invest into security in five different economic environments, that are characteristic of different threat models. We consider generalized models of traditional public goods games (e.g., total effort and weakest link) and two recently proposed games (e.g., weakest target game). Agents may split their contributions between a public good (protection) and a private good (self-insurance). We can examine how incentives may shift between investment in a public good (protection) and a private good (insurance), subject to factors such as network size, type of attack, loss probability, loss magnitude, and cost of technology. We compare Nash equilibrium predictions for homogeneous and heterogeneous user populations. We also provide results for the social optima for different classes of attacks and defenses in the case of homogeneous agents. * This is a working paper in preparation for archival journal submissions and represents a subset of results from an ongoing project on security economics. Some of the preliminary results on the homogeneous case presented here have been published in [21]. Results on the case of heterogeneous agents are available also in [22]. We hope to further improve this draft with the feedback of the workshop participants.","cites":"14","conferencePercentile":"77.27272727"},{"venue":"WEIS","id":"409e303e480700dc6d92f1489ce1417e1bbcfd75","venue_1":"WEIS","year":"2009","title":"Valuating Privacy with Option Pricing Theory","authors":"Stefan Berthold, Rainer Böhme","author_ids":"2037929, 1748910","abstract":"One of the key challenges of the information society is responsible handling of personal data. An often-cited reason why people fail to make rational decisions regarding their own informational privacy is the high uncertainty about future consequences of information disclosures today. This paper builds an analogy to financial options and draws on principles of option pricing to account for this uncertainty in the valuation of privacy. For this purpose, the development of a data subject's personal attributes over time and the development of the attribute distribution in the population are modelled as two stochastic processes, which fit into the Binomial Option Pricing Model (BOPM). Possible applications of such valuation methods to guide decision support in future privacy-enhancing technologies (PET) are sketched.","cites":"9","conferencePercentile":"50"},{"venue":"WEIS","id":"d70fb86746d3d88b9fe747a0aee91c5d68bb59b3","venue_1":"WEIS","year":"2005","title":"An Empirical Analysis of Vendor Response to Disclosure Policy","authors":"Ashish Arora, Ramayya Krishnan, Rahul Telang, Yubao Yang","author_ids":"3029911, 1733479, 1840673, 2703429","abstract":"Software vulnerability disclosure has generated intense interest and debate. In particular, there have been arguments made both in opposition to and in favor of alternatives such as full and instant disclosure and limited or no disclosure. An important consideration in this debate is the behavior of the software vendor. Does vulnerability disclosure policy have an effect on patch release behavior of software vendors? This paper compiles a unique data set from CERT/CC and Security Focus databases to answer this question. Our results suggest that early disclosure has significant positive impact on the vendor patching speed. Open source vendors patch more quickly than closed source vendors and severe vulnerabilities are patched faster. We also find that vendors respond slower to vulnerabilities not disclosed by CERT/CC. This might reflect unmeasured differences in the severity and importance of vulnerabilities. It might also reflect the stronger lines of communication between CERT/CC and vendors, and the value of the vulnerability analysis by CERT/CC. We also find that vendors are more responsible after the 9/11 event.","cites":"21","conferencePercentile":"80"},{"venue":"WEIS","id":"b0a8ab81da28b1a2f4e0b4159bc6690b88030696","venue_1":"WEIS","year":"2006","title":"Financial Privacy for Free? US Consumers' Response to FACTA","authors":"Alessandro Acquisti, Bin Zhang","author_ids":"1683053, 1731735","abstract":"In December 2004 the three US credit reporting agencies-Equifax, Experian, and TransUnion-complied with the Fair and Accurate Credit Transaction Act (FACTA) and started providing free copies of their credit reports to any consumers who requested it. The FACTA initiative was overseen by the Federal Trade Commission (FTC) and was significant in many respects: it was one of the first and largest initiatives by the federal government aiming at alleviating the rising concerns with identity theft; it forced – an unusual move in the laissez faire panorama of US privacy legislation-private sector companies to offer some of their products and services for free to the general public; and it required an uncommon concerted effort by the three credit agencies to provide reports to an estimated potential pool of 220 million US adults. However, to date, no data about the public response to the initiative has been provided by the FTC or the reporting agencies themselves. We present the results of a [institution name's removed] and Harris Interactive survey-based study of US consumers' response to FACTA. The survey was based on a nationally representative sample of US adults and provides the first look at the success of the initiative as well as the likely motivations for requesting one's credit report. Such information can help us understand consumers' interest in their financial information and, indirectly, their sensitivity towards the privacy of their financial data.","cites":"1","conferencePercentile":"12"},{"venue":"WEIS","id":"db64e81cdbd1488671145777cfe4bcc582a103ab","venue_1":"WEIS","year":"2005","title":"Impact of Software Vulnerability Announcements on the Market Value of Software Vendors - an Empirical Investigation","authors":"Rahul Telang, Sunil Wattal","author_ids":"1840673, 2628487","abstract":"Researchers in the area of information security have mainly been concerned with tools, techniques and policies that firms can use to protect themselves against security breaches. However, information security is as much about security software as it is about secure software. Software is not secure when it has defects or flaws which can be exploited by hackers to cause attacks such as unauthorized intrusion or denial of service attacks. Any public announcement about a software defect is termed as 'vulnerability disclosure'. Although research in software economics have studied firms' incentive to improve overall quality, there have been no studies to show that software vendors have an incentive to invest in building more secure software. In this paper, we use the event study methodology to examine the role that financial markets play in determining software vendors' incentives to build more secure software. We collect data from leading national newspapers and industry sources like CERT by searching for reports on published software vulnerabilities. We show that vulnerability disclosures lead to a negative and significant change in market value for a software vendor. On average, a vendor loses around 0.6% value in stock price when a vulnerability is reported. This is equivalent to a loss in market capitalization values of $0.86 billion per vulnerability announcement. To provide further insight, we use the information content of the disclosure announcement to classify vulnerabilities into various types. We find that the change in stock price is more negative if the vendor fails to provide a patch at the time of disclosure. Moreover, vulnerabilities which cause a confidentiality related breach cause a greater decline in the market value for a vendor than the vulnerabilities which cause non-confidentiality related breaches. Also, more severe flaws have a significantly greater impact than flaws with low or moderate severity. Finally, we find that the markets do not punish a software vendor more severely if a third party discovers a flaw in its product than if the vendor itself discovers the flaw. Our analysis provides many interesting implications for software vendors as well as policy makers.","cites":"23","conferencePercentile":"85.71428571"},{"venue":"WEIS","id":"94e83e5b5fd375e2e3f226cfb15c2c8259c1651a","venue_1":"WEIS","year":"2006","title":"Economics of Security Patch Management","authors":"Huseyin Cavusoglu, Hasan Cavusoglu, Jun Zhang","author_ids":"3031676, 3293728, 1752214","abstract":"Patch management is a crucial component of IT security programs. An important problem within this context is to determine how often to update the systems with necessary patches. Keeping the systems patched with more frequent patch updates increases operational costs while reducing security risks. On the other hand, leaving the systems unpatched with less frequent patch updates decreases operational costs while increasing security risks. In this paper we develop a game theoretic model to derive the optimal frequency of patch updates to balance the operational costs and damage costs associated with security vulnerabilities. We first analyze a centralized system in a benchmark case to find the socially optimal patch management policy and associated patch release cycle of the vendor and patch update cycle of the firm. Then we consider a noncentralized system in which the vendor determines its patch release policy and the firm selects its patch update policy in a Stackelberg framework. Given the results in centralized and noncentralized patch management, we next address how we can coordinate the patch release policy of the vendor and the patch update policy of the firm using cost sharing and/or liability to achieve the socially optimal patch management in a noncentralized setting. 1. Introduction Today most security incidents are caused by flaws in software, called vulnerabilities. It is estimated that there are as many as 20 flaws per thousand lines of software code (Dacey, 2003). Computer Emergency Response Team/Coordination Center (CERT/CC) statistics reveal that the number of vulnerabilities reported has increased dramatically over the years,","cites":"13","conferencePercentile":"64"},{"venue":"WEIS","id":"c06d2787adc3f61afdb154c009b3f57e34b0d2dc","venue_1":"WEIS","year":"2010","title":"Data Breaches and Identity Theft: When is Mandatory Disclosure Optimal?","authors":"Sasha Romanosky, Richard Sharp, Alessandro Acquisti","author_ids":"2952105, 5666939, 1683053","abstract":"In order to reduce identity theft and consumer loss caused by data breaches, many U.S. states have enacted laws requiring firms to notify individuals when their personal information has been stolen or lost. The effect of these disclosure laws has yet to be rigorously tested, and some claim that they only serve to burden firms and consumers with unnecessary costs. Leveraging the economic analysis of accident law, we examine whether mandatory disclosure policies can ever reduce overall social costs by inducing firms and consumers to take optimal care. Using both analytical and numerical modeling, we show that even though firm costs will be higher under disclosure regimes, firms can be induced to increase their investment in care, which may lower social costs. Moreover, disclosure can induce consumers to increase their level of care, thus lowering their total costs. Finally, we find that the change in social costs are typically increasing in disclosure 'tax' (costs imposed on firms due to disclosure laws) and decreasing in consumer redress (compensation paid to consumers by firms). However, when firms compensate consumers for only a small amount of loss, some disclosure tax may be necessary to optimally reduce social costs. Acknowledgements We would like to thank CyLab at Carnegie Mellon University for their generous support under grant DAAD19-02-1-0389 from the Army Research Office.","cites":"10","conferencePercentile":"50"},{"venue":"WEIS","id":"1015dd444a4ffaf3f8cb77279516b621f2bf8d33","venue_1":"WEIS","year":"2012","title":"Ad-blocking Games: Monetizing Online Content Under the Threat of Ad Avoidance","authors":"Nevena Vratonjic, Mohammad Hossein Manshaei, Jens Grossklags, Jean-Pierre Hubaux","author_ids":"3265338, 2534900, 1718732, 1757221","abstract":"Much of the Internet economy relies on online advertising for monetizing digital content: Users are expected to accept the presence of online advertisements in exchange for content being free. However, online advertisements have become a serious problem for many Internet users: while some are merely annoyed by the incessant display of distracting ads cluttering Web pages, others are highly concerned about the privacy implications – as ad providers typically track users' behavior for ad targeting purposes. Similarly, security problems related to technologies and practices employed for online advertisement have frustrated many users. Consequently, a number of software solutions have emerged that block online ads from being down-loaded and displayed on users' screens as they browse the Web. We focus on these advertisement avoidance technologies for online content and their economic ramifications for the monetization of websites. More specifically, our work addresses the interplay between users' attempts to avoid commercial messages and content providers' design of countermeasures. Our investigation is substantiated by the development of a game-theoretic model that serves as a framework usable by content providers to ponder their options to mitigate the consequences of ad avoidance techniques. We complement our analytical approach with simulation results, addressing different assumptions about user heterogeneity. 1 2 Nevena Vratonjic et al. Our findings show that publishers who treat each user individually, and strategically deploy fee-financed or ad-financed monetization strategy, obtain higher revenues, compared to deploying one monetization strategy across all users. In addition, our analysis shows that understanding the distribution of users' aversion to ads and valuation of the content is essential for publishers to make a well-informed decision.","cites":"3","conferencePercentile":"38.23529412"},{"venue":"WEIS","id":"62fc17a3b7c0fba820c55f3eba9908a6a6e35d60","venue_1":"WEIS","year":"2005","title":"An Economic Analysis of Software Market with Risk-Sharing Contract","authors":"Byungcho Kim, Pei-Yu Sharon Chen, Tridas Mukhopadhyay","author_ids":"2127293, 2170015, 1794433","abstract":"Poor quality of software has been blamed for poor security of our computer networks in the sense that major viruses and worms exploit the vulnerabilities of such software. However, software vendors have no incentive to improve the quality of their products since they are not directly liable for any loss due to poor quality. Software liability has been intensely discussed among computer scientists and jurists for decades as a possible solution for software quality improvement. This paper proposes a risk-sharing mechanism between software vendors and customers as a market-driven way to impose software liability. We consider two dimensions of software quality, which are functionality and security quality. We present an economic model of software market with a risk-sharing mechanism, which takes into account the strategic interplay of risk-sharing and security quality of the software given a certain level of functionality. We then apply this model in different scenarios, and examine the implications of risk-sharing mechanism in the context of cyber security. Our model provides evidence of under-provided security quality of software under the monopoly case, as has been observed in the market. We consider feasibility and effectiveness of the risk-sharing mechanism under various scenarios, and our results suggest that this mechanism is promising.","cites":"1","conferencePercentile":"15.71428571"},{"venue":"WEIS","id":"db9fb8fbc92b74d3d84e02240bf98064170ef23a","venue_1":"WEIS","year":"2010","title":"Self Hosting vs. Cloud Hosting: Accounting for the Security Impact of Hosting in the Cloud","authors":"David Molnar, Stuart E. Schechter","author_ids":"2804783, 1803888","abstract":"As more and more organizations consider moving their applications and data from dedicated hosting infrastructure, which they own and operate, to shared infrastructure leased from 'the cloud', security remains a key sticking point. Tenants of cloud hosting providers have substantially less control over the construction, operation, and auditing of infrastructure they lease than infrastructure they own. Because cloud-hosted infrastructure is shared, attackers can exploit the proximity that comes from becoming a tenant of the same cloud hosting provider. As a result, some have argued that that cloud-hosted infrastructure is inherently less secure than the self-hosted infrastructure, and that it will never be appropriate for high-stakes applications such as health care or financial transaction processing. We strive to present a more balanced treatment of the potential security impacts of transitioning to cloud-hosted infrastructure, surveying both the security costs and security benefits of doing so. The costs include exposure to new threats, some of which are technological, but many others of which are contractual, jurisdictional, and organizational. We also survey potential countermeasures to address these threats, which are also as likely to be contractual or procedural as technological. Transitioning to a cloud-hosted infrastructure may also have security benefits; some security measures have high up-front costs, may become affordable when amortized at cloud scale, and impact threats common to both cloud-and self-hosted infrastructures.","cites":"17","conferencePercentile":"72.72727273"},{"venue":"WEIS","id":"1f81057e84e43fd2d6611f1ebf393b29a37b53be","venue_1":"WEIS","year":"2006","title":"Competitive and Strategic Effects in the Timing of Patch Release","authors":"Ashish Arora, Chris Forman, Anand Nandkumar, Rahul Telang","author_ids":"3029911, 3286632, 2225267, 1840673","abstract":"The relationship between quality and market concentration has long been of interest to both policy makers and economists. In our application, we focus on the effect of competition on one aspect of software quality – time taken by software vendors to release patches that fix vulnerabilities. We empirically estimate how the extent of competition affects the timing of patch release using a novel dataset assembled for the purposes of this research. Competition in the context of information security has two separate effects: First is the disclosure threat effect-the possibility of any of the other vendors that are also affected by the same vulnerability, releasing patch earlier, thereby implicitly disclosing the vulnerability. Second is the competition effect, which is the effect of end users penalizing laggards, by comparing responses of vendors that also sell a similar product. Our results suggest disclosure threat hastens the arrival of a patch by about 24 days, whereas competition effect hastens patch release by 52 days on average. Further, firms with larger sales (of the product) patch faster: a 10% increase in firm sales is associated with an earlier patch release by about 2.5 days. Therefore, our results support the notion that greater competition results in better ex-post service quality. Further, to the extent that earlier patch release minimizes consumer loss, our results suggest that when higher number vendors are affected by the same vulnerability end user losses are lower, thereby leading to better social outcomes.","cites":"6","conferencePercentile":"30"},{"venue":"WEIS","id":"972e9f8476bd4256365f24f402984e3370b90709","venue_1":"WEIS","year":"2005","title":"Uncertainty, Ambiguity and Privacy","authors":"Alessandro Acquisti, Jens Grossklags","author_ids":"1683053, 1718732","abstract":"In this paper we discuss the importance of ambiguity, uncertainty and limited information on indi-viduals' decision making in situations that have an impact on their privacy. We present experimental evidence from a survey study that demonstrates the impact of framing a marketing offer on participants' willingness to accept when the consequences of the offer are uncertain and highly ambiguous.","cites":"11","conferencePercentile":"60"},{"venue":"WEIS","id":"848131e283a3693bba62e867bbf0c7ecdba55861","venue_1":"WEIS","year":"2012","title":"Is Patient Data Better Protected in Competitive Healthcare Markets?","authors":"Martin S. Gaynor, Muhammad Zia Hydari, Rahul Telang","author_ids":"2652666, 2151072, 1840673","abstract":"We study the effect of hospital market concentration on the quality of patient data protection practices. We use approximately 200 reported data breaches in US hospitals over the period 2006-2011 as a measure of the quality of patient data protection practices. We measure market concentration using the Herfindahl-Hirschman Index (HHI) and estimate our models by exploiting cross-sectional HHI variation. Surprisingly, we find that increased competition is associated with a decline in the quality of patient data protection. Our main result indicates that a 100 point increase in HHI is associated with a 5% decline in the average count of data breach incidents. The results are directionally robust to a number of alternate model specifications. To explain our findings, we posit that hospitals in more competitive markets may be inclined to shift resources to more consumer visible activities from the less consumer visible activity of data protection.","cites":"1","conferencePercentile":"14.70588235"},{"venue":"WEIS","id":"74020287eb32532c21e30885dea8f210793ac453","venue_1":"WEIS","year":"2006","title":"Bootstrapping the Adoption of Internet Security Protocols","authors":"Andy Ozment, Stuart E. Schechter","author_ids":"2136878, 1803888","abstract":"The deployment of network-wide security enhancements to the Internet has proven more difficult than many had initially anticipated. We leverage existing models of networks' value to model the problem of bootstrapping the adoption of security technologies. We describe a variety of policy interventions and deployment strategies that can help to catalyze this adoption. Using this framework, we provide a series of short case studies for previous attempts to deploy security technologies to the Internet. We then provide a detailed study of strategies for deploying security-enhanced protocols into the Internet's Domain Name System (DNS). Finally, we show how the adoption of these DNS security enhancements can help to alleviate bootstrapping problems that have impeded the deployment of other security-enhanced protocols.tions are those of the author(s) and are not necessarily endorsed by the United States Government.","cites":"32","conferencePercentile":"84"},{"venue":"WEIS","id":"edb5d4597d56ec1aa328828a7a29c1340141c160","venue_1":"WEIS","year":"2005","title":"Valuating Privacy","authors":"Bernardo A. Huberman, Eytan Adar, Leslie R. Fine","author_ids":"8579301, 2630700, 3134841","abstract":"In spite of the widespread concerns expressed about the importance of privacy, individuals frequently give away or sell a myriad of personal data. How and why people decide to transition their information from the private to the public sphere is poorly understood. To address this puzzle, we conducted a reverse second-price auction to identify the monetary value of private information to individuals and how that value is set. Our results demonstrate that the more undesirable the trait with respect to the group, whether perceived or actual, impacts the price demanded to reveal private information.","cites":"42","conferencePercentile":"97.14285714"},{"venue":"WEIS","id":"6d0ee560d9dda4a037542cbd9b08677edc9bc5d6","venue_1":"WEIS","year":"2015","title":"The Economics of Mandatory Security Breach Reporting to Authorities","authors":"Stefan Laube, Rainer Böhme","author_ids":"2032471, 1748910","abstract":"Regulators in many countries enact security breach notification laws to address a lack of information security in their economies. Some of these laws designate authorities to handle reported security breaches and advise firms. We devise a principal–agent model to analyze the economic effect of mandatory security breach reporting to authorities. In practice, it is hard to enforce such laws as firms (agents) have little incentive to unilaterally report security breaches. In response, regulators (principals) may introduce security audits and impose sanctions. However, security audits cannot differentiate between malicious concealment and benign nescience of the agents. Even under optimistic assumptions about the effect of mandatory security breach reporting to authorities on reducing losses, our model predicts that it may be difficult to adjust the level of sanctions such that security breach notification laws are socially beneficial. 1 Motivation Confidentiality, integrity and availability are the canonical protection goals of information systems. Security breaches are violations of one or more of these protection goals [15]. They may concern data protection or data security [10]. Over the past years, both the attack rate against information systems and the number of security breaches has increased, causing high costs to affected firms [36]. Cavusoglu et al. [5], among others, remark that security breaches may cause direct and indirect costs. Direct costs include for instance the costs of cleaning systems from malware. Indirect costs comprise intangible costs, which include costs from security breach announcements to the public coming along with, e. g., potential reputation loss [11]. Quantifying indirect costs of security breaches is generally hard. One approach suggested by the authors of [5] is to analyze the impact of published breaches on the stock market value of affected firms. The results show that security breaches create losses (on average) of 2.1 % of the market value within the first two days of their announcement. Cavusoglu et al. [5]","cites":"3","conferencePercentile":"78.57142857"},{"venue":"WEIS","id":"0ed55eab295559f0bf202800e40ffb6d0beebd90","venue_1":"WEIS","year":"2015","title":"Deception in Online Auction Marketplaces: Incentives and Personality Shape Seller Honesty","authors":"Brian Glass, Michelle Baddeley, M. Angela Sasse","author_ids":"6381729, 8469127, 1752376","abstract":"In online auction marketplaces, item misrepresentation is one of the most common forms of seller deception. The impact of coarse-grained incentive manipulations on deceptive seller behavior in online markets had not been studied. We demonstrate experimental control over seller honesty, quantify this behavior relative to ground truth, and link it to personality. We recruited 62 experienced online auction sellers to handle seven jewelry items (some flawed) and generate auction advertisements. Independent variables included demographics, personality, and an incentive manipulation: maximize returns , avoid negative reputation, or a Control condition. Dependent variables involved the inclusion or exclusion of honest information. Reputation incentives led to significantly more reported flaws (30%) than other conditions (17%), all 'hiding' flaws in the middle of descriptions. More experience in selling items significantly predicted honesty, while extraversion and neuroticism predicted dishonesty. Design features can reduce seller deception and enhance buyer detection of deception: reputation systems should be highly salient to sellers, while buyers should consider images over text, and descriptions could be shuffled to expose honest information.","cites":"0","conferencePercentile":"21.42857143"},{"venue":"WEIS","id":"5651ed2dacf617ed3387cc1382538e8ff27117bd","venue_1":"WEIS","year":"2012","title":"Would You Sell Your Mother's Data? Personal Data Disclosure in a Simulated Credit Card Application","authors":"Miguel Malheiros, Sacha Brostoff, Charlene Jennett, M. Angela Sasse","author_ids":"2715605, 3175867, 2586963, 1752376","abstract":"To assess the risk of a loan applicant defaulting, lenders feed applicants \" data into credit scoring algorithms. They are always looking to improve the effectiveness of their predictions, which means improving the algorithms and/or collecting different data. Research on financial behavior found that elements of a person \" s family history and social ties can be good predictors of financial responsibility and control. Our study investigated how loan applicants applying for a credit card would respond to questions such as \" Did any of your loved ones die while you were growing up? \" 48 participants were asked to complete a new type of credit card application form containing such requests as part of a \" Consumer Acceptance Test \" of a credit card with lower interest rates, but only available to \" financially responsible customers. \" This was a double-blind study – the experimenters processing participants were told exactly the same. We found that: (1) more sensitive items are disclosed less often-e.g. friends \" names and contact had only a 69% answer rate; (2) privacy fundamentalists are 5.6 times less likely to disclose data; and (3) providing a justification for a question has no effect on its answer rate. Discrepancies between acceptability and disclosure were observed – e.g. 43% provided names and contact of friends, having said they found the question unacceptable. We conclude that collecting data items not traditionally seen as relevant could be made acceptable if lenders can credibly establish relevance, and assure applicants they will be assessed fairly. More research needs to be done on how to best communicate these qualities.","cites":"4","conferencePercentile":"52.94117647"},{"venue":"WEIS","id":"b19c2aa855c247461d9caa48ea94b0b39d650001","venue_1":"WEIS","year":"2015","title":"Framing Dependencies Introduced by Underground Commoditization","authors":"Kurt Thomas, Danny Yuxing Huang, David Y. Wang, Elie Bursztein, Chris Grier, Tom Holt, Christopher Krügel, Damon McCoy, Stefan Savage, Giovanni Vigna","author_ids":"2353710, 8312481, 2992113, 1687723, 2249744, 4897673, 1715189, 1703426, 1727599, 1711242","abstract":"Internet crime has become increasingly dependent on the underground economy: a loose federation of specialists selling capabilities, services, and resources explicitly tailored to the abuse ecosystem. Through these emerging markets, modern criminal entrepreneurs piece together dozens of à la carte components into entirely new criminal endeavors. From an abuse fighting perspective, criminal reliance on this black market introduces fragile dependencies that, if disrupted , undermine entire operations that as a composite appear intractable to protect against. However, without a clear framework for examining the costs and infrastructure behind Internet crime, it becomes impossible to evaluate the effectiveness of novel intervention strategies. In this paper, we survey a wealth of existing research in order to systematize the community's understanding of the underground economy. In the process, we develop a taxon-omy of profit centers and support centers for reasoning about the flow of capital (and thus dependencies) within the black market. Profit centers represent activities that transfer money from victims and institutions into the underground. These activities range from selling products to unwitting customers (in the case of spamvertised products) to outright theft from victims (in case of financial fraud). Support centers provide critical resources that other miscreants request to streamline abuse. These include exploit kits, compromised credentials, and even human services (e.g., manual CAPTCHA solvers) that have no credible non-criminal applications. We use this framework to contextualize the latest intervention strategies and their effectiveness. In the end, we champion a drastic departure from solely focusing on protecting users and systems (tantamount to a fire fight) and argue security practitioners must also strategically focus on disrupting frail underground relationships that underpin the entire for-profit abuse ecosystem—including actors, infrastructure, and access to capital.","cites":"7","conferencePercentile":"92.85714286"},{"venue":"WEIS","id":"8ad8f7a7359930b6f1d924fb54484642b36b90a1","venue_1":"WEIS","year":"2008","title":"Modelling the Human and Technological Costs and Benefits of USB Memory Stick Security","authors":"Adam Beautement, Robert Coles, Jonathan Griffin, Christos Ioannidis, Brian Monahan, David J. Pym, M. Angela Sasse, Mike Wonham","author_ids":"3096168, 2647655, 2734040, 1813103, 1736436, 1749654, 1752376, 2818841","abstract":"Organizations deploy systems technologies in order to support their operations and achieve their business objectives. In so doing, they encounter tensions between the confidentiality, integrity, and availability of information , and must make investments in information security measures to address these concerns. We discuss how a macroeconomics-inspired model, analogous to models of interest rate policy used by central banks, can be used to understand trade-offs between investments against threats to confidentiality and availability. We investigate how such a model might be formulated by constructing a process model, based on empirically obtained data, of the use of USB memory sticks by employees of a financial services company.","cites":"44","conferencePercentile":"95.45454545"},{"venue":"WEIS","id":"78031a366bffa8a9ed319e30c34408fab6f4ba8f","venue_1":"WEIS","year":"2007","title":"The Effect of Online Privacy Information on Purchasing Behavior: An Experimental Study","authors":"Janice Y. Tsai, Serge Egelman, Lorrie Faith Cranor, Alessandro Acquisti","author_ids":"3246951, 2645852, 1699751, 1683053","abstract":"Companies' efforts to manage their information practices to produce transparent privacy policies have yielded mixed results. Web retailers detail such practices in their online privacy policies, but most of the time this information remains invisible to consumers. This paper reports on research undertaken to determine whether a more prominent display of privacy information will cause consumers to incorporate privacy considerations into their online purchasing decisions. We designed an experiment in which a shopping search engine interface, Privacy Finder, clearly displays privacy policy information. When such information is made available, consumers tend to purchase from online retailers who better protect their privacy. Importantly, our study indicates that once privacy information is made more salient, some consumers are willing to pay a premium to purchase from more privacy protective websites. This suggests that companies may be able to leverage privacy protection as a selling point.","cites":"136","conferencePercentile":"100"},{"venue":"WEIS","id":"05c60011f0b375b45daf422a67ce205f09f9d82b","venue_1":"WEIS","year":"2006","title":"Is There a Cost to Privacy Breaches? An Event Study","authors":"Alessandro Acquisti, Allan Friedman, Rahul Telang","author_ids":"1683053, 7931195, 1840673","abstract":"While the infosec economics literature has begun to investigate the stock market impact of security breaches and vulnerability announcements, little more than anecdotal evidence exists on effects of privacy breaches. In this paper we present the first comprehensive analysis of the impact of a company's privacy incidents on its market value. We compile a broad data set of instances of exposure of personal information from a failure of some security mechanism (hacking, stolen or lost equipment, poor process, and others) and we present the results of various empirical analyses, including event study analysis. We show that there exists a negative and statistically significant impact of data breaches on a company's market value on the announcement day for the breach. The cumulative effect increases in magnitudes over day following the breach announcement, but then decreases and loses statistical significance. We also present regression analyses that aim at disentangling the effects of a number of factors on abnormal stock returns due to reported breaches. Finally, we comment on the differences between the impact of the security breaches already described in the literature, and the privacy breaches described here.","cites":"50","conferencePercentile":"96"}]}