{"WELCOM.csv":[{"venue":"WELCOM","id":"8b08d821dcd022b0b272f06026c79753af873aa5","venue_1":"WELCOM","year":"2001","title":"Rational Exchange - A Formal Model Based on Game Theory","authors":"Levente Buttyán, Jean-Pierre Hubaux","author_ids":"1801605, 1757221","abstract":"We introduce game theory as a formal framework in which exchange protocols can be modeled and their properties can be studied. We use this framework to give a formal deenition for rational exchange relating it to the concept of Nash equilibrium in games. In addition, we study the relationship between rational exchange and fair exchange. We prove that fair exchange implies rational exchange, but the reverse is not true. The practical consequence of this is that rational exchange protocols may provide interesting solutions to the exchange problem by representing a trade-oo between complexity and what they achieve. They could be particularly useful in mobile e-commerce applications.","cites":"23","conferencePercentile":"90"},{"venue":"WELCOM","id":"8ce53a71049389667da203459aba06ebfa608fc8","venue_1":"WELCOM","year":"2001","title":"Integration of Goods Delivery Supervision into E-commerce Supply Chain","authors":"Anke Thede, Albrecht Schmidt, Christian Merz","author_ids":"1690254, 1678329, 1888038","abstract":"One of the benefits of electronic commerce is the gain of speed and easiness through electronic delivery of commerce data. Only the data specifying the delivery of the physical goods is not integrated into the electronic supply chain and therefore presents an unpleasant interruption of integration. The goal is to find a way to transfer delivery and goods related data electronically to gain rapidity and reliability. This paper focusses on supervisory data of sensitive goods and describes an implementation of a technique to store these data electronically and to integrate their flow seamlessly into the enterprise systems. It also gives an outlook to further utilization and improvements.","cites":"8","conferencePercentile":"50"},{"venue":"WELCOM","id":"0ffa0f836c76d2b64e79ab27e8a3e641f4b59b0b","venue_1":"WELCOM","year":"2001","title":"FAucS : An FCC Spectrum Auction Simulator for Autonomous Bidding Agents","authors":"János A. Csirik, Michael L. Littman, Satinder P. Singh, Peter Stone","author_ids":"2820210, 1735162, 1699868, 1728389","abstract":"We introduce FAucS, a software testbed for studying automated agent bidding strategies in simulated auctions, specifically the United States FCC wireless frequency spectrum auctions. In addition to the complexity of these auctions, which provides ample opportunities for intelligent approaches to bidding, this type of auction has huge commercial importance, each bringing in billions of dollars to governments around the world. We implement straightforward sample agents in FAucS and use them to replicate known beneficial bidding strategies in this type of auction. We then discuss potential in-depth studies of autonomous bidding agent behaviors using FAucS. The main contribution of this work is the implementation, description, and empirical validation of the FAucS testbed. We present it as a challenging and promising AI research domain.","cites":"20","conferencePercentile":"80"},{"venue":"WELCOM","id":"433cb8841eef9ab8a62d1346187209941625ea3b","venue_1":"WELCOM","year":"2001","title":"User Modelling for Live Help Systems","authors":"Johan Aberg, Nahid Shahmehri, Dennis Maciuszek","author_ids":"6181282, 1723372, 2158349","abstract":"We have explored the role of user modelling in live help systems for e-commerce web sites. There are several potential benefits with user modelling in this context: 1) Human assistants can use the personal information in the user models to provide the users with efficient support tailored to their personal needs; 2) Assistants can be more comfortable in their supporting role; 3) Consultation resources can be saved, and thus, financial savings can be made for the e-commerce company. A user modelling approach has been implemented and deployed in a real web environment as part of a live help system. Following the deployment we have analysed consultation dialogue logs and answers to a questionnaire for participating assistants. This paper elaborates on these results, which show that assistants consider user modelling to be helpful and that consultation dialogues can be an important source for user model data collection. Based on lessons learned from the study, future directions for research and development are carefully analysed and laid out.","cites":"3","conferencePercentile":"30"},{"venue":"WELCOM","id":"065d3e025175b19af6f936052d99151894c87b3f","venue_1":"WELCOM","year":"2001","title":"Incentives for Sharing in Peer-to-Peer Networks","authors":"Philippe Golle, Kevin Leyton-Brown, Ilya Mironov, Mark Lillibridge","author_ids":"2779068, 2360288, 1761190, 2434278","abstract":"We consider the <i>free-rider</i> problem that arises in peer-to-peer file sharing networks such as Napster: the problem that individual users are provided with no incentive for adding value to the network. We examine the design implications of the assumption that users will selfishly act to maximize their own rewards, by constructing a formal game theoretic model of the system and analyzing equilibria of user strategies under several novel payment mechanisms. We support and extend upon our theoretical predictions with experimental results from a multi-agent reinforcement learning model.","cites":"328","conferencePercentile":"100"},{"venue":"WELCOM","id":"1dbd2ddb5a6673ef1ff26040cb03d380dc1b338f","venue_1":"WELCOM","year":"2001","title":"GAMA-Mall - Shopping in Communities","authors":"Till Schümmer","author_ids":"1738533","abstract":"In this article, we consider market places as social places. Social places provide social presence and interaction. Virtual market places often lack in these social factors. Community support tools, such as chat systems or newsgroups try to fill this gap. We argue that a new architecture is needed that brings together customers with common interests. We propose a combined system called GAMA-Mall based on a spatial representation of the shop, which implements this architecture.","cites":"2","conferencePercentile":"15"}]}