{"Wellcome_open_research.csv":[{"venue":"Wellcome open research","id":"34fd072eac1b12bb6c4664d263fa773d39511896","venue_1":"Wellcome open research","year":"2016","title":"A blinded randomised placebo-controlled trial investigating the efficacy of morphine analgesia for procedural pain in infants: Trial protocol","authors":"Rebeccah Slater, Caroline Hartley, Fiona Moultrie, Eleri Adams, Ed Juszczak, Richard Rogers, Jane E Norman, Chetan Patel, Kayleigh Stanbury, Amy Hoskin, Gabrielle Green","author_ids":"2361880, 8261073, 7759444, 4432347, 6836928, 8567042, 3833524, 3864897, 8255058, 4183049, 5305337","abstract":"Infant pain has both immediate and long-term negative consequences, yet in clinical practice it is often undertreated. To date, few pain-relieving drugs have been tested in infants. Morphine is a potent analgesic that provides effective pain relief in adults, but there is inconclusive evidence for its effectiveness in infants. The purpose of this study is to establish whether oral morphine provides effective analgesia for procedural pain in infants. A blinded, placebo-controlled, parallel-group randomized, phase II, clinical trial will be undertaken to determine whether morphine sulphate administered orally prior to clinically-required retinopathy of prematurity (ROP) screening and heel lancing provides effective analgesia.  156 infants between 34 and 42 weeks' gestational age who require a clinical heel lance and ROP screening on the same test occasion will be included in the trial. Infants will be randomised to receive either a single dose of morphine sulphate (100 μg/kg) or placebo. Each infant will be monitored for 48 hours and safety data will be collected during the 24 hours following drug administration. The primary outcome will be the Premature Infant Pain Profile-revised (PIPP-R) score 30 seconds after ROP screening. The co-primary outcome will be the magnitude of nociceptive-specific brain activity evoked by a clinically-required heel lance. Infant clinical stability will be assessed by comparing the number of episodes of bradycardia, tachycardia, desaturation and apnoea, and changes in respiratory support requirements in the 24-hour periods before and after the clinical intervention. In addition, drug safety will be assessed by considering the occurrence of apnoeic and hypotensive episodes requiring intervention in the 24-hour period following drug administration. This study has been published as an Accepted Protocol Summary by The Lancet.","cites":"0","conferencePercentile":"50"}]}