{"WESE_09.csv":[{"venue":"WESE '09","id":"e87bf38fa20a8610b49914f806552dbe165dee5f","venue_1":"WESE '09","year":"2009","title":"Experiencing wireless sensor network concepts in an undergraduate computer science curriculum","authors":"Ardjan Zwartjes, Marlies Van de Voort, Bram Dil, Paul Havinga","author_ids":"1794895, , 3178672, 1679046","abstract":"Incorporating Embedded Systems courses in a general and broad Computer Science undergraduate curriculum can be a challenging task. The lack of experience with relevant tools and programming languages tends to limit the amount material that can be included in courses on this area. This, combined with limited familiarity and theoretical background within the field, makes motivating the students a serious issue.\n In this paper we describe our effort to change one of the embedded systems courses at the University of Twente in a way that enables students, without additional prior knowledge, to obtain a broad experience on the field of Wireless Sensor Networks and possibly motivate them to follow a further specialization in Embedded Systems. To achieve this goal we moved away from the traditional course where students first had to practice with all the tools and languages needed to program embedded systems, after which they could work on the real challenges, to a course where students could work on the final challenges from the start.\n Reversing this order eliminated the amount of time and effort students had to spent on learning tools and languages of which they did not yet understand the final purpose. This reversal led to a course that was received with great enthusiasm. Furthermore, given the progress the students showed during the course, this new approach proved to be highly effective. Hopefully the effects of this course can be seen in the following years in the form of a higher number of students choosing a specialization in Embedded Systems.","cites":"0","conferencePercentile":"27.27272727"},{"venue":"WESE '09","id":"1824b60abbce6b621fd5f6edb07e7a666c66c3ee","venue_1":"WESE '09","year":"2009","title":"History of summer school on embedded system technologies organized by students and young engineers","authors":"Hideki Takase, Takuya Azumi, Ittetsu Taniguchi, Yutaka Matsubara, Hayato Kanai, Shintaro Hosoai, Midori Sugaya","author_ids":"2162149, 1757662, 2137682, 6940784, 2732721, 3311039, 2442092","abstract":"This paper reports an embedded educational activity named Summer School on Embedded System Technologies (SSEST) in Japan. We, the committee members made up of students and young engineers gathering from all over the country, set down beginners as main targets since they have few chance to experience a series of processes of an embedded system development. This activity aims to provide an opportunity to learn elementary knowledge and skills of embedded system technologies through a practice of whole development process. Communication skills of participants can be enhanced by an interchange among them of different universities and companies through a group work. In this paper, we introduce a learning curriculum and contents of SSEST. Our curriculum consists of prior individual training and boot camp. Participants develop a line trace car through the embedded system development process. Then, we discuss the educational effects on this activity and achievements of the purpose. According to answers of the questionnaire, the 94% of participants satisfied or almost satisfied for SSEST.","cites":"0","conferencePercentile":"27.27272727"}]}