{"WETICE.csv":[{"venue":"WETICE","id":"91767ba8a63341f25db8ba822ec37a48de7c2a99","venue_1":"WETICE","year":"1996","title":"Educational applications of multi-client synchronization through improved Web graph semantics","authors":"Michael V. Capps, Brian C. Ladd, P. David Stotts, Lars S. Nyland","author_ids":"1736456, 1843438, 2158857, 8114754","abstract":"The Multi-Head, Multi-Tail, Multi-Client (MMM) Browsing Project is a continuing effort to bring stronger graph semantics to the World Wide Web thereby increasing the Web's usefulness for collaboration and education. The first modified browser [1] provided facilities for links with multiple heads and tails, thereby giving the content author the ability to direct concurrent and synchronized browsing streams. The web author can direct the paths of his readers, and ensure that they visit pages in the correct context and order desired. Our most recent effort [2] was the construction of a layer that filters content between the reader and the Web. This layer allows the ready composition of graph protocols so that Web content can be interpreted according to a variety of graph models. The model of the first project was expanded to be a full colored Petri net, thereby allowing synchronization of multiple browsing streams; the application of the MMM project to education now extends to a full collaborative classroom.","cites":"3","conferencePercentile":"26.08695652"},{"venue":"WETICE","id":"330407db983973718e55b60d1ae8ef64e3c05abd","venue_1":"WETICE","year":"1996","title":"Software engineering of distributed simulation environments","authors":"James W. Duff, James M. Purtilo, Michael V. Capps, P. David Stotts","author_ids":"2861382, 1718132, 1736456, 2158857","abstract":"With the increasing popularity of simulation and virtual environment software, it is necessary to provide software engineering techniques to simulation program designers. In this paper we lay out the requirements that any such techniques will have to meet, then suggest a formalism and an interconnection tool that will allow the interconnection of re-usable simulator components to build distributed simulation software.","cites":"5","conferencePercentile":"34.7826087"},{"venue":"WETICE","id":"2dc1e4eb98e222a33dcd38da334f7f294b5a3667","venue_1":"WETICE","year":"2003","title":"A Logical Model for Coordination Rule Classes in Collaborative Sessions","authors":"José Martín Molina Espinosa, Jean Fanchon, Khalil Drira","author_ids":"2123475, 1873837, 1809322","abstract":"This paper presents a coordination model allowing managers to define coordination policies in collaborative sessions. Our model allows different collaboration sites to be managed by maintaining consistency of the distributed management actions at the user and collaborative tool levels. The model manages multi-tools and multi-users collaboration sessions. It is based on a partial order representation of interdependencies in collaborative sessions and a logical specification of the required properties. We define three rule classes of coordination sufficient to specify the properties of interest. Our model is used to implement a software component for collaborative session management. We proceed by control of user-level management actions and by automated execution of tool-level management actions.","cites":"0","conferencePercentile":"8.108108108"},{"venue":"WETICE","id":"89e992ee60e9e990e9174464bf5850aa82d50acd","venue_1":"WETICE","year":"1997","title":"Communication Visibility in Shared Virtual Worlds","authors":"Michael V. Capps, Seth J. Teller","author_ids":"1736456, 1720894","abstract":"Though the service of shared virtual worlds is an active area of research, little effort has been made to optimize such systems for urban world spaces. Tracking the motion, action, and communication of thousands of users in a city requires a application of visibility for spatial and logical subdivision of updates. We propose herein the City-Level Optimizations for Virtual Environments (CLOVES) substrate for the MIT City Scan (automated urban geometry acquisition) project. CLOVES includes a generalized spatial subdivision optimized for visibility; a Graduated Visibility Set (GVS) generator; associated interest management techniques; and model service to distributed heterogeneous clients.","cites":"8","conferencePercentile":"73.68421053"},{"venue":"WETICE","id":"5180b9a8b7b1be8b9775cb3b3e93a21081791740","venue_1":"WETICE","year":"2006","title":"WETICE 2006 TICE Workshop -- Final Report","authors":"Alois Ferscha, Clemens Holzmann, Michael H. Leitner","author_ids":"1745790, 2215719, 2598155","abstract":"This report is a summary of the first international IEEE workshop on \" Tangible Interaction in Collabo-rative Environments \" (TICE) hold during WETICE 2006 at the University of Manchester on June 27 th .","cites":"0","conferencePercentile":"12.90322581"},{"venue":"WETICE","id":"ed78e3acd7020ee65198e2f49159d2f82bdd02a3","venue_1":"WETICE","year":"2005","title":"Plugging a Scalable Authentication Framework into Shibboleth","authors":"Ning Zhang, Li Yao, Jay Chin, Aleksandra Nenadic, A. McNab, Alan L. Rector, Carole A. Goble, Qi Shi","author_ids":"1729811, 1736276, 2199482, 3035549, 2134781, 8575990, 1701008, 7524129","abstract":"Shibboleth is an internet2 project developing security architectures and protocol messages supporting inter-institutional sharing of resources that require access control. Users identify and authenticate themselves locally to their respective institutions, and the institutions assert the users' identities through the use of attribute certificates signed by the institutions and SAML. The service providers then make access control decisions based upon users' privileges contained in the attribute certificates. In this VO (virtual organisation) environment that the Shibboleth solution is designed for, services are provided by dissimilar organisations which are from different security domains and have dissimilar security requirements. Therefore there is a need for a dynamic authentication mechanism that supports a whole range of authentication tokens and the authentication strengths derived from these tokens should be fed into the access decision making. This paper reports our ongoing efforts in designing and implementing such an authentication framework to facilitate multi-level and multi-factor authentication and authentication strength linked fine-grained access control in Shibboleth. The proof-of-concept prototype using a Java smart card is reported.","cites":"1","conferencePercentile":"16.66666667"},{"venue":"WETICE","id":"b9a4c307023d524a46e3da4218b2401cad7b22d3","venue_1":"WETICE","year":"2006","title":"Memetic: Semantic Meeting Memory","authors":"Danius T. Michaelides, Simon Buckingham Shum, Ben Juby, Clara Mancini, Roger Slack, Michelle Bachler, Rob Procter, Michael Daw, Andrew Rowley, Tim Chown, David De Roure, W. Terry Hewitt","author_ids":"1974756, 1749768, 3156785, 2373478, 3187653, 2845031, 1695506, 1679083, 2974688, 2790134, 1708123, 1773791","abstract":"This paper introduces the Memetic toolkit for recording meetings held over Internet-based video conferencing technologies , and making these navigable in linear and non-linear ways. We introduce the tools and technologies that form the toolkit and discuss the semantics of the information they capture.","cites":"2","conferencePercentile":"53.22580645"},{"venue":"WETICE","id":"a4d2222ccf17f41e23d0e20ec75ef234f7f77217","venue_1":"WETICE","year":"2006","title":"Curball--A Prototype Tangible Game for Inter-Generational Play","authors":"Dagmar Kern, Mark Stringer, Geraldine Fitzpatrick, Albrecht Schmidt","author_ids":"1770336, 2093203, 1719764, 1678329","abstract":"Older people have been the focus of research for ubiquitous computing applications. While many of these are understandably focused on health and aging in place issues, there is also considerable opportunity to support more playful aspects of life as an older person. We report here on a prototype collaborative game that can be played between an older person and a child. The game is based on a bowling game and makes use of tangible devices, sensors and augmented reality components. We report on the iterative development of this inter-generational play prototype and initial user feedback.","cites":"14","conferencePercentile":"96.77419355"},{"venue":"WETICE","id":"3f35c8653f94011af577666fc86a6d286b078551","venue_1":"WETICE","year":"2010","title":"Floating Task: Introducing and Simulating a Higher Degree of Uncertainty in Project Schedules","authors":"Sanja Lazarova-Molnar, Rabeb Mizouni","author_ids":"1749726, 1722280","abstract":"Despite several attempts to accurately predict duration and cost of projects, simulation models in use are still over simplified and nonrealistic. They often fail to cope with real-life scenarios and uncertainty. In this paper we use the proxel-based simulation method to analyze and predict duration of project schedules exhibiting high uncertainty due to typical on-the-fly human decision behavior. The proxel-based simulation is an approximate simulation method that is more precise than discrete-event simulation. To model uncertainty, we introduce a new type of task, state-dependent (floating) task that supports and demonstrates a high degree of uncertainty and depends on various parameters in the schedule. For example, the probability distribution of the duration of a task can change depending on the team that performs it. Thus, this kind of task can be used to model the frequent rescheduling in a project. We use software development process to illustrate our approach.","cites":"2","conferencePercentile":"41.66666667"},{"venue":"WETICE","id":"4ee048e9a05b332e358167dc2495492d349ba771","venue_1":"WETICE","year":"2003","title":"Spray Computers: Frontiers of Self-Organization for Pervasive Computing","authors":"Franco Zambonelli, Marie Pierre Gleizes, Marco Mamei, Robert Tolksdorf","author_ids":"1684412, 1732694, 1715670, 1802808","abstract":"We envision a future in which clouds of microcomputers can be sprayed in an environment to provide, by spontaneously networking with each other, an endlessly range of futuristic applications. However, beside the vision, spraying may also act as a powerful metaphor for a range of other scenarios that are already under formation, from ad-hoc networks of embedded and mobile devices to worldwide distributed computing. After having detailed the different spray computers scenarios and their applications, this paper discusses the issues related to the design and development of spray computer applications, issues which call for novel approaches exploiting self-organization and emergent behaviors as first-class tools. Finally, this paper presents the key research efforts being taken in the area and attempt at defining a rough research agenda.","cites":"10","conferencePercentile":"63.51351351"},{"venue":"WETICE","id":"eed73ac1305f64a9811a4c74e7259395d41689b3","venue_1":"WETICE","year":"2000","title":"Towards an Evaluation Methodology for the Development of Research-Oriented Virtual Communities","authors":"Janet Ho, Monica M. C. Schraefel, Mark H. Chignell","author_ids":"1876036, 2284695, 1796394","abstract":"A virtual community is a group of people whose shared needs and/or interests are largely communicated within, and mediated by Web-enabled interactions, e.g., within a Website. While some virtual communities (e.g., Motley Fool) have flourished, many sites designed for online collaboration have failed to succeed as virtual communities, places for people to hang out and collaborate online. In order to design effective virtual communities, we need methods to evaluate the usability and effectiveness of collaborative environments, and the degree to which they function as virtual communities (VCs). Our concern in this paper is to explore, through the discussion of a pilot study of a research-purposed VC, how to evaluate a VC infrastructure.","cites":"5","conferencePercentile":"36.36363636"},{"venue":"WETICE","id":"8cc041b21b4136f489bbdd8fb070d8ed599cc18a","venue_1":"WETICE","year":"2009","title":"GeoIGM: A Location-Aware IGM Platform","authors":"Neil Cowzer, Aaron J. Quigley","author_ids":"2372057, 1746410","abstract":"—In recent years, peer-to-peer systems have gained traction in a number of important areas including; file-sharing, VoIP and scientific research vehicles such as the Grid. We argue that this merely scratches the surface of the potential of peer-to-peer systems. This paper proposes a novel peer-to-peer system, GeoIGM, well suited to the highly collaborative style of tagging and development of context-aware services, particularly location. With the provision two fundamental operations; geographically-scoped multicasting and queries, GeoIGM eases the development of next-generation location-aware systems.","cites":"1","conferencePercentile":"20.83333333"},{"venue":"WETICE","id":"1743273c68cea7cc32aefb969eaafaedbe154f70","venue_1":"WETICE","year":"1998","title":"How to Coordinate Internet Applications based on Mobile Agents","authors":"Giacomo Cabri, Letizia Leonardi, Franco Zambonelli","author_ids":"1682769, 1679937, 1684412","abstract":"Internet applications can take advantage of a new design paradigm based on mobile agents. However, the presence of mobile active computational entities introduces peculiar problems in the coordination of the application components. The paper surveys the possible coordination models for mobile agent applications and evaluates them in the context of a widely distributed application in the area of WWW information retrieval. The analysis outlines the advantages and the drawbacks of each coordination model and shows how reactivity of the coordination media can provide the degree of flexibility and adaptivity required by mobile agent applications.","cites":"15","conferencePercentile":"87.09677419"},{"venue":"WETICE","id":"58923b7a9aeec9e57a3baaa5de16775e5a000952","venue_1":"WETICE","year":"2000","title":"The Mechanics of Collaboration: Developing Low Cost Usability Evaluation Methods for Shared Workspaces","authors":"Carl Gutwin, Saul Greenberg","author_ids":"1693768, 1696942","abstract":"We introduce a conceptual framework that articulates the mechanics of collaboration for shared-workspace groupware: the low level actions and interactions that must be carried out to complete a task in a shared manner. These include communication, coordination, planning, monitoring, assistance, and protection. The framework also includes three general measures of these mechanics: effectiveness, efficiency, and satisfaction. The underlying idea of the framework is that some usability problems in groupware systems are not inherently tied to the social context in which the system is used, but rather are a result of poor support for the basic activities of collaborative work in shared spaces. We believe that existing low-cost evaluation methods—heuristic evaluation, walkthroughs, user observations and questionnaires— can be modified to include this framework in a way that helps a groupware evaluator uncover these usability problems. 1. Introduction With the increasing connectivity of the internet, the increasing power of the worldwide web, and the increasingly distributed nature of organizations, multiuser computer systems (groupware) are becoming increasingly common. Despite this growth, many groupware systems have serious usability problems. At best, working in groupware is awkward and frustrating compared to face-to-face collaboration.","cites":"94","conferencePercentile":"100"},{"venue":"WETICE","id":"5072f8a78ad3d4741f9623c494d37158eb992632","venue_1":"WETICE","year":"2001","title":"Looking at the Whole Picture: A Case Study of Analyzing a Virtual Workplace","authors":"Michelle Potts Steves, Emile L. Morse","author_ids":"2080970, 2451209","abstract":"In a previous study, we analyzed data from a field study to determine the usability problems in a groupware system. That 75% of the system use was asynchronous surprised us. Consequently, we suspected that the user-centered method that had been employed in that evaluation, might have been insufficient to detect problems related to such heavy asynchronous use. Re-analysis of the data using an artifact-centered approach revealed additional support for our initial findings and some new usability issues. In combination, we believe that user-centered and artifact-centered methods can yield superior usability analyses for systems that support both synchronous and asynchronous collaboration, and provide application developers with more appropriate priorities for addressing usability problems and system design.","cites":"2","conferencePercentile":"36.20689655"},{"venue":"WETICE","id":"7f50dde5fe08d397f9179f71cd9af6d3937bd484","venue_1":"WETICE","year":"2007","title":"User-Controlled Collaborations in the Context of Trust Extended Environments","authors":"Jonathan Chan, Surya Nepal, David Moreland, Hon Hwang, Shiping Chen, John Zic","author_ids":"4733207, 1681657, 2888226, 2032736, 1806110, 8539818","abstract":"The area of virtual organisations researches mechanisms to enable entities from different organisations to collectively create a virtual enterprise for some mutual benefit. Our research is particularly interested in the type of collaboration where resources are normally 'opaque' and are only revealed 'as-required' between a select group of collaborating partners. Working in this area has revealed a need to establish a trusted environment for all application transactions prior-to, during and after a collaboration e.g. a pre-active eContract negotiation phase, an active phase for all collaborating activities and a post-active phase for information retrieval. Central to our embodiment of the trusted environment is the development and use of a portable Trust Extension Device (TED) with applicability to each phase of the collaboration process.","cites":"2","conferencePercentile":"50"},{"venue":"WETICE","id":"63446e87e8b03d464ec3da0d991627a247b5588c","venue_1":"WETICE","year":"1997","title":"A Product Information System based on an Object-Oriented Internet Database System","authors":"Adrian Kobler, Moira C. Norrie","author_ids":"1737786, 1685670","abstract":"We present a product informution system which supports enterprise-wide access to product structure data through the WorldWide Web (WWW). This information system provides ready access to data on products, their structures, variants and conjgurations. To meet the needs of various enterprises and types of use< the system is based on a product data model which is both Pexible and ex-tensible. The system has been implemented using the OMS object-oriented database management system and its generic WWW inte~ace.","cites":"1","conferencePercentile":"13.15789474"},{"venue":"WETICE","id":"3ddce595c5aa43d16f6e25695f669e0c331a793e","venue_1":"WETICE","year":"2000","title":"Workshop on Evaluating Collaborative Enterprises - Workshop Report","authors":"Amy J. Knutilla, Michelle Potts Steves, Robert H. Allen","author_ids":"3119204, 2080970, 1834807","abstract":"The workshop, Evaluating Collaborative Enterprises, 1 explored the issues surrounding the evaluation of collaborative systems including methods and tools for evaluating collaborative software as well as application-specific evaluation experiences. This paper describes the workshop's mission, summarizes the workshop papers and discussions, and concludes with future research needs. Acknowledgments The following people participated in this workshop and contributed to the contents of this report: In addition to the editors, the following people participated on the program committee. We gratefully acknowledge their time and energies:","cites":"10","conferencePercentile":"61.36363636"},{"venue":"WETICE","id":"7ffe998f8e4a4ced44a5842a25b0c7af6343046b","venue_1":"WETICE","year":"2011","title":"Handling Conflicts in Autonomous Coordination of Distributed Collaborative Activities","authors":"Jörn Franke, François Charoy, Cedric Ulmer","author_ids":"2453726, 2038513, 3261148","abstract":"— Coordination between different organizations in dynamic situations, such as a disaster response, is challenging. Organizations are autonomous and coordinate the situation from their point of view. There is no central authority to coordinate all operations. To coordinate their actions, organizations need to exchange information on what they are doing. However, they cannot share everything with everybody due to privacy, regulatory or strategic reasons. Currently, only e-mail, telephone or fax are used to exchange information. This makes detecting and handling of conflicting views on the situation very difficult. We propose an approach for inter-organizational process management for these kinds of dynamic scenarios. It allows different organizations to share selected activities by replicating them in the different workspaces of the organizations. State changes of shared activities are propagated optimistically. We explain detecting and handling of two different types of conflicts that can occur in this setting. We provide an implementation and interviews to validate the concepts.","cites":"2","conferencePercentile":"64.28571429"},{"venue":"WETICE","id":"c134908520138bad86be280a40cd80fb7fcb4640","venue_1":"WETICE","year":"1996","title":"A Web-based requirements analysis tool","authors":"Annie I. Antón, Eugene Liang, Roy Rodenstein","author_ids":"3254638, 2126953, 2796723","abstract":"The Goal Based Requirements Analysis Tool GBRAT is designed to support goal-based r equire-ments analysis. The tool provides procedural support for the identiication, elaboration, reenement and organization of goals to specify the requirements for software b ased information systems. GBRAT employs interactive Web browser technology to support the col-laborative nature o f r equirements engineering.","cites":"18","conferencePercentile":"91.30434783"},{"venue":"WETICE","id":"b67e4b797d7569bbf5ad00a3e8a3aefb14269bb3","venue_1":"WETICE","year":"2000","title":"Evaluation Challenges for a Federation of Heterogeneous Information Providers: The Case of NASA's Earth Science Information Partnerships","authors":"Catherine Plaisant, Anita Komlodi, Francis Lindsay","author_ids":"1764846, 2296141, 2269392","abstract":"NASA's Earth Science Information Partnership Federation is an experiment funded to assess the ability of a group of widely heterogeneous earth science data or service providers to self organize and provide improved and cheaper access to an expanding earth science user community. As it is organizing itself, the federation is mandated to set in place an evaluation methodology and collect metrics reflecting the health and benefits of the Federation. This paper describes the challenges of organizing such a federated partnership self-evaluation and discusses the issues encountered during the metrics definition phase of the early data collection.","cites":"4","conferencePercentile":"31.81818182"},{"venue":"WETICE","id":"877596771b4737e9e491bf37b476b1f05f0b15e5","venue_1":"WETICE","year":"2002","title":"Evaluation Factors for Multi-Stakeholder Broadband Visual Communication Projects","authors":"Marion A. Barfurth, Janice Singer, Bruno Emond, Norman G. Vinson, Martin Brooks, John Spence","author_ids":"2557430, 2561053, 2065261, 1781524, 3354665, 7689013","abstract":"This paper presents a summary of multi-faceted evaluation factors that we have identified through our research with Broadband Visual Communication (BVC) projects involving multiple stakeholders. The main benefit of these evaluation factors is that they provide a general evaluation framework for multiple stakeholder projects. The factors are social infrastructure, technical infrastructure, physical space, interaction style and content.","cites":"1","conferencePercentile":"25"},{"venue":"WETICE","id":"ed8b59814d9b9817c8023b2bf83c32dfac31b8f3","venue_1":"WETICE","year":"2004","title":"Towards A Component-Based Middleware Framework for Configurable and Reconfigurable Grid Computing","authors":"Geoff Coulson, Paul Grace, Gordon S. Blair, Laurent Mathy, David A. Duce, Christopher S. Cooper, Wai Kit Yeung, Wei Cai","author_ids":"1696978, 2431136, 1700173, 1703770, 1750156, 2907388, 2229110, 1712547","abstract":"Significant progress has been made in the design and development of Grid middleware which, in its present form, is founded on service-oriented architecture and web services technologies. Nevertheless, Grid middleware is still severely limited in key areas. In this paper we discuss work that aims to address some of these limitations. First, we consider how ideas and principles from the wider middleware research community can usefully be applied in a Grid middleware context. Then we focus on our own current work on integration of the Grid middleware platform with an extensible set of interaction types and advanced network services, and on an architectural framework for Grid middleware internals. We believe that these areas, along with complexity management, will become increasingly important as sophisticated e-Science applications start to exploit the potential of service-oriented architecture-based middleware.","cites":"13","conferencePercentile":"96.96969697"},{"venue":"WETICE","id":"e778119d6cca753ca1905f7e87e66b9a68ca04cd","venue_1":"WETICE","year":"2000","title":"CollabLogger: A Tool for Visualizing Groups at Work","authors":"Emile L. Morse, Michelle Potts Steves","author_ids":"2451209, 2080970","abstract":"The CollabLogger is a visual tool that supports usability analyses of human-computer interaction in a team environment. Participants in our computer-mediated activity were engaged in a small-scale manufacturing testbed project. Interactions of the group were mediated by Teamwave Workplace 1 and the members performed both synchronous and asynchronous activities depending on their availability, project requirements, and due to chance meetings in the collaborative space. The software was instrumented to log users' interactions with the system and each other. The CollabLogger addresses the problem of helping investigators analyze the volumes of log data that groupware tools can generate. Visual tools are powerful when large amounts of diverse data present themselves. The place-based collaboration environment offered by Teamwave Workplace provided a level of organization that allowed us to create a visual interface with which to perform exploratory sequential data analysis. Preliminary use of the tool shows that usability engineers can employ the visual display to form hypotheses about subject's interactions with the GUI interface and with each other. 1 Teamwave Workplace [1]is a commercial product identified in this document for the purpose of describing a collaborative software environment. This identification does not imply any recommendation or endorsement by the National Institute of Standards and Technologies.","cites":"12","conferencePercentile":"72.72727273"},{"venue":"WETICE","id":"8d97a1f17123ced7238d17036ce3198ab301a705","venue_1":"WETICE","year":"1999","title":"Supporting Manufacturing Process Analysis and Trouble Shooting with ACTS","authors":"Michelle Potts Steves, Wo Chang, Amy J. Knutilla","author_ids":"2080970, 2394901, 3119204","abstract":"This paper presents a National Institute of Standards and Technology (NIST) prototype tool called ACTS (Annotation Collaboration Tool via SMIL – Synchronized Multimedia Integrated Language), which was designed to meet the user requirements of a distributed, collaborative team performing remote analysis of robotic welds. Based on open standards such as W3C (World Wide Web Consortium) SMIL, ACTS provides a framework of temporal and spatial synchronization for multimedia data streams. An annotation facility provides for asynchronous collaboration among colleagues. ACTS uses the NIST-developed S2M2 [2] Java applet-based SMIL player that implements and extends the SMIL 1.0 specification. Future work is also discussed.","cites":"5","conferencePercentile":"66.66666667"},{"venue":"WETICE","id":"74b1144d5826bda0ff5c1e6307120c342057d852","venue_1":"WETICE","year":"2014","title":"Query Analyzer and Manager for Complex Event Processing as a Service","authors":"Wilson A. Higashino, Cédric Eichler, Miriam A. M. Capretz, Thierry Monteil, Maria Beatriz Felgar de Toledo, Patricia Stolf","author_ids":"2335859, 3424556, 1711826, 3476714, 1706407, 1745628","abstract":"—Complex Event Processing (CEP) is a set of tools and techniques that can be used to obtain insights from high-volume, high-velocity continuous streams of events. CEP-based systems have been adopted in many situations that require prompt establishment of system diagnostics and execution of reaction plans, such as in monitoring of complex systems. This article describes the Query Analyzer and Manager (QAM) module , a first effort toward the development of a CEP as a Service (CEPaaS) system. This module is responsible for analyzing user-defined CEP queries and for managing their execution in distributed cloud-based environments. Using a language-agnostic internal query representation, QAM has a modular design that enables its adoption by virtually any CEP system.","cites":"1","conferencePercentile":"57.14285714"},{"venue":"WETICE","id":"44845350c6f3ea94e728a8f251d8d8e416768227","venue_1":"WETICE","year":"2012","title":"SOTA: Towards a General Model for Self-Adaptive Systems","authors":"Dhaminda B. Abeywickrama, Nicola Bicocchi, Franco Zambonelli","author_ids":"2974012, 1693197, 1684412","abstract":"—The increasing complexity and dynamics in which software systems are deployed calls for solutions to make such systems autonomic, i.e., capable of dynamically self-adapting their behavior in response to changing situations. To this end, proper models and software engineering tools are required to be available to support the design and development of autonomic systems. In this paper, we introduce a new general model, SOTA, for modeling the adaptation requirements. SOTA, by bringing together the lessons of goal-oriented mod-eling and of context-aware system modeling, has the potentials for notably facilitating the tackling of some key issues in the design and development of complex self-adaptive software systems. In particular, SOTA enables: early verification of requirements, identification of knowledge requirements for self-adaptation, and identification of the most suitable self-adaptive patterns.","cites":"19","conferencePercentile":"100"},{"venue":"WETICE","id":"690b2ddf397489993115b87ffbdd52417cb7fca4","venue_1":"WETICE","year":"1998","title":"Using a Groupware Space for Distributed Requirements Engineering","authors":"Daniela E. Damian, Saul Greenberg","author_ids":"1741744, 1696942","abstract":"Requirements engineering (RE) is a necessary part of the software development process, as it helps customers and designers identify necessary system requirements. If these stakeholders are separated by distance, we argue that a distributed groupware environment supporting a cooperative requirements engineering process must be supplied that allows them to negotiate software requirements. Such a groupware environment must support aspects of joint work relevant to requirements negotiation: synchronous and asynchronous collaboration, telepresence, and teledata. It should also add explicit support for a structured RE process, which includes the team's ability to discuss multiple perspectives during requirements acquisition and traceability. We chose the TeamWave software platform as an environment that supplied the basic collaboration capabilities, and tailored it to fit the specific needs of RE. The misidentification of requirements is one of the most significant sources of customer dissatisfaction with delivered systems [13]. Consequently, development teams often include a requirements engineering process (RE) within a software development cycle to help them determine what needs to be designed. The problem is that software stakeholders can work in environments that cross organizational and national boundaries, where team members and subgroups may find themselves isolated from one another by distance and by time. One solution to this problem is to have a networked team use groupware specifically designed to support a distributed RE process. In this paper, we consider ways that groupware can support how a distributed team gathers requirements through a negotiated RE process. The naïve view of RE is that requirements are immutable facts about a situation that exist a priori and independent of the client's perception [4]. Our view is that requirements gathering goes beyond the one-way transfer of information from clients to designers. Rather, requirements are a negotiated product generated through a collaborative requirements process, where both clients and designers socially construct their requirements [4,14]. Consequently, groupware for RE must support a truly collaborative requirements negotiation process. Groupware should support activities identified as major problems in RE, including domain knowledge acquisition and traceability [16]. The issue here is that the participants in the process have multiple perspectives over the system to be designed [5], and that communication in RE \" is much more about developing an understanding of each other's views and perspectives, about sharing knowledge and about learning as a result of a shared experience \" [14]. Consequently, we focus on the ability of team members to express, discuss and …","cites":"21","conferencePercentile":"90.32258065"},{"venue":"WETICE","id":"04105ea5c51b6cddd5d29aeccc52523b1e0f8a5d","venue_1":"WETICE","year":"2013","title":"Graph-Based Formalism for Machine-to-Machine Self-Managed Communications","authors":"Cédric Eichler, Ghada Gharbi, Nawal Guermouche, Thierry Monteil, Patricia Stolf","author_ids":"3424556, 2548606, 2294140, 3476714, 1745628","abstract":"— Machine-to-Machine communications comprise a large number of intelligent devices sharing information and making cooperative decisions without any human intervention. To support M2M requirements and applications which are in perpetual evolution, many standards are designed, updated and rendered obsolete. Among these, arises from The European Telecommunications Standards Institute (ETSI) a promising standard for M2M communications. The ETSI M2M provides in particular a standardized framework for interoperable M2M Services. As most of its peer, this standard does not, however, address the issue of dynamic reconfiguration or provide a suitable model for the reasoning required to build self-managed M2M architectures. In our paper, we propose a graph-based approach built on top of the ETSI standard, including rules for reconfiguration management, to enforce self-management properties of M2M communications.","cites":"5","conferencePercentile":"100"},{"venue":"WETICE","id":"4f63cecea9dd6e53e33228192afac605fb45b892","venue_1":"WETICE","year":"1996","title":"EEN: a pen-based electronic notebook for unintrusive acquisition of engineering design knowledge","authors":"Jacek Gwizdka, Jim Louie, Mark S. Fox","author_ids":"2082319, 3166092, 6605630","abstract":"Capturing design information and decisions is critical to supporting re-use of designs and coordination in engineering teams. Most of this information is currently not recorded at all. In this research we focus on the role of electronic engineering notebooks in the capture, storage and dissemination of design information and decisions, and on their role in integrating and managing design decisions and processes. We propose EEN as a tool ultimately leading towards replacement of traditional paper engineering notebooks and assisting engineers in information related tasks. This paper presents requirements, design and implementation of EEN as well as initial experiment results.","cites":"6","conferencePercentile":"39.13043478"},{"venue":"WETICE","id":"b43fbf00a1d30222049e94556bc7a0951b2d4685","venue_1":"WETICE","year":"2003","title":"Mapping Abstractions of Norms in Electronic Institutions","authors":"Ismail Khalil, Gabriele Anderst-Kotsis, Wieland Schwinger","author_ids":"2822661, 2164574, 2705345","abstract":"Electronic institutions are the agents' counterpart of human organizations, which are specifically designed for providing support, trust, and legitimacy in electronic commerce applications. Two approaches have been advocated for the design and modeling of multi agent systems in an environment that is governed by some kind of (social) norms: in coordination strategy, multi agent systems are defined as a set of entities regulated by mechanisms of social order and created by more or less autonomous actors to achieve common goals; in cooperation strategy, agents model specific roles in the society and interact with each other as means to accomplish their goals. In this paper, we argue that there is a relative similarity between the two approaches with respect to their use of norms as constraints on the social behavior of multi agents systems.","cites":"4","conferencePercentile":"47.2972973"},{"venue":"WETICE","id":"23d87da612365bfd450cd5bc5b164223b4babdb1","venue_1":"WETICE","year":"2001","title":"Evaluation of Interference During Collaborative Document Development","authors":"Jeffrey D. Campbell","author_ids":"1733322","abstract":"A problem with collaborative development of documents is that people can interfere with each other's work. If unresolved, this interference can result in an incorrect document. A evaluation scenario using the development of a database design is proposed as a good context for evaluation of collaborative systems for the development of both text and diagram documents. Several metrics and measures are described for quantifying the occurrence of interference. In particular, five survey questions were added to a standard usability instrument to address interference and protection.","cites":"0","conferencePercentile":"6.896551724"},{"venue":"WETICE","id":"a3341cefb234cac8e47ef9d9d34712d5b2e7f832","venue_1":"WETICE","year":"2000","title":"Report On Major Themes and Issues Arising from the Workshop","authors":"Kirstie L. Bellman, Christopher Landauer, Robert Tolksdorf, Alois Ferscha","author_ids":"2446872, 1722798, 1802808, 1745790","abstract":"workflow rules) and facilitate knowledge management and exchange. Thus, the workshop looked not only at collaborative systems, but also at the models and infras-tructures needed for enabling human organizations, or hybrid organizations made up of both human and software agents I processes, to effectively interact and cooperate. The papers presented at the workshop and included in the proceedings contributed to all areas mentioned. They triggered several discussions on the addressed topics. This report present the views expressed and conclusions drawn. The Workshop Chairs voted Alois Ferscha's paper \"Workspace Awareness in Mobile Virtual Teams'. as the best paper in the workshop. Abstract The WETICE Workshop on Web-based Infrastructures and Coordination Architectures for Collaborative Enterprises continued two threads of workshops in the WET-ICE series that were held over the last four years. These workshops addressed the question of how Web techniques can be used 10 achieve or 10 improve collaboration within or between organizations, and which coordination mechanisms could be used in such an architecture. The papers presented at the workshop and included in the proceedings contributed 10 all areas mentioned. They triggered several discussions on the addressed topics. This report present the views expressed and conclusions drawn. The Workshop Chairs voted Alois Ferscha's paper .'Workspace Awareness ill Mobile Virtual Teams\" as the best paper in the workshop.","cites":"0","conferencePercentile":"11.36363636"},{"venue":"WETICE","id":"1bfff461889589d13ed59d54f631b614e4a62eb0","venue_1":"WETICE","year":"2001","title":"Evaluating Collaborative Enterprises - A Workshop Report","authors":"Michelle Potts Steves, Robert H. Allen","author_ids":"2080970, 1834807","abstract":"As part of the the 10th IEEE International Workshops on Enabling Technologies: Infrastructure for Collaboration conference (WETICE 2001), the Workshop on Evaluating Collaborative Enterprises continued from its debut last year exploring the issues surrounding the evaluation of collaborative enterprises. This exploration included methods and tools for evaluating collaborative software as well as application-specific evaluation experiences. This paper describes the workshop's mission, summarizes the nine workshop presentations and one demonstration, and presents the main themes emanating from this workshop. These include the need for integrated theories, the need for advances in evaluation techniques and tools, and the need to confront non-controlled variables in case studies.","cites":"4","conferencePercentile":"58.62068966"},{"venue":"WETICE","id":"8ada3cd15421253779155974e986acb8ed8d995f","venue_1":"WETICE","year":"2013","title":"Collective Awareness for Human-ICT Collaboration in Smart Cities","authors":"Nicola Bicocchi, Alket Cecaj, Damiano Fontana, Marco Mamei, Andrea Sassi, Franco Zambonelli","author_ids":"1693197, 2293853, 8741478, 1715670, 2590441, 1684412","abstract":"Future urban scenarios will be characterized by the close integration of ICT devices and humans. Citizens using their own capabilities integrated with ICT technologies could collaboratively constitute a large-scale socio-technical superorganism to support collective urban awareness and activities. This position paper, with the help of a representative case study in the area of intelligent transportation systems, identifies the key challenges for future urban superorganisms and proposes a two-tier architecture to support their development.","cites":"4","conferencePercentile":"85.29411765"},{"venue":"WETICE","id":"25ee4bc52e1ddb8db436c1d0127a4baaa1822954","venue_1":"WETICE","year":"2003","title":"Developing Adaptive and Context-aware Applications in Dynamic Networks","authors":"Marco Mamei, Franco Zambonelli, Letizia Leonardi","author_ids":"1715670, 1684412, 1679937","abstract":"Suitable programming models and associated supporting infrastructures are required to deal with large software systems dived in complex and dynamic network environments. Here, with the aid of a case study scenario, we discuss the inadequacies of current approaches in dealing with such scenarios. Then we sketch the key characteristics of TOTA (Tuples On The Air), as a novel proposal to deal with the above inadequacy TOTA relies on tuple-based information to be spatially diffused in the network and to be exploited by application agents so as to achieve context-awareness and – consequently – to effectively coordinate with each other despite the network dynamics. Related works are also discussed.","cites":"2","conferencePercentile":"25.67567568"},{"venue":"WETICE","id":"1cac5bfa0c8a083cdd811fe80d9a44a83c7e8e91","venue_1":"WETICE","year":"2003","title":"Coordination in Pervasive Computing Environments","authors":"Alois Ferscha","author_ids":"1745790","abstract":"Computer science and engineering nowadays appears to be challenged (and driven) by technological progress and quantitative growth. Among the technological progress challenges are advances in sub-micron and system-on-a-chip designs, novel communication technologies, micro-electro-mechanical systems, nano and materials sciences. The vast pervasion of global networks, the growing availability of wireless communication technologies for the wide, local and personal area, and the evolving ubiquitous use of mobile and embedded information and communication technologies are indicators for accelerated quantitative growth. We perceive a shift from the \" one person with one computer \" paradigm, which is based on explicit human machine interaction, towards a ubiquitous and pervasive computing paradigm, in which implicit interaction and cooperation is the primary mode of computer supported activity. This, however, poses serious challenges to the conceptual architectures of computing, and related engineering disciplines in computer science. 1. Historical Background \" The most profound technologies are those that disappear. They weave themselves into the fabric of everyday life until they are indistinguishable from it \" was Mark Weiser's central statement in his seminal paper [43] in Scientific American in 1991. His conjecture, that \" we are trying to conceive a new way of thinking about computers in the world, one that takes into account the natural human environment and allows the computers themselves to vanish into the background \" has fertilized the embedding of ubiquitous computing technology into a physical environment which responds to people's needs and actions. Most of the services delivered through such a \" technology-rich \" environment are services adapted to context, particularly to the person, the time and the place of their use. Along Weiser's vision, it is expected that context-aware services will evolve, enabled by wirelessly ad-hoc networked, mobile, autonomous special purpose computing devices (i.e. \" smart appliances \"), providing largely invisible support for tasks performed by users. It is expected that services with explicit user input and output will be replaced by a computing landscape sensing the physical world via a huge variety of sensors, and controlling it via a manifold of actuators in such a way that it becomes merged with the virtual world. Applications and services will have to be greatly based on the notion of context and knowledge, will have to cope with highly dynamic environments and changing resources, and will need to evolve towards a more implicit and proactive interaction with users. A second historical vision impacting the evolution …","cites":"13","conferencePercentile":"72.97297297"},{"venue":"WETICE","id":"19089ef6455f1fc1293cbe1f9e7f5f67ead2ad3c","venue_1":"WETICE","year":"2002","title":"On Communication Security in Wireless Ad-Hoc Sensor Networks","authors":"Sasha Slijepcevic, Miodrag Potkonjak, Vlasios Tsiatsis, Scott Zimbeck, Mani B. Srivastava","author_ids":"2569441, 1733429, 2360116, 2755706, 1702254","abstract":"Networks of wireless microsensors for monitoring physical environments have emerged as an important new application area for wireless technology. Key attributes of these new types of networked systems are the severely constrained computational and energy resources, and an ad hoc operational environment. This paper is a study of the communication security aspects of these networks. Resource limitations and specific architecture of sensor networks call for customized security mechanisms. Our approach is to classify the types of data existing in sensor networks, and identify possible communication security threats according to that classification. We propose a communication security scheme where for each type of data we define a corresponding security mechanism. By employing this multitiered security architecture where each mechanism has different resource requirements, we allow for efficient resource management, which is essential for wireless sensor networks.","cites":"88","conferencePercentile":"100"},{"venue":"WETICE","id":"53f9bea5262ca784fdcdd1eb4372d42f0f493f54","venue_1":"WETICE","year":"2000","title":"DEMOIR: A Hybrid Architecture for Expertise Modeling and Recommender Systems","authors":"Dawit Yimam Seid, Alfred Kobsa","author_ids":"3171286, 1715227","abstract":"Although employees' expertise has long been regarded as an important asset in organizations at least on a par with capital, goods and documented information, it is only recently that automated systems to enhance the visibility and traceability of employees with particular expertise started to receive research attention. In this paper, we introduce a systematic classification of alternative architectures for a core functionality of expert finding systems, namely expertise modeling. We also analyze the advantages and disadvantages of each approach and present our hybrid solution. We discuss how this solution addresses the requirements of (1) distributed and heterogeneous organizational and personal expertise data sources and, (2) centralized access to extracted expertise information.","cites":"8","conferencePercentile":"54.54545455"},{"venue":"WETICE","id":"24cc7587be867b1959c103903036c1046d996c0b","venue_1":"WETICE","year":"2003","title":"Policy Storage for Role-Based Access Control Systems","authors":"András Belokosztolszki, David M. Eyers, Wei Wang, Ken Moody","author_ids":"2342812, 1784358, 1706612, 1749795","abstract":"Role-based access control has been a focal area for many security researchers over the last decade. There have been a large number of models, and many rich specification languages. However there has been little attention paid to the way in which access control policy is stored persistently. This paper investigates policy storage from the perspective of access control to the policy itself, and of its distributed administration.","cites":"2","conferencePercentile":"25.67567568"},{"venue":"WETICE","id":"3110d9c39fb320e2afb6466287a8e40243c9cb23","venue_1":"WETICE","year":"2007","title":"Tabletop Collaboration through Tangible Interactions","authors":"Sriram Subramanian, David Pinelle, Jan H. M. Korst, Vincent Buil","author_ids":"1702794, 2201898, 2123812, 2964252","abstract":"Recent advances in tracking technology have led to the design of digital tables that support interaction using multi-finger input and physical objects. However, the tradeoffs between these input modalities are not clear, making it difficult for developers to make informed decisions when choosing input strategies for digital table systems. In this paper, we consider the role that multi-finger input and physical objects play in the design of collaborative tabletop systems. We present the results of an observational study of group work on regular tables, and an experimental study of interaction techniques for supporting group handoff. Our results show that people often perform several explicit communication and coordination activities that involve epistemic and pragmatic movements of physical tools. Further , our experimental results suggest that using physical objects to control digital information improves performance over using finger gestures.","cites":"5","conferencePercentile":"77.5"},{"venue":"WETICE","id":"02d696b0d9da62c501f692d3523882e8c8640dec","venue_1":"WETICE","year":"2001","title":"Group Task Analysis for Groupware Usability Evaluations","authors":"David Pinelle, Carl Gutwin","author_ids":"2201898, 1693768","abstract":"Techniques for inspecting the usability of groupware applications have recently been proposed. These techniques focus on the mechanics of collaboration rather than the work context in which a system is used, and offer time and cost savings by not requiring actual users or fully-functional prototypes. Although these techniques are valuable, adding information about task and work context could improve the quality of inspection results. We introduce a method for analysing group tasks that can be used to add context to discount groupware evaluation techniques. Our method allows for the specification of collaborative scenarios and tasks by considering the mechanics of collaboration, levels of coupling during task performance, and variability in task execution. We describe how this type of task analysis could be used in a new inspection technique based on cognitive walkthrough.","cites":"9","conferencePercentile":"81.03448276"},{"venue":"WETICE","id":"2e0f544e3e0cb66cca6c223efef5b62ceeb2473e","venue_1":"WETICE","year":"2000","title":"A Review of Groupware Evaluations","authors":"David Pinelle, Carl Gutwin","author_ids":"2201898, 1693768","abstract":"A better understanding of how groupware systems have been evaluated in the past can help to frame the discussion of what methods and techniques should be considered for future evaluations. We reviewed all papers from the ACM CSCW conference (1990-1998) that introduced or evaluated a groupware system. Forty-five papers were included in the review. The main findings are that almost one-third of the groupware systems were not evaluated in any formal way, that only about one-quarter of the articles included evaluations in a real-world setting, and that a wide variety of evaluation techniques are in use. Our main conclusions from the review are that more attention must be paid to evaluating groupware systems and that there is room for additional evaluation techniques that are simple and low in cost.","cites":"46","conferencePercentile":"90.90909091"},{"venue":"WETICE","id":"50f64aa00a880541837f43c5668a886de498a571","venue_1":"WETICE","year":"2008","title":"Mobile Ad Hoc Networks for Collaborative and Mission-Critical Mobile Scenarios: A Practical Study","authors":"Gianluca Bertelli, Massimiliano de Leoni, Massimo Mecella, Justin Dean","author_ids":"3335759, 1714840, 1732710, 4233999","abstract":"Nowadays Mobile Ad hoc NETworks (MANETs) are proposed in many collaborative and mobile scenarios. Despite the effort of the research community on algorithms and implementations mainly targeted to laptops, very few implementations exist for commercial PDAs (i.e., equipped with Windows Mobile). In this work, a practical study on one of the few available and running implementation has been conducted, with the aim of providing a toolkit for researchers, engineers and practitioners willing to use MANETs in their scenarios/systems/applications.","cites":"3","conferencePercentile":"71.42857143"},{"venue":"WETICE","id":"19ed9218250701235069ef388852e26ae1a84da3","venue_1":"WETICE","year":"2005","title":"On P2P Collaboration Infrastructures","authors":"Manfred Hauswirth, Ivana Podnar Zarko, Stefan Decker","author_ids":"1733076, 1700129, 1685642","abstract":"BSCW [8] and Groove [10] have become the two de-facto standards for collaboration over the Internet. They offer a wealth of functionalities, support a variety of possible collaboration styles, and are applied frequently in research and business projects. While being useful and powerful for standard scenarios, they suffer from some problematic aspects if support for distributed ad-hoc and mobile collaboration is needed. Both are centralized systems which require the setup and maintenance of a server. Setting up such an infrastructure for short-term and ad-hoc collaboration of mobile users is not feasible since it requires the infrastructure to be in place and configured a-priori, which is costly in terms of hardware, software, and time. Thus they are not very adequate for flexible, short term collaborations, a genuine building block of many lightweight distributed mobile collaboration scenarios. In this paper we discuss how P2P approaches could be applied to remedy these shortcomings and to what extent existing technology can already be applied \" out of the box. \"","cites":"4","conferencePercentile":"55"},{"venue":"WETICE","id":"8271b7d84d2af747df64f57012ee4c48d294bc05","venue_1":"WETICE","year":"1999","title":"Collective Choice in Virtual Teams","authors":"Alois Ferscha, Christoph Scheiner","author_ids":"1745790, 3339518","abstract":"Virtual organisations within and across enterprise structures are becoming mature as a potentially effective means for goal oriented business teamwork. Among the plentyful of support functions enabling the efficient cooperation in teams, team decision making is a very crucial one, but does not find adequate support in contemporary team software solutions. Even the most knowledgable results from collective choice theory are not reflected in the respective virtual team environments. This paper makes a first and very systematic attempt to provide virtual teams with the power of voting procedures developed in the context of the theory of collective choice. A toolset, TEAMVOTE, for electronic decision making is presented, implementing a blend of the most important collective choice strategies like the Dodgson rule, the majority rule, plurality voting, Borda counting, approval voting, the Nanson rule, the Hare rule, the Coomb rule etc. based on standard Internet technology. The services of TEAMVOTE targeted to support goal oriented business teams in group decision matters raises the perspective of its use also to enable democratic processes on a societal scale. 1 Introduction Organisations like virtual teams which by nature of their configuration are geographically dislocated have raised demands for electronic decision making facilities via the networking infrastructure defining their workplace. Among the obvious advantages of electronic voting systems are the time and place independence of voters, the ease of administration with respect to cost and speed-the prevalent problems are authentication of voters and security and privacy when submitting a ballot. Although a growing need for electronic voting system is percieved, not many efforts have been undertaken to implement flexible voting systems that can handle the basic collective choice procedures developed and discussed in collective choice theory [1]. Before discussing contemporary electronic voting systems, we first sketch basic collective choice principles within Section 1. The software architecture of TEAMVOTE and the Internet technologies used to implement it are outlined in Section 2, the user interface is illustrated in Section 3. Conclusion and perspectives are given in Section 4. 1.1 Collective Choice Background After the pioneering work of Arrow [3] and Senn [1] (operationally summarized by Nurmi [2] [9]) a collective choice problem is formulated as a choice function CCF: aggregating individual preference relations R i to a collective preference relation R on a set of alternatives A. The individual preference relation R i are assumed to be reflexive, complete (for any pair of alternatives x,y ∈ …","cites":"3","conferencePercentile":"30.55555556"},{"venue":"WETICE","id":"42a02f88d0bb017adf252ba6bfa8c7bcb29a5c17","venue_1":"WETICE","year":"2000","title":"Workspace Awareness in Mobile Virtual Teams","authors":"Alois Ferscha","author_ids":"1745790","abstract":"Staying aware of each other in cooperative team work is something we take for granted in the everyday world, even if collaboration is not continuously face-to-face, and team members frequently shift from group to individual activity during work sessions. Maintaining this intuitive fidelity of awareness, e.g. of team members working in the office next door, is on the other hand something that has proven particularly difficult to attain in distributed collaboration systems, where the social interaction protocol is not as established, and the means for becoming aware of the environment are far less common. The work reported in this paper is focussed on workspace awareness, i.e. the \"... up-to-the-moment understanding of another person's interaction with a shared workspace\" [GuGr 99]. Opposed to the traditional understanding of shared workspaces as being bounded spaces where people can see and manipulate artefacts related to their activities (documents in an office, the whiteboard in a lecture hall or assembly lines in a factory), we consider virtual mobile (team) workspaces as abstract spaces containing objects that constitute the team work.","cites":"11","conferencePercentile":"68.18181818"},{"venue":"WETICE","id":"2f480d3535c6f5034237f0645627fe17104b022c","venue_1":"WETICE","year":"2001","title":"Using Innovation Diffusion Theory to Guide Collaboration Technology Evaluation: Work in Progress","authors":"Diane H. Sonnenwald, Kelly Maglaughlin, Mary C. Whitton","author_ids":"1740763, 2498148, 1761150","abstract":"Cost effective development of collaboration technology requires evaluation methods that consider group practices and can be used early in a system's life-cycle. To address this challenge we developed a survey to evaluate collaboration technology based on innovation dgusion theory[23]. The theory proposes five attributes of innovations that influence technology adoption: relative advantage, compatibility, complexity, trialability and observability. Selecting items from existing surveys related to these attributes, we developed a prototype multi-scale survey to help evaluate whether using a system face-to-face or distributively influences study participants' attitudes towards system adoption. We have begun refining the survey instrument and report on this process, the proposed survey questions, and the reliability and validity of the survey instrument.","cites":"19","conferencePercentile":"96.55172414"},{"venue":"WETICE","id":"54ebf472fd458ddae9126d3c569c945aa687523f","venue_1":"WETICE","year":"2003","title":"Requirements Engineering and Agile Software Development","authors":"Frauke Paetsch, Armin Eberlein, Frank Maurer","author_ids":"3147762, 1688474, 1736996","abstract":"This article compares traditional requirements engineering approaches and agile software development. Our paper analyzes commonalities and differences of both approaches and determines possible ways how agile software development can benefit from requirements engineering methods.","cites":"117","conferencePercentile":"100"},{"venue":"WETICE","id":"708efa28ed4406fe49d3564966e6421c77a1649d","venue_1":"WETICE","year":"1999","title":"A Concept for Supporting the Formation of Virtual Corporations through Negotiation","authors":"Boris Kötting, Frank Maurer","author_ids":"3001270, 1736996","abstract":"This paper describes a system that supports software development processes in virtual software corporations. A virtual software corporation consists of a set of enterprises that cooperate in projects to fulfill customer needs. Contracts are negotiated in the whole lifecycle of a software development project. The negotiations really influence the performance of a company. Therefore, it is useful to support negotiations and planning decisions with software agents. Our approach integrates software agent approaches for negotiation support with flexible multi-server workflow engines.","cites":"3","conferencePercentile":"30.55555556"},{"venue":"WETICE","id":"10d026f4e8aeee47d5537fc94718cb9148354bb1","venue_1":"WETICE","year":"2006","title":"Multi-Dimensional Performance Framework for Enterprise Knowledge Infrastructures","authors":"Joe Bolinger, Jayashree Ramanathan","author_ids":"2276103, 7205600","abstract":"— Within service-oriented business environments, the non-routine processing of requests requires a greater degree of social interaction and learning in order to achieve an effective response. Specific practices arise and evolve through these business-social interactions, however traditional enterprise data and content management systems are typically 'closed'. They do not permit the evolution of practices through sharing within the network of practitioners. Enterprise Knowledge Infrastructure (EKI) has been defined as the phenomenon in which local knowledge emerges during practice. Support for capture and re-use of knowledge has many known challenges. We propose an interdisciplinary EKI portal framework to support business-social interactions and monitor their value to accelerate the creation and evolution of practice through reflexive knowledge. The main contributions of the framework are: 1) a multi-dimensional model for monitoring the value of social interactions to all stakeholders, 2) living objects that capture and feedback multi-dimensional performance as reflexive knowledge for the execution of tasks, and 3) the complete business-technology architecture for effective implementation.","cites":"0","conferencePercentile":"12.90322581"},{"venue":"WETICE","id":"4a721a291a802a0378f08b743329524fd20819ad","venue_1":"WETICE","year":"2001","title":"Approaching Support for Internet-Based Negotiation on Software Projects","authors":"Boris Kötting, Frank Maurer","author_ids":"3001270, 1736996","abstract":"Negotiating a software development contract is a complex operation. One needs to make decisions about many different aspects of what information to provide to possible contractors, who potential collaborators can be and how one wants to negotiate with them. This paper deals with our approach for negotiation support for software development tasks. We created a virtual marketplace that supports contract negotiation between different companies as well as in between a company. In contrast to existing Web based marketplaces, we needed to develop concepts for dealing with complex structures like task hierarchies and also offer more negotiation possibilities.","cites":"1","conferencePercentile":"20.68965517"},{"venue":"WETICE","id":"470ed576bf516845ec4aca9364d57c9f90b3d2d9","venue_1":"WETICE","year":"2013","title":"Is Self-Expression Useful? Evaluation by a Case Study","authors":"Mariachiara Puviani, Carlo Pinciroli, Giacomo Cabri, Letizia Leonardi, Franco Zambonelli","author_ids":"1727357, 1794766, 1682769, 1679937, 1684412","abstract":"—In the context of adaptive component-based systems , self-expression is the capability of changing the adaptation pattern at run-time when some changes occur in the system itself or in its environment. Even if functional requirements can be met without changing the adaptation pattern, the achievement of non-functional requirements, such as performance, can benefit from a change of adaptation pattern. The aim of this paper is to show, by means of a case study in swarm robotics, that a change of adaptation pattern can affect the performance of a system. In particular we show that the change of adaptation pattern can be useful in adaptive component-based systems to react to changes in the situation of the environment.","cites":"3","conferencePercentile":"67.64705882"},{"venue":"WETICE","id":"34e2e14b9225622b736fa5f25e588a2f8ec0a799","venue_1":"WETICE","year":"2006","title":"Co-Presence Communities: Using Pervasive Computing to Support Weak Social Networks","authors":"Jamie Lawrence, Terry R. Payne, David De Roure","author_ids":"2757664, 1740601, 1708123","abstract":"Although the strongest social relationships feature most prominently in our lives, we also maintain a multitude of much weaker connections: the distant colleagues that we share a coffee with in the afternoon; the waitress at a our regular sandwich bar; or the 'famil-iar stranger' we meet each morning on the way to work. These are all examples of weak relationships which have a strong spatial-temporal component but with few support systems available. This paper explores the idea of 'Co-presence Communities'-a probabilistic definition of groups that are regularly collocated together-and how they might be used to support weak social networks. An algorithm is presented for mining the Co-presence Community definitions from data collected by Bluetooth-enabled mobile phones. Finally, an example application is introduced which utilises these communities for disseminating information.","cites":"11","conferencePercentile":"90.32258065"},{"venue":"WETICE","id":"213987e7ca74e0fbdf515270517e855e004c6a46","venue_1":"WETICE","year":"2008","title":"Coordinating Mobile Actors in Pervasive and Mobile Scenarios: An AI-Based Approach","authors":"Massimiliano de Leoni, Andrea Marrella, Massimo Mecella, Stefano Valentini, Sebastian Sardiña","author_ids":"1714840, 2232193, 1732710, 2172685, 2302339","abstract":"Process Management Systems (PMSs) can be used not only in classical business scenarios, but also in highly dynamic and uncertain environments, for example, in supporting operators during Emergency Management for coordinating their activities. In such challenging situations, processes should be adapted in order to cope with anomalous situations, including connection anomalies and task faults. This requires the provision of intelligent support for the planning and enactment of complex processes, that allows to capture the knowledge about the dynamic context of a process. In this paper, we show how this knowledge, together with information about the capabilities of the available actors, may be specified and used to not only to support the selection of an appropriate set of agents to fill the roles in a given task, but also to solve the problem of adaptiv-ity. The paper describes a first prototype of a PMS based on well-known Artificial Intelligence Techniques and how it can be extended to tackle adaptation.","cites":"3","conferencePercentile":"71.42857143"},{"venue":"WETICE","id":"760d9d1fe9a587ec49d85af788ac2f22a8a54154","venue_1":"WETICE","year":"2003","title":"Ontology-Based Information in Dynamic Environments","authors":"Heiner Stuckenschmidt","author_ids":"1698459","abstract":"It has been argued that ontologies are a key technology for resolving semantic heterogeneity. A number of ontol-ogy based systems have been developed that support typical Knowledge Management tasks. At the moment almost all of these systems, however, rely on a number of assumptions about the nature of environment they are used in. One of these assumptions is that the domain is more or less static. In many realistic application scenarios for ontology-based information, however, we are facing environments that are highly dynamic. This is especially true if we are aiming at the management of information on the WWW, but it is also true for knowledge management in large or distributed organizations that do not have a central repository for accessing information. In such an environment, a number of problems occur when trying to use ontology-based information. Changing Information The most frequently observed kind of dynamics is a change in the set of information that should be made accessible using an ontology. If we want to be able to access information that has been published by someone else, we cannot rely on an appropriate annotation that allows us to access information via our local ontology. We rather have to find ways to relate remote information to our ontology while avoiding time consuming manual annotation as far as possible. In [4] we describe a method for dynamically generating RDF annotations for pages in web-based information systems on the basis of general rules about the structure of the documents. It turned out that these rules could even be learned quite successfully using inductive logic programming techniques. Changing Ontologies Less frequently than changes in the information are changes in the ontologies used to access information. Such changes, however, if they take place have a strong impact on the access of annotated information. The problem here is that ontologies are often seen as logical theories that encode implicit information (e.g. about subclass relationships) that is only revealed when we use the ontol-ogy for reasoning. Therefore a small change in the ontology can imply a lot of changes in the result of ontology-based information retrieval. In [3] we propose a modular architecture for representing ontologies that helps to better encapsulate changes. We use a restricted language for connecting modules that allows us to 'predict' the impact of changes in one module on other modules. Further, we describe an algorithms that checks whether a change has …","cites":"2","conferencePercentile":"25.67567568"},{"venue":"WETICE","id":"fb90761c98253097a2005a3c7c05d0bba94ea6c5","venue_1":"WETICE","year":"2001","title":"SCENTOR: Scenario-Based Testing of E-Business Applications","authors":"Jeremiah Wittevrongel, Frank Maurer","author_ids":"2213079, 1736996","abstract":"E-business software is often developed on a tight schedule, and testing needs to keep pace. Advice from proponents of approaches like Extreme Programming is that by testing continuously, it is actually possible to compress development cycles. In this paper we discuss a testing approach that supports developers with their task of creating automated functional test drivers for e-business applications. The main goal for the approach is to reduce the time and effort required to automate scenario tests for e-business applications. After motivating the approach, we give an abstract view of a tool designed and implemented to support the approach. Next, we give an example of its use, and finally proceed to a discussion of the architecture of the tool itself.","cites":"8","conferencePercentile":"72.4137931"},{"venue":"WETICE","id":"2bc0a92216ccc68dc977c348d1aef6856ba92547","venue_1":"WETICE","year":"1999","title":"A Hierarchical Proxy Architecture for Internet-Scale Event Services","authors":"Haobo Yu, Deborah Estrin, Ramesh Govindan","author_ids":"1860651, 1736486, 1747970","abstract":"— The rapid growth of the Web has made it possible to build collaborative applications on an unprecedented scale. However , the request-reply interaction model of HTTP limits the range of applications that can be built. In this paper, we consider a complementary communication model—asynchronous event notification from servers to clients. Our focus in the paper is the design of an Internet-scale mechanism for event dissemination. Such a mechanism must scale to large numbers of participants and event types, as well as provide failure detection and handling. In this paper , we explore the design space of event dissemination architec-tures, and present a design of a hierarchical proxy architecture for event dissemination. Compared with previous approaches, our design reduces proxy states and provides failure detection and recovery mechanisms.","cites":"28","conferencePercentile":"94.44444444"},{"venue":"WETICE","id":"e10200f8029e263b76236eddcb4a8a73ade86390","venue_1":"WETICE","year":"1997","title":"Boundaries, Awareness and Interaction in Collaborative Virtual Environments","authors":"Chris Greenhalgh, Steve Benford","author_ids":"1714469, 1738239","abstract":"Personal use of this material is permitted. However permission to reprint/republish this material for advertising or promotional purposes or for creating new collective workds for resale or redistribution to servers or lists, or to reuse any copyrighted component of this work in other works must be obtained from the IEEE. Abstract This paper is concerned with how collaborative virtual environments can be structured in order to enable greater scalability and yet maintain a richness of communication. Based on a survey of current work in this area a number of important issues and design criteria are drawn out. In this context a recent extension to the spatial model of interaction called third party objects is described which can be used to develop a variety of spatial structures which have different effects on mutual awareness and communication. These structures include nested regions and zones, dynamic data districts and potentially mobile crowds of participants. The paper also discusses how these structures can be exploited by an underlying network architecture based on a dynamically evolving hierarchy of multicast groups and describes the MASSIVE-2 system which implements it.","cites":"20","conferencePercentile":"94.73684211"},{"venue":"WETICE","id":"76cb7ea87f7204a132d10866e248a07029319946","venue_1":"WETICE","year":"1999","title":"Design and Implementation of PROSYT: A Distributed Process Support System","authors":"Gianpaolo Cugola, Carlo Ghezzi","author_ids":"3292643, 1716252","abstract":"This paper describes the design and implementation of a process support system (PROSYT), which is intended to provide guidance in performing business processes and cooperation among people over a local or geographically distributed architecture. In particular, it can be used as a Process-centered Software Engineering Environment (PSEE) to support distributed software development. Our main purpose is to describe how complex applications of this kind can be developed systematically. In particular, how the requirements of high exibility, re-conngurability, scalability, and eeciency demanded by these applications can be met through appropriate design choices.","cites":"9","conferencePercentile":"83.33333333"},{"venue":"WETICE","id":"132ecfa66a9e713c3455b97999a8f95c9c02726a","venue_1":"WETICE","year":"2005","title":"A Multicast Transport Driver for Globus XIO","authors":"Karl Jeacle, Jon Crowcroft","author_ids":"2504828, 1726850","abstract":"In recent years, much work has been done on attempting to scale multicast data transmission to hundreds or thousands of receivers. There are, however, many situations where an application might involve transmission to just ten or twenty sites. Today's Grid environments, for example, see High Energy Physicists carry out multi-gigabyte bulk data transfers to a handful of destinations. In this project, we are investigating how TCP-XM, a modified version of TCP that supports multicast, can be integrated with Globus to to provide Grid users with a reliable multicast transport protocol. Our approach has been to use Globus XIO – an eX-tensible Input/Output library for Globus, that provides a POSIX-like API to swappable I/O implementations. We have wrapped TCP-XM in XIO to extend Globus to support multicast transmission. This paper describes the implementation and operation of our Globus XIO multicast driver, reviews the TCP-XM protocol design, and provides some experimental results.","cites":"2","conferencePercentile":"31.66666667"},{"venue":"WETICE","id":"4da478ead980d45d28a6116c72c3b385b7956267","venue_1":"WETICE","year":"1995","title":"Subdocument invocation semantics in collaborative hyperdocuments","authors":"Richard Furuta, Jaime Navon, P. David Stotts","author_ids":"1763643, 3012096, 2158857","abstract":"In this paper we informally explain a new Trellis model that incorporates colored tokens into the previously-described timed-Petri-net-based deenition. We g i v e examples of using Trellis to deene protocols for Computer Supported Cooperative W ork (CSCW). We then explain an interesting analog to procedure call we h a ve d e v eloped for subdocument i n vocation in collaborative h y-perdocuments. Trellis prototype implementations are based around a client-server architecture and interpret their speciications. Consequently they provide an environment for the rapid prototyping and incremental development o f m ulti-user distributed protocols.","cites":"1","conferencePercentile":"28.57142857"},{"venue":"WETICE","id":"b836c7a978c3714b2473f89a7e5e0d7814a41d0e","venue_1":"WETICE","year":"1998","title":"Internet Based Software Process Support","authors":"Frank Maurer, Barbara Dellen","author_ids":"1736996, 2757528","abstract":"The paper presents a process-oriented view on knowledge management in software development. We describe requirements on process support systems for globally distributed software development projects, introduce the process modeling language MILOS, and an enactment environment based on it.","cites":"4","conferencePercentile":"48.38709677"},{"venue":"WETICE","id":"7ec05e7e76b199c569a0fd9b9f00ff1c221914f9","venue_1":"WETICE","year":"1996","title":"Working Group Report on Computer Support in Project Coordination","authors":"Frank Maurer","author_ids":"1736996","abstract":"This paper summarizes the presentations, discussions, and results of the Project Coordination Workshop of the IEEE Fifth Workshops on Enabling Technologies: Infrastructure for Collaborative Enterprises (WET ICE '96).","cites":"8","conferencePercentile":"45.65217391"},{"venue":"WETICE","id":"0f7753acc0ef80b008ba7e4557757277fbf8e6c0","venue_1":"WETICE","year":"1996","title":"Integrating planning and execution in software development processe","authors":"Barbara Dellen, Frank Maurer","author_ids":"2757528, 1736996","abstract":"In conventional approaches to support planning of software development processes, the project plan has to be completely speciJed ahead of the process enactment. These approaches ignore two main characteristics of software development processes: Firstly, many planning decisions can only be made on base of knowledge resulting from the development process itsev Therefore the project planner must be able to extend and adapt the plan during enactment on basis of the current project data. Secondly, plan changes have to be taken into account. Considering these observations, the planner can be supported effectively , only vplanning and enactment steps are altemated. In this contribution we identify the main requirements on a \"dynamic\" planning of software development processes and present methods and techniques which meet them.","cites":"14","conferencePercentile":"80.43478261"},{"venue":"WETICE","id":"4bceda0947414e86c24a98e436f35041b9c504dc","venue_1":"WETICE","year":"2005","title":"An Agent-based Framework for Integrating Workflows and Web Services","authors":"Cécile Aberg, Patrick Lambrix, Nahid Shahmehri","author_ids":"2923053, 1793342, 1723372","abstract":"The Semantic Web will enable business-to-business in new ways. In this context, organizations will need to make use of the new opportunities that the Semantic Web technology provides. However, this should be done without major requirements on the organization. To this aim we propose an agent-based model for integrating the usage of the Semantic Web (represented as Web services) into an organi-zation's work routines (represented by Workflows). Further, we describe a possible architecture for our approach, and briefly show its feasibility with an implemented prototype.","cites":"10","conferencePercentile":"80"},{"venue":"WETICE","id":"2e9e50082ddb14d06ab788fe39f769b975fbfe02","venue_1":"WETICE","year":"2008","title":"An Architecture for an Adaptive and Collaborative Learning Management System in Aviation Security","authors":"Yi Guo, Adrian Schwaninger, Harald C. Gall","author_ids":"4405325, 2388249, 1707328","abstract":"The importance of aviation security has increased dramatically in recent years. Frequently changing regulations and the need to adapt quickly to new and emerging threats are challenges that need to be addressed by airports, security companies and appropriate authorities across the world. Learning Management Systems (LMS) have been developed as effective tools for enhancing the management, integration and application of knowledge in organizations. In the aviation security domain, we need mechanisms to quickly adapt to new learning content, to different roles ranging from screeners to supervisors, to flexible training scenarios and solid job assessments. For that, a learning system has to be flexible and adaptive both in knowledge, organizational and in collaboration dimensions. Current LMS do not meet these requirements. In this paper we present a software architecture that is apt to support the adaptability and collaboration needs for such a system in aviation security. We discuss the requirements, roles, learning objects and course configuration in terms of adaptive and collaborative learning. We present a six-layer architecture and discuss some of its application scenarios. Our aim is to improve the quality and usefulness of LMS in aviation security by utilizing knowledge-based analysis for data analysis and integrating a process engine for collaborative learning. We briefly report on our prototype and the gained first feedback from the users.","cites":"1","conferencePercentile":"40.47619048"},{"venue":"WETICE","id":"95169955c36dd0f9ca91d1260d2638cdf2ad4cc3","venue_1":"WETICE","year":"1998","title":"WebGroup: A Secure Group Access Control Tool for the World-Wide Web","authors":"Fabien A. P. Petitcolas, Kan Zhang","author_ids":"2022035, 1715449","abstract":"We present an integrated secure group access control tool to support workgroups on the WorldWide Web. The system enables user authentication, encrypted communication and fine-grained group access control. The tool comprises two proxies: one running on the server side and the other one on the client side. Typically the browser sends a query to the client side proxy which contacts the server side proxy for authentication, session key exchange and checking of access rights. The server side proxy finally forwards the request to the HTTP server. Our tool is completely transparent to the user and compatible with any Web server and browser. It can also become part of a firewall configuration.","cites":"0","conferencePercentile":"8.064516129"},{"venue":"WETICE","id":"5f9949512fd9b5671ec8b7a0c749b2cfc7fe8c2b","venue_1":"WETICE","year":"1996","title":"Project coordination in design processes","authors":"Frank Maurer","author_ids":"1736996","abstract":"In this paper we describe how explicit models of design processes can be used to guide and control distributed development of complex systems. The paper focuses on techniques which automatically infer dependencies between decisions from a process model and methods which allow to integrate planning and execution steps. Managing dependencies between decisions is a basis for improving the traceability of development processes. Switching between planning and execution of subpro-cesses is an inherent feature in the development of large complex systems. The paper concludes with a description of the CoMo-Kit system which implements the technologies mentioned above and which will use WWW technology to coordinate development processes.","cites":"14","conferencePercentile":"80.43478261"},{"venue":"WETICE","id":"045fc114eae5de1411fc00e1acdb8668787e4313","venue_1":"WETICE","year":"1996","title":"Independent validation of specifications: a coordination headache","authors":"Steve M. Easterbrook, John R. Callahan","author_ids":"1693900, 2308971","abstract":"Large, complex projects face significant barriers to coordination and communication due to continuous, rapid changes during a project's lifecycle. Such changes must be tracked, analyzed, and reconciled to ensure high-quality in the end-product, otherwise problems may be get lost or ignored in the overall complexity. We report on \" work-in-progress \" in the study of coordination problems between two independent, separate groups: software development and software analysis. We have begun to construct a taxonomy of coordination problem, which we illustrate with two scenarios. We briefly describe current attempts to introduce incremental improvements to coordination problems in such projects via WorldWide Web tools. Based on actual project experiences, we plan to deploy such tools in a non-intrusive fashion to improve coordination and communication between software development groups.","cites":"15","conferencePercentile":"86.95652174"},{"venue":"WETICE","id":"1c22b86f0a83759c40d92a8385fefd07de23ff5a","venue_1":"WETICE","year":"2003","title":"Weakly-structured Workflows for Knowledge-intensive Tasks: An Experimental Evaluation","authors":"Ludger van Elst, Felix-Robinson Aschoff, Ansgar Bernardi, Heiko Maus, Sven Schwarz","author_ids":"1727962, 3083654, 1709215, 1685168, 1749820","abstract":"Knowledge-intensive activities can typically not be modeled sufficiently by classical, static process models and workflows. To enable a process-oriented knowledge management approach under these circumstances, the concept of weakly-structured workflows has been developed. This approach integrates process modeling and workflow enactment and facilitates active information support in dynamically changing process environments. Furthermore, the approach allows process knowledge itself to be used as a valuable resource in knowledge management. In order to investigate whether this approach is viable and useful for supporting knowledge-intensive activities we designed and performed a comprehensive experimental evaluation. We outline the conceptual approach and realization in an agent-based software framework for organizational memories and describe the experimental settings. The results of the experiment demonstrate the viability of our key concepts.","cites":"24","conferencePercentile":"89.18918919"},{"venue":"WETICE","id":"093f628bbf346c9d25371eb9e2668a53302ec673","venue_1":"WETICE","year":"1998","title":"A Framework to Integrate Synchronous and Asynchronous Collaboration","authors":"Sheng Feng Li, Andy Hopper","author_ids":"2337364, 1769174","abstract":"For the last decade, the research in CSCW (Computer Supported Cooperative Work) has been focusing on synchronous collaboration, which requires the participants involved in common tasks to remotely share computer display workspaces simultaneously without leaving their workplaces. However, to support truly global cooperative work, asynchronous collaboration is equally prominent, in order to accommodate the participants who may not be available for the synchronous CSCW session. These participating individuals, whether working synchronously or asynchronously, may be mobile and may have to connect to and disconnect from the session repeatedly with ubiquitous systems. In this research paper, we describe a framework for asynchronous as well as synchronous collaboration. The framework provides facilities to transfer the screen images or frame buffers of the ongoing CSCW session to remote users, allowing the available participants to share the view and the control of the session simultaneously, and to record the screen images or frame buffers for the absent participants to retrieve and playback the session at a later stage, with VCR-like control (i.e. fast forward, rewind, play and stop). The frame buffers are transferred and recorded in units of rectangles containing pixel values of the screen images. These rectangles are platform independent and can be dynamically directed to and displayed by heterogeneous systems such as X Windows or Windows NT, or by Web browser such as Netscape.","cites":"6","conferencePercentile":"64.51612903"},{"venue":"WETICE","id":"806da384d100eb653459428c5bc33351feeab62c","venue_1":"WETICE","year":"2006","title":"MOBIDIS: A Pervasive Architecture for Emergency Management","authors":"Massimiliano de Leoni, Fabio De Rosa, Massimo Mecella","author_ids":"1714840, 3034329, 1732710","abstract":"Current mobile and pervasive technologies (e.g., PDAs, GPRS/UMTS and WiFI connections, etc.) enable the development of adaptive peer-to-peer software infrastructures for supporting collaborative work of human operators in emergency/disaster scenarios. In this paper, we present a novel architecture, named MOBIDIS (Mobile @ DIS), currently under development in the context of an IST research project, in which operators, equipped with hand-held devices, are coordinated by a workflow management system able to adap-tively change the process schema in order to cope with anomalies. Some preliminary experimental results are also presented.","cites":"13","conferencePercentile":"93.5483871"},{"venue":"WETICE","id":"e71016381349982a0adb37e3cba69809138c4a1a","venue_1":"WETICE","year":"2009","title":"UniWiki: A Collaborative P2P System for Distributed Wiki Applications","authors":"Gérald Oster, Pascal Molli, Sergiu Dumitriu, Rubén Mondéjar","author_ids":"1948115, 3025899, 2192027, 1700452","abstract":"The ever growing request for digital information raises the need for content distribution architectures providing high storage capacity, data availability and good performance. While many simple solutions for scalable distribution of quasi-static content exist, there are still no approaches that can ensure both scalability and consistency for the case of highly dynamic content, such as the data managed inside wikis. We propose a peer to peer solution for distributing and managing dynamic content, that combines two widely studied technologies: distributed hash tables (DHT) and optimistic replication. In our \" universal wiki \" engine architecture (UniWiki), on top of a reliable, inexpensive and consistent DHT-based storage, any number of front-ends can be added, ensuring both read and write scalability, as well as suitability for large-scale scenarios. The implementation is based on a Distributed Interception Middleware, thus separating distribution, replication, and consistency responsibilities , and also making our system transparently usable by third party wiki engines.","cites":"8","conferencePercentile":"64.58333333"},{"venue":"WETICE","id":"914207aba0fb20766fe7196a3247738607cbf189","venue_1":"WETICE","year":"2007","title":"A Bayesian Approach for Disconnection Management in Mobile Ad Hoc Networks","authors":"Massimiliano de Leoni, Massimo Mecella, Ruggero Russo","author_ids":"1714840, 1732710, 7403958","abstract":"Mobile Ad-hoc Networks are used in many scenarios (e.g., emergency management) for supporting collab-orative work of operators. But this requires either (i) continuous connections, or at least (ii) the possibility to foresee that a device is going out and disconnecting. Therefore a basic problem is how to predict the possible disconnections of devices, in order to let the upper layers appropriately address connection anomalies (e.g., either taking global remedial actions to maintain the network connected, or local ones to let the disconnecting device to go on for some time with its own work, e.g., cache important data needed for the following activities). In this paper we present a bayesian approach to predict disconnections in MANETs, and validating experimental results that show the viability of the approach.","cites":"6","conferencePercentile":"85"},{"venue":"WETICE","id":"240c8f1131c21e1e773119c3b9501a8fa319653d","venue_1":"WETICE","year":"1998","title":"Working Group Report on Coordinating Distributed Software Development Projects","authors":"Harald Holz, Sigrid Goldmann, Frank Maurer","author_ids":"2224941, 2416436, 1736996","abstract":"This paper summarizes the work presented at the WET ICE '98 workshop on \" Coordinating Distributed Software Development Projects \" as well as the ensuing discussions that arose in the course of the workshop.","cites":"6","conferencePercentile":"64.51612903"},{"venue":"WETICE","id":"75efc95999d8ffd1f22b2b04129ebd956b0fa661","venue_1":"WETICE","year":"1998","title":"An Open Architecture for Supporting Collaboration on the Web","authors":"David De Roure, Wendy Hall, Siegfried Reich, Aggelos Pikrakis, Gary Hill, Mark A. Stairmand","author_ids":"1708123, 1685385, 2119809, 1890454, 1784415, 2158772","abstract":"The MEMOIR framework supports researchers working with a vast quantity of distributed information, by assisting them in finding both relevant documents and researchers with related interests. It is an open architecture based on the existing Web infrastructure. Key to the architecture are the use of proxies and the use of an open and extensible message protocol for communication: to support message routing for dynamic reconfiguration and extension of the system, to collect information about the trail of documents that a user visits, and to insert links on-the-fly. In this paper we present the MEMOIR architecture and its rationale, and discuss early experiences with the system.","cites":"6","conferencePercentile":"64.51612903"},{"venue":"WETICE","id":"974a1df255ed712bc8a25221ef44dc95a559520a","venue_1":"WETICE","year":"2010","title":"Privacy-Aware and Highly-Available OSN Profiles","authors":"Rammohan Narendula, Thanasis G. Papaioannou, Karl Aberer","author_ids":"1796529, 1766169, 1751802","abstract":"—The explosive growth of online social networks (OSNs) and their wide popularity suggest the impact of OSNs on today's Internet. At the same time, concentration of vast amount of personal information within a single administrative domain causes critical privacy concerns. As a result, privacy-conscious users feel dis-empowered with today's OSNs. In this paper, we report on an ongoing research work and introduce a privacy-aware decentralized OSN called porkut. Our system exploits trust relationships in the social network for decentralized storage of OSN profiles and their content. By taking users' geographical locations and online time statistics into account, it also addresses availability and storage performance issues. We finally advocate indexing of social network content and present an approach for indexing in a privacy-preserving manner.","cites":"15","conferencePercentile":"88.88888889"},{"venue":"WETICE","id":"6ac288186a7e78f53db51d84c24ff7199cc74087","venue_1":"WETICE","year":"2000","title":"Integrating XML and Object-Based Programming for Distributed Collaboration","authors":"Vassil Roussev, Prasun Dewan, Naveen Koorakula, Sriram Sellappa","author_ids":"1743959, 1749237, 2563791, 3294411","abstract":"In this paper, we explore some of the new opportunities for distributed collaborative applications that emerge from the use of XML as a data specification language. We present two different approaches: the first one transparently adds asynchronous collaboration to applications whose persistent state is in XML format, while the second one helps build synchronous collaborative applications starting with an XML schema specification. Although the two approaches start with different assumptions, they both lead to the same problem—the need for a generic one-to-one conversion between objects and XML constructs. Using object properties, we define two variants of a conversion scheme for the two approaches.","cites":"3","conferencePercentile":"25"},{"venue":"WETICE","id":"c712e7249ed218eb96a7917914582e5c9ea32963","venue_1":"WETICE","year":"2008","title":"Relation-Centric Development of Spatially-Aware Applications","authors":"Clemens Holzmann, Manfred Hechinger, Alois Ferscha","author_ids":"2215719, 3085723, 1745790","abstract":"With an increasing density of computationally enhanced objects that are distributed in physical space, it becomes important that they operate autonomously and allow for a more implicit interaction with humans. Spatial properties and relations are important in this regard, as an awareness about such context information builds up the basis for autonomously adapting to spatial changes in the environment. In this paper, we propose a relation-centric approach for the development of spatially-aware applications for autonomous embedded systems, which builds upon qualitative abstractions of spatial relations and the rule-based inference of conclusions from them. We implemented a service-oriented software framework for this purpose and demonstrate our approach by means of two application scenarios.","cites":"2","conferencePercentile":"54.76190476"},{"venue":"WETICE","id":"69f4b4b66d108ba77984e0c3219031fec19550b5","venue_1":"WETICE","year":"2005","title":"The LAICA Project: Supporting Ambient Intelligence via Agents and Ad-Hoc Middleware","authors":"Giacomo Cabri, Luca Ferrari, Letizia Leonardi, Franco Zambonelli","author_ids":"1682769, 1726869, 1679937, 1684412","abstract":"Users' environments are going to be disseminated of intelligent devices and sensors that will coordinate each other to help users in their activities. This leads to what is called \" Ambient Intelligence \" , i.e., environments that exhibits a certain degree of intelligence. Software agents are the natural candidates for this kind of task, thanks to their autonomy and the capability to act on behalf of their owners, resulting thus appropriate in the Ambient Intelligence area. In this position paper we discuss the use of agents in Ambient Intelligence, and sketch the relevant aspects of the LAICA project. In particular we focus on the design of a middleware for Ambient Intelligence that connects several kinds of agents and other distributed components.","cites":"18","conferencePercentile":"90"},{"venue":"WETICE","id":"667ebc14263cc2c5bc0b15d3fd273d410139485a","venue_1":"WETICE","year":"2007","title":"First-Class Protocols for Agent-Based Coordination of Scientific Instruments","authors":"Tim Miller, Peter McBurney, Jarred McGinnis, Kostas Stathis","author_ids":"1692512, 1698125, 2144802, 1802398","abstract":"The coordination of distributed processing is of great interest to a number of research communities. However these research communities, such as those involved in e-science GRIDs and multi-agent systems, view this problem from dis-parate viewpoints. This paper aims to contribute to the necessary reconciliation of these perspectives. By demonstrating the coordination of processes whether reactive (such as web services) or proactive (such as autonomous agents) can be done with a single representation using a protocol language , RASA. The multi-agent paradigm introduces, into any model of distributed systems, flexibility and autonomy that can be daunting and intimidating to scientists accustomed to more orthodox approaches. It is for this reason that it is important that the model for coordination of this system is reliable, verifiable, inspectable, referable, com-posable and executable. The language RASA provides this functionality, which we extend its use for not only agent interaction protocols but also to express workflows. The language for expression then becomes the domain of discourse as well as potentially the language for the workflow's execution .","cites":"4","conferencePercentile":"67.5"}]}