{"WEWST.csv":[{"venue":"WEWST","id":"00f60ebb59af66e77e16b37896b96d4c3d954aad","venue_1":"WEWST","year":"2007","title":"Management Requirements of Web Service Compositions","authors":"Anis Charfi, Rainer Berbner, Mira Mezini, Ralf Steinmetz","author_ids":"3115402, 2076850, 1681134, 1725298","abstract":"Several works have addressed the management of individual Web Services. However, the specific management requirements of workflow-based web service compositions such as those specified in the BPEL have not yet been considered. In this paper, we present several management requirements in web service compositions such as discovery and selection management, SLA and policy management, middleware services management, and management of the composite service. Supporting these requirements is crucial for providing a reliable service composition with well-defined QoS properties. We also introduce web service composition management and present our vision of having dedicated tool support for it in future BPEL engines.","cites":"0","conferencePercentile":"18.18181818"},{"venue":"WEWST","id":"46e22f4982576697c7ba897cb173114c91d44e04","venue_1":"WEWST","year":"2009","title":"Overview of an end-user enabled model-driven development approach for interactive applications based on annotated services","authors":"Marius Feldmann, Tobias Nestler, Klemens Muthmann, Uwe Jugel, Gerald Hübsch, Alexander Schill","author_ids":"3238861, 3028909, 2956206, 2939439, 2317953, 1695086","abstract":"Developing Service-based interactive applications is a time consuming and nontrivial task. The idea of annotating Web Services with information fragments used for deriving parts of interactive applications automatically promises the simplification of this task, thus enabling the creation of Service-based interactive applications for end-users without any implementation skills. The paper discusses a model-driven approach for generating executable Service-based interactive applications directly from the output of a visual authoring tool. Besides the introduction of details about the model-driven methodology, this paper makes two central contributions: Firstly, technical details about the developed end-user enabled authoring tool are introduced. Secondly, the meta-model applied as serialization format of the authoring tool and as input for an application generation approach is presented.","cites":"13","conferencePercentile":"100"},{"venue":"WEWST","id":"5113a1060f4ac08de00b5dbe92cc60458f103817","venue_1":"WEWST","year":"2010","title":"Adaptive matchmaking for RESTful services based on hRESTS and MicroWSMO","authors":"Ulrich Lampe, Stefan Schulte, Melanie Siebenhaar, Dieter Schuller, Ralf Steinmetz","author_ids":"1741873, 1728549, 1694835, 1780448, 1725298","abstract":"Matchmaking -- i.e., the task of finding functionally suitable service offers based on a service request -- has only been addressed in the context of WS-* Web services. However, RESTful services are gaining increasing attraction and have been adopted by major companies, thus increasing the need for suitable matchmaking solutions. This paper introduces XAM4SWS, an adaptive matchmaker for semantic Web services that supports multiple service description formats, including hRESTS and MicroWSMO for RESTful services. XAM4SWS adapts existing methodologies from WS-* matchmaking and extends them through the inclusion of REST-specific service features. A prototypical implementation of the matchmaker is evaluated with respect to multiple information retrieval metrics using an adapted semantic Web service test collection.","cites":"3","conferencePercentile":"83.33333333"}]}