{"WF-IoT.csv":[{"venue":"WF-IoT","id":"5b8997af4c70aba63317911eb4b8f7b0a159ed1a","venue_1":"WF-IoT","year":"2014","title":"DPWSim: A simulation toolkit for IoT applications using devices profile for web services","authors":"Son N. Han, Gyu Myoung Lee, Noël Crespi, Kyoungwoo Heo, Nguyen Van Luong, Mihaela Brut, Patrick Gatellier","author_ids":"1817573, 1701732, 1737867, 3289708, 3188775, 1736859, 2148334","abstract":"—The OASIS standard Devices Profile for Web Services (DPWS) enables the use of Web services on smart and resource-constrained devices, which are the cornerstones of the Internet of Things (IoT). DPWS sees a perspective of being able to build service-oriented and event-driven IoT applications on top of these devices with secure Web service capabilities and a seamless integration into existing World Wide Web infrastructure. We introduce DPWSim, a simulation toolkit to support the development of such applications. DPWSim allows developers to prototype, develop, and test IoT applications using the DPWS technology without the presence of physical devices. It also can be used for the collaboration between manufacturers, developers, and designers during the new product development process.","cites":"4","conferencePercentile":"78.125"},{"venue":"WF-IoT","id":"39ff9cfea2dc7d2d27fb30dd011424a73f415259","venue_1":"WF-IoT","year":"2014","title":"Multi-player gaming in public transport crowd: Opportunities and challenges","authors":"Saumay Pushp, Chi Harold Liu, Fangming Liu, Junehwa Song","author_ids":"2407246, 1791656, 1812563, 1789470","abstract":"—Smart devices are supporting emerging types of location-based gaming applications to attain collaborations among collocated users in public places like transports. However, they are facing many challenges like the timely performance of back-end game servers for runtime game operation, unreliable cellular network connections, and opportunistic and dynamic local environment. To address these limitations, in this paper, we propose \" CrowdMoG \" , a Crowd based Mobile Gaming platform, to identify and match the nearby passengers on the move according to their associated gaming preferences, and provides the smooth session handoff to enable the continuity of existing game plays when participants leave the game due to different mobility patterns. We therefore describe the potential, along with challenges and opportunities that open up the new dimension for the entire research community to redesign and examine a tradition problem, fundamentally transforming it into a new era of mobile gaming experience. I. INTRODUCTION In many crowded metropolitan cities, people often travel by public transports like metro and local buses everyday. A finding shows that about 3,000 commuters in the west of England spend about 139 hours a year on average traveling to and from their work place [1]. Therefore, mobile computing in crowded public transports can open up a new opportunity to harness a collection of smart devices (e.g., smartphones and tablets [2], [3]) in their vicinity as a unified computing substrate. Figure 1 shows a snapshot of the Beijing Underground where most of crowded passengers are looking at their smart devices. A promising aspect we focus in this paper and our research path in its own right, is to enable highly-interactive and opportunis-tic multi-player gaming [4]–[6] among the crowd. Examples of these games are first-person-shooting (FPS) and racing. In it, users play and exchange their game play information dynamically among the crowd, however they come with many challenges. First, despite the fact that mobile gaming has been a dominant entertainment source while they commute in public transports 1 , and the increasing number of mobile games are available, their adaptability as multi-player games is still in an early stage. As far as we are concerned, none of them are carefully designed for the highly-crowded public transport environments, as they are either single-player based or turn wise multi-player, and these applications are usually built with suboptimal features, like for a particular platform or network type. Second, in public transports, cellular network connectivity like 3G …","cites":"0","conferencePercentile":"20.3125"},{"venue":"WF-IoT","id":"38a9236c5bf52f1ff0ee25ad8831b4be38ae0f1d","venue_1":"WF-IoT","year":"2014","title":"A semantic service creation platform for Social IoT","authors":"Victoria Beltran, Antonio Manuel Ortiz, Dina Hussein, Noël Crespi","author_ids":"2529882, 2044812, 3213120, 1737867","abstract":"—The Social Internet of Things (SIoT) is aimed at integrating devices into users' daily life by taking advantage of the interconnectivity and user-friendliness of Social Networks (SNs). To ensure the success of SIoT, we need to provide new attractive services that engage people to socialize their devices. Automation is a requirement to seamlessly integrate such services into user life. Ontologies are used to semantically describe Web services with the aim of enabling the automatic invocation and composition of these services. We envisage semantic Web services as a means to develop automated, value-added applications for SIoT. We propose an SN that can achieve a synergy between the SIoT and semantic Web services based on RESTful principles and ontologies. The proposed SN is a converging point for a user's friends, devices and Web services of interest. Moreover, this SN is a service creation environment through which users can define their own event-triggered services involving devices and Web services.","cites":"0","conferencePercentile":"20.3125"},{"venue":"WF-IoT","id":"9e989383d713b61a579170d11e1545cbd309d076","venue_1":"WF-IoT","year":"2014","title":"IoT routing architecture with autonomous systems of things","authors":"Soochang Park, Noël Crespi, Hosung Park, Sang-Ha Kim","author_ids":"1700672, 1737867, 1691638, 1719215","abstract":"—This article presents a future-driven routing architecture for Internet of Things (IoT). This IoT is a novel concept involving a new concept regarding a set of things with the same routing and service polices, denoted by an autonomous system of things (ASoT). In IoT, an ASoT would be connected not only to the others but legacy autonomous systems (ASs) for the Internet in a wide variety of scenarios. Hence, this article firstly addresses classification of diverse features of ASoTs, and then explores new challenges especially on inter-domain routing.","cites":"1","conferencePercentile":"46.875"},{"venue":"WF-IoT","id":"367b7dbcb2bf0f454447530cca1e01237e02be2e","venue_1":"WF-IoT","year":"2015","title":"A context and user aware smart notification system","authors":"Fulvio Corno, Luigi De Russis, Teodoro Montanaro","author_ids":"1712546, 1794953, 3018189","abstract":"Porto, the institutional repository of the Politecnico di Torino, is provided by the University Library and the IT-Services. The aim is to enable open access to all the world. Please share with us how this access benefits you. Your story matters. Abstract—Nowadays, notifications are increasingly gaining momentum in our society. New smart devices and appliances are developed everyday with the ability to generate, send and show messages about their status, acquired data and/or information received from other devices and users. Consequently, the number of notifications received by a user is growing and the tolerance to them could decrease in a short time. This paper presents a smart notification system that uses machine learning algorithms to adequately manage incoming notifications. According to context awareness and user habits, the system decides: a) who should receive an incoming notification; b) what is the best moment to show the notification to the chosen user(s); c) on which device(s) the chosen user(s) should receive the notification; d) which is the best way to notify the incoming notification. After the design of a general architecture, as a first step in building such a system, three different machine learning algorithms were compared in the task of establishing the best device on which the incoming notification should be delivered. The algorithms were applied to a dataset derived from real data provided by the MIT Media Laboratory Reality Mining project, enriched with additional synthetic information.","cites":"0","conferencePercentile":"44.44444444"},{"venue":"WF-IoT","id":"c894433f6117e7dd7d58953fc9da23d7b9be21eb","venue_1":"WF-IoT","year":"2014","title":"Human Data Interaction in IoT: The ownership aspect","authors":"Afra J. Mashhadi, Fahim Kawsar, Utku Günay Acer","author_ids":"1743965, 1792840, 3338636","abstract":"—As Internet of Things (IoT) becomes a growing reality, more ubiquitous devices are embedded in our daily lives, serving us in a broad range of purposes in everyday life from: personal healthcare to home automation to tailored smart city services. These devices primarily collect data that is about or produced by people, be it street noise level of a neighbourhood, or the energy footprint of an individual's home or her location and other situational context. As this unprecedented amount of data is collected, we are challenged with one fundamental research question: who owns this data and who should have access to it? Specifically, the emergent of the Human Data Interaction (HDI) topic which aims to put the human at the centre of the data driven industry, calls attention to the IoT community to address the data ownership aspect more carefully. In this note, we offer a reflection on the challenges that IoT faces in regards to the data ownership in HDI and advocate the roles that both ordinary people and industries must play to best answer those challenges in shaping the IoT landscape.","cites":"0","conferencePercentile":"20.3125"},{"venue":"WF-IoT","id":"79c7093e98cfea2b734e9a44d569e93946ef4ce2","venue_1":"WF-IoT","year":"2014","title":"Internet of vehicles: From intelligent grid to autonomous cars and vehicular clouds","authors":"Mario Gerla, Eun-Kyu Lee, Giovanni Pau, Uichin Lee","author_ids":"8467438, 2563601, 7952283, 1799283","abstract":"—Traditionally, the vehicle has been the extension of the man's ambulatory system, docile to the driver's commands. Recent advances in communications, controls and embedded systems have changed this model, paving the way to the Intelligent Vehicle Grid. The car is now a formidable sensor platform, absorbing information from the environment (and from other cars) and feeding it to drivers and infrastructure to assist in safe navigation, pollution control and traffic management. The next step in this evolution is just around the corner: the Internet of Autonomous Vehicles. Pioneered by the Google car, the Internet of Vehicles will be a distributed transport fabric capable to make its own decisions about driving customers to their destinations. Like other important instantiations of the Internet of Things (e.g., the smart building), the Internet of Vehicles will have communications, storage, intelligence, and learning capabilities to anticipate the customers' intentions. The concept that will help transition to the Internet of Vehicles is the Vehicular Cloud, the equivalent of Internet cloud for vehicles, providing all the services required by the autonomous vehicles. In this article, we discuss the evolution from Intelligent Vehicle Grid to Autonomous, Internet-connected Vehicles, and Vehicular Cloud. The urban fleet of vehicles is rapidly evolving from a collection of sensor platforms that provide information to drivers and upload filtered sensor data (e.g., GPS location, road conditions, etc.) to the cloud; to a network of autonomous vehicles that exchange their sensor inputs among each other in order to optimize a well defined utility function. This function, in the case of autonomous cars, is prompt delivery of the passengers to destination with maximum safety and comfort and minimum impact on the environment. In other words, one is witnessing in the vehicle fleet the same evolution from Sensor Web (i.e., sensors are accessible from the Internet to get their data) to Internet of Things (the components with embedded sensors are networked with each other and make intelligent use of the sensors). In the intelligent home, the IOT formed by the myriad of sensors and actuators that cover the house internally and externally can manage all the utilities in the most economical way, with maximum comfort to residents, with virtually no human intervention. Similarly, in the modern energy grid, the IOT formed by all components large and small can manage power loads in a safe and efficient manner, with the operators now playing the role of observers. In …","cites":"18","conferencePercentile":"96.875"},{"venue":"WF-IoT","id":"475a94f0c5e560d1a2fe72d241766b020d7cb439","venue_1":"WF-IoT","year":"2015","title":"Virtual resources for the Internet of Things","authors":"Andrea Azzara, Luca Mottola","author_ids":"2664206, 1803866","abstract":"—We present VIRTUAL RESOURCES: a software architecture to resolve the tension between effective development and efficient operation of Internet of Things (IoT) applications. Emerging IoT architectures exhibit recurring traits: resource-limited sensors and actuators with RESTFUL interfaces at one end; full-fledged Cloud-hosted applications at the opposite end. The application logic resides entirely at the latter, creating performance issues such as excessive energy consumption and high latencies. To ameliorate these, VIRTUAL RESOURCES allows developers to push a slice of the application logic to intermediate IoT devices, creating a continuum between physical resources and Cloud-hosted applications. With VIRTUAL RESOURCES, for example, developers can push processing of sensed data to IoT devices close to the physical sensors, reducing the data to transmit and thus saving energy. We describe the key concepts of VIRTUAL RESOURCES and their realization in a CoAP prototype atop resource-constrained devices. Experimental results from cycle-accurate emulation indicate that VIRTUAL RESOURCES enable better performance than Cloud-centric architectures, while retaining the RESTFUL interaction pattern. For example, energy consumption in representative scenarios improves up to 40% and control loop latencies reduce up to 60%.","cites":"2","conferencePercentile":"100"}]}