{"WHC.csv":[{"venue":"WHC","id":"79264cddbec6f2428cbf3912d69ed49ebaf3e70f","venue_1":"WHC","year":"2009","title":"Displaying realistic contact accelerations via a dedicated vibration actuator","authors":"William McMahan, Katherine J. Kuchenbecker","author_ids":"1752084, 1716879","abstract":"During real physical interactions, contact between a hand-held tool and an object causes high-frequency tool accelerations that are detected by mechanoreceptors in the human hand. These haptic signals provide salient cues about changes in tool-surface contact state and enable effortless identification of material and surface properties. Unfortunately, these rich contact sensations are often absent from haptic renderings of virtual and remote objects. This demonstration features a classic implementation of bilateral teleoperation with two augmented SensAble Omni haptic interfaces. By using this system to touch a variety of remote objects, users will have an opportunity to experience first-hand the remarkable improvements in haptic realism that can be achieved through the use of a dedicated high-frequency vibration actuator driven by contact accelerations. 1 INTRODUCTION When touching objects in your surroundings, you can feel a rich array of haptic cues that reveal each item's geometry, material, and surface properties. For example, the vibrations and forces experienced by your hand as you stroke a piece of cardboard with a pen are distinct and different from those generated by touching a paintbrush to a curved foam surface or using a scalpel to make a surgical incision. The human talent for discerning haptic surface properties such as stiffness and texture through an intermediate tool stems partly from the phenomenon of distal attribution, in which a hand-held tool comes to feel like an extension of one's own body because its dynamics are simple to understand [6]. Humans are amazingly adept at eliciting and interpreting haptic feedback during tool-based interactions with physical objects, naturally leveraging this wealth of information to guide both exploratory and dexterous manipulation. Touching a real physical object with a hand-held tool causes the tool to experience high-frequency accelerations that reflect the mechanical characteristics of the contact. These accelerations are easily sensed by the Pacinian corpuscles in the glabrous skin of the human hand [1], and they enable easy identification of the surface's key properties. Unfortunately, current haptic interfaces cannot display objects that feel as crisp and distinctive as real objects; instead, the standard position-based control algorithm and base-mounted actuators doom most virtual surfaces to feel soft and undefined, significantly limiting the usefulness and applicability of such systems. For example, the human subject study in [4] demonstrated that typical virtual surfaces seeking to emulate wood are actually indistinguishable from soft foam, earning a mere 2 out of 7 for realism during unsighted tapping. It is …","cites":"3","conferencePercentile":"40.76923077"},{"venue":"WHC","id":"78d2ed866f86e2e805adc09335843d325834340e","venue_1":"WHC","year":"2005","title":"High Fidelity Multi Finger Haptic Display","authors":"Rainer Leuschke, Elizabeth K. T. Kurihara, Jesse Dosher, Blake Hannaford","author_ids":"2657526, 3023645, 2436277, 2036485","abstract":"The Fingertip Haptic Display (FHD) is a five bar mechanism developed at the University of Washington for hap-tic interaction with the fingertip of the operator. The two-degree-of-freedom mechanism was computer optimized to accommodate the workspace of the human finger in flex-ion/extension with a high degree of kinematic isotropy. Direct drive with frictionless flat-coil actuators ensure low torque ripple, inertia, and static friction in the actuation system for high fidelity haptic rendering. This paper describes a redesign of the position sensing arrangement, I/O hardware and software as well as thermal modelling to improve performance and stack four devices for use with index, middle, ring and little finger in a multifinger haptic display. Promising applications are expected to include palpation training for medical personnel, museum displays enabling the visitor to \" touch \" art, as well as psy-chophysics research: exploring the limits of human touch perception.","cites":"6","conferencePercentile":"47.33333333"},{"venue":"WHC","id":"90081ecd353cd03b28adadc244b66aff6b336820","venue_1":"WHC","year":"2007","title":"The Effect of Sound on Haptic Perception","authors":"Seung-Chan Kim, Ki-Uk Kyung, Dong-Soo Kwon","author_ids":"6837406, 2069791, 1750864","abstract":"Research on the intermodality relationship of auditory and tactile perceptions was conducted. An experiment is performed with 78(26 auditory cues × 3 tactile cues) stimuli combinations. The result of this experiment showed that the sound intensity level definitely affects perceived sensation in three ways: 1) The perceived roughness and ruggedness sensation is more innervated when the specific frequency is enhanced, e.g. approximately 30Hz~300Hz for ruggedness and 30Hz~600Hz for roughness sensation; 2) Conversely, the perceived density is reciprocally affected by an intensity adjustment of the sound; 3) A frequency adjustment of the sound can elicit a perceived roughness if even no stimuli are conveyed to subjects. In general, the importance of congruency between modalities was observed.","cites":"2","conferencePercentile":"28.57142857"},{"venue":"WHC","id":"90093bfb0ccbda6fe307240551408a9273610a79","venue_1":"WHC","year":"2005","title":"Ultrasound Tactile Display for Stress Field Reproduction -- Examination of Non-Vibratory Tactile Apparent Movement","authors":"Takayuki Iwamoto, Hiroyuki Shinoda","author_ids":"2222964, 1715925","abstract":"We developed a new tactile display using acoustic radiation pressure. The display can produce a 1 mm diameter focal point and 2 gf total force. By steering the focal point using a linear phased array, the display creates various precise spatiotemporal patterns of pressure distribution on the skin. We conducted experiments on \" tactile apparent movement \" with the tactile display and found that even if the successive stimuli were not vibrations but simple indentations, tactile apparent movement was evoked. When the intervals of the indentations were between 10 ms and 40 ms, discriminating between actual stroking and apparent movement was quite difficult.","cites":"11","conferencePercentile":"64.66666667"},{"venue":"WHC","id":"48fb824faab7bc1d526ff8c9d3e16aa1c3b3b038","venue_1":"WHC","year":"2009","title":"Perceptual coding of haptic data in time-delayed teleoperation","authors":"Iason Vittorias, Julius Kammerl, Sandra Hirche, Eckehard G. Steinbach","author_ids":"2119704, 3328065, 1793567, 7252930","abstract":"In telepresence and teleaction systems the haptic communication channel plays a central role. As it closes a global control loop any introduced communication delay possibly destabilizes the system and impairs the performance. The scattering theory is known to solve these stability issues by transmitting wave variables instead of haptic signals, i.e. force and velocity, over the communication channel. For stability and performance additionally high packet rates are required stressing the underlying network resources. Perceptual coding techniques of haptic signals, such as the Weber-inspired deadband approach, are known to successfully reduce the packet rate on the haptic channel. However, as wave variables do not directly represent haptic information but a linear transformation of both signals, perceptual coding is not directly applicable any-more. In this paper, we present a novel control scheme as well as a modification of the deadband approach to take advantage of the stabilization ability of the wave variables while allowing perceptual coding on the communication channel. Simulation results and comparison with the wave variables architecture indicate improved data compression for same degree of transparency for purely stiff as well as free environments.","cites":"5","conferencePercentile":"64.61538462"},{"venue":"WHC","id":"fe6fd8d914005a7e934beb4ff4bbe95c55c6f87e","venue_1":"WHC","year":"2007","title":"Fast Rendering for a Multifinger Haptic Display","authors":"Blake Hannaford, Rainer Leuschke","author_ids":"2036485, 2657526","abstract":"An algorithm is described for fast rendering of surfaces for haptic interaction with multiple fingers. The algorithm uses a human-defined geometrical map to quickly cache surface triangles for constant time solution of the collision detection problem. The map is a 1, 2, or 3 dimensional manifold onto which it is easy to project the haptic interaction point. Dividing it's surface into quantized bins allows easy reference to a small set of triangles which can be checked for collision. Although the algorithm relies on some one-time manual input (i.e. defining the contact map), it represents a significant increase in speed without a substantial memory penalty.","cites":"0","conferencePercentile":"5.555555556"},{"venue":"WHC","id":"143c8db2b11a38c06bce6c10c5d8b334004fbe50","venue_1":"WHC","year":"2009","title":"A low cost vibrotactile array to manage respiratory motion","authors":"Ali Israr, Dillon P. Eng, Sastry S. Vedam, Marcia Kilchenman O'Malley","author_ids":"1769549, 1769638, 1803652, 1793748","abstract":"We present a tactile Respiratory Management System (tRMS) to manage and control breathing patterns of cancer patients undergoing radiation therapy. The system comprises of an array of small vibrating motors and a control box that supplies power to and provides a control interface for up to twelve motors through the parallel port of a standard personal computer. The vibrotactile array can be fastened along the forearm, arm, thigh, leg or abdomen in any configuration using Velcro and fabric wraps. All motors are operated in a binary fashion, i.e. on or off, with quick response time and perceivable vibration magnitudes. The tRMS system is inexpensive and portable, providing spatiotemporal variations in tactile cues to regulate respiratory motion during radiotherapy. The system will also be used in future psychophysical studies to determine effective use of tactile cues to control human motor actions. 1 INTRODUCTION Gated radiation therapy is used to treat cancer patients with tumors in the upper torso area where the location of the tumor varies due to breathing patterns [1]. In this technique, the radiation beam targeting the tumor is turned on during specific portions of the breathing cycle, only when the tumor is in-line with the beam orientation. Specifically with lung cancer patients, the magnitude of lung motion is highly non-uniform during free breathing (see Fig. 1). Such irregularity in respiratory motion results in elongated treatment time, increased cost, and additional inconvenience to the patients. In order to reduce the cost and duration of the therapy, regularity in both frequency and amplitude of breathing motion must be maintained during radiotherapy. Visual and auditory feedback had been used to reduce the inconsistency in breathing patterns, but these modalities were proven ineffective due to an increase in cognitive stress that patients experienced during therapy [1]. It is the goal of the present study to utilize tactile cues, possibly in addition to visual and auditory feedback, to maintain steady and consistent breathing rates without discomfort or burdensome cognitive demands on the patient. In related research efforts, localized cues were presented via the tactile sense using spatially spaced vibrator placed along the skin. Figure 1. Typical lung motion profiles of two cancer patients These cues provided attentional and directional information as well as information extracted from acoustical signals [2,3]. In contrast, the objective of the present study is to develop and investigate the effectiveness of spatially distributed tactile cues that command a human's …","cites":"2","conferencePercentile":"26.92307692"},{"venue":"WHC","id":"6e72fdf9d8ab19d46b07385147d5444e197d163e","venue_1":"WHC","year":"2005","title":"Delayed Visual and Haptic Feedback in a Reciprocal Tapping Task","authors":"Caroline Jay, Roger J. Hubbold","author_ids":"1728418, 2878103","abstract":"To make optimal use of distributed virtual environments (DVEs), we must understand and quantify the effects that latency has on user performance. Although the effects of visual lag have been subject to considerable investigation, far less is known about the consequences of delayed haptic feedback. The current study investigates whether delaying haptic, and/or visual feedback in a simple reciprocal tapping task impairs performance or makes the task appear more difficult to the user. Results indicate that in reciprocal tapping, haptic latency has a small effect on performance, but is considerably less disruptive than a lag in visual feedback, providing evidence that in simple operations, such as reaching out to touch surfaces, users of DVEs may be able to tolerate a considerable amount of lag.","cites":"12","conferencePercentile":"68.66666667"},{"venue":"WHC","id":"0c76304f080b5787e9ff6b12de3d350164470e24","venue_1":"WHC","year":"2009","title":"Toward iconic vibrotactile information display using floor surfaces","authors":"Yon Visell, Alvin Law, Jeremy R. Cooperstock","author_ids":"3322706, 7701722, 2242019","abstract":"This paper presents our preliminary research on haptic displays integrated in floor surfaces. We emphasize potential roles for the latter as vibrotactile communication channels that might be seamlessly integrated in everyday environments. We describe the interactive floor component that is the platform for our research, and an application we have developed to support the design of vibrotactile icon sets for display with the device. The results of a preliminary evaluation of this display method are presented, and future directions for this research are described.","cites":"1","conferencePercentile":"16.92307692"},{"venue":"WHC","id":"823f43c7caf7511ac42b02574ecf4f5b9d674b2b","venue_1":"WHC","year":"2009","title":"Toward tactilely transparent gloves: Collocated slip sensing and bibrotactile actuation","authors":"Joseph M. Romano, Steven R. Gray, Nathan T. Jacobs, Katherine J. Kuchenbecker","author_ids":"2431496, 5194475, 3138888, 1716879","abstract":"Toward tactilely transparent gloves: Collocated slip sensing and bibrotactile actuation,\" This material is posted here with permission of the IEEE. Such permission of the IEEE does not in any way imply IEEE endorsement of any of the University of Pennsylvania's products or services. Internal or personal use of this material is permitted. However, permission to reprint/republish this material for advertising or promotional purposes or for creating new collective works for resale or redistribution must be obtained from the IEEE by writing to pubs-permissions@ieee.org. By choosing to view this document, you agree to all provisions of the copyright laws protecting it. Abstract Tactile information plays a critical role in the human ability to manipulate objects with one's hands. Many environments require the use of protective gloves that diminish essential tactile feedback. Under these circumstances, seemingly simple tasks such as picking up an object can become very difficult. This paper introduces the SlipGlove, a novel device that uses an advanced sensing and actuation system to return this vital tactile information to the user. Our SlipGlove prototypes focus on providing tactile cues associated with slip between the glove and a contact surface. Relative motion is sensed using optical mouse sensors embedded in the glove's surface. This information is conveyed to the wearer via miniature vibration motors placed inside the glove against the wearer's skin. The collocation of slip sensing and tactile feedback creates a system that is natural and intuitive to use. We report results from a human subject study demonstrating that the SlipGlove allows the wearer to approach the capabilities of bare skin in detecting and reacting to fingertip slip. Users of the SlipGlove also had significantly faster and more consistent reaction to fingertip slip when compared to a traditional glove design. The SlipGlove technology allows us to enhance human perception when interacting with real environments and move toward the goal of a tactilely transparent glove. This material is posted here with permission of the IEEE. Such permission of the IEEE does not in any way imply IEEE endorsement of any of the University of Pennsylvania's products or services. Internal or personal use of this material is permitted. However, permission to reprint/republish this material for advertising or promotional purposes or for creating new collective works for resale or redistribution must be obtained from the IEEE by writing to pubs-permissions@ieee.org. By choosing to view this document, you agree to all provisions of the …","cites":"2","conferencePercentile":"26.92307692"},{"venue":"WHC","id":"9ee59f0c28b8669a06be7f51b76b8910b87e546f","venue_1":"WHC","year":"2007","title":"Tilt Perception by Constant Tactile and Constant Proprioceptive Feedback through a Human System Interface","authors":"Franziska K. B. Freyberger, Martin Kuschel, Berthold Färber, Martin Buss, Roberta L. Klatzky","author_ids":"3103906, 1713486, 2723594, 1732126, 1735008","abstract":"Tilt perception through a haptic human system interface is experimentally investigated. Tactile feedback is provided by vibration motors and proprioceptive feedback by the Cybergrasp exoskeleton. Enriching mere vibrotactile feedback by additional constant force feedback has not been found to influence human tilt perception. Participants' verbal and haptic estimations of the displayed tilt were highly accurate. As expected, tilt estimations depend on the actual tilt.","cites":"3","conferencePercentile":"43.65079365"},{"venue":"WHC","id":"a57ef5234591db114c0f344c0f60096d26fcaf32","venue_1":"WHC","year":"2005","title":"Haptic-Assisted Guidance System for Navigating Volumetric Data Sets","authors":"Erick Méndez, Shunsuke Yoshida, Haruo Noma, Robert W. Lindeman, Yasuyuki Yanagida, Shinobu Masaki, Kenichi Hosaka","author_ids":"2933780, 1787112, 2743783, 1719686, 2041543, 1859002, 2608946","abstract":"531 Figure 1: An example of the problem of occlusion of fMRI data overlaid on an MRI scan. Abstract In this paper, a new approach for navigation assistance through sets of volumetric data is presented. This innovative method uses force feedback in two dimensions to guide the user to a region of interest. The haptic feedback is calculated under two methods and we explain the implementation of both approaches. The output is displayed by the Proactive Desk, a two dimensional force feedback device developed at the Advanced Telecommunications Research Institute. This new approach is targeted to scientists who work with sets of volumetric data and who wish to find information using visual scanning enhanced with haptics. Our system is designed for Magnetic Resonance Images (MRI) overlaid with functional MRI.","cites":"1","conferencePercentile":"14.66666667"},{"venue":"WHC","id":"0e9505d0d1df102acfe5451fa532c75249057c0f","venue_1":"WHC","year":"2007","title":"A Behavioral Adaptation Approach to Identifying Visual Dependence of Haptic Perception","authors":"James S. Sulzer, Arsalan Salamat, Vikram S. Chib, J. Edward Colgate","author_ids":"1761085, 2971328, 5983141, 1700106","abstract":"Both haptic and visual senses play a role in how we explore our environment. Previous studies have shown that vision plays a very strong role in perception of object stiffness, yet quantification of the contributions of both haptic and visual feedback remains elusive. This study uses a behavioral adaptation approach in order to better understand how humans perceive stiffness. Namely, subjects make targeted reaches across a virtual surface of varying stiffness, adapting to the new environment. The hand's cursor position is visually distorted to seem more stiff for one group, less stiff for another, and no distortion for the control group. Area Reaching Deviation (ARD) and post-adaptation interface forces, used in previous studies, were the two outcome measures used to determine differences between groups. We compare the slopes of the post-adaptation force-stiffness relations to quantify the effect of visual distortion. Our results indicate that making a stiff surface look more compliant has a greater effect on humans than making a compliant surface look more stiff.","cites":"2","conferencePercentile":"28.57142857"},{"venue":"WHC","id":"4c84c63918174b215e6c0138c4a32897ed0463a4","venue_1":"WHC","year":"2007","title":"Accelerated Proximity Queries for Haptic Rendering of Deformable Models","authors":"Nico Galoppo, Miguel A. Otaduy, Paul Mecklenburg, Markus H. Gross, Ming C. Lin","author_ids":"2665709, 1704342, 1945836, 1743207, 1709625","abstract":"We present a fast proximity query algorithm for hap-tic display of complex deformable models using a lay-ered representation. Assuming that each solid model can be represented as a rigid core covered by a layer of deformable material, the deformation field of the surface can be expressed as a function in the parametric domain of the rigid core. Our 2-stage collision query algorithm starts by performing an approximate object-space collision detection between low-resolution polyg-onal proxies. We then refine the query result by computing a directional penetration depth field using a local height-field representation of the deformable layers to detect the interference between the high-resolution surface geometry. We have developed a proof-of-concept demonstration using commodity graphics processors and been able to perform fast proximity queries between two highly complex deformable models in less than 2 msecs.","cites":"3","conferencePercentile":"43.65079365"},{"venue":"WHC","id":"235e0c2682153ec9aa2369f9281e67e4b6b1c848","venue_1":"WHC","year":"2007","title":"Quantifying the Value of Visual and Haptic Position Feedback During Force-Based Motion Control","authors":"Katherine J. Kuchenbecker, Netta Gurari, Allison M. Okamura","author_ids":"1716879, 2078730, 1713767","abstract":"Controlling the motion of a prosthetic upper limb without visual feedback is extremely difficult because the wearer does not know the prosthesis' configuration. This paper describes an experiment designed to determine the relative importance of visual and haptic position feedback during targeted force-based motion by non-amputee human subjects as an analogy to prosthetic use. Subjects control the angle of a virtual proxy through an admittance relationship by generating torque at the MCP joint of the right index finger. During successive repetitions of a target acquisition task, the proxy's state is selectively conveyed to the user through graphical display, finger motion, and tactile stimulation. Performance metrics for each feedback condition will provide insights on the role of haptic position feedback and may help guide the development of future upper-limb prostheses. Abstract Controlling the motion of a prosthetic upper limb without visual feedback is extremely difficult because the wearer does not know the prosthesis' configuration. This paper describes an experiment designed to determine the relative importance of visual and haptic position feedback during targeted force-based motion by non-amputee human subjects as an analogy to prosthetic use. Subjects control the angle of a virtual proxy through an admittance relationship by generating torque at the MCP joint of the right index finger. During successive repetitions of a target acquisition task, the proxy's state is selectively conveyed to the user through graphical display, finger motion, and tactile stimulation. Performance metrics for each feedback condition will provide insights on the role of haptic position feedback and may help guide the development of future upper-limb prostheses.","cites":"3","conferencePercentile":"43.65079365"},{"venue":"WHC","id":"b7fe454a70c33c7e89fa32d2b1faa91943b1eba7","venue_1":"WHC","year":"2007","title":"Transparent Rendering of Tool Contact with Compliant Environments","authors":"Miguel A. Otaduy, Markus H. Gross","author_ids":"1704342, 1743207","abstract":"Transparent haptic rendering of the contact between a tool and its environment requires very frequent update of the contact forces acting on the tool. Given a rigid tool and a deformable environment, we define contact constraints by solving a constrained dynamic simulation problem, typically at a low update rate. A generalized contact Jaco-bian defines velocities at the constraints given the velocity of the rigid tool. We define an inverse of the contact Jaco-bian that is dynamically consistent with the constraints and, once we know other forces acting on the rigid tool, it allows a fast update of the accumulated contact forces, and thereby highly transparent rendering.","cites":"12","conferencePercentile":"88.88888889"},{"venue":"WHC","id":"2c03647791e90d0b2a8c77056707b61d96115cb5","venue_1":"WHC","year":"2005","title":"Selective Stimulation to Superficial Mechanoreceptors by Temporal Control of Suction Pressure","authors":"Yasutoshi Makino, Hiroyuki Shinoda","author_ids":"1712395, 1715925","abstract":"In this paper we propose a new set of primitives to realize a large-area covering realistic tactile display. They stimulate the skin surface with suction pressure (SPS method) as our former paper proposed. The difference from the former device is that a single suction hole provides a pair of primitives. Since the identical hole provides the multiple primitives, we can expect Multi-Primitive Tactile Stimulation is realized more stably, and the physical structure is simpler than the former method. The method uses the frequency characteristics of the mechanoreceptor sensitivity and a feature of SPS that suction pressure through a hole does not reach the deep receptors, Pacinian corpuscles. We show the basic theory and results of fundamental experiments. In the experiments, we show the spatial feature of the virtual object (edged or round) can be controlled by the temporal profile of the primitives. We explain the reason of the phenomena based on a tactile perception model called Simple Bundle Model.","cites":"5","conferencePercentile":"41.33333333"},{"venue":"WHC","id":"2a61d86b949a7958ab413e56eb60d88261a1c12f","venue_1":"WHC","year":"2005","title":"A Compact Broadband Tactile Display and Its Effectiveness in the Display of Tactile Form","authors":"Ki-Uk Kyung, Minseung Ahn, Dong-Soo Kwon, Mandayam A. Srinivasan","author_ids":"2069791, 3268506, 1750864, 8138389","abstract":"This paper describes the development of a planar distributed tactile display, and tests its effectiveness for displaying textures. The tactile display is composed of a 6×5 pin array actuated by 30 piezoelectric bimorphs. The pins lie on 1.8 mm centers. Vertical excursion of each pin is controlled over a 0-0.7mm range. Perceptual experiments were conducted to evaluate the performance of the system under three conditions: active touch, passive touch with vibration, and passive touch without vibration.","cites":"12","conferencePercentile":"68.66666667"},{"venue":"WHC","id":"4cba6be2393962251254bdc22bb6147e60dc243c","venue_1":"WHC","year":"2005","title":"Discrimination of Virtual Haptic Textures Rendered with Different Update Rates","authors":"Seungmoon Choi, Hong Z. Tan","author_ids":"1718126, 1698913","abstract":"This paper addresses the discriminability of virtual haptic textures rendered with different update rates. Two psychophysical experiments were conducted. In the first experiment, we examined the pairwise dis-criminability of textured surfaces rendered with different update rates. In the second experiment, we measured the discrimination threshold of update rate for a reference textured surface rendered at 10 kHz. The results indicated that as long as the virtual textures were perceived to be stable (i.e., free of perceptual artifacts), subjects judged them to be perceptually equivalent. These findings, when taken together with our previous findings regarding the effect of update rate on perceived instability of virtual haptic texture [1], provide a general guideline for choosing an optimal update rate for haptic texture rendering, with explicit consideration for both control and perception performance.","cites":"5","conferencePercentile":"41.33333333"},{"venue":"WHC","id":"f818b779329e50c8ba625e4130339588479c2e8c","venue_1":"WHC","year":"2009","title":"ShiverPad: A device capable of controlling shear force on a bare finger","authors":"Erik C. Chubb, J. Edward Colgate, Michael A. Peshkin","author_ids":"1958715, 1700106, 1789986","abstract":"We discuss the theory, design, and performance of a flat-panel tac-tile display capable of controlling shear force on a finger. In previous research a TPaD variable friction device was presented. It modulates friction by using vertical ultrasonic vibrations to form a squeeze film of air between the finger and the horizontal glass surface. In this research, a TPaD is oscillated in the horizontal plane at 20-100Hz while alternating between low and high friction at the same frequency. As the plate moves in one direction, the squeeze film is turned on and friction is reduced. As the plate moves in the opposite direction, the squeeze film is turned off and the friction increases. The net time-averaged force is non-zero and can be used as a source of shear force to a finger in contact with the surface. We demonstrate the implementation of line sources and sinks using this new technology.","cites":"4","conferencePercentile":"54.61538462"},{"venue":"WHC","id":"3c38f12a23f2a6e332c839f9ef59362cd3c7ec3e","venue_1":"WHC","year":"2005","title":"The Tango: A Tangible Tangoreceptive Whole-Hand Human Interface","authors":"Dinesh K. Pai, Eric W. VanDerLoo, Subarna Sadhukhan, Paul G. Kry","author_ids":"1694975, 2458634, 2960659, 1970147","abstract":"e�str��t We describe the Tango, a new passive haptic interface for whole-hand interaction with 3D objects. The Tango is shaped like a ball and can be grasped comfortably in one hand. Its pressure sensitive skin measures the contact pressures exerted by the user's hand, and accelerometers within the device measure its motion and attitude. This information can be used for novel modes of interaction with three dimensional objects. We describe the design of the device, and the software for interpreting the sensor data for user interaction. Accompanying this paper, there will be a demonstration of the device at the Hands-On Demo session of the conference .","cites":"14","conferencePercentile":"74.66666667"},{"venue":"WHC","id":"3a3688cb396ff2ce6ec40bb432f896df5c40ffc4","venue_1":"WHC","year":"2005","title":"Dynamic Primitive Caching for Haptic Rendering of Large-Scale Models","authors":"Mashhuda Glencross, Roger J. Hubbold, Ben Lyons","author_ids":"2502700, 2878103, 2714662","abstract":"In this paper we present a software approach to managing complexity for haptic rendering of large-scale geometric models, consisting of tens to hundreds of thousands of distinct geometric primitives. A secondary client-side caching mechanism, exploiting partitioning, is used to dynamically update geometry within the locality of a user. Results show that the caching mechanism performs well, and that graphical rendering performance becomes an issue before the caching mechanism fails. The performance penalty of the caching technique was found to be dependent on the type of partitioning method employed.","cites":"2","conferencePercentile":"24"},{"venue":"WHC","id":"13aee18e19ee2af928c3e4584bfd212433b1d9db","venue_1":"WHC","year":"2007","title":"A Wearable Haptic Display to Present the Gravity Sensation - Preliminary Observations and Device Design","authors":"Kouta Minamizawa, Hiroyuki Kajimoto, Naoki Kawakami, Susumu Tachi","author_ids":"1711743, 1776927, 1681291, 7688338","abstract":"We propose a wearable ungrounded haptic display that presents a realistic gravity sensation of a virtual object. We focused on the shearing stress on the fingerpads due to the weight of the object, and found that the deformation of the fingerpads can generate a reliable gravity sensation even when proprioceptive sensation on the wrist or arm is absent. This implies that an ungrounded gravity display can be realized by reproducing fingerpad deformation. Based on our observations, we conducted evaluation tests for the device design. We first implemented the prototype device, which has a simple structure comprising dual motors, and then evaluated the recognition ability of the gravity sensation presented on the operator's finger by this method.","cites":"22","conferencePercentile":"95.23809524"},{"venue":"WHC","id":"623374bef0262a29b1054deaa1a77da2ec8ae8f5","venue_1":"WHC","year":"2009","title":"Stiffness discrimination with visual and proprioceptive cues","authors":"Netta Gurari, Katherine J. Kuchenbecker, Allison M. Okamura","author_ids":"2078730, 1716879, 1713767","abstract":"This study compares the Weber fraction for human perception of stiffness among three conditions: vision, proprioceptive motion feedback, and their combination. To make comparisons between these feedback conditions, a novel haptic device was designed that senses the spring behavior through encoder and force measurements, and implements a controller to render linear virtual springs so that the stimuli displayed haptically could be compared with their visual counterparts. The custom-designed, torque-controlled haptic interface non-invasively controls the availability of proprioceptive motion feedback in unimpaired individuals using a virtual environment. When proprioception is available, the user feels an MCP joint rotation that is proportional to his or her finger force. When proprioception is not available, the actual finger is not allowed to move, but a virtual finger displayed graphically moves in proportion to the user's applied force. Visual feedback is provided and removed by turning on and off this graphical display. Weber fractions were generated from an experiment in which users examined pairs of springs and attempted to identify the spring with higher stiffness. To account for slight trial-to-trial variations in the relationship between force and position in the proprioceptive feedback conditions, our analysis uses measurements of the actual rendered stiffness, rather than the commanded stiffness. Results for 10 users give average Weber fractions of 0.056 for vision, 0.036 for proprioception, and 0.039 for their combination, indicating that proprioception is important for stiffness perception for this experimental setup. The long-term goal of this research is to motivate and develop methods for proprioception feedback to wearers of dexterous upper-limb prostheses. ABSTRACT This study compares the Weber fraction for human perception of stiffness among three conditions: vision, proprioceptive motion feedback, and their combination. To make comparisons between these feedback conditions, a novel haptic device was designed that senses the spring behavior through encoder and force measurements , and implements a controller to render linear virtual springs so that the stimuli displayed haptically could be compared with their visual counterparts. The custom-designed, torque-controlled haptic interface non-invasively controls the availability of proprio-ceptive motion feedback in unimpaired individuals using a virtual environment. When proprioception is available, the user feels an MCP joint rotation that is proportional to his or her finger force. When proprioception is not available, the actual finger is not allowed to move, but a virtual finger displayed graphically moves in proportion to the user's applied force. Visual feedback is provided and removed by turning on and …","cites":"7","conferencePercentile":"83.07692308"},{"venue":"WHC","id":"0716456e37813f9444956bdd8e79850a39d6eefe","venue_1":"WHC","year":"2005","title":"\"A4\": A Technique to Improve Perception of Contacts with Under-Actuated Haptic Devices in Virtual Reality","authors":"Anatole Lécuyer, Jean-Marie Burkhardt, Jildaz Le Biller, Marco Congedo","author_ids":"1693899, 2899899, 2205995, 3276441","abstract":"The objective of this paper is twofold. First, it aims at positioning the performance of under-actuated haptic devices as compared to fully-actuated haptic devices and unactuated devices (i.e. input devices) in virtual reality. Second, it proposes a technique-called \" A 4 \"-to improve the perception of contacts when using an under-actuated haptic device in virtual reality. This technique focuses on point-based haptic exploration. When a contact occurs in the simulation, we suggest to rotate the virtual scene in order to align the contact normal with the direction of the actuated axis (or axes) of the haptic device. With this technique, the virtual scene moves itself automatically to provide a more \" realistic \" sensation of contact. An experimental evaluation showed first that the performance of under-actuated force-feedback was located between the no-haptic condition (worst performance) and the full-haptic condition (best performance). Second, the use of the A 4 technique decreased strongly the \" penetration \" inside virtual objects, and thus globally improved the performance of the participants in situation of under-actuation.","cites":"3","conferencePercentile":"32"},{"venue":"WHC","id":"4737804ee2a346a54035c37ec2e2371679694d6f","venue_1":"WHC","year":"2007","title":"Discriminability of Real and Virtual Surfaces with Triangular Gratings","authors":"Matthew Kocsis, Hong Z. Tan, Bernard D. Adelstein","author_ids":"2912559, 1698913, 2782231","abstract":"Human sensitivity to height differences in textured surfaces is on the order of microns. Research on human texture perception requires texture samples with precisely controlled micro-geometry. This can be achieved with an electrical discharge machining (EDM) procedure, but the process is time consuming and labor intensive. An alternative approach is to simulate textured surfaces with a haptic interface with high position resolution. The present study measured the amplitude discrimination thresholds for surfaces with triangular gratings using real EDM textured samples and virtual textures rendered with a high-precision force-feedback device called the ministick. The results indicated that the just noticeable differences for real and virtual textures, respectively 3.69±0.65 and 4.94±0.96 μm, were of similar magnitude. Therefore, we propose that this device is suitable for the study human perception of surface micro-geometry with features on the scale of human perceptual resolution.","cites":"4","conferencePercentile":"55.55555556"},{"venue":"WHC","id":"51e181fee488acc07798a2dd53cbccf9c79ae194","venue_1":"WHC","year":"2005","title":"The \"Bubble\" Technique: Interacting with Large Virtual Environments Using Haptic Devices with Limited Workspace","authors":"Lionel Dominjon, Anatole Lécuyer, Jean-Marie Burkhardt, Guillermo Andrade-Barroso, Simon Richir","author_ids":"2243317, 1693899, 2899899, 2090385, 2646589","abstract":"The \" Bubble \" technique is a novel interaction technique to interact with large Virtual Environments (VE) using a haptic device with a limited workspace. It is based on a hybrid position/rate control which enables both accurate interaction and coarse positioning in a large VE. The haptic workspace is displayed visually using a semi-transparent sphere (looking like a bubble) that surrounds the manipulated cursor. When the cursor is located inside the bubble, its motion is position-controlled. When the cursor is outside, it is rate-controlled. The user may also \" feel \" the inner surface of the bubble, since the spherical workspace is \" haptically \" displayed by applying an elastic force-feedback when crossing the surface of the bubble.","cites":"34","conferencePercentile":"93.33333333"},{"venue":"WHC","id":"590d2841769c4f573f68a239fc555f087fcf0351","venue_1":"WHC","year":"2007","title":"Surface Interrogation Methods for Haptic Rendering of Virtual Objects","authors":"Anusha Sridaran, Dianne Hansford, Kanav Kahol, Sethuraman Panchanathan","author_ids":"2904778, 1746264, 3105442, 1743991","abstract":"The process which enables virtual objects to mimic their real world counterparts is known as realistic rendering in haptics. Realistic sensations could relate to any spatial feature like shape or texture. We have proposed a system here that aims at utilizing the shape information of a surface effectively to aid in object recognition through a haptic interface. This paper describes some surface interrogation techniques namely isophotes, contours and Gaussian curvature to assist in haptic rendering by drawing the user's attention to certain features on a surface that cannot be perceived by realistic means. The effectiveness of these tools, based on their behavior in an external environment, has also been compared. The main goal of this paper is to demonstrate that perception of virtual surfaces can be enhanced by providing haptic feedbacks parameterized according to geometric features identified by surface interrogation.","cites":"1","conferencePercentile":"15.87301587"},{"venue":"WHC","id":"366aea019f1d5587a110cb2b03c532290007ac29","venue_1":"WHC","year":"2005","title":"An Experiment on Tracking Surface Features with the Sensation of Slip","authors":"Mark A. Salada, J. Edward Colgate, Peter M. Vishton, Eviatar Frankel","author_ids":"7936700, 1700106, 8586515, 2038377","abstract":"This paper describes the last of three experiments that investigate relative motion between a surface and the fingertip (slip) as part of a larger program of research on \" fingertip haptics. \" To confirm the suspicion that tangential displacement of the skin during contact contribute to the perception of feature movement, this experiment tasks subjects to follow a feature on a surface that displays the path tangent given three different factors: the first factor is the absence of tangential displacements 1) within the contact area and 2) on the whole finger pad. The second factor explores different surface speeds. Finally, we explore different rates of path curvature. A custom mechanical filter placed between the skin and the moving surface enables the selective elimination of tangential contact displacements. Thirty-three subjects completed the tracking test, showing that the absence of tangential forces from slip severely impairs performance. However, results reveal heightened performance with the filter in a \" loose \" configuration. The performance suggests that subjects do not use shape alone to track features, but some combination of shape and tangential forces (due to friction) together to perceive the movement of small features.","cites":"9","conferencePercentile":"57.33333333"},{"venue":"WHC","id":"31f3703580f45d29f0f4cd78aeff6cd45fe44c6c","venue_1":"WHC","year":"2005","title":"A Haptic Interface for Human-in-the-Loop Manipulation at the Nanoscale","authors":"Hong Z. Tan, Laron Walker, Ron Reifenberger, Sorubh Mahadoo, George Chiu, Arvind Raman, Aron T. Helser, Pablo Colilla","author_ids":"1698913, 2049506, 2951608, 2795333, 8661439, 2937522, 2879281, 2702944","abstract":"This paper outlines major challenges that we are facing in interfacing a human user with objects in the nanoworld via a haptic interface. After a review of prior efforts at haptically-enabled nanomanipulation systems, we present the current state of our nanomanipulator system. We then discuss current research issues including the direct-Z mode, force modeling, data transfer rates and the stability of the haptic interface. Results of nanomanipulation of single-walled carbon nanotubes are presented. It is our hope that the insight gained by the human user of a haptic interface to SPM will lead to scanning algorithms that can automatically adjust the SPM parameters based on the properties of the nanosample and the substrate under investigation.","cites":"2","conferencePercentile":"24"},{"venue":"WHC","id":"e04fec3ec2b2af7fcfed53a11678622d58756e07","venue_1":"WHC","year":"2009","title":"Haptic interface for perceiving remote object using a laser range finder","authors":"Hiroaki Yano, Yuichi Miyamoto, Hiroo Iwata","author_ids":"1827539, 2142662, 2711482","abstract":"This paper describes development of a haptic interface using a laser range finder. The system consists of a laser range finder, computer and a 1 degree-of-freedom haptic apparatus. The haptic apparatus can generate a reaction force based on a distance to a remote object that is measured by the laser range finder. A user can feel the shape of a remote object by holding this interface and pointing the object. Through an experiment, the effectiveness of this system was confirmed.","cites":"3","conferencePercentile":"40.76923077"},{"venue":"WHC","id":"ebd2fae814efc15cca83c75f7618c71617151de0","venue_1":"WHC","year":"2007","title":"Development of a Whole-Sensitive Teleoperated Robot Arm using Torque Sensing Technique","authors":"Dzmitry Tsetserukou, Riichiro Tadakuma, Hiroyuki Kajimoto, Naoki Kawakami","author_ids":"3095699, 1693304, 1776927, 1681291","abstract":"In this paper, we concentrate on the design of a new whole-sensitive robot arm enabling torque measurement in each joint by means of developed optical torque sensors. When the contact of arm with an object occurs, local impedance algorithm provides active compliance of corresponding robot arm joint. Thus, the whole structure of the manipulator can safely interact with unstructured environment. The detailed design procedure of the 4-DOF robot arm and optical torque sensors is described in the paper. The gravity compensation algorithm was elaborated and verified by implementation of the local impedance control of a simple two-link arm manipulator.","cites":"1","conferencePercentile":"15.87301587"},{"venue":"WHC","id":"2549dc763b954df4448b4b7dd5a46455ebaa92a2","venue_1":"WHC","year":"2009","title":"Effects of haptic device attributes on vibration detection thresholds","authors":"Curt Salisbury, R. Brent Gillespie, Hong Z. Tan, Federico Barbagli, John Kenneth Salisbury","author_ids":"1752889, 1769259, 1698913, 1768969, 1772984","abstract":"Human vibrotactile detection experiments were used to compare temporal sinusoids displayed on three commercial haptic devices to a high-fidelity linear voice-coil actuator. The three commercial haptic devices we used span the cost spectrum, supposing that cost of a device is correlated with the fidelity of its virtual textures. This turned out not to be the case. The results indicated that none of the three haptic devices we tested were able to render perceptually distortion-free, periodically regular vibrations at detection threshold levels. Further investigation into the electrical and mechanical device properties that limited the performance of these devices revealed that D/A resolution, amplifier non-linearity and stiction were the primary sources of signal corruption.","cites":"5","conferencePercentile":"64.61538462"},{"venue":"WHC","id":"661d7d8fa7b587f97de950312f71aadabd1323e5","venue_1":"WHC","year":"2005","title":"Using Collaborative Haptics in Remote Surgical Training","authors":"Chris Gunn, Matthew A. Hutchins, Duncan Stevenson, Matt Adcock, Patricia Youngblood","author_ids":"1690012, 1681523, 7371355, 1691131, 2990545","abstract":"We describe the design and trial of a remotely conducted surgical master class, using a haptic virtual environment as an integral part of the learning process. In the trial, we linked a haptic virtual environment in Canberra, Australia with a second installation at Stanford University, California. We were testing several haptic components of the system, and whether collaborative haptics could be useful in teaching surgery at a distance. We were also interested to see if an audience could be engaged in the instruction. The participants used features such as manipulating body organs, diathermy and clipping and cutting of ducts. The audience followed each student's performance on a large 3D screen while waiting their turn at the interface. A key aim of the application was to produce a shared sense of presence in the virtual environment. The responses of the audience and participants in this regard were collected and results are presented. 1. Background Collaborative (networked) virtual environments (CVEs) have been found to have several benefits when groups or individuals need to share information or skills. Singhal and Zyada [19] list some of these as \" a shared sense of space, a shared sense of presence, a shared sense of time, a way to communicate and a way to share data \". It has also been shown [2] [17] that haptic (force) feedback significantly improves perceived virtual presence in a CVE, and that it also enhances performance considerably in a shared, dexterous 3D task. Salilinas, Rassmus-Grohn and Sjostrom [17] found that force feedback improved performance and a sense of presence in a cube manipulation task. However, this field presents several challenges. These include communication delay (latency) and logical consistency between separate representations of the environment. When haptic feedback is used as an interface mechanism, solving these issues becomes more critical, due to the direct and immediate user input at each end. Kammermieir et al [10] state that as well as providing information about the environment, haptic interaction also implies a bilateral exchange of energy between the human operator and that environment. This produces a feedback loop that is susceptible to instability. To use collaborative haptics in a real world application, over a real network, we needed to overcome the stability problem. Kim et al [11] were able to achieve usable haptic collaboration across the Atlantic Ocean by introducing a predictive algorithm for collision detection, as well as three layers of damping. …","cites":"26","conferencePercentile":"86.66666667"},{"venue":"WHC","id":"2f7caf2e054bd156edb5d9a54472ee76ea50162a","venue_1":"WHC","year":"2009","title":"Passive set-position modulation approach for haptics with slow, variable, and asynchronous update","authors":"Dongjun Lee, Ke Huang","author_ids":"5385653, 5071870","abstract":"We consider the following problem in haptics: information update from the virtual world is slow w.r.t. the local servo-loop rate of the haptic device, and the information transmission/update between the haptic device and the virtual world is of variable rate and/or asyn-chronous. For this, we propose a novel control framework, that, by relying on our recently proposed passive set-position modulation (PSPM) and discrete-time passive non-iterative integrators, enables us to enforce two-port hybrid (i.e. continuous-discrete) passivity for such slow and variable/asynchronous haptics as well as to separate the virtual world simulation design from the device's servo-loop tuning. Relevant experimental results are also presented.","cites":"4","conferencePercentile":"54.61538462"},{"venue":"WHC","id":"235c2e731751e10704dd4d8e2cd513d7bce9bd00","venue_1":"WHC","year":"2007","title":"Assessing the Efficacy of Variable Compliance Tactile Displays","authors":"Michael A. Taylor, Aaron R. Ferber, J. Edward Colgate","author_ids":"1706907, 1907236, 1700106","abstract":"Tactile displays based on pin arrays are challenging to design because they require a large number of individually controllable pins, or \" tactors \". A semi-active approach such as variable compliance could lead to improvements in tactor density, power consumption, size, and weight. However, the effectiveness of such an approach at conveying information to the user has not previously been studied. This paper presents an experiment that compares the performance of height varying and compliance varying pin arrays. It was found that users of a variable compliance pin array took at least 1.41 times longer to determine the shape of a displayed object than when using a variable height pin array, and this decision time increases with tactor stiffness.","cites":"0","conferencePercentile":"5.555555556"},{"venue":"WHC","id":"fec381c5b6e394e0fc9a3632fec6533f1c50e289","venue_1":"WHC","year":"2007","title":"Free-Form Tactile Sensor Using 3-Dimensional Shape Capture Sheet","authors":"Takayuki Hoshi, Hiroyuki Shinoda","author_ids":"1789842, 1715925","abstract":"We are developing a novel sensing device named \" 3-dimensional capture sheet (3DCS) \". The cloth-like sheet measures its own 3D configuration. The sheet enables us to make a soft tactile sensor by wrapping a compressible material in it. The number, shapes, and positions of objects are obtained from the surface deformation of the material. The contact forces are also estimated. There is a lattice structure inside the sheet, and each link of the structure has a triaxial accelerometer. The roll and pitch angles of the link are derived from the gravity vector measured by the accelerometer. Furthermore, the relative yaw angle is also determined owing to the lattice structure. The posture of each link is fully described by these three angles. Then, the whole shape of the sheet is estimated by combining all of the links in computation.","cites":"0","conferencePercentile":"5.555555556"},{"venue":"WHC","id":"3891a00b240ea4e8bb747a046b7b407b8a4f3988","venue_1":"WHC","year":"2009","title":"Haptic stiffness identification by veterinarians and novices: A comparison","authors":"Neil Forrest, Sarah Baillie, Hong Z. Tan","author_ids":"2600724, 2402421, 1698913","abstract":"Palpation is important in both veterinary and medical health professions. It is however difficult to learn, teach and assess. More must be understood about the skills involved in palpation. The present study compares the ability of practicing veterinarians and veterinary students to identify stiffness values. An absolute identification paradigm was used where a force-feedback device rendered virtual surfaces with 5 levels of stiffness within a \" clinically relevant \" range of 0.2 – 0.5 N/mm. The results from 12 veterinarians and 14 veterinary students show that the veterinarians performed significantly better than the students (p < 0.001). The mean information transfer was 0.97 bits (almost 2 perfectly-identifiable stiffness levels) for the veterinarians and 0.58 bits (1 correctly-identified stiffness level) for the students. However, neither group was able to reliably identify more than 2 levels of stiffness, indicating that the success of veterinarians in clinical practice probably relies on additional properties such as size, shape and texture. Our findings suggest that stiffness perception in the context of veterinary medicine is a learned clinical skill. Quantifying expert ability will help inform teaching methods and set targets for students. Similar psychophysical methods can also be used to monitor student performance throughout the learning process. Future work will examine the contributions of other object properties as well as motor strategies to palpation performance. 1 INTRODUCTION In both human and veterinary medicine, health professionals use palpation as part of many clinical examinations. When palpating a structure, the clinician uses the sense of touch to assess properties such as size, shape, texture and stiffness. The information gathered helps in the diagnostic process. Examples of palpation based examinations in human medicine include the detection of prostate and breast cancer and in veterinary medicine the diagnosis of pregnancy in several species. Learning and teaching palpation is difficult, especially when the examination is internal and unsighted. Opportunities for trainees to practice on real patients are limited by ethical considerations and have been further reduced by rising student numbers. Additionally, the level of skill required is hard to quantify which makes setting targets for students and assessing competence difficult. Simulators provide a potential solution to some of these issues and a number of medical and veterinary palpation simulators have been developed. Most are mannequins or part-task trainers (for example, the E-Pelvis for teaching pelvic examinations [1]). But there are also a few virtual reality (VR) simulators that use haptic technology, …","cites":"6","conferencePercentile":"74.61538462"},{"venue":"WHC","id":"9ab3274f358a6992875297384085cc26ef6535bf","venue_1":"WHC","year":"2009","title":"Non-contact tactile sensation synthesized by ultrasound transducers","authors":"Takayuki Hoshi, Takayuki Iwamoto, Hiroyuki Shinoda","author_ids":"1789842, 2222964, 1715925","abstract":"This paper describes a new tactile device which produces stress fields in 3D space. Combined with mid-air and/or 3D stereoscopic displays, this device provides high-fidelity tactile feedback for interaction with visual objects. The principle is based on a nonlinear phenomenon of ultrasound; acoustic radiation pressure. The fabricated prototype device consists of 324 airborne ultrasound transducers, and the phase and intensity of each transducer are controlled individually. The total output force within the focal region is 1.6 gf. The spatial resolution is 20 mm. The prototype can produce sufficient vibrations up to 1 kHz. An interaction system including the prototype is also introduced which tracks user's hand and provides suitable touch feeling. 1 INTRODUCTION There has been a wide interest in mid-air and/or 3D displays and such displays have been seen in many SF movies [1]. People in the movies see and manually interact with touch screens or virtual objects floating in front of them. Recently, novel technologies are developed to render images hovering in air without special glasses. FogScreen [2] and Heliodisplay [3] use a thin layer of fog as a projection screen. Holo [4] provides floating images from an LCD by utilizing a concave mirror. SeeReal Technologies is working on a real-time, computer-generated, and 3D holography [5] through the use of an eye-tracking technology for reduction of calculation amount. Furthermore, by applying the camera-based and marker-less hand tracking techniques demonstrated in Holovizio [6] or GrImage [7], we will be able to handle the projected images with our hands. Then, tactile feedback will be the next demand. If tactile feedback is provided additionally, the usability of the interaction systems will be highly improved. There are three types of conventional strategies for tactile feedback in free space. The first is attaching tactile devices on user's fingers and/or palms. Employed devices are, for example, vibrotactile stimulators (CyberTouch [8]), motor-driven belts (GhostGlove [9]), and pin-array units (SaLT [10]). In this strategy, the skin and the device are always in contact and that leads to undesired touch feelings. The second is controlling the position of tactile devices so that they contact with the skin only when tactile feedback is required. In the master-slave system shown in [11], the encounter-type force feedback is realized by the exoskeleton Figure 1. 18×18 array of ultrasound transducers master hand. The detailed tactile feedback for each finger is provided by the electrotactile display attached on the finger part of …","cites":"12","conferencePercentile":"91.53846154"},{"venue":"WHC","id":"62ab2c86e5e336fdb8ac60247612195fc4f47832","venue_1":"WHC","year":"2009","title":"Good vibrations: Asymmetric vibrations for directional haptic cues","authors":"Hanns Tappeiner, Roberta L. Klatzky, Bertram J. Unger, Ralph L. Hollis","author_ids":"1944021, 1735008, 3125010, 8050304","abstract":"In this paper we present a new concept for haptic guidance in multiple dimensions, in the form of asymmetric vibrations. We show that by adding asymmetry, vibrations from a single source can, like continuous forces, provide effective, high-resolution directional hap-tic cues in multiple dimensions. Unlike feedback via continuous forces, vibrations can be generated in an almost arbitrarily small workspace. After describing the concept in detail, we describe a user study that assesses the effects of such vibrations-applied to subjects' hands-on their ability to distinguish between different directions. The results indicate that asymmetric vibrations can provide accurate directional haptic feedback.","cites":"6","conferencePercentile":"74.61538462"},{"venue":"WHC","id":"afe42c30211837194867216110f721fa2ff75dff","venue_1":"WHC","year":"2005","title":"Motion Space Reduction in a Haptic Model of Violin and Viola Bowin","authors":"Sarah Baillie, Stephen A. Brewster, Cordelia V. Hall, John T. O'Donnell","author_ids":"2402421, 1721608, 2674553, 3267971","abstract":"A haptic model of bowing the violin and viola is presented that focuses on just the geometry of the contact point between the bow hair and the string, giving a simplified description that focuses on aspects which the performer thinks about consciously. The model allows artificial constraints on the bow motion to be provided, giving the player physical feedback if one dimension of the contact point becomes incorrect , while allowing full movement in other dimensions.","cites":"0","conferencePercentile":"5.333333333"},{"venue":"WHC","id":"0c5fcca033d4d492aebb20e901786ebd7fac6283","venue_1":"WHC","year":"2005","title":"Perceptibility of Haptic Digital Watermarking of Virtual Textures","authors":"Domenico Prattichizzo, Mauro Barni, Hong Z. Tan, Seungmoon Choi","author_ids":"1789883, 1707075, 1698913, 1718126","abstract":"Digital watermarking refers to the process of embedding a digital code into an image, video, printed document or audio media. The code should not interfere with the normal use of the media but can be recovered later. With the growing interest in haptic interactions for training and museum displays, it is only a matter of time that haptic digital media become available on the internet. For example , one will soon be able to feel the shape of Michaelan-gelo's David or Japan's Big Buddha by downloading a file that can be \" played \" on a force-feedback device. The hap-tic file may contain surface texture data in addition to topography so that David feels like marble and Big Buddha wood. In the meanwhile, the need for haptic digital wa-termarking will arise for protecting haptic media contents. This paper introduces for the first time the idea of haptic watermarking and shows one way to embed a watermark into a host surface texture signal. We also demonstrate the imperceptibility of the texture watermark in a psychophys-ical experiment.","cites":"5","conferencePercentile":"41.33333333"},{"venue":"WHC","id":"206f4c368d020ecf0a34728a94c581cae3beaf4b","venue_1":"WHC","year":"2007","title":"Implementing Compact Tactile Display for Fingertips with Multiple Vibrotactile Actuator and Thermoelectric Module","authors":"Tae-Heon Yang, Gi-Hun Yang, Dong-Soo Kwon, Sungchul Kang","author_ids":"3205030, 2515260, 1750864, 2478029","abstract":"this paper, a compact tactile display which consists of multiple vibrotactile actuators with 4-different vibrotactile unbalanced masses and a peltier thermoelectric module is proposed. By stimulating 2 different sensory channels including mechano-receptors and thermo-receptor simultaneously, surface texture and material composition can be displayed using the implemented device. 3 experiments were conducted for the performance evaluation of the proposed device through discriminating various patterned textures. Experimental results show that the developed device can be used to display surface texture and temperature together and suggest the possibility of implementing a small-sized, multi-fingered tactile display device.","cites":"0","conferencePercentile":"5.555555556"},{"venue":"WHC","id":"62b65a88fe2a9161f3ae2c3d892d8e15e3b52694","venue_1":"WHC","year":"2005","title":"Multi-Modal Perceptualization of Volumetric Data and Its Application to Molecular Docking","authors":"Ross Maciejewski, Seungmoon Choi, David S. Ebert, Hong Z. Tan","author_ids":"1786514, 1718126, 1701512, 1698913","abstract":"In this paper, we present a multi-modal data perceptual-ization system used to analyze the benefits of augmenting a volume docking problem with other perceptual cues, particularly stereoscopic vision and haptic rendering. This work focuses on the problem of matching complex three-dimensional shapes in order to reproduce known configurations. Specifically, we focus on the docking of two proteins , actin and cofilin, responsible for cellular locomotion. Users were shown examples of cofilin combining with actin and asked to reproduce this match. Accuracy of the match and completion time were measured and analyzed in order to quantify the benefits of augmenting tools for such a task.","cites":"8","conferencePercentile":"53.33333333"},{"venue":"WHC","id":"07caf21352db0c33d040e069d3d671afdbc81b85","venue_1":"WHC","year":"2007","title":"Mechanical Impedance of the Hand Holding a Spherical Tool at Threshold and Suprathreshold Stimulation Levels","authors":"Ali Israr, Seungmoon Choi, Hong Z. Tan","author_ids":"1769549, 1718126, 1698913","abstract":"We report mechanical impedance of the hand for sinusoidal stimulation at the threshold and su-prathreshold levels in the frequency range of 10-500 Hz delivered through a ball-shaped interface. The participants held the ball mounted on a minishaker in a way similar to that of holding a ball interface of a force-feedback device. A minishaker excited the ball in the vertical direction, resulting in vibrations on the skin of the hand in mostly the tangential direction. The position detection threshold curve was similar to that measured earlier using a stylus in the pen-hold posture , but the force detection threshold curve and the mechanical impedance was shifted upwards in the high frequency region. The mechanical impedance at the threshold and suprathreshold levels were essentially the same, indicating that skin characteristics do not change in the dynamic range of tactual perception for the same tool-holding posture.","cites":"8","conferencePercentile":"82.53968254"},{"venue":"WHC","id":"02b337dc562f10550131ceb97e9921df5319f6b5","venue_1":"WHC","year":"2009","title":"A high fidelity ungrounded torque feedback device: The iTorqU 2.0","authors":"Kyle N. Winfree, Jamie Gewirtz, Thomas Mather, Jonathan Fiene, Katherine J. Kuchenbecker","author_ids":"2681893, 2172428, 2093358, 1971080, 1716879","abstract":"This material is posted here with permission of the IEEE. Such permission of the IEEE does not in any way imply IEEE endorsement of any of the University of Pennsylvania's products or services. Internal or personal use of this material is permitted. However, permission to reprint/republish this material for advertising or promotional purposes or for creating new collective works for resale or redistribution must be obtained from the IEEE by writing to pubs-permissions@ieee.org. By choosing to view this document, you agree to all provisions of the copyright laws protecting it. Abstract This paper discusses the design and operation of the iTorqU 2.0, an ungrounded, handheld torque feedback device for haptic applications. Based upon the gyroscopic effect, the iTorqU 2.0 uses a metal flywheel inside of a two-axis actuated gimbal to create directional torques that are applied to the user's hand. The coupling of angular velocity and angular momentum creates a torque that is orthogonal to the two input angular velocities, giving the user the impression that their hand is being twisted in free air. Following a review of prior work in the field of ungrounded torque feedback devices, we first present our preliminary prototype, the iTorqU 1.0. Building on empirical observations and user feedback from a public demonstration, we revised and augmented this design to create the iTorqU 2.0. This paper covers the major mechanical, electrical, and controls design considerations that went into creating the iTorqU 2.0, along with an analysis of its torque output capabilities.A high fidelity ungrounded torque feedback device: The iTorqU 2. This material is posted here with permission of the IEEE. Such permission of the IEEE does not in any way imply IEEE endorsement of any of the University of Pennsylvania's products or services. Internal or personal use of this material is permitted. However, permission to reprint/republish this material for advertising or promotional purposes or for creating new collective works for resale or redistribution must be obtained from the IEEE by writing to pubs-permissions@ieee.org. By choosing to view this document, you agree to all provisions of the copyright laws protecting it. ABSTRACT This paper discusses the design and operation of the iTorqU 2.0, an ungrounded, handheld torque feedback device for haptic applications. Based upon the gyroscopic effect, the iTorqU 2.0 uses a metal flywheel inside of a two-axis actuated gimbal to create directional torques that are applied to the user's hand. The coupling of angular velocity …","cites":"13","conferencePercentile":"95.38461538"},{"venue":"WHC","id":"aa44195bc3f4709466337a178daf09736fe54b77","venue_1":"WHC","year":"2005","title":"Design Considerations for Stand-Alone Haptic Interfaces Communicating via UDP Protoco","authors":"Ryan M. Traylor, Danny Wilhelm, Bernard D. Adelstein, Hong Z. Tan","author_ids":"1823477, 3337413, 2782231, 1698913","abstract":"This work was motivated by the need for high-speed communication between a stand-alone haptic interface and an external computer running haptic rendering algorithms. This paper describes our recent work with User Datagram Protocol (UDP) over Ethernet as a communication channel between a remote computer and a custom embedded controller built for a finger-scale 3 DOF force-feedback haptic interface (the 3-DOF ministick). The results and observations from three experiments are contrasted with theoretical timing models in order to isolate potential problems and verify predicted models. Details of the controller hardware that enabled a haptic update rate of 3800 Hz are provided. Information that may reduce development time for other systems requiring Ethernet communication is also presented.","cites":"0","conferencePercentile":"5.333333333"},{"venue":"WHC","id":"0453e5bdfd9e1ff3927bf54a4b1b1425135066b4","venue_1":"WHC","year":"2007","title":"Finger Ring Tactile Interface Based on Propagating Elastic Waves on Human Fingers","authors":"Takayuki Iwamoto, Hiroyuki Shinoda","author_ids":"2222964, 1715925","abstract":"We propose a new tactile device which measures several DOF vibrations propagating along the finger. The device can be used both as a tactile sensor and human-machine interface. In this paper, as a pilot experiment, we carried out experiments on the identification of contact positions by using 2 DOF vibrations. It was shown that with a 2-axis accelerometer placed on the backside of the proximal phalanx, tapping on distal phalanx and middle phalanx can be discriminated.","cites":"4","conferencePercentile":"55.55555556"},{"venue":"WHC","id":"355376d9ab9c265e4ee4410079b7775582343737","venue_1":"WHC","year":"2007","title":"JND Analysis of Texture Roughness Perception using a Magnetic Levitation Haptic Device","authors":"Bertram J. Unger, Ralph L. Hollis, Roberta L. Klatzky","author_ids":"3125010, 8050304, 1735008","abstract":"This paper describes the use of a magnetic levitation haptic device (MLHD) to study the psychophysics of texture roughness. Studies of texture roughness perception performed using real textures can be time consuming and expensive. By using a MLHD to simulate texture we are able to quickly and easily adjust texture parameters. A dithered textured surface composed of conical elements is simulated using a constraint surface algorithm. The constraint surface shape is defined by the geometry of the elements as well as the size and shape of the virtual probe. The spacing of the elements and the size of the probe can be varied continuously and in real time. Just noticeable difference (JND) experiments were conducted over the parameters of probe radius and texture spacing. The JND of roughness was determined with respect to element spacing using unforced weighted up-down adaptive threshold estimation. JND's were found to vary for texture spacing and probe size. JND's for constant probe size decreased with increasing texture spacing to a minimum and then increased again. JND's for constant spacing increased as probe size increased. These results are consistent with a geometric model of probe-texture interaction.","cites":"7","conferencePercentile":"78.57142857"},{"venue":"WHC","id":"03cde8fb41c98e786a72e02030d348e328b010b6","venue_1":"WHC","year":"2007","title":"Shaping Event-Based Haptic Transients Via an Improved Understanding of Real Contact Dynamics","authors":"Jonathan Fiene, Katherine J. Kuchenbecker","author_ids":"1971080, 1716879","abstract":"Haptic interactions with stiff virtual surfaces feel more realistic when a short-duration transient is added to the spring force at contact. But how should this event-based transient be shaped? To answer this question, we present a targeted user study on virtual surface realism that demonstrates the importance of scaling transients correctly and hints at the complexity of this dynamic relationship. We then present a detailed examination of the dynamics of tapping on a rigid surface with a hand-held probe; theoretical modeling is combined with empirical data to determine the influence of impact velocity, impact acceleration, and user grip force on the resulting transient surface force. The derived mathematical relationships provide a formula for generating open-loop, event-based force transients upon impact with a virtual surface. By incorporating an understanding of the dynamics of real interactions into the recreation of virtual contact, these findings promise to improve the performance and realism of a wide range of haptic simulations. Abstract Haptic interactions with stiff virtual surfaces feel more realistic when a short-duration transient is added to the spring force at contact. But how should this event-based transient be shaped? To answer this question, we present a targeted user study on virtual surface realism that demonstrates the importance of scaling transients correctly and hints at the complexity of this dynamic relationship. We then present a detailed examination of the dynamics of tapping on a rigid surface with a hand-held probe; theoretical mod-eling is combined with empirical data to determine the influence of impact velocity, impact acceleration, and user grip force on the resulting transient surface force. The derived mathematical relationships provide a formula for generating open-loop, event-based force transients upon impact with a virtual surface. By incorporating an understanding of the dynamics of real interactions into the recreation of virtual contact, these findings promise to improve the performance and realism of a wide range of haptic simulations.","cites":"5","conferencePercentile":"65.07936508"},{"venue":"WHC","id":"5d8eb142730929c85529fd2799698a7b1208f382","venue_1":"WHC","year":"2005","title":"Design and Performance of a High Fidelity, Low Mass, Linear Haptic Display","authors":"David W. Weir, Michael A. Peshkin, J. Edward Colgate, Pietro Buttolo","author_ids":"2283556, 1789986, 1700106, 2748389","abstract":"We built a high fidelity, low mass, linear haptic display, with a peak force output of 8.5 Newtons, continuous force output of 1.3 Newtons, range of motion of approximately 15 millimeters, sensing resolution of 0.5 microns, and a-3dB bandwidth of approximately 550 Hz. By having low apparent mass of approximately 5 grams, we can realistically render linear switches, which themselves have a moving mass of only a few grams. This device utilizes a low inertia rotary motor, but over only a limited range of motion, allowing it to be driven without commutation. We constructed a linear current controlled amplifier to drive the system. Additionally, the motor windings allow us to use electrical damping to add physical damping to the system to improve its performance.","cites":"3","conferencePercentile":"32"},{"venue":"WHC","id":"b90d8a8911106060f01a62cc4b261c7447606349","venue_1":"WHC","year":"2007","title":"Braille Display by Lateral Skin Deformation with the STReSS2 Tactile Transducer","authors":"Vincent Lévesque, Jérôme Pasquero, Vincent Hayward","author_ids":"2723114, 2251890, 8113012","abstract":"Earlier work with a 1-D tactile transducer demonstrated that lateral skin deformation is sufficient to produce sensations similar to those felt when brushing a finger against a line of Braille dots. Here, we extend this work to the display of complete 6-dot Braille characters using a general purpose 2-D tactile transducer called STReSS 2. The legibility of the produced Braille was evaluated by asking seven expert Braille readers to identify meaningless 5-letter strings as well as familiar words. Results indicate that reading was difficult but possible for most individuals. The superposition of texture to the sensation of a dot improved performance. The results contain much information to guide the design of a specialized Braille display operating by lateral skin deformation. They also suggest that rendering for contrast rather than realism may facilitate Braille reading when using a weak tactile transducer.","cites":"17","conferencePercentile":"92.06349206"},{"venue":"WHC","id":"1657e9b1d1a4391daca1bef6db702d1461375692","venue_1":"WHC","year":"2005","title":"The Design and Evaluation of a Vibrotactile Progress Bar","authors":"Stephen A. Brewster, Alison King","author_ids":"1721608, 7677044","abstract":"We present an investigation into the use of Tactons to present progress information. Progress bars are common but must compete for screen space and visual attention with other visual tasks. We created a tactile progress indicator, encoding progress into a series of vibrotactile pulses. An experiment comparing the tac-tile progress indicator to a standard visual one showed a significant improvement in performance and an overall preference for the tactile display.","cites":"9","conferencePercentile":"57.33333333"},{"venue":"WHC","id":"3fef55bc23bb03ee62972dabce5adce2908852c4","venue_1":"WHC","year":"2005","title":"Fundamental Limits in the Rendering of Virtual Haptic Textures","authors":"Gianni Campion, Vincent Hayward","author_ids":"2582180, 8113012","abstract":"We discuss the properties of force-feedback haptic simulation systems that fundamentally limit the recreation of periodic gratings, and hence, of any texture. These include sampling rate, device resolution, and structural dynamics. Basic sampling limitations are analyzed in terms of the Nyquist and the Courant conditions. The analysis proposes that noise due to sampling and other sources injected in the system may prevent it to achieve acceptable performance in most operating conditions, unless special precautions such as the use of a reconstruction filter, make the closed-loop more robust to noise. The structural response of a PHANTOM 1.0A device was such that no such filter could be found, and the system introduced heavy distortion in gratings as coarse as 10 mm. The Pantograph Mark-II device having more favorable structural properties could reliably create gratings between 1 and 10 mm.","cites":"36","conferencePercentile":"96"},{"venue":"WHC","id":"5b285c659c2beb201280251cf3ac646c065ccbfd","venue_1":"WHC","year":"2005","title":"Increasing the Impedance Range of a Haptic Display by Adding Electrical Damping","authors":"Joshua Mehling, J. Edward Colgate, Michael A. Peshkin","author_ids":"2145718, 1700106, 1789986","abstract":"This work examines electrical damping as a means for improving haptic display performance. Specifically , electrical damping, like its mechanical counterpart , can significantly reduce the occurrences of limit cycle oscillations at high impedance boundaries in virtual environments. Furthermore, electrical damping has a number of advantages including its simplicity of design and the ease at which it can be made frequency dependent so that it does not adversely affect a de-vice's low impedance range. This work examines the theoretical behavior and practical application of frequency dependent electrical damping as it applies to haptic displays. Data is presented illustrating a significant increase in the range of virtual wall behaviors that a one degree-of-freedom device is capable of displaying when electrical damping is added.","cites":"32","conferencePercentile":"90.66666667"},{"venue":"WHC","id":"f7bb44e0179dd241242d002ae8097eb9326da798","venue_1":"WHC","year":"2007","title":"Proposal for tactile sense presentation that combines electrical and mechanical stimulus","authors":"Shinobu Kuroki, Hiroyuki Kajimoto, Hideaki Nii, Naoki Kawakami, Susumu Tachi","author_ids":"2982511, 1776927, 1736915, 1681291, 7688338","abstract":"This study proposes a combination of electrical and mechanical stimulation as a foundational method to realize a tactile display with a high temporal and spatial resolution. We further confirm the interaction between the electrical and mechanical stimulations. The interaction (1) lowers tactile threshold and (2) reduces the so-called \" electrical \" sensation. The results of this study may resolve certain practical difficulties with regard to electro-tactile displays.","cites":"8","conferencePercentile":"82.53968254"},{"venue":"WHC","id":"bb99de23ea8c4b4833cbbf3f2f6235588f43253e","venue_1":"WHC","year":"2007","title":"The Effect of Virtual Haptic Training on Real Surgical Drilling Proficiency","authors":"Christopher Sewell, Nikolas H. Blevins, Sumanth Peddamatham, Hong Z. Tan","author_ids":"5710800, 2978105, 2084043, 1698913","abstract":"This sketch presents the design and preliminary results of a study that investigates the transference of motor skills learned in a haptic-enabled virtual environment to performance on a surgically-relevant task in the real world. The chosen task, which requires skills similar to those needed in a number of surgical procedures, including stapedotomy and cochleostomy, is drilling holes through an eggshell using a surgical drill without penetrating the egg's inner membrane. Results reflect a learning curve for task proficiency and indicate a benefit to haptic training, but a planned follow-up study will be required for this claim to be statistically conclusive.","cites":"5","conferencePercentile":"65.07936508"},{"venue":"WHC","id":"ac68d774adc9393be44ba1d6ea2c07f9e645666e","venue_1":"WHC","year":"2005","title":"Perception of Short Tactile Pulses Generated by a Vibration Motor in a Mobile Phone","authors":"Topi Kaaresoja, Jukka Linjama","author_ids":"1718357, 2342103","abstract":"This paper describes an experimental setup and results of user tests focusing on the perception of temporal characteristics of vibration of a mobile device. The experiment consisted of six vibration stimuli of different length. We asked the subjects to score the subjective perception level in a five point Lickert scale. The results suggest that the optimal duration of the control signal should be between 50 and 200 ms in this specific case. Longer durations were perceived as being irritating.","cites":"22","conferencePercentile":"80"},{"venue":"WHC","id":"4089f955b5139cb1805c14d9c89918c7b4da3f91","venue_1":"WHC","year":"2009","title":"Feasibility study of a rotational haptic display - rotational action and measuring the rotational moment at the wrist -","authors":"Junji Sone, Yuuki Hosono, Tomoaki Nakajima, Katsumi Yamada, Kinya Fujita","author_ids":"1846242, 2394908, 3223565, 3984464, 1733141","abstract":"We are developing a wearable exoskeleton rotational haptic interface that will fit the human body. First, we developed a force sensor to measure the rotational moment of rotational tasks at the wrist and measured the rotational moment of important tasks. Then, we tried to develop a prototype of the exoskeleton rotational haptic interface .","cites":"0","conferencePercentile":"6.923076923"},{"venue":"WHC","id":"74fdc2668548fdc7ddbad14e53340ad4353151e3","venue_1":"WHC","year":"2007","title":"Large Area Sensor Skin based on Two-Dimensional Signal Transmission Technology","authors":"Hiromasa Chigusa, Yasutoshi Makino, Hiroyuki Shinoda","author_ids":"3297732, 1712395, 1715925","abstract":"In this paper, we propose a stretchable large area sensor skin based on Two-Dimensional Signal Transmission (2DST) technology. A small tactile sensor chip with stable non-contact connectors (Resonant Proximity Connector: RPC) to a 2DST sheet is developed. The sensor nodes communicate by microwave that propagates in a two-dimensional sheet. Sensor nodes connect to the 2DST sheet via RPCs without electrical contact anywhere on the sheet and also receive the power for operation from the microwave in the sheet. RPC is a spiral electrode whose total length is a quarter of the electromagnetic wavelength. The induced resonance around the electrode reduces the impedance between the connector and 2DST sheet, which allows sensor chips to connect to the 2DST sheet stably. Simulation results on spiral RPCs show that the concept is effective. We produce an on-off type tactile sensor element which consists of a RFID-tag and RPC, and experimentally confirm that the sensor element works in a stretchable 2DST sheet.","cites":"7","conferencePercentile":"78.57142857"},{"venue":"WHC","id":"41ad044a31c81f6815780a9fd2d88c415f6d5c2c","venue_1":"WHC","year":"2007","title":"Capturing the Dynamics of Mechanical Knobs","authors":"Colin Swindells, Karon E. MacLean","author_ids":"1794909, 5658688","abstract":"We present a novel experimental apparatus for the capture and replay of physical controls (mechanical knobs), as well as a set of acquired models and a design discussion related to the characterization approach taken here. Our work extends existing research by addressing problems surrounding identification of physical controls, including sensor gripping techniques for arbitrary target devices; and improved hardware and algorithm combinations for finer capture resolutions. Models were acquired from 5 real knobs, based on 2 nd order model fits to torque and kinematic results of swept-sine excitations.","cites":"6","conferencePercentile":"73.80952381"},{"venue":"WHC","id":"127820ec0d5c95d6dd0fffb38f0f1ae5307ba25c","venue_1":"WHC","year":"2007","title":"Frequency Analysis of the Detectability of Virtual Haptic Gratings","authors":"Steven A. Cholewiak, Hong Z. Tan","author_ids":"2217475, 1698913","abstract":"The tactile detectability of sinusoidal and square-wave virtual texture gratings were measured and analyzed. Using a three-interval one-up three-down adaptive tracking procedure, detection thresholds for virtual gratings were estimated using a custom-designed high position-resolution 3-degrees-of-freedom force-feedback haptic device. Two types of gratings were used, defined by sinusoidal and square waveforms, with spatial wavelengths of 0.2 to 25.6 mm. The results indicated that the participants demonstrated a higher sensitivity (i.e., lower detection threshold) to square-wave gratings than to sinusoidal ones at all the wavelengths tested. When the square-wave gratings were represented by the explicative Fourier series, it became apparent that the detectability of the square-wave gratings could be determined by that of the sinusoidal gratings at the corresponding fundamental frequencies. This was true for any square-wave grating as long as the detection threshold for the fundamental component was below those of the harmonic components.","cites":"2","conferencePercentile":"28.57142857"},{"venue":"WHC","id":"64062af8caceb092f091001cf475f9482353dcfc","venue_1":"WHC","year":"2009","title":"Efficient object exploration and object presentation in TeleTA, Teleoperation system with Tactile feedback","authors":"Dzmitry Tsetserukou, Susumu Tachi","author_ids":"3095699, 7688338","abstract":"In order to achieve awareness of collision during teleoperation and to support operator with valuable information (object stiffness and shape), we elaborated approaches to object parameter identification and delivering this information to the operator's skin through tactile display. The tactile sensory ability of the remote manipulator allows collision detection and exploration of contacting object. A new type of tactile display that accounts for effectiveness of the information presentation, power consumption, ergonomics, and usability for particular teleoperation task was developed. The experimental results of object shape and stiffness presentation to the human's forearm revealed the most efficient vibration patterns. 1 INTRODUCTION The paper focuses on the teleoperation system TeleTA (Teleoperetion system with wearable Tactile display on the operator arm surface providing Awareness about slave robot collision) designed by us to achieve high level of maneuverability of robot arm in unstructured dynamic environment and to perform cooperative tasks with humans in a safe manner. We announce several distinctive contributions in this paper. New remote robot and sensory system for the operation in cluttered environment were developed. Distributed optical joint torque sensors and local admittance controllers endow our robot arm with the distinctive capability of safe interaction with surroundings along entire manipulator surface (including joints). The applied force vector can be calculated from the values of joint torques and contact point coordinates. Master side (Fig. 1(a)) includes exoskeleton robot arm with 6 DOF (Fig. 1(b)) and tactile display BraTact to present cutaneous stimulation when collision with object is detected. The orientation of the human elbow is controlled by the tilt sensor. Teleoperated robot arm has 4-DOF: Roll, Pitch, Yaw joints of a shoulder, and Pitch joint of an elbow (Fig. 1(c)). Each joint is equipped with optical torque sensor directly connected to the output shaft of harmonic drive. Proposed sensory system of slave robot (tactile skin to detect contact point and torque sensors distributed into each joint for measurement of applied force) patterns on the human tactile system. Our sense of touch can be separated into kinesthetic and coetaneous. Kinesthetic stimulations, produced by forces exerted on body, are sensed by mechanoreceptors in the joints, tendons, and muscles enabling us to estimate forces being applied to body [1]. On the contrary, mechanoreceptors in the skin layers are responsible for cutaneous stimulation sensation that enables stimuli localization. The robot arm is covered with Kinotex tactile sensor measuring the pressure intensity through amount of backscattered light …","cites":"3","conferencePercentile":"40.76923077"},{"venue":"WHC","id":"b745ed464fb77cddf9fa4bee19078ac52fc768bc","venue_1":"WHC","year":"2007","title":"Design of a Haptic Zoom: levels and steps","authors":"Mounia Ziat, Olivier Gapenne, John Stewart, Charles Lenay, Jerome Bausse","author_ids":"1761745, 2373493, 3616341, 2401485, 3358359","abstract":"When the subjects handle a haptic zoom (kinaesthetic zoom through a sensory substitution device), they don't have any difficulty to make the distinction between a zoom-in and a zoom-out and this, while basing themselves on the number of pins activated under the finger. In a similar way to the visual zoom, the haptic zoom-in gives them access to the detail and to position themselves with precision on the object whereas the haptic zoom-out, less used, is used only to benefit of a global perception in order to better centre themselves on the objects present in the perception space. The second result underlines that the subjects do not handle more than 25 levels and this, even if they have the possibility of handling more (100 or 1000).","cites":"4","conferencePercentile":"55.55555556"},{"venue":"WHC","id":"07d94ce2ec464e40458d33b356bf9ea20f1e7d60","venue_1":"WHC","year":"2009","title":"Effects of magnitude and phase cues on human motor adaptation","authors":"Ali Israr, Hakan Kapson, Volkan Patoglu, Marcia Kilchenman O'Malley","author_ids":"1769549, 3037332, 1751652, 1793748","abstract":"Recent findings have shown that humans can adapt their internal control model to account for the changing dynamics of systems they manipulate. In this paper, we explore the effects of magnitude and phase cues on human motor adaptation. In our experiments , participants excite virtual second-order systems at resonance via a two-degree of freedom haptic interface, with visual and visual plus haptic feedback conditions. Then, we change the virtual system parameters and observe the resulting motor adaptation in catch trials. Through four experimental conditions we demonstrate the effects of magnitude and phase cues on human motor adaptation. First, we show that humans adapt to a nominal virtual system resonant frequency. Second, humans shift to higher and lower natural frequencies during catch trials regardless of feedback modality and force cues. Third, participants can detect changes in natural frequency when gain, magnitude, and phase cues are manipulated independently. Fourth, participants are able to detect changes in natural frequency when the feedback (visual or visual plus haptic) is delayed such that the phase shift between the nominal system and catch trial system is zero. The persistent ability of participants to perform system identification of the dynamic systems which they control, regardless of the cue that is conveyed, demonstrates the human's versatility with regard to manual control situations. We intend to further investigate human motor adaptation and the time for adaptation in order to improve the efficacy of shared control methodologies for training and rehabilitation in haptic virtual environments. 1 INTRODUCTION Humans frequently perform motor tasks that require interactions with external dynamic systems, such as driving a car or wielding a tool. Such systems may be underactuated or may have higher order control mappings, thereby requiring training in order for the human to learn proper control of the system [1,2]. For rhythmic tasks such as pumping a swing or bouncing a ball, the perception of the dynamic behavior of the external system directly affects the control input planned and executed by the user [3]. However, psychophysical analysis of actively controlled dynamic systems, which may shed light on the mechanisms used by humans to execute motor tasks, has received little attention. A broader understanding of human motor control could directly benefit researchers who develop training protocols or simulations to teach new motor skills. Virtual environments have been explored as a means to teach new motor skills in domains such as surgery, assembly, and pilot training. …","cites":"4","conferencePercentile":"54.61538462"},{"venue":"WHC","id":"0150a14d8db4579357d7b257f30f735f3715e0ec","venue_1":"WHC","year":"2005","title":"A First Investigation into the Effectiveness of Tactons","authors":"Lorna M. Brown, Stephen A. Brewster, Helen C. Purchase","author_ids":"1716874, 1721608, 1740156","abstract":"This paper reports two experiments relating to the design of Tactons (or tactile icons). The first experiment investigated perception of vibro-tactile \" roughness \" (created using amplitude modulated sinusoids), and the results indicated that roughness could be used as a parameter for constructing Tactons. The second experiment is the first full evaluation of Tactons, and uses three values of roughness identified in the first experiment, along with three rhythms to create a set of Tactons. The results of this experiment showed that Tactons could be a successful means of communicating information in user interfaces, with an overall recognition rate of 71%, and recognition rates of 93% for rhythm and 80% for roughness.","cites":"73","conferencePercentile":"100"},{"venue":"WHC","id":"b8db157c8020d514a345f1e86f6fe92fecdba210","venue_1":"WHC","year":"2007","title":"Time-Domain Passivity Control of Haptic Interfaces with Tunable Damping Hardware","authors":"Andrew H. C. Gosline, Vincent Hayward","author_ids":"3084480, 8113012","abstract":"We describe a time-domain passivity control methodology that uses programmable eddy current viscous dampers to prevent a user from extracting energy from a haptic interface. A passivity observer monitors the energy flow of the virtual environment, and damping hardware is used to remove any energy contributions from the virtual environment that violate passivity constraints. Experiments illustrate that the programmable physical damper method improves the performance of a haptic device that has minimal inherent dissipation.","cites":"6","conferencePercentile":"73.80952381"},{"venue":"WHC","id":"ebf162aea6554b3894dd8cc69381ded5242a7d81","venue_1":"WHC","year":"2007","title":"T-PaD: Tactile Pattern Display through Variable Friction Reduction","authors":"Laura Winfield, John Glassmire, J. Edward Colgate, Michael A. Peshkin","author_ids":"2398453, 2969892, 1700106, 1789986","abstract":"In this paper we discuss the theory, design and construction of a haptic display for creating texture sensations through variations in surface friction. Ultra-sonic frequency, low amplitude vibrations between two flat plates have been shown to create a squeeze film of air between the two plate surfaces thereby reducing the friction [1][2]. We show that a reduction of friction will also occur between a human finger and a vibrating plate. Thus, a vibrating plate can serve as a haptic interface. The amplitude of vibration can also be correlated to the amount of friction reduction between the plate and the finger. Varying the surface friction between the finger and the haptic interface is a way of indirectly controlling shear forces on the finger during active exploration. Using finger position and velocity feedback on the display allows for the creation of spatial texture sensations.","cites":"73","conferencePercentile":"99.20634921"},{"venue":"WHC","id":"0c56002a23d3b72efc6a2e4691eb19bf3312c9e2","venue_1":"WHC","year":"2009","title":"System improvements in Mobile Haptic Interface","authors":"In Lee, Inwook Hwang, Kyung-Lyong Han, Oh Kyu Choi, Seungmoon Choi, Jin S. Lee","author_ids":"1752383, 1791758, 2127564, 2926160, 1718126, 1762508","abstract":"A Mobile Haptic Interface (MHI), a force-feedback haptic interface with a mobile base, allows to render very large virtual objects in a safe and portable manner. In this paper, we present a novel MHI system, featured with: 1) extended horizontal workspace using a omni-directional mobile base, 2) extended vertical workspace using a linear lift, 3) high-accuracy estimation of the position of the haptic interface tool, 4) efficient motion planning algorithm to move the mobile base while avoiding collisions with the user and other objects, and 5) closed-loop force control to compensate the undesired effect of mobile base dynamics on the final rendering force perceived by the user. As a consequence, our MHI system can provide high quality haptic rendering of large virtual objects.","cites":"2","conferencePercentile":"26.92307692"},{"venue":"WHC","id":"51cea637a8254b1f8a4fb3bd221b3d6056a24ad8","venue_1":"WHC","year":"2005","title":"Event-Based Haptics and Acceleration Matching: Portraying and Assessing the Realism of Contact","authors":"Katherine J. Kuchenbecker, Jonathan Fiene, Günter Niemeyer","author_ids":"1716879, 1971080, 1762771","abstract":"Contact in a typical haptic environment resembles the experience of tapping on soft foam, rather than on a hard object. Event-based, high-frequency transient forces must be superimposed with traditional proportional feedback to provide realistic haptic cues at impact. We have developed a new method for matching the accelerations experienced during real contact, inverting a dynamic model of the device to compute appropriate force feedback transients. We evaluated this haptic rendering paradigm by conducting a study in which users blindly rated the realism of tapping on a variety of virtually rendered surfaces as well as on three real objects. Event-based feedback significantly increased the realism of the virtual surfaces, and the acceleration matching strategy was rated similarly to a sample of real wood on a foam substrate. This work provides a new avenue for achieving realism of contact in haptic interactions. Abstract Contact in a typical haptic environment resembles the experience of tapping on soft foam, rather than on a hard object. Event-based, high-frequency transient forces must be superimposed with traditional proportional feedback to provide realistic haptic cues at impact. We have developed a new method for matching the accelerations experienced during real contact, inverting a dynamic model of the device to compute appropriate force feedback transients. We evaluated this haptic rendering paradigm by conducting a study in which users blindly rated the realism of tapping on a variety of virtually rendered surfaces as well as on three real objects. Event-based feedback significantly increased the realism of the virtual surfaces, and the acceleration matching strategy was rated similarly to a sample of real wood on a foam substrate. This work provides a new avenue for achieving realism of contact in haptic interactions.","cites":"31","conferencePercentile":"89.33333333"},{"venue":"WHC","id":"1fd1d9ca5591c5269cb9a0c52a4d36dadc207bd8","venue_1":"WHC","year":"2005","title":"Multimodal Interaction in a Haptic Environment","authors":"Anton Nijholt, Sander Kole, Job Zwiers","author_ids":"1745198, 2021676, 3168259","abstract":"In this paper we investigate the introduction of haptics in a multimodal tutoring environment. In this environment a haptic device is used to control a virtual piece of sterile cotton and a virtual injection needle. Speech input and output is provided to interact with a virtual tutor, available as a talking head, and a virtual patient. We introduce the haptic tasks and how different agents in the multi-agent system are made responsible for them. Notes are provided about the way we introduce an affective model in the tutor agent.","cites":"0","conferencePercentile":"5.333333333"},{"venue":"WHC","id":"dec4ccc2f66e69e175a0ddf0a9142e7040f0ed85","venue_1":"WHC","year":"2009","title":"Vibrotactile score: A score metaphor for designing vibrotactile patterns","authors":"Jaebong Lee, Jonghyun Ryu, Seungmoon Choi","author_ids":"3174767, 2039840, 1718126","abstract":"Despite the plethora of vibrotactile applications that already have begun to impact our everyday life, how to design vibrotactile patterns easily and efficiently remains to be a challenge. In this paper, we introduce a vibrotactile score, an effective means for composing vibrotactile patterns. The vibrotactile score is a metaphor of the musical score to vibrotaction, and its design is adapted from two common musical scores (the piano score and the guitar tab-lature). Moreover, we developed an authoring tool, Vibrotactile Score Editor (VibScoreEditor), that fully supports the vibrotactile score with intuitive graphical user interface. Another metaphorical feature, vibrotactile clef (analogous to the musical clef), is incorporated in the editor to make the process of composing vibrotactile patterns decoupled from the process of considering the signal-level characteristics of vibration. A few examples of vibrotactile patterns designed using the VibScoreEditor are also presented.","cites":"6","conferencePercentile":"74.61538462"},{"venue":"WHC","id":"a6a1211cebf30157bc6bc6c687a1818cec93cdb2","venue_1":"WHC","year":"2007","title":"Where are we with Haptic Visualization?","authors":"Jonathan C. Roberts, Sabrina A. Panëels","author_ids":"1727068, 2704085","abstract":"There is a growing interest into non-visual forms of data communication, not only driven by the need for accessible representations but also because researchers are realizing the potential of understanding information better or differently through other modalities. Thus, haptic visual-ization is an immature but exciting area; it represents the abstract realization of information through the use of tac-tile or force-feedback devices. Through such a realization the user can gain quantitative, qualitative or nominal understanding of some underlying data. This paper presents the growth and development of haptic visualization, shows current trends, and acts as a snapshot of history. In fact, we remember the past based on temporal landmarks: we remember what we were doing when we heard the news of 9/11. Thus it is interesting and useful to look at the subject in the context of key events and seminal work. Moreover, it helps us to not re-invent the wheel: something that is far too common with interdisciplinary work. Thus, we take a holistic approach to the literature and place the research in context of important historic events and seminal work, which shows the reader where we have been, and points towards the future.","cites":"11","conferencePercentile":"87.3015873"},{"venue":"WHC","id":"3f2f89237f0db8f81cb6318d93f6499f85530ee4","venue_1":"WHC","year":"2005","title":"Tilt to Scroll: Evaluating a Motion Based Vibrotactile Mobile Interface","authors":"Ian Oakley, M. Sile O'Modhrain","author_ids":"1698507, 7680408","abstract":"The increasing complexity and pervasiveness of handheld devices is demanding the development of interaction techniques explicitly tailored for mobile scenarios. This paper examines one such technique: the use of device orientation to navigate through one dimensional lists or menus. We describe a novel input mapping, directly relating list position to device orientation, and two studies quantifying user performance with this system. We believe vibrotactile feedback will be significant in movement-based mobile interfaces, and also examine its influence. Our results indicate that both our input mapping and the inclusion of vibrotactile feedback positively affect user performance and experience. We conclude by discussing the design implications of this work.","cites":"35","conferencePercentile":"94.66666667"},{"venue":"WHC","id":"aafc61bb8b1c66b0f79d8ed7f717de7db63b70c6","venue_1":"WHC","year":"2005","title":"Effects of DOF Separation on Elastic Devices for the Navigation in 3D Virtual Environments with Force Feedback","authors":"Géry Casiez, Christophe Chaillou","author_ids":"3051289, 1774410","abstract":"We investigated the use of a new haptic device called DigiHaptic in a 3D navigation task. Unlike other devices intended to interact in 3D with one end-effector, the Digi-Haptic has three levers that the user may handle simultaneously or not in elastic mode to rate control objects. We compared it to the SpaceMouse-another elastic device-to evaluate the influence that degrees of freedom (DOF) separation and force feedback have in terms of accuracy (errors) and speed (time) in a 3D navigation task. We found that users performed the task with the same amount of time on both devices but that DOF separation increases the control accuracy of the camera.","cites":"2","conferencePercentile":"24"},{"venue":"WHC","id":"ab303e5b5a34abe45046cebf717349ad43084c38","venue_1":"WHC","year":"2007","title":"Experiments in Planar Haptic Contour Exploration","authors":"Kee-Yip Chan, Kelly Kitagawa, Roberto Manduchi","author_ids":"1785872, 2276644, 1737048","abstract":"We present some experimental results concerning exploration of planar contours (more specifically, polygons) using a 2–D haptic device, the Logitech Wingman mouse. With respect to previous work, our project focused on improving the contour tracing experience using the effects provided by the Immersion TouchSense API.","cites":"0","conferencePercentile":"5.555555556"},{"venue":"WHC","id":"ebe0a4cfe67f7e6cc171419035c43eaff94ed03e","venue_1":"WHC","year":"2005","title":"Effect of Cognitive Load on Tactor Location Identification in Zero-g","authors":"Anu Bhargava, Michael Scott, Ryan Traylor, Roy Chung, Kimberly Mrozek, Jonathan Wolter, Hong Z. Tan","author_ids":"1704769, 5835371, 1719155, 1724267, 1688685, 1695834, 1698913","abstract":"A wearable haptic interface has been developed to impart vibrotactile information to its user with the goal of improving situation awareness. The effectiveness of the haptic interface has been evaluated in three experiments aboard the NASA KC-135A reduced gravity aircraft. During the third flight, subjects identified the locations of tactors embedded in the haptic display in a microgravity environment. We report our results on how cognitive load affects one's ability to identify the locations of vibrotactile stimulations in the altered-gravity environment. Cognitive load was manipulated by requiring subjects to be strapped to the floor of the KC-135 (low cognitive-load condition) or allowing them to float freely in microgravity (high cognitive-load condition). It was found that tactor-location identification was more accurate in the low cognitive-load condition than in the high cognitive-load condition. Our results have implications for the design of multimodal user interfaces in general.","cites":"9","conferencePercentile":"57.33333333"},{"venue":"WHC","id":"420261b63fb465b06791eaaf67605127f829d435","venue_1":"WHC","year":"2005","title":"Learning and Identifying Haptic Icons under Workload","authors":"Andrew Chan, Karon E. MacLean, Joanna McGrenere","author_ids":"4839365, 5658688, 1713735","abstract":"This work addresses the use of vibrotactile haptic feedback to transmit background information with variable intrusiveness, when recipients are engrossed in a primary visual and/or auditory task. We describe two studies designed to (a) perceptually optimize a set of vibrotactile \"icons\" and (b) evaluate users' ability to identify them in the presence of varying degrees of workload. Seven icons learned in approximately 3 minutes were each typically identified within 2.5 s and at 95% accuracy in the absence of workload.","cites":"46","conferencePercentile":"98.66666667"},{"venue":"WHC","id":"d89f4293702c1c60eab3890ec70e80d66f278d7b","venue_1":"WHC","year":"2009","title":"Determining appropriate parameters to elicit linear and circular apparent motion using vibrotactile cues","authors":"Masataka Niwa, Robert W. Lindeman, Yuichi Itoh, Fumio Kishino","author_ids":"2059619, 1719686, 1707181, 3289052","abstract":"This paper reports on two experiments we conducted to look at how to design effective linear and circular apparent-motion displays. Using a two-tactor array on the upper arm, the first study found that a time interval of greater than 400ms before repeating the directional sequence is required for subjects to achieve 95 % proficiency of direction identification over a range of Duration of Stimulus (DOS) and Stimulus Onset Asynchrony (SOA) values. The second study looked at the number of tactors necessary in a circular tactor array on the upper arm for people to correctly identify the direction of the rotation. We found that subjects could achieve a proficiency approaching 100 % across a large range of DOS and SOA values with four tactors, using a circuit-completion time of 400ms or longer. These findings can be used by interface designers to realize information displays that either stand on their own, or work in combination with visual and/or audio displays. 1 INTRODUCTION One can provide additional information to visual and audio displays using vibrotactile stimulation. Alternatively, vibrotactile stimulation can be used in situations where visual or audio displays are inappropriate. The use of vibrotactile stimulation is especially useful in conditions where the user is attending to other tasks or displays, as it stimulates the skin, which has a much larger stimulation field than the eyes or ears. Finally, vibrotactile stimulation is useful in situations where information should be displayed in a private manner, such as in public spaces. With regard to vibrotactile displays, much research has been done in the area of sensory substitution, but often these devices are large in size, such as TVSS [1]. More recently, many consumer devices, such as mobile phones and video-game controllers, incorporate simple DC-motor-type vibration units (tactors) that are readily available, inexpensive to purchase, and relatively easy to control using straightforward circuitry. Because of these factors, there has been a resurgence of research into the use of vibrotactile stimulation. For example, Rupert [2] used a vest with tactors sewn into it to relay gravity information to pilots performing aerial maneuvers. Piateski & Jones [3] used tactor arrays on the arm and torso to aid users in navigation tasks. Brown et al. [4] used rhythmic patterns and changes in amplitude to explore the use of multiple vibration attributes to relay information to the fingertips. Our own previous work [5] suggests that information displays using apparent motion …","cites":"4","conferencePercentile":"54.61538462"},{"venue":"WHC","id":"ea1db0fb291821cc8a8b837edd36afdcbdb2626e","venue_1":"WHC","year":"2005","title":"Improving User Comfort in Haptic Virtual Environments through Gravity Compensation","authors":"Renaud Ott, Mario Gutiérrez, Daniel Thalmann, Frédéric Vexo","author_ids":"2625593, 1696903, 1689760, 1699529","abstract":"Our experience with a Haptic Workstation™ has shown that this device is uncomfortable to use during long sessions. The main reason is the uncomfortable posture of the arms, which must be kept outstretched horizontally while supporting the weight of an exoskeleton. We describe Zero-G, a real-time weight compensation system aimed at improving user comfort by compensating for the weight of both the exoskeleton and arms (zero gravity illusion). We present experimental results complemented with electro myography measures (EMG) as an indicator of muscular activity/fatigue. Our tests show how Zero-G exerts a positive influence on the reduction of muscular fatigue when using a Haptic Workstation™. To introduce the work we present in this article we must refer to two apparently unrelated concepts: user comfort and simulation of gravity. Looking for enhancing the user comfort under virtual environments with haptic feedback, we ended up with a gravity simulation system. The rationale is the following: our experience with haptic interfaces using a Haptic Workstation™ showed that this device is difficult to use during long sessions. One of the main reasons was the muscular fatigue induced by the uncomfortable posture to be adopted while using the workstation (two-arms exoskeleton). The user manipulates virtual objects in a workspace located in front of him. This requires outstretching both arms horizontally, supporting the weight of the arms themselves and the exoskeleton. The approach we followed consisted on compensating for the weight of the device and the arms. We developed a gravity compensation system called Zero-G: it creates the sensation of working under a zero gravity environment by means of applying vertical-component forces on the wrists. Next section presents a brief overview of our research work involving a Haptic Workstation™ (fully immersive virtual environments (VE) with haptic feedback) and our observations concerning the lack of user comfort when using this device. The rest of the article elaborates on the problem of evaluating comfort and the solution we have implemented. First we show objective measures of the muscular fatigue induced by the use of a Haptic Workstation™. Then we describe Zero-G, the weight compensation system we developed to overcome this problem. The paper ends by presenting experimental results showing the positive effects of Zero-G on reducing muscular fatigue and creating the illusion of a zero gravity environment. Our experience with haptic interfaces is based on the development of novel applications using a Haptic Worksta-tion™. We have proposed the use …","cites":"9","conferencePercentile":"57.33333333"},{"venue":"WHC","id":"065cfa872414c659d3d9fdb845a8d60378a3352c","venue_1":"WHC","year":"2007","title":"Experimental Evaluation of Attachment Methods for a Multifinger Haptic Device","authors":"Regina Donlin, Rainer Leuschke, Blake Hannaford","author_ids":"2319836, 2657526, 2036485","abstract":"Due to the nature of touch sensation, the interface between a user and a haptic device must be carefully designed and selected such that the user feels they are directly manipulating a virtual object. This is particularly critical for attachment of fingertips to a multi fingered device. We experimentally tested eight methods of attachment for a Multifinger Haptic Device (MFHD) previously developed in our lab. From the test we gathered objective and subjective data on force and user preference. Based on this data we were able to evaluate the quality of the attachment methods.","cites":"2","conferencePercentile":"28.57142857"},{"venue":"WHC","id":"8f612dc30b3fe6b3cd168db3fa8eb188b1e5795b","venue_1":"WHC","year":"2009","title":"The ultimate haptic device: First step","authors":"Guillaume Millet, D. Sinan Haliyo, Stéphane Régnier, Vincent Hayward","author_ids":"2376842, 1753386, 8127565, 8113012","abstract":"We describe a single-axis haptic interface which is based on a dual-stage actuator technique and which is aimed at achieving perfect transparency to a human user. The paper shows how all parasitic forces arising from inertia and friction can be brought below human detection thresholds, yet, the system is able to output significant torque. It has a stage with a large motor coupled to a distal stage with a smaller motor via a viscous coupler based on the principle of eddy current induction. The paper also describes its control principle and preliminary results. 1 INTRODUCTION The ultimate haptic device has no mass and has infinite bandwidth. In an effort to approach this ideal, it is worth considering what bounds performance above, that is, what is the maximum performance that can possibly be achieved, and what bounds it under, that is, how good performance should be. In the area of force feedback devices, the actuator performance is what bounds the performance above. With a given actuator, no manner how well transmissions and linkages, if any, are designed, these elements can only degrade key aspects of performance such as the dynamic range (ratio of the largest to the smallest specifiable force), the stiffness of the connection between the prime mover and the manipulandum, or the end-point inertia. In this paper, we describe an approach to the design and construction of a single-axis haptic interface prototype that can cover a significant portion of the range of human sensorimotor performance. Perhaps, the most relevant aspect of human performance with respect to haptic device design, is the smallest human-detectable force. In an ideal device, the smallest detectable force should match the smallest force that can be commanded by the device and the largest force should match the normal operation of the human hand. While actuator saturation (long and short term) is clearly the factor that determines the upper limit of the range, the determination of the lower limit merits some discussion. When a manipulandum interacts with a hand, it is subject to a number of forces (to simplify the discussion, for now no distinction is made between forces and torques). If we can neglect the effect of internal elastic forces, that is, if the device operates below its first resonant mode, these forces are: the actuator force, typically a Lorentz force developed in the motor windings; the forces due to viscous and friction losses","cites":"9","conferencePercentile":"86.15384615"},{"venue":"WHC","id":"c559f586a5dd967a364618fe06c651c63b625eb9","venue_1":"WHC","year":"2007","title":"Tactile Perception of Rotational Sliding","authors":"William R. Provancher, Brandt D. Erickson, Federico Barbagli, Hong Z. Tan","author_ids":"1728218, 3269135, 1768969, 1698913","abstract":"We present a new tactile display for rendering rotational friction at the fingertips. To inform the design and control of this device, we have conducted an initial set of perceptual experiments to investigate perceptual thresholds for rates of rotational slipping at the fingertips. It was found that humans can discriminate a change in rotational sliding rate of 4.13-28.04 rad/sec from a reference rate of 1.57-25.13 rad/sec. An initial device design and prototype are presented. The device utilizes a small friction disk housed in a thimble, driven remotely from a motor worn on the user's wrist. The device directly integrates with a robotic force feedback arm, preserving the force feedback functionality while adding the tactile information on frictional sliding. Insights from the presented psychophysical experiments and initial device prototype will be utilized in the design of the next generation of rotation friction devices that will be used in multi-finger grasp studies.","cites":"2","conferencePercentile":"28.57142857"},{"venue":"WHC","id":"2fe1079663ee5afc75d2b00d7d9843aeb6b498eb","venue_1":"WHC","year":"2007","title":"Improvement of Shape Distinction by Kinesthetic-Tactile Integration","authors":"Katsunari Sato, Hiroyuki Kajimoto, Naoki Kawakami, Susumu Tachi","author_ids":"2183140, 1776927, 1681291, 7688338","abstract":"The sensation of touch is divided into kinesthetic and tactile sensation. It is important for a touch sensation device to present both types of sensations. We mounted an electrotactile display on a kinesthetic display, and realized a compact display of touch sensation. This system can improve the ability to identify objects. In this paper, we evaluate the effect of integrating kinesthetic and electrotactile sensations for identifying the shape of an object.","cites":"5","conferencePercentile":"65.07936508"},{"venue":"WHC","id":"9bfe7780b57172417608bfe2b990fc8d1349c688","venue_1":"WHC","year":"2005","title":"Tactile Change Detection","authors":"Alberto Gallace, Hong Z. Tan, Charles Spence","author_ids":"2508045, 1698913, 1808149","abstract":"Interest in the use of tactile information displays has grown rapidly in recent years. However, relatively little research has been conducted to explore any cognitive and/or attentional limitations that may be inherent when using the body as a receptor surface for the transmission of information. In the present study, participants attempted to detect changes to tactile patterns presented sequentially on the body surface. The patterns consisted of 1-3 vibrotactile stimuli presented for 200ms with a blank interstimulus interval of 800ms. The pattern of tactile stimulation was repeatedly changed (alternating between two different patterns) on 50% of the trials, while no change occurred on the remaining trials. The results showed that participants often failed to detect the changes to the consecutively-presented tactile patterns. This finding may reflect a tactile equivalent of the phenomenon of change blindness reported in previous visual studies. The implications of these finding for human tactile interface design are discussed.","cites":"15","conferencePercentile":"76.66666667"},{"venue":"WHC","id":"9cdedfd657730ff40d234f0d396a174cc63528cd","venue_1":"WHC","year":"2007","title":"An Eyetracker Study of the Haptic Cuing of Visual Attention","authors":"Chanon M. Jones, J. Jay Young, Rob Gray, Charles Spence, Hong Z. Tan","author_ids":"2197378, 2737152, 1803050, 1808149, 1698913","abstract":"We investigated the haptic cuing of visual attention using spatially-predictive (75% valid) and spatially-nonpredictive (25%) haptic cues. The participants performed a visual change detection task immediately following a haptic spatial cue whose location corresponded to one of the four visual quadrants. The participants were explicitly instructed to use the spatially-predictive haptic cues but to try and ignore the spatially-nonpredictive cues. In addition to reaction time (RT) data, we recorded participants' eye-position in order to provide a direct measure of overt visual attention. The results indicated that the spatially-predictive haptic cues reduced the amount of time taken to detect the visual changes, as expected. The spatially-nonpredictive cues increased visual search latencies, indicating that the cues could not be ignored completely. There was also evidence that haptic cuing served to alert the participants resulting in an overall reduction of response latencies.","cites":"3","conferencePercentile":"43.65079365"},{"venue":"WHC","id":"c7f31f9831827daf798cfcdd8b34db900720c237","venue_1":"WHC","year":"2007","title":"The Effect of Weight on the Perception of Vibrotactile Intensity with Handheld Devices","authors":"Hsin-Yun Yao, Vincent Hayward, Juan Manuel Cruz-Hernández, Danny Grant","author_ids":"1788820, 8113012, 1804363, 1804884","abstract":"The objective of this study was to determine whether the weight of a vibrating handheld object influenced the perceived intensity of its vibrations. Experiments were conducted to determine the subjective equivalence of vibrotac-tile intensity for objects that had the same size but had different weights. The results suggest that for the same surface acceleration and hence the same movement, the heavier is the device, the stronger is the perceived intensity.","cites":"1","conferencePercentile":"15.87301587"},{"venue":"WHC","id":"2bab4bcc5f2a100e5de4b88db20aa5e4fb579835","venue_1":"WHC","year":"2007","title":"Haptic Feedback Enhances Force Skill Learning","authors":"Dan Morris, Hong Z. Tan, Federico Barbagli, Timothy Chang, John Kenneth Salisbury","author_ids":"1779342, 1698913, 1768969, 2871243, 1772984","abstract":"This paper explores the use of haptic feedback to teach an abstract motor skill that requires recalling a sequence of forces. Participants are guided along a trajectory and are asked to learn a sequence of one-dimensional forces via three paradigms: haptic training, visual training, or combined visuohaptic training. The extent of learning is measured by accuracy of force recall. We find that recall following visuohaptic training is significantly more accurate than recall following visual or haptic training alone, although haptic training alone is inferior to visual training alone. This suggests that in conjunction with visual feedback, haptic training may be an effective tool for teaching sensorimotor skills that have a force-sensitive component to them, such as surgery. We also present a dynamic programming paradigm to align and compare spatiotemporal haptic trajectories.","cites":"73","conferencePercentile":"99.20634921"}]}