{"WHICEB.csv":[{"venue":"WHICEB","id":"0b9bb755db0273ac68b28e0e4bdee9859e5cdd14","venue_1":"WHICEB","year":"2014","title":"The Psychic Distance of the Enterprise Internationalization","authors":"Jun Zhang","author_ids":"1752214","abstract":"Firstly, this article defines the basic concept of the psychic distance, analyzes the influencing factors of psychic distance and establishes an evaluation model based on fuzzy comprehensive evaluation on the basis of psychic distance. On this basis, the paper made it clear that the psychic distance is an important factor to affect international development of enterprises. When enterprises want to enter the international market, they should choose the national market which perceptual similarity, namely the psychic distance similar country market access to enter.","cites":"0","conferencePercentile":"50"},{"venue":"WHICEB","id":"8a0cc12813111f12c4d6ae22403aab88cd24181d","venue_1":"WHICEB","year":"2014","title":"The analytic network processes method & fuzzy cognitive map method in decision making: a comparative study","authors":"Ling Zhang, Xiaodong Qiao, Lijun Zhu","author_ids":"1712174, 2251156, 5366786","abstract":"The analytic network processes method & fuzzy cognitive map method in decision making: a comparative study\" (2014). Abstracts: Decision making problems always puzzled managers and decision makers in enterprises or organizations. There are many useful soft operation research methods could solve the complicated problem. The paper raises two classic approaches ANP (Analytical network process) and FCM (Fuzzy cognitive map). Those two methods have some similarities and differences. In thus, according to different decision problems, people could compare the two approaches' characteristics and choose the best tool to deal with the problems. At the end of the paper, a case study has been given for us.","cites":"0","conferencePercentile":"50"},{"venue":"WHICEB","id":"58b21dc0f03607a56fa36979d31806517407c8a9","venue_1":"WHICEB","year":"2012","title":"A Study on the Competitiveness of Chinese Nonferrous Metals Industry Based on Principle Component Analysis","authors":"Lin Sun, Canhua Kang, Yanlin Sun","author_ids":"1750501, 1957725, 2413755","abstract":"Based on the theories of regional economics and industrial economics, the paper analyzed the development of China nonferrous metals industry, made summary of the current research on industrial competitiveness, built an evaluation index system from the four areas: scale competitiveness, market competitiveness, benefit competitiveness and export competitiveness. Then, with the tool of SPSS, the paper conducted principal component analysis to evaluate the competitiveness of China's nonferrous metals industry. The principal component analysis showed that 2 principle components, named as market competitiveness and benefit competitiveness, can be extracted to evaluate china's nonferrous industrial competitiveness. It is concluded that the competitiveness of Chinese nonferrous metals industry has been improving, and it also came up some suggestions on how to further improve the competitiveness of Chinese nonferrous metals industry from the two areas: adjust the industrial structure and improve the technological level.","cites":"0","conferencePercentile":"48.38709677"},{"venue":"WHICEB","id":"5a69fdc183e3430f8b41e1cc4cb3656236df21b0","venue_1":"WHICEB","year":"2012","title":"Empirical Study on the Preference of Shareholding of Institutional Investors after Split Share Structure Reform","authors":"Jing Li","author_ids":"1742253","abstract":"Since the 1960s, rapid development of institutional investors is a prominent feature of global financial market. In china, full circulation of stock will realize after the completion of Split Share Structure Reform. Under the circumstance of institutional investors holding a large scale of stock, will they change their invest style? Whether they place more emphasis on value investment and concerning about long-term development of their enterprises or utilize their advantage of controlling large scale of capital, continue to use \"dominate\" and \"speculation\" methods to seek short-term interests? In this paper, we focus on institutional investor's preference for stocks, trying to find certain evidence from their stock preference to judge whether the institutional investors were intended to make long-term investment or short-term investment when they invested in stocks. Here we used the stocks holding by institutional investors at the end of the fourth quarter from 2003 to 2007 to perform empirical analysis. The regression results of non-equilibrium panel data model indicate that there is a definite positive correlation between market value of negotiable shares and the rate of shareholdings by institutional investors. Our conclusion support the statement that institutional investors were preferred to holding large capitalization stocks. The volatility of large capitalization stocks are less than small capitalization stocks, and the information disclosure degree of large capitalization stocks is higher than small capitalization stocks. Therefore, the actions of institutional investors prefer large capitalization stocks indicates that when they were selecting the stock, they didn't intended to perform short-term \" speculation \" , but to long-term investment.","cites":"0","conferencePercentile":"48.38709677"},{"venue":"WHICEB","id":"18438a8388db9588a07ecb6b58ee254ce3d6ce44","venue_1":"WHICEB","year":"2012","title":"Overall Development of Logistics in Wuhan Urban Agglomeration and Its Influence to Regional Economy","authors":"Gang Liu, Liwei Zhang","author_ids":"1697913, 3033210","abstract":"The regional economy and the regional logistics are interdependent unity, the coordinated development of the two aspects have important significance on the ascension of regional overall competitiveness. With the development of the central region strategy step by step, Wuhan urban agglomeration has good economic environment for the developing of regional logistics. Since the 11th Five-year Development Program implemented, the regional economy of Wuhan urban agglomeration will also have been leading local logistics to higher level. By analyzing the economic relationship between the latest 10 years' GDP and the amounts of goods turnover in Wuhan urban agglomeration, the result shows that the development of regional logistics has an influence on regional economy. At last the have put forward suggestions for the development of regional logistics in Wuhan urban agglomeration.","cites":"0","conferencePercentile":"48.38709677"},{"venue":"WHICEB","id":"536c9700d440a7816b1fca8e906d69093d2f5a89","venue_1":"WHICEB","year":"2012","title":"How to Retain Your Customers: The Impact of Consumer Trust and Commitment in E-marketplaces","authors":"Wei Wang, Rui Chen","author_ids":"1706612, 1721559","abstract":"Retaining your customers is important for E-sellers to survive in the intensified competitive e-marketplace. We approach this issue from the perspective of \" continuance intention \" , a behavior intention that describes the willingness of customers to continue transacting with sellers. Drawing upon the trust-commitment theory, as well as institution-based trust factors, we examine two types of trustees, EC platform and individual E-sellers, in the process of maintaining customers in e-marketplaces. A model is theoretically developed to understand customers' continuance intention to do business with specific E-sellers on an EC platform. An empirical study was conducted in three public universities to validate the model. The results suggest that affective commitment and calculative commitment jointly nurture customers' continuance intention. In addition, five factors of institution-based trust strongly influence trust in EC platform, and then transfers to trust in individual E-sellers.","cites":"0","conferencePercentile":"48.38709677"},{"venue":"WHICEB","id":"c799427c23210b16a8fca3b5196afe88547ae1d8","venue_1":"WHICEB","year":"2012","title":"An Empirical Study of Sentiment Analysis for Chinese Microblogging","authors":"Zhiming Liu, Lu Liu, Hong Li","author_ids":"2051785, 1700049, 4117903","abstract":"This paper used three machine learning algorithms, three kinds of feature selection methods and three feature weight methods to study the sentiment classification for Chinese microblogging. The experimental results indicate that the performance of SVM is best in three machine learning algorithms; IG is the better feature selection method compared to the other methods, and TF-IDF is best fit for the sentiment classification in Chinese microblogging. Combining the three factors the conclusion can be drawn that the performance of combination of SVM, IG and TF-IDF is best.","cites":"0","conferencePercentile":"48.38709677"}]}