{"Whole_Body_Interaction.csv":[{"venue":"Whole Body Interaction","id":"aa21a8b3de2ac26a650cbf29e02f190cd79c04b0","venue_1":"Whole Body Interaction","year":"2011","title":"Gesture-Based Interfaces: Practical Applications of Gestures in Real World Mobile Settings","authors":"Julie Rico Williamson, Andrew Crossan, Stephen A. Brewster","author_ids":"1685831, 2235196, 1721608","abstract":"In the past, the design of gesture-based interfaces has focused on issues of gesture recognition with consideration of social or practical factors that affect the ability of users to perform gestures on the go largely missing. This work describes two important aspects of gestures design for mobile gesture and body-based interaction. First, this paper discusses the social acceptability of using gesture-based interfaces in the variety of locations where mobile interfaces are used. This includes a discussion of a variety of methods that can be used to evaluate social acceptability early on in the development process. Second, this paper discusses the practical implications of creating gesture recognition using accelerometer based sensing given the challenges of gesturing in mobile situations. This includes a discussion of body-based interactions and the scenarios where these might be used successfully.","cites":"2","conferencePercentile":"66.66666667"},{"venue":"Whole Body Interaction","id":"f74c1b4f0ed3de20e5567d6292463273eeb440a9","venue_1":"Whole Body Interaction","year":"2011","title":"Capacitive Sensors for Whole Body Interaction","authors":"Raphael Wimmer","author_ids":"3231762","abstract":"Capacitive proximity sensors can be used to implement a variety of expressive input devices. They are especially suitable for Whole Body Interaction as they are small, robust, flexible, and can be both worn on the body or embedded into the environment. This chapter discusses technical challenges that arise when using capacitive sensors for tracking human motion, namely sensor shielding and ensuring both low latency and high sensitivity. A custom sensor design and an adaptive moving average filter presented here address these challenges. Two user studies evaluated these sensors as input modalities for different computer games. They found evidence that capacitive sensors offer a friendly but challenging behavior , being easy to learn but hard to master.","cites":"7","conferencePercentile":"100"}]}