{"WICON.csv":[{"venue":"WICON","id":"42f8cecb1a06db07b26c4f435f7ad96be14979d5","venue_1":"WICON","year":"2008","title":"Traffic-aware dynamic spectrum access","authors":"Lei Yang, Lili Cao, Haitao Zheng, Elizabeth M. Belding-Royer","author_ids":"3453824, 6992728, 5053008, 2377614","abstract":"— Demand-driven spectrum allocation can drastically improve performance for WiFi access points struggling under increasing user demands. While their frequency agility makes cognitive radios ideal for this challenge, performing adaptive spectrum allocation is a complex and difficult process. In this work, we propose FLEX, an efficient spectrum allocation architecture that efficiently adapts to dynamic traffic demands. FLEX tunes network-wide spectrum allocation by access points coordinating with peers, minimizing network resets through local adaptations. Through detailed analysis and experimental evaluation, we show that FLEX converges quickly, provides users with proportional-fair spectrum usage and significantly outperforms existing spectrum allocation proposals.","cites":"18","conferencePercentile":"95.34883721"},{"venue":"WICON","id":"6f6b24f166768f871b76f260564b9498dc952989","venue_1":"WICON","year":"2008","title":"Constructing accurate, space-efficient, wireless coverage maps for vehicular contexts","authors":"David Naveen Cottingham, Robert K. Harle, Andy Hopper","author_ids":"3084709, 6080964, 1769174","abstract":"Wireless connectivity for vehicles is a fast-growing market, with a plethora of different network technologies already in use. Surveys of the numbers of IEEE 802.11b/g access points in cities point to hundreds to thousands of networks within each square kilometre, with coverage areas that are not easily predicted due to the complexities of the urban environment. In order to take advantage of the diversity in wireless networks available, we need data concerning their coverage. Methods of generating such coverage maps that are accurate, space-efficient and easy to query are not a well addressed area. In this paper, we present and evaluate, using a large corpus of real-world data, novel algorithms for processing large quantities of signal strength values into coverage maps that satisfy such requirements.","cites":"2","conferencePercentile":"37.20930233"},{"venue":"WICON","id":"685d39ced4ebe70da9bd3b918827e3bd995e74af","venue_1":"WICON","year":"2008","title":"The impact of link-layer retransmissions on video streaming in wireless mesh networks","authors":"An Chan, Sung-Ju Lee, Xiaolin Cheng, Sujata Banerjee, Prasant Mohapatra","author_ids":"1793610, 5273011, 3905181, 1733676, 1697868","abstract":"Link-layer retransmission is a feature of IEEE 802.11 protocol that aims to increase the reliability of data communications. However, when successive retransmissions fail, retransmissions add to the traffic congestion, raise the collision probability, and increase the end-to-end delay. Using our 4-hop wireless mesh network testbed, we evaluate the impact of link-layer retransmissions on the performance of video streaming in wireless multi-hop environment. Our experimental results show that when the traffic load is near the network capacity, retransmissions cause erratic video quality and increase the end-to-end delay tremendously. When the best-effort traffic coexists, increasing the number of retransmissions degrades the goodput of best-effort traffic and increases the end-to-end delay of video streaming. Retransmissions add reliability and increases the video streaming quality when the traffic volume is far below the network capacity limit.","cites":"5","conferencePercentile":"61.62790698"},{"venue":"WICON","id":"3e81b29ac8c4e1de71ccc87ace4138756b9c03f3","venue_1":"WICON","year":"2006","title":"People-centric urban sensing","authors":"Andrew T. Campbell, Shane B. Eisenman, Nicholas D. Lane, Emiliano Miluzzo, Ronald A. Peterson","author_ids":"1690035, 2109269, 2772904, 3325038, 2062264","abstract":"The vast majority of advances in sensor network research over the last five years have focused on the development of a series of small-scale (100s of nodes) testbeds and specialized applications (e.g., environmental monitoring, etc.) that are built on low-powered sensor devices that self-organize to form application-specific multihop wireless networks. We believe that sensor networks have reached an important crossroads in their development. The question we address in this paper is how to propel sensor networks from their small-scale application-specific network origins, into the commercial mainstream of people's every day lives; the challenge being: how do we develop large-scale general-purpose sensor networks for the general public (e.g., consumers) capable of supporting a wide variety of applications in urban settings (e.g., enterprises, hospitals, recreational areas, towns, cities, and the metropolis). We propose <i>MetroSense</i>, a new people-centric paradigm for urban sensing at the edge of the Internet, at very large scale. We discuss a number of challenges, interactions and characteristics in urban sensing applications, and then present the MetroSense architecture which is based fundamentally on three design principles: network symbiosis, asymmetric design, and localized interaction. The ability of MetroSense to scale to very large areas is based on the use of an <i>opportunistic sensor networking</i> approach. Opportunistic sensor networking leverages mobility-enabled interactions and provides coordination between people-centric mobile sensors, static sensors and edge wireless access nodes in support of opportunistic sensing, opportunistic tasking, and opportunistic data collection. We discuss architectural challenges including providing sensing coverage with sparse mobile sensors, how to hand off roles and responsibilities between sensors, improving network performance and connectivity using adaptive multihop, and importantly, providing security and privacy for people-centric sensors and data.","cites":"184","conferencePercentile":"100"},{"venue":"WICON","id":"e620601d856435427d8e53ccbe85deaf6da256c9","venue_1":"WICON","year":"2010","title":"On Infostation Density of Vehicular Networks","authors":"Vinod Kone, Haitao Zheng, Antony I. T. Rowstron, Ben Y. Zhao","author_ids":"2886677, 5053008, 1710239, 1972108","abstract":"—Vehicle-to-Vehicle and Vehicle-to-Roadside communications are going to become an indispensable part of the modern day automotive experience. For people on the move, vehicular networks can provide critical network connectivity and access to real-time information. Infostations play a vital role in these networks by acting as gateways to the Internet and by extending network connectivity. In this context, an important question is \" What is the minimum number of infostations that need to be deployed in an area in order to support vehicular applications? \" Optimizing infostation density is vital to understanding and reducing the cost of deployment and management. In this paper, we examine the required infostation density in a highway scenario using different data dissemination models. We start from a simple analysis that captures the required density under idealized assumptions. We then run detailed QualNet simulations on both controlled and realistic vehicular traces to observe the information density trends in practical environments, and consequently propose techniques to improve dissemination performance and reduce the required infostation density.","cites":"6","conferencePercentile":"70.83333333"},{"venue":"WICON","id":"1c7783dc501b0f570a58ce7ad214750c5b6e3481","venue_1":"WICON","year":"2010","title":"GA-MIP: Genetic Algorithm based Multiple Mobile Agents Itinerary Planning in Wireless Sensor Networks","authors":"Wei Cai, Min Chen, Takahiro Hara, Lei Shu","author_ids":"1712547, 1711628, 1697569, 3621967","abstract":"—It has been proven recently that using Mobile Agent (MA) in wireless sensor networks (WSNs) can drastically help to obtain the flexibility of application-aware deployment. Normally, in any MA based sensor network, it is an important research issue to find out an optimal itinerary for the MA in order to achieve efficient and effective data collection from multiple sensory data source nodes. In this paper, we firstly investigate a number of conventional single MA itinerary planning based schemes, and then indicate some shortcomings of these schemes, since only one MA is used by them. Having these investigations and analysis, a novel genetic algorithm based multiple MAs itinerary planning (GA-MIP) scheme is proposed to address the shortcomings of large latency and global unbalancing of using single MA, and its effectiveness is proved by conducting the extensive experiments in professional environment.","cites":"8","conferencePercentile":"87.5"},{"venue":"WICON","id":"b6029f9fabb105ebdba126317743060645d36155","venue_1":"WICON","year":"2007","title":"Scheduler design for heterogeneous traffic in cellular networks with multiple channels","authors":"Karthikeyan Sundaresan, Xiaodong Wang, Mohammad Madihian","author_ids":"1785674, 7136549, 1806176","abstract":"The design of an efficient base station scheduler with the ability to support different kinds of IP traffic, ranging from conventional data to real-time IP services plays a crucial role in the <i>all-IP</i> convergence goal of next-generation cellular systems. In this context, we first consider the basic network utility based data (rate) scheduler and extend it to a more generic, unified scheduler, capable of handling heterogeneous (data and voice) traffic types and their respective parameters (rate, delay and jitter). More importantly, we then consider the case where both the base station and mobile users are equipped with multiple sub-channels as in OFDM systems. The introduction of multiple sub-channels exponentially increases the search space for scheduling decisions as well as significantly increases the feedback overhead. To reduce the complexity of scheduling and the feedback overhead without sacrificing appreciably on performance, we propose a <i>parameter-based optimization.</i> While such an optimization does not reduce the complexity and overhead in single channel systems, we show that it has the potential to significantly reduce complexity and overhead in multiple channel systems. This is achieved in the form of a unified scheduling algorithm that identifies and exploits specific transmission strategies that optimize individual parameters. This is verified through comprehensive evaluations in a packet-level event-driven network simulator.","cites":"1","conferencePercentile":"34.21052632"},{"venue":"WICON","id":"c5be3ea51c832305998bed4da528b7325005b8c2","venue_1":"WICON","year":"2008","title":"A cut-off phenomenon in location based random access games with imperfect information","authors":"Hazer Inaltekin, Mung Chiang, H. Vincent Poor","author_ids":"1714717, 1683977, 1717259","abstract":"This paper analyzes the behavior of selfish transmitters under imperfect location information. The scenario considered is that of a wireless network consisting of selfish nodes that are randomly distributed over the network domain according to a known probability distribution, and that are interested in communicating with a common sink node using common radio resources. In this scenario, the wireless nodes do not know the exact locations of their competitors but rather have belief distributions about these locations. Firstly, properties of the packet success probability curve as a function of the node-sink separation are obtained for such networks. Secondly, a monotonicity property for the best-response strategies of selfish nodes is identified. That is, for any given strategies of competitors of a node, there exists a critical node-sink separation for this node such that its best-response is to transmit when its distance to the sink node is smaller than this critical threshold, and to back off otherwise. Finally, necessary and sufficient conditions for a given strategy profile to be a Nash equilibrium are provided. Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. To copy otherwise, to republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee.","cites":"1","conferencePercentile":"22.09302326"},{"venue":"WICON","id":"464bb2a9bae5702fd03867d9f9c02d936f4d7d38","venue_1":"WICON","year":"2008","title":"A study of MAC schemes for wireless sensor networks powered by ambient energy harvesting","authors":"Zhi Ang Eu, Winston Khoon Guan Seah, Hwee Pink Tan","author_ids":"2545135, 2390462, 7299735","abstract":"Energy consumption is a perennial issue in the design of wireless sensor networks which typically rely on portable sources like batteries for power. Recent advances in ambient energy harvesting technology have made it a potential alternative source of energy for powering wireless sensor networks. In this paper, we study the performance of four different medium access control (MAC) protocols based on CSMA and polling techniques for wireless sensor networks which are powered by ambient energy harvesting. First, we define our model for describing the ambient energy harvesting process. Next, we derive the main performance metrics which are the per-node throughput of each sensor node (R) and the network throughput (S) which is the rate of sensor data received by the sink. We validate the analytical models using simulations, and the results show that neither CSMA-based nor polling protocols always gives the best performance results. These results aim to provide insights to the design of algorithms and protocols for wireless sensor networks that rely on ambient energy harvesting for power which is different from the typical assumption of limited power as in the case of batteries.","cites":"13","conferencePercentile":"86.04651163"},{"venue":"WICON","id":"ab0ffd54a216c6d458fd98ceda1aed4a00d73997","venue_1":"WICON","year":"2010","title":"Joint Power Control and Scheduling Algorithm for Wi-Fi Ad-hoc Networks","authors":"Sangho Oh, Marco Gruteser, Daniel Jiang, Qi Chen","author_ids":"2451873, 1708469, 7221526, 1783637","abstract":"—Power control is a widely used technique in improving the throughput and the quality of services in wireless communications. In this paper, a power control method based on a utility maximization method is applied to Ad-hoc networks built on Wi-Fi radios. First, a fully distributed power control algorithm is developed considering the different characteristics of discrete multi-rate Wi-Fi radios, then a novel joint power control and scheduling algorithm is proposed to maximize the network throughput without sacrificing fairness. The proposed algorithm has a linear complexity degree while other utility based sub-optimal algorithms have exponential complexity. Lastly, as a preliminary step for an application for real Wi-Fi networks, the SINR model of Wi-Fi radios is verified through an experimental research based on the power capture effects.","cites":"0","conferencePercentile":"16.66666667"},{"venue":"WICON","id":"20a142fd79b83cad74ae71be985d43e249d646de","venue_1":"WICON","year":"2007","title":"Resource estimation on wireless backhaul networks","authors":"Irfan Sheriff, Prashanth Aravinda Kumar Acharya, Elizabeth M. Belding-Royer","author_ids":"2155579, 2567345, 2377614","abstract":"The increased usage of IEEE 802.11 wireless backhaul networks and the growing popularity of real time applications, such as VoIP, presents a challenging resource management problem due to the limited capacity of wireless networks. At high traffic volumes, measurements have shown that packet collisions and interference in 802.11 networks can lead to degraded performance to the extent that users experience unacceptably low throughput, which can ultimately lead to complete network breakdown [1]. A resource management framework that limits network flows can prevent network breakdown and improve the performance of throughput and delay-sensitive multimedia applications. To address this problem, we present a measurement-driven framework that leverages wireless characteristics for intelligent admission control in a static wireless network. Experiments on a 25 node wireless testbed show that the proposed scheme can enhance network performance such that the QoS requirements of real time applications, such as VoIP, can be met.","cites":"3","conferencePercentile":"67.10526316"},{"venue":"WICON","id":"010dfbe67cd679ceb3a8bbbd8870ec0bcb5e07a2","venue_1":"WICON","year":"2007","title":"Y-Comm: a global architecture for heterogeneous networking","authors":"Glenford E. Mapp, Fatema Shaikh, David Naveen Cottingham, Jon Crowcroft, Javier Baliosian","author_ids":"7403657, 2544379, 3084709, 1726850, 1799501","abstract":"In the near future mobile devices with several interfaces will become commonplace. Most of the peripheral networks using the Internet will therefore employ wireless technology. To provide support for these devices, this paper proposes a new framework which encompasses the functions of both peripheral and core networks. The framework is called Y-Comm and is defined in a layered manner like the OSI model.","cites":"12","conferencePercentile":"90.78947368"},{"venue":"WICON","id":"b40f561009a958ec23984ec8859a0018d928d496","venue_1":"WICON","year":"2006","title":"Impact of 802.11e EDCA on mixed TCP-based applications","authors":"Marina Thottan, Michele C. Weigle","author_ids":"2257464, 1793181","abstract":"There has been an explosive growth in the use of wireless LANs (WLANs) to support network applications ranging from web-browsing and file-sharing to voice calls. It is difficult to optimally configure WLAN components, such as access points (APs), to meet the quality-of-service requirements of the different applications, as well as ensuring flow-level fairness. Recent work has shown that the widely-deployed IEEE 802.11 MAC Distributed Coordination Function (DCF) is biased against downstream flows. The new IEEE 802.11e standard introduces QoS mechanisms, such as Enhanced Distributed Channel Access (EDCA), that allow this unfairness to be addressed. So far, only limited work has been done to evaluate the impact of these MAC protocols on TCP-based applications. In this paper, through <i>ns</i>-2 simulations, we evaluate the impact of EDCA on TCP application traffic consisting of both long and short-lived TCP flows. We find that the performance of TCP applications is very dependent upon the settings of the EDCA parameters and buffer lengths at the AP. We also show that the performance of the admission control strategy employed depends on the buffer lengths at the AP and the traffic intensity.","cites":"12","conferencePercentile":"66.66666667"},{"venue":"WICON","id":"02613f37908b9de060dbec39758a4b49cd774e78","venue_1":"WICON","year":"2007","title":"Capacity regions for multiple unicast flows using inter-session network coding","authors":"Abdallah Khreishah, Chih-Chun Wang, Ness B. Shroff","author_ids":"1750196, 1702535, 1750487","abstract":"In this paper we consider the problem of transmitting packets through multiple unicast sessions when inter-session linear network coding is permitted. We propose and formulate two new capacity regions for this problem. Distributed rate allocation algorithms and coding schemes are also provided for these capacity regions. The two capacity regions are compared with other known capacity regions in the literature to represent their benefits in terms of throughput, fairness, complexity, and ease of implementation.","cites":"2","conferencePercentile":"51.31578947"},{"venue":"WICON","id":"101dee5be9af76e251d5d34f70dc3009e8096462","venue_1":"WICON","year":"2008","title":"An experimental study on connectivity and topology control in real multi-hop wireless networks","authors":"Alvin C. Valera, Pius W. Q. Lee, Yew Fai Wong, Winston Khoon Guan Seah, Hwee Pink Tan, Han Ju","author_ids":"2291192, 3068634, 1687123, 2390462, 7299735, 1978835","abstract":"Topology control by means of transmit power adjustment is a well-studied technique for improving the network capacity and energy efficiency of wireless ad hoc networks. In this paper, we investigate the feasibility of connectivity and topology control in a real IEEE 802.11b testbed composed of inexpensive commercial off-the-shelf (COTS) routers. Although topology control via transmit power adjustment is feasible based on analytical studies and emulations, it is difficult in practice for the range provided by COTS wireless routers.","cites":"0","conferencePercentile":"9.302325581"},{"venue":"WICON","id":"3fe00a8fdce106cd86c55327fa8843d1e9539052","venue_1":"WICON","year":"2006","title":"CRUSE: a context reactive natural language mobile interface","authors":"Babak Hodjat, Siamak Hodjat, Nick Treadgold, Ing-Marie Jonsson","author_ids":"3024670, 2223434, 2456097, 2600373","abstract":"The user interfaces for mobile devices generally have space and entry restrictions. These restrictions often limit both the usage and usefulness of many mobile applications. The Context Reactive User Experience (CRUSE) is a user interface framework enabling the delivery of applications and services to mobile users in a standard usable form. CRUSE is designed to both maximize the amount of useful information presented to a user, and to minimize the difficulty the user has in accessing information missing from the user interface. At any given time CRUSE takes available context, user preferences and user behavior to present options that have the most likelihood of being selected by the user. Such a prediction cannot be foolproof at all times therefore it is augmented by a natural language text box.","cites":"0","conferencePercentile":"9.259259259"},{"venue":"WICON","id":"59bf1e734c20de531b827e681996943170a343d5","venue_1":"WICON","year":"2010","title":"Prediction-Based Data Transmission for Energy Conservation in Wireless Body Sensors","authors":"Feng Xia, Zhenzhen Xu, Lin Yao, Weifeng Sun, Mingchu Li","author_ids":"1688607, 7814624, 1708162, 1758230, 8679900","abstract":"— Wireless body sensors are becoming popular in healthcare applications. Since they are either worn or implanted into human body, these sensors must be very small in size and light in weight. The energy consequently becomes an extremely scarce resource, and energy conservation turns into a first class design issue for body sensor networks (BSNs). This paper deals with this issue by taking into account the unique characteristics of BSNs in contrast to conventional wireless sensor networks (WSNs) for e.g. environment monitoring. A prediction-based data transmission approach suitable for BSNs is presented, which combines a dual prediction framework and a low-complexity prediction algorithm that takes advantage of PID (proportional-integral-derivative) control. Both the framework and the algorithm are generic, making the proposed approach widely applicable. The effectiveness of the approach is verified through simulations using real-world health monitoring datasets.","cites":"1","conferencePercentile":"37.5"},{"venue":"WICON","id":"bd54dc6f44a251a6cdf0a6f53e06e228adda83bc","venue_1":"WICON","year":"2005","title":"SHUSH: reactive transmit power control for wireless MAC protocols","authors":"Anmol Sheth, Richard Han","author_ids":"1744850, 1719013","abstract":"— Asymmetric transmission ranges caused due to transmit power control have the undesirable effect of increasing the number of hidden terminals in the network as well as increasing the unfairness in channel access. In this paper we present a new reactive power controlled MAC protocol, SHUSH, which tackles the above problems. We compare the performance of SHUSH with four other transmit power controlled MAC protocols and demonstrate that SHUSH achieves superior aggregate goodput, spatial reuse, fairness, and minimal energy consumption. I. INTRODUCTION Transmit power control is a highly effective technique for minimizing interference and energy consumption in wireless networks. If two communicating nodes can lower their transmission powers and corresponding transmission radii to the minimal values that maintain communication between the two nodes, then the transmission between the two nodes will minimize interference with other nodes, enabling higher aggregate throughput and greater spatial reuse than wireless networks that lack power control [19]. Transmit power control has further value in terms of minimizing energy consumption due to transmission. Portable wireless access devices such as laptops, PDAs, and cell phones have extremely limited battery lifetimes. Energy constraints are also severe in wireless sensor networks. Transmit power control offers an effective technique for prolonging the lifetime of these wireless access devices by communicating at the minimum power that still maintains connectivity. An assumption made by existing MAC layer protocols is that communication ranges are symmetric. However, in presence of power control this assumption is no longer valid. A critical issue that is encountered by MAC layer design given asymmetric transmit powers is the general hidden terminal problem, which can result in increased collisions and degraded throughput. We define the general hidden terminal problem as any situation in which an interferer is unable to hear a hidden ongoing conversation and then interrupts that hidden conversation. The specific hidden terminal problem addressed by MACA [2] is a subset of the general problem and assumes symmetric transmit powers. In a symmetric transmit power environment, the only way that an interferer is unable to hear an ongoing conversation and then interrupts that conversation is if the interferer cannot hear the sender and then interrupts the receiver by transmitting. In this case, the sender is hidden from the interferer, hence the classic hidden terminal terminology.","cites":"11","conferencePercentile":"57.14285714"},{"venue":"WICON","id":"22a53c4acd7b54507b38699685231e417a445608","venue_1":"WICON","year":"2008","title":"Design and deployment considerations for high performance MIMO testbeds","authors":"Konstantinos Pelechrinis, Ioannis Broustis, Theodoros Salonidis, Srikanth V. Krishnamurthy, Prasant Mohapatra","author_ids":"2096978, 2919362, 2522394, 1791108, 1697868","abstract":"MIMO (Multiple Input Multiple Output) enabled systems are characterized by higher reliability and transmission rates, as compared to conventional SISO (Single Input Single Output) systems. However, unless administered properly, the MIMO technology may not facilitate very high throughputs on point-to-point wireless links. Therefore, it becomes imperative for the network architect to design such networks in ways that fully exploit the inherent properties of MIMO. In this paper, we first conduct an extensive experimental study, using a powerful hardware platform, in order to understand the behavior of MIMO links in different topological scenarios. Our experiments involve scenarios with MIMO links in isolation, as well as in competition with other MIMO and SISO links. Second, we perform measurements with different commercial platforms towards assessing the ability of each platform to efficiently support the MIMO technology. Based on our experimental observations we deduce that the CPU processing speed of the underlying hardware platform is an important factor that can hide the performance benefits of a MIMO enabled tranceiver. We comment on the applicability of the different hardware choices that we test; furthermore , we suggest the most appropriate choice for building a MIMO testbed, taking into account the cost, the extend-ability and the re-usability of the selected platform. Finally, having adopted this choice in our testbed design, we provide a description of our testbed architecture.","cites":"20","conferencePercentile":"97.6744186"},{"venue":"WICON","id":"2866674c1285b47c1b2a00966b73d07f07645f15","venue_1":"WICON","year":"2005","title":"Multimedia messaging service: system description and performance analysis","authors":"Majid Ghaderi, Srinivasan Keshav","author_ids":"3316639, 1692842","abstract":"Following the success of short messaging service (SMS), multimedia messaging service (MMS) is emerging as a natural but revolutionary successor to short messaging. MMS allows personalized multimedia messages containing content such as images, audio, text and video to be created and transferred between MMS-capable phones and other devices. By using IP and its associated protocols, MMS is able to interwork with other messaging systems such as Internet messaging services. An important feature of MMS is the guaranteed delivery of messages via a store-and-forward mechanism which temporarily stores messages in the network until successfully delivered. Unlike SMS, multimedia messaging service does not mandate any maximum size for a multimedia message. This enhanced flexibility of MMS requires a careful design of the network in order to avoid excessive message delays and losses. This paper develops a mathematical model for evaluating the performance of an MMS system. Using the model, closed-form expressions for major performance parameters such as message loss, message delay and expiry probability have been derived. Furthermore, a simple algorithm is presented to find the optimal temporary storage size for a given set of system parameters. The accuracy of the presented analysis is evaluated through simulations which shows a close agreement between analytic and simulation results.","cites":"10","conferencePercentile":"50"},{"venue":"WICON","id":"e257f0c67682a2db8af069fa92c7e7a5f6659c8d","venue_1":"WICON","year":"2008","title":"Channel assignment with partially overlapping channels in wireless mesh networks","authors":"Yong Ding, Yi Huang, Guo-Kai Zeng, Li Xiao","author_ids":"4433183, 5224616, 1708629, 6619548","abstract":"Many efforts have been devoted to maximizing the network throughput with limited channel resources in multi-radio multi-channel wireless mesh networks. It has been believed that the limited spectrum resource can be fully exploited by utilizing partially overlapping channels in addition to non-overlapping channels in 802.11b/g networks. However, there are only few studies of channel assignment algorithms for partially overlapping channels. In this paper, an extension to the traditional conflict graph model, weighted conflict graph, is proposed to model the interference between wireless links more accurately. Based on this model, we first present a greedy algorithm for partially overlapping channel assignment, and then propose a novel genetic algorithm, which has the potential to obtain better solutions. Through evaluation, we demonstrate that the network performance can be dramatically improved by properly utilizing the partially overlapping channels. In addition, the genetic algorithm outperforms the greedy algorithm in mitigating the interference within the network and therefore leads to higher network throughput.","cites":"22","conferencePercentile":"100"},{"venue":"WICON","id":"1cd2a9d7d1bd91de94d2b24085b062944b48eb5a","venue_1":"WICON","year":"2006","title":"Vehicular grid communications: the role of the internet infrastructure","authors":"Mario Gerla, Biao Zhou, Yeng-Zhong Lee, Fabio Soldo, Uichin Lee, Gustavo Marfia","author_ids":"8467438, 1791395, 2675759, 3003725, 1799283, 1728804","abstract":"Vehicle communications are becoming a reality, driven by navigation safety requirements and by the investments of car manufacturers and Public Transport Authorities. As a consequence many of the essential vehicle grid components (radios, Access Points, spectrum, standards, etc.) will soon be in place (and paid for) paving the way to unlimited opportunities for other car-to-car applications beyond safe navigation, for example, from news to entertainment, mobile network games and civic defense. In this study, we take a visionary look at these future applications, the emerging \"Vehicular Grid\" that will support them and the interplay between the grid and the communications infrastructure.\n In essence, the Vehicular Grid is a large scale ad hoc network. However, an important feature of the Vehicular Grid, which sets it apart from most instantly-deployed ad hoc networks, is the ubiquitous presence of the infrastructure (and the opportunity to use it). While the Vehicular Grid must be entirely self-supporting for emergency operations (natural disaster, terrorist attack, etc), it should exploit the infrastructure (when present) during normal operations. In this paper we address the interaction between vehicles and Internet servers through Virtual Grid and Internet Infrastructure. This includes transparent geo-route provisioning across the Internet, mobile resource monitoring, and mobility management (using back up services in case of infrastructure failure). We then focus on routing and show the importance of Infrastructure cooperation and feedback for efficient, congestion free routing.","cites":"27","conferencePercentile":"92.59259259"},{"venue":"WICON","id":"f43f5eb8e0cfb209db0718e496f72a513dd5aee2","venue_1":"WICON","year":"2008","title":"Opportunistic spectrum access in cognitive radio networks: when to turn off the spectrum sensors","authors":"Dan Xu, Xin Liu","author_ids":"1751941, 1749705","abstract":"— In cognitive radio networks, spectrum sensing is a critical to both protecting the primary users and creating spectrum access opportunities of secondary users. Channel sensing itself, including active probing and passive listening, often incurs cost, in terms of time overhead, energy consumption, or intrusion to primary users. It is thus not desirable to sense the channel arbitrarily. In this paper, we are motivated to consider the following problem. A secondary user, equipped with spectrum sensors, dynamically accesses a channel. If it transmits with-out/with colliding with primary users, a certain reward/penalty is obtained. If it senses the channel, accurate channel information is obtained, but a given channel sensing cost incurs. The third option for the user is to turn off the sensor/transmitter and go to sleep mode, where no cost/gain incurs. So when should the secondary user transmit, sense, or sleep, to maximize the total gain? We derive the optimal transmitting, sensing, and sleeping structure, which is a threshold-based policy. Our work sheds light on designing sensing and transmitting scheduling protocols for cognitive radio networks, especially the in-band sensing mechanism in 802.22 networks. I. INTRODUCTION Current static spectrum allocation policy of FCC has resulted in obvious imbalance of spectrum usage between licensed users and numerous unlicensed users crowded in the ISM band. To alleviate such a imbalance, cognitive radio[2]. has been considered as a key technology to enable the unlicensed users or secondary users (SU) to dynamically access the licensed spectrum. Cognitive radio networks has attracted a lot of attention from both industry and academy. The IEEE standard 802.22, Wireless Regional Area Networks (WRAN) [1] is a highlight on this area. Cognitive radio can dynamically and promptly adjust itself to the environments. For example, it can dynamically bind channels, switch channels, and control transmit power and modulation schemes[2], [3]. However, the power of cognitive radio cannot make it succeed solely. Cognitive radio networks can only dynamically access the spectrum holes where primary users (PU) are absent. How to protect the PUs communication is a key issue on the research of cognitive radio networks.","cites":"7","conferencePercentile":"75.58139535"},{"venue":"WICON","id":"45a09f51142efd27771cc17596a04628b4ab41dd","venue_1":"WICON","year":"2005","title":"Large-scale RTT measurements from an operational UMTS/GPRS network","authors":"Francesco Vacirca, Fabio Ricciato, René Pilz","author_ids":"3179763, 1729578, 2416978","abstract":"— In this paper we present some observations about TCP RTT as captured in the live traffic of an operational GPRS/UMTS network. RTT samples are extracted from traces collected by passive monitoring the Gn interfaces of one of the major providers in Austria, EU. We compare results for GPRS and UMTS, and expose some methodological issues involved in performing this type of analysis, for instance the potential bias introduced by heavy users. We also explore the correlation of RTT with time-of-day. The primary motivation for this research is to gain a better understanding of the dominant causes that shape the behaviour and the distribution of RTT across the TCP connections that populate a GPRS/UMTS network. The results presented here are useful for the scientific community, for instance to set more realistic simulation scenarios for other research activities. In addition, RTT measurements as obtained by large-scale passive monitoring can be used in combination with other indicators to build a summary indicator of the performances experienced by the TCP users at the scale of the whole network, i.e. a global RTT-based KPI (Key Performance Indicator). I. INTRODUCTION In this work 1 we report some observations from an ongoing research on TCP Round Trip Time (RTT) in GPRS and UMTS based on passive measurements from an operational network. The traces are collected by passive monitoring the Gn links of one of the major providers in Austria, EU. The primary motivation for this research is to move towards a better understanding of the dominant causes that shape the behaviour and the distribution of RTT across the TCP connections that populate a GPRS/UMTS network. Such knowledge would pave the ground towards the exploitation of passive RTT monitoring for practical purposes. Possible applications include: • Detect performance bottleneck on the side of the network and/or of the terminals. • Optimize parameter setting and resource allocation in the network (e.g., buffer). • Build more realistic scenarios for simulations. • Use some statistic parameters extracted from TCP monitoring (e.g., RTT samples) to build a summary indicator of the performances experienced by the users at the scale of the whole network. The latter point is useful to detect medium-and long-term (from hours to weeks) drifts in the performances caused by macroscopic modifications in the volume and composition of the traffic at the scale of the whole network. Such modifications might be caused for example by changes in the","cites":"22","conferencePercentile":"85.71428571"},{"venue":"WICON","id":"0a723c6475d8eaca447171751d0c07179f46ee9a","venue_1":"WICON","year":"2005","title":"Optimal data delivery in wireless sensor networks in the energy and latency domains","authors":"Marco Borghini, Francesca Cuomo, Tommaso Melodia, Ugo Monaco, Fabio Ricciato","author_ids":"3213051, 1793031, 1706150, 2872138, 1729578","abstract":"In this paper we address the problem of optimal data gathering in wireless sensor networks (WSN). The goal of this work is to develop algorithms and techniques in order to minimize the data delivery latency and at the same time balance the energy consumption among the nodes, so as to maximize the network lifetime. Following an incremental-complexity approach, several mathematical programming problems are proposed with focus on different network aspects. First, the static routing problem is formulated for large and dense WSNs. Then, an accurate network model is proposed that captures the tradeoff between the data delivery latency and the network energy consumption by model-ing the interactions among the routing, medium access control and physical layers. Finally, we consider dynamic rerouting and scheduling. For each problem we provide extensive simulations results for reference scenarios. The proposed models provide a deeper insight into the problem of timely and energy efficient data gathering. Along with the simulation results reported here they provide useful guidelines for the design of effective WSNs.","cites":"4","conferencePercentile":"35.71428571"},{"venue":"WICON","id":"56e322c93f53f5c0f80ba9d66dcb56db1e3b2e36","venue_1":"WICON","year":"2005","title":"Ad hoc probe: path capacity probing in wireless ad hoc networks","authors":"Ling-Jyh Chen, Tony Sun, Guang Yang, M. Y. Sanadidi, Mario Gerla","author_ids":"1759187, 1797568, 1773554, 1708056, 8467438","abstract":"Knowledge of end-to-end path capacity is useful for video/audio stream adaptation, rate control and overlay design. Capacity estimation in wired and last-hop wireless networks has been extensively investigated, but an in-depth study of path capacity in ad hoc, multihop wireless networks is still lacking. Since the \" capacity \" of a wireless link can vary dynamically and rapidly due to changes in interference, mobility or energy optimization policy, timely path capacity tracking is the key to efficient routing, traffic management and application deployment. In this paper, we present AdHoc Probe, a \" packet-pair \" based technique, to estimate end-to-end path capacity in ad hoc wireless networks. Using analysis and simulation, we show that AdHoc Probe converges fast and thus works well in mobile, rapidly changing scenarios. AdHoc Probe is simpler, faster and less intrusive than previously proposed schemes.","cites":"24","conferencePercentile":"92.85714286"},{"venue":"WICON","id":"11f38d6614bce4614f847b5807d2fa58477717df","venue_1":"WICON","year":"2006","title":"A TCP with guaranteed performance in networks with dynamic congestion and random wireless losses","authors":"Stefan Schmid, Roger Wattenhofer","author_ids":"1789173, 1716440","abstract":"It is well-known that TCP performs poorly in the presence of packet losses happening for reasons other than Internet congestion. One increasingly important source of such errors are wireless links. In this paper, networks are studied where the congestion---and thus the bandwidth available to a host---varies over time, and where in addition packets are lost at random. First, we propose a network comprising both dynamically varying congestion and random errors. Second, our model is extended with network calculus concepts in order to study bursty changes of congestion. Finally, we present the transfer protocol TCP \"Wichita\" (TCPW) which achieves a provable worst-case performance in this environment.","cites":"4","conferencePercentile":"40.74074074"},{"venue":"WICON","id":"25f6518131f41ec8daf4ff2b986e41e73688e8cf","venue_1":"WICON","year":"2010","title":"Optimized Content Caching and Request Capture in CNF Networks","authors":"Lijun Dong, Dan Zhang, Yanyong Zhang, Dipankar Raychaudhuri","author_ids":"2055631, 3386738, 1813845, 1690964","abstract":"—In order to meet the overwhelming demands of content retrieval for mobile end users, a novel architecture for the next-generation Internet called Cache-and-Forward (CNF) has been proposed to transport content as large \" packages \" in a hop by hop manner towards the destination, instead of transporting a stream of small packets along an established TCP/IP connection. In this paper, we investigate how CNF network architecture can be designed for efficient content retrieval for wireless mobile nodes. In particular, we look at Integrated Caching in which we assume each CNF router on the future Internet can cache contents that pass by and reply to content requests with its local copy. We name this content delivery method Caching-n-Capture(CC). We develop a mathematical model for CC to optimize the average content retrieval latency with limited storage on each CNF router. We propose Sequential Reassignment(SR) algorithm to solve the optimization problem. We compare the performance of the derived optimal solutions against our integrated caching and routing heuristics. The results show the Sequential Reassignment algorithm significantly reduces the average content retrieval latency by as high as 70%.","cites":"3","conferencePercentile":"54.16666667"},{"venue":"WICON","id":"723128f33c0d0f404a3de342dee694478d920c1f","venue_1":"WICON","year":"2006","title":"Design and implementation of a socket-level bandwidth aggregation mechanism for wireless networks","authors":"Hiroshi Sakakibara, Masato Saito, Hideyuki Tokuda","author_ids":"4889269, 2901115, 1700496","abstract":"This paper proposes a mechanism to aggregate bandwidth of multiple network interfaces on a computer. Recently one single computer entails multiple different wireless network interfaces, such as IEEE 802.11a/b/g/n, Bluetooth, WiMAX, and so on. They can be combined, and we can aquire broad bandwidth. We designed and developed a <b>S</b>ocket-level <b>B</b>andwidth <b>A</b>ggregation <b>M</b>echanism (SBAM). SBAM can aggregate multiple interfaces on a computer to offer broad bandwidth. In addition, implementation in socket layer causes easy deployment and adaptation to existing environment. We evaluated SBAM under actual wireless network environments. SBAM offers broad bandwidth by utilizing various wireless devices on a computer while it avoids modification to existing environment.","cites":"9","conferencePercentile":"62.96296296"}]}