{"WICSAECSA_Companion_Volume.csv":[{"venue":"WICSA/ECSA Companion Volume","id":"b5c754daa82044e99e0b29b9374ec0dddc5996e6","venue_1":"WICSA/ECSA Companion Volume","year":"2012","title":"Elements for a cloud-based development environment: online collaboration, revision control, and continuous integration","authors":"Tommi Mikkonen, Antti Nieminen","author_ids":"1764720, 1774173","abstract":"In almost any other field than software development, the World Wide Web, or simply the Web has revolutionized collaboration by providing a platform for cooperative applications and services. In contrast, so far revision control, also referred to as version management, has been the key technology for enabling collaborative software development. However, even today it is feasible to build a cooperative development environment that runs in a cloud, following the spirit of Google Docs, where developers can cooperate in real time. In this paper, we take a step beyond from the design of the technical artifact that allows collaborative coding, and consider the consequences of such an approach to software development in a more general sense, in particular from the perspective of version management. The goal is to integrate collaborative development with traditional facilities commonly associated with software engineering. This in turn will lead to a development approach where new opportunities complement tools that are known to work and provide a lot of added value in software development.","cites":"3","conferencePercentile":"71.21212121"},{"venue":"WICSA/ECSA Companion Volume","id":"59a8da4302fb2ce27a8a3d6a24f87e12977b90e2","venue_1":"WICSA/ECSA Companion Volume","year":"2012","title":"Nordic Symposium on Cloud Computing and Internet Technologies (NordiCloud)","authors":"Muhammad Ali Babar, Parastoo Mohagheghi, Åke Edlund, Sébastien Mosser, Tommi Mikkonen, Peep Küngas","author_ids":"1725926, 1798426, 3110340, 3423026, 1764720, 2672166","abstract":"This is an introduction to the NordiCloud Symposium collocated with WICSA/ECSA 2012.","cites":"1","conferencePercentile":"34.84848485"},{"venue":"WICSA/ECSA Companion Volume","id":"2c7a3aa561da6ec319d16e09eaacde7a95aae8ed","venue_1":"WICSA/ECSA Companion Volume","year":"2012","title":"Data management requirements for a knowledge discovery platform","authors":"Liming Zhu, Leonard J. Bass, Xiwei Xu","author_ids":"8301531, 2040359, 7925496","abstract":"This paper provides some requirements for the data management portion of a knowledge discovery ecosystem platform. The requirements are functional -- what the platform should provide for its clients; quality -- how the platform should support modifiability, performance, and availability; and management -- how the platform supports operational control to sites that use it. It also provides design guidance that reflects the lack of central management that exists in an ecosystem.","cites":"1","conferencePercentile":"34.84848485"}]}