{"WIFS.csv":[{"venue":"WIFS","id":"62c4ed931b3689e5624dd7b3fcf0f1f92469dee5","venue_1":"WIFS","year":"2011","title":"Holmes: A data theft forensic framework","authors":"Ramya Jayaram Masti, Vincent Lenders, Mario Strasser, Stefan Engel, Bernhard Plattner","author_ids":"2542232, 1711433, 2603232, 2965501, 1773497","abstract":"—This paper presents Holmes, a forensic framework for postmortem investigation of data theft incidents in enterprise networks. Holmes pro-actively collects potential evidence from hosts and the network for correlation analysis at a central location. In order to optimize the storage requirements for the collected data, Holmes relies on compact network and host data structures. We evaluate the theoretical storage requirements of Holmes in average networks and quantify the improvements compared to raw data collection alternatives. Finally, we present the application of Holmes to two realistic data theft investigation scenarios and discuss how combining network and host data can improve the efficiency and reliability of these investigations.","cites":"0","conferencePercentile":"7.894736842"},{"venue":"WIFS","id":"155301cd5c3c8721ec9217f8166f792b1fc556f9","venue_1":"WIFS","year":"2012","title":"Weighted stego-image steganalysis for naive content-adaptive embedding","authors":"Pascal Schöttle, Stefan Korff, Rainer Böhme","author_ids":"2390770, 2798025, 1748910","abstract":"—Weighted stego-image (WS) steganalysis is the state of the art for estimating LSB replacement steganography in spatial domain images. However, the most powerful WS variants designed against random uniform embedding perform poorly against content-adaptive steganography. As a remedy, we propose a novel variant of WS which is specialized in detecting small payloads hidden exclusively in the least detectable spots of a cover, benchmark its performance against known methods, and experimentally investigate the influence of the choice of the adaptivity criterion, i. e., the function that identifies supposedly secure spots in a heterogeneous cover. We find that adaptivity criteria which are hard to recover from the stego image alone provide stronger security against our specialized WS method.","cites":"9","conferencePercentile":"83.33333333"},{"venue":"WIFS","id":"cc8e6d69e3e6460e014fbb28c6ea9ab5c0977b05","venue_1":"WIFS","year":"2011","title":"Painless migration from passwords to two factor authentication","authors":"Ziqing Mao, Dinei A. F. Florêncio, Cormac Herley","author_ids":"2731513, 1882479, 1679146","abstract":"—In spite of growing frequency and sophistication of attacks two factor authentication schemes have seen very limited adoption in the US, and passwords remain the single factor of authentication for most bank and brokerage accounts. Clearly the cost benefit analysis is not as strongly in favor of two factor as we might imagine. Upgrading from passwords to a two factor authentication system usually involves a large engineering effort, a discontinuity of user experience and a hard key management problem. In this paper we describe a system to convert a legacy password authentication server into a two factor system. The existing password system is untouched, but is cascaded with a new server that verifies possession of a smart-phone device. No alteration, patching or updates to the legacy system is necessary. There are now two alternative authentication paths: one using passwords alone, and a second using passwords and possession of the trusted device. The bank can leave the password authentication path available while users migrate to the two factor scheme. Once migration is complete the password-only path can be severed. We have implemented the system and carried out two factor authentication against real accounts at several major banks.","cites":"3","conferencePercentile":"23.68421053"},{"venue":"WIFS","id":"6aa332089cd255326b4c77c67fbf778d57377d9b","venue_1":"WIFS","year":"2012","title":"A framework for privacy preserving statistical analysis on distributed databases","authors":"Bing-Rong Lin, Ye Wang, Shantanu Rane","author_ids":"1974924, 1681196, 2028448","abstract":"—Alice and Bob are mutually untrusting curators who possess separate databases containing information about a set of respondents. This data is to be sanitized and published to enable accurate statistical analysis, while retaining the privacy of the individual respondents in the databases. Further, an adversary who looks at the published data must not even be able to compute statistical measures on it. Only an authorized researcher should be able to compute marginal and joint statistics. This work is an attempt toward providing a theoretical formulation of privacy and utility for problems of this type. Privacy of the individual respondents is formulated using −differential privacy. Privacy of the marginal and joint statistics on the distributed databases is formulated using a new model called δ−distributional −differential privacy. Finally, a constructive scheme based on randomized response is presented as an example mechanism that satisfies the formulated privacy requirements.","cites":"2","conferencePercentile":"31.48148148"},{"venue":"WIFS","id":"e417905b0abeab6adcb531335a0df277da4f235b","venue_1":"WIFS","year":"2010","title":"Phishing and money mules","authors":"Dinei A. F. Florêncio, Cormac Herley","author_ids":"1882479, 1679146","abstract":"Data breaches, phishing and spyware have compromised millions of end-user records and credentials. Mules are the preferred means for draining compromised accounts. These are unwitting accomplices who provide a stepping stone between the victim account and the attacker. The key role they play is to turn reversible traceable transactions into irreversible untraceable ones. This, together with the fraud protections enjoyed by US banking customers, generates some surprising findings. First, it is the mule's money not the victim's or the bank's money that the attacker steals. Second, mule recruitment and not credential theft appears the true bottleneck in online fraud. Third, this suggests an explanation of why stolen credentials sell so cheaply: there is a shortage of mules.","cites":"7","conferencePercentile":"50"},{"venue":"WIFS","id":"2067f69a288e7d3662ac190cfad168df9f7c52b8","venue_1":"WIFS","year":"2009","title":"BitStalker: Accurately and efficiently monitoring bittorrent traffic","authors":"Kevin S. Bauer, Damon McCoy, Dirk Grunwald, Douglas C. Sicker","author_ids":"1744469, 1703426, 1748465, 1694069","abstract":"BitTorrent is currently the most popular peer-to-peer network for file sharing. However, experience has shown that Bit-Torrent is often used to distribute copyright protected movie and music files illegally. Consequently, copyright enforcement agencies currently monitor BitTorrent swarms to identify users participating in the illegal distribution of copyright-protected files. These investigations rely on passive methods that are prone to a variety of errors, particularly false positive identification. To mitigate the potential for false positive peer identification , we investigate the feasibility of using active methods to monitor extremely large BitTorrent swarms. We develop an active probing framework called BitStalker that identifies active peers and collects concrete forensic evidence that they were involved in sharing a particular file. We evaluate the effectiveness of this approach through a measurement study with real, large torrents consisting of over 186,000 peers. We find that the current investigative methods produce at least 11% false positives, while we show that false positives are rare with our active approach.","cites":"12","conferencePercentile":"83.33333333"}]}