{"WikiSym.csv":[{"venue":"WikiSym","id":"583f1b58e2679c18ca78cf364b0558e8397ee531","venue_1":"WikiSym","year":"2012","title":"On the accuracy of urban crowd-sourcing for maintaining large-scale geospatial databases","authors":"Afra J. Mashhadi, Giovanni Quattrone, Licia Capra, Peter Mooney","author_ids":"1743965, 1742046, 1699832, 8113819","abstract":"The world is in the midst of an immense population shift from rural areas to cities. Urban elements, such as businesses, Points-of-Interest (POIs), transportation, and housing are continuously changing, and collecting and maintaining accurate information about these elements within spatial databases has become an incredibly onerous task. A solution made possible by the uptake of social media is crowd-sourcing, where user-generated content can be cultivated into meaningful and informative collections, as exemplified by sites like Wikipedia. This form of user-contributed content is no longer confined to the Web: equipped with powerful mobile devices, citizens have become cartographers too, volunteering geographic information (e.g., POIs) as exemplified by sites like OpenStreetMap. In this paper, we investigate the extent to which crowd-sourcing can be relied upon to build and maintain an accurate map of the changing world, by means of a thorough analysis and comparison between traditional web-based crowd-sourcing (as in Wikipedia) and urban crowd-sourcing (as in OpenStreetMap).","cites":"10","conferencePercentile":"88.75"},{"venue":"WikiSym","id":"8c9ed16144f3ac925b8dcd34e83b81eb594c873e","venue_1":"WikiSym","year":"2012","title":"Deletion discussions in Wikipedia: decision factors and outcomes","authors":"Jodi Schneider, Alexandre Passant, Stefan Decker","author_ids":"2557187, 1733056, 1685642","abstract":"Deletion of articles is a common process in Wikipedia, in order to ensure the overall quality of the encyclopedia. Yet, there is a need to better understand the procedures in order to promote the best decisions without unnecessary community work. In this paper, we study deletion in Wikipedia, drawing from factor analysis, and taking an in-depth, content-analysis-based approach. We address three research questions: First, what factors contribute to the decision about whether to delete a given article? Second, when multiple factors are given, what is the relative importance of those factors? Third, what are the outcomes of deletion discussions, both for articles and for the community? We find that multiple factors contribute to the assessment of an article, and we discuss their relative frequency. Further, we show how the assessment timeline focuses attention on improving borderline articles that have the potential to meet Wikipedia's content inclusion policies, and we highlight the role of novice contributors in this improvement process.","cites":"10","conferencePercentile":"88.75"},{"venue":"WikiSym","id":"fd7aa51fcf65373713d19218ab8b454ae440c826","venue_1":"WikiSym","year":"2012","title":"Design for free learning: a case study on supporting a service design course","authors":"Teresa Consiglio, Gerrit C. van der Veer","author_ids":"1976949, 1768316","abstract":"In this experience report, we provide a case study on the use of information and communication technology (ICT) in higher education, developing an open source interactive learning environment to support a blended course.\n Our aim is to improve the quality of adult distance learning, ultimately involving peers worldwide, by developing learning environments as flexible as possible regardless of the culture and context of use, of individual learning style and age of the learners. Our example concerns a course of Service Design where the teacher was physically present only intermittently for part of the course while in the remaining time students worked in teams using our online learning environment.\n We developed a structure where students are guided through discovery learning and mutual teaching. We will show how we started from the students' authentic goals and how we supported them by a simple structure of pacing the discovery process and merging theoretical understanding with practice in real life.\n Based on these first empirical results practical guidelines have been developed regarding improvements on the structure provided for the learning material and on the interaction facilities for students, teachers and instructional designers.","cites":"1","conferencePercentile":"47.5"},{"venue":"WikiSym","id":"49b4848f62786f6ae4bfb56c67c2343a2e24eb8e","venue_1":"WikiSym","year":"2012","title":"In search of the ur-Wikipedia: universality, similarity, and translation in the Wikipedia inter-language link network","authors":"Morten Warncke-Wang, Anuradha Uduwage, Zhenhua Dong, John Riedl","author_ids":"3196416, 2780406, 4342928, 8497382","abstract":"Wikipedia has become one of the primary encyclopaedic information repositories on the World Wide Web. It started in 2001 with a single edition in the English language and has since expanded to more than 20 million articles in 283 languages. Criss-crossing between the Wikipedias is an inter-language link network, connecting the articles of one edition of Wikipedia to another. We describe characteristics of articles covered by nearly all Wikipedias and those covered by only a single language edition, we use the network to understand how we can judge the similarity between Wikipedias based on concept coverage, and we investigate the flow of translation between a selection of the larger Wikipedias. Our findings indicate that the relationships between Wikipedia editions follow Tobler's first law of geography: similarity decreases with increasing distance. The number of articles in a Wikipedia edition is found to be the strongest predictor of similarity, while language similarity also appears to have an influence. The English Wikipedia edition is by far the primary source of translations. We discuss the impact of these results for Wikipedia as well as user-generated content communities in general.","cites":"7","conferencePercentile":"80"},{"venue":"WikiSym","id":"25cb011b651d4eab2cb2321e46adbe3dae0541d2","venue_1":"WikiSym","year":"2012","title":"There is No Deadline - Time Evolution of Wikipedia Discussions","authors":"Andreas Kaltenbrunner, David Laniado","author_ids":"1889171, 3203785","abstract":"Wikipedia articles are by definition never finished: at any moment their content can be edited, or discussed in the associated talk pages. In this study we analyse the evolution of these discussions to unveil patterns of collective participation along the temporal dimension, and to shed light on the process of content creation on different topics. At a micro-scale, we investigate peaks in the discussion activity and we observe a non-trivial relationship with edit activity. At a larger scale, we introduce a measure to account for how fast discussions grow in complexity, and we find speeds that span three orders of magnitude for different articles. Our analysis should help the community in tasks such as early detection of controversies and assessment of discussion maturity.","cites":"15","conferencePercentile":"95"},{"venue":"WikiSym","id":"27d79b1b46843b00075bffd4763fca616f08e1b3","venue_1":"WikiSym","year":"2012","title":"Alternative interfaces for deletion discussions in Wikipedia: some proposals using decision factors","authors":"Jodi Schneider, Krystian Samp","author_ids":"2557187, 3015854","abstract":"Content deletion is an important mechanism for maintaining quality in online communities. In Wikipedia, deletion is guided by complex procedures. Controversial cases (~12% [4]) are sent to special community discussions called \"Articles for Deletion\" (AfD). Deciding the outcome of these deletion debates can be difficult. Further, deletion seems to be a point of friction, which demotivates new editors without sufficiently informing them about Wikipedia's values and standards.","cites":"1","conferencePercentile":"47.5"},{"venue":"WikiSym","id":"0a804919f0ef6f8eb4d18baab8255b07cb4ff713","venue_1":"WikiSym","year":"2012","title":"Emotions and dialogue in a peer-production community: the case of Wikipedia","authors":"David Laniado, Andreas Kaltenbrunner, Carlos Castillo, Mayo Fuster Morell","author_ids":"3203785, 1889171, 3747087, 3177219","abstract":"This paper presents a large-scale analysis of emotions in conversations among Wikipedia editors. Our focus is on the emotions expressed by editors in talk pages, measured by using the Affective Norms for English Words (ANEW).\n We find evidence that to a large extent women tend to participate in discussions with a more positive tone, and that administrators are more positive than non-administrators. Surprisingly, female non-administrators tend to behave like administrators in many aspects.\n We observe that replies are on average more positive than the comments they reply to, preventing many discussions from spiralling down into conflict. We also find evidence of emotional homophily: editors having similar emotional styles are more likely to interact with each other.\n Our findings offer novel insights into the emotional dimension of interactions in peer-production communities, and contribute to debates on issues such as the flattening of editor growth and the gender gap.","cites":"13","conferencePercentile":"92.5"},{"venue":"WikiSym","id":"2a7d1b976f2da749e21a07e6d4ebc0ea12d18822","venue_1":"WikiSym","year":"2012","title":"How people assess cooperatively authored information resources","authors":"Andrea Forte, Thomas H. Park","author_ids":"2525370, 2570989","abstract":"This work in progress highlights late-breaking results and foreshadows opportunities for designing interfaces that help support credibility assessment of cooperatively authored information resources.","cites":"1","conferencePercentile":"47.5"},{"venue":"WikiSym","id":"8ebfc24fa403508cbaf41454f24efab3c37ede32","venue_1":"WikiSym","year":"2012","title":"How long do Wikipedia editors keep active?","authors":"Dell Zhang, Karl Prior, Mark Levene","author_ids":"1725070, 3162596, 1722499","abstract":"In this paper, we use the technique of survival analysis to investigate how long Wikipedia editors remain active in editing. Our results show that although the survival function of occasional editors roughly follows a lognormal distribution, the survival function of customary editors can be better described by a Weibull distribution (with the median lifetime of about 53 days). Furthermore, for customary editors, there are two critical phases (0-2 weeks and 8-20 weeks) when the hazard rate of becoming inactive increases. Finally, customary editors who are more active in editing are likely to keep active in editing for longer time.","cites":"4","conferencePercentile":"63.75"},{"venue":"WikiSym","id":"675eed2fd31f1468eb54b6d44a06c383cca491e3","venue_1":"WikiSym","year":"2012","title":"Drawing a data-driven portrait of Wikipedia editors","authors":"Robert West, Ingmar Weber, Carlos Castillo","author_ids":"1913101, 1684687, 3747087","abstract":"While there has been a substantial amount of research into the editorial and organizational processes within Wikipedia, little is known about how Wikipedia editors (<i>Wikipedians</i>) relate to the online world in general. We attempt to shed light on this issue by using aggregated log data from Yahoo!'s browser toolbar in order to analyze Wikipedians' editing behavior in the context of their online lives beyond Wikipedia. We broadly characterize editors by investigating how their online behavior differs from that of other users; e.g., we find that Wikipedia editors search more, read more news, play more games, and, perhaps surprisingly, are more immersed in popular culture. Then we inspect how editors' general interests relate to the articles to which they contribute; e.g., we confirm the intuition that editors are more familiar with their active domains than average users. Finally, we analyze the data from a temporal perspective; e.g., we demonstrate that a user's interest in the edited topic peaks immediately before the edit. Our results are relevant as they illuminate novel aspects of what has become many Web users' prevalent source of information.","cites":"3","conferencePercentile":"60"},{"venue":"WikiSym","id":"1157507709576561615d75cef81b96efffcc9c47","venue_1":"WikiSym","year":"2012","title":"\"Writing up rather than writing down\": becoming Wikipedia literate","authors":"Heather Ford, R. Stuart Geiger","author_ids":"2349952, 2473694","abstract":"Editing Wikipedia is certainly not as simple as learning the MediaWiki syntax and knowing where the \"edit\" bar is, but how do we conceptualize the cultural and organizational understandings that make an effective contributor? We draw on work of literacy practitioner and theorist Richard Darville to advocate a multi-faceted theory of literacy that sheds light on what new knowledges and organizational forms are required to improve participation in Wikipedia's communities. We outline what Darville refers to as the \"background knowledges\" required to be an empowered, literate member and apply this to the Wikipedia community. Using a series of examples drawn from interviews with new editors and qualitative studies of controversies in Wikipedia, we identify and outline several different literacy asymmetries.","cites":"5","conferencePercentile":"68.75"},{"venue":"WikiSym","id":"20582b8b910f2b25fc3b93a9b3889c12f354d5ef","venue_1":"WikiSym","year":"2012","title":"Biographical social networks on Wikipedia: a cross-cultural study of links that made history","authors":"Pablo Aragón, David Laniado, Andreas Kaltenbrunner, Yana Volkovich","author_ids":"3356477, 3203785, 1889171, 1782794","abstract":"It is arguable whether history is made by great men and women or vice versa, but undoubtably social connections shape history. Analysing Wikipedia, a global collective memory place, we aim to understand how social links are recorded across cultures. Starting with the set of biographies in the English Wikipedia we focus on the networks of links between these biographical articles on the 15 largest language Wikipedias. We detect the most central characters in these networks and point out culture-related peculiarities. Furthermore, we reveal remarkable similarities between distinct groups of language Wikipedias and highlight the shared knowledge about connections between persons across cultures.","cites":"8","conferencePercentile":"82.5"},{"venue":"WikiSym","id":"a5350b4acbbb514c3d3c9abe529788b38b92460f","venue_1":"WikiSym","year":"2012","title":"What aren't we measuring?: methods for quantifying wiki-work","authors":"Aaron Halfaker, Brian Keegan, Andrea Forte, R. Stuart Geiger, Dario Taraborelli, Maryana Pinchuk, Mikhil Masli","author_ids":"1793302, 5451329, 2525370, 2473694, 1682815, 2696592, 2291233","abstract":"Wikis and other open collaboration systems rely on the work of contributors to survive. But what is work and how do we quantify it? Answering this question in the right context is essential for attaining robust and generalizable results across open contribution systems. Our goal is to develop a repertoire of metrics and understand their possible dimensions in order to refine our ability as a research community to measure wikis and wiki activity appropriately across a wide range of contexts. This panel explores the current practice of measuring work in wikis, offers perspectives about the limitations of current approaches and suggests new opportunities for measuring contribution behavior.","cites":"0","conferencePercentile":"20"},{"venue":"WikiSym","id":"8dc17a4e3c2439c8a18f5ba47f656b4f22287d96","venue_1":"WikiSym","year":"2012","title":"Staying in the loop: structure and dynamics of Wikipedia's breaking news collaborations","authors":"Brian Keegan, Darren Gergle, Noshir S. Contractor","author_ids":"5451329, 2815240, 6203716","abstract":"Despite the fact that Wikipedia articles about current events are more popular and attract more contributions than typical articles, canonical studies of Wikipedia have only analyzed articles about pre-existing information. We expect the co-authoring of articles about breaking news incidents to exhibit high-tempo coordination dynamics which are not found in articles about historical events and information. Using 1.03 million revisions made by 158,384 users to 3,233 English Wikipedia articles about disasters, catastrophes, and conflicts since 1990, we construct \"article trajectories\" of editor interactions as they coauthor an article. Examining a subset of this corpus, our analysis demonstrates that articles about current events exhibit structures and dynamics distinct from those observed among articles about non-breaking events. These findings have implications for how collective intelligence systems can be leveraged to process and make sense of complex information.","cites":"23","conferencePercentile":"100"},{"venue":"WikiSym","id":"aea69b01790d3ea93878dcafffc33a0e10759531","venue_1":"WikiSym","year":"2012","title":"Wedata: a wiki system for service oriented tiny code sharing","authors":"Koichiro Eto, Masahiro Hamasaki, Hideaki Takeda","author_ids":"1866564, 1783855, 1696371","abstract":"A new trend for applications for the Internet is to create and share tiny codes for applications like site-specific codes for a broswer extension. It needs a new tools to share and distribute such codes efficiently. We built a Wiki site called Wedata which stores tiny code for a particular service. Wedata has three features: machine readability, code sharing, and service orientation. Many developers already use Wedata for browser extensions. More than 1,300,000 users are using Wedata. As described in this paper, we describe the Wedata system, usage statistics, and the behavior of open collaboration on the system.","cites":"0","conferencePercentile":"20"}]}