{"Wiley_interdisciplinary_reviews":[{"venue":"Wiley interdisciplinary reviews. RNA","id":"da351545689c390d414d100863180cc86a734908","venue_1":"Wiley interdisciplinary reviews. RNA","year":"2015","title":"Linking aptamer‐ligand binding and expression platform folding in riboswitches: prospects for mechanistic modeling and design","authors":"Fareed Aboul‐ela, Wei Huang, Maaly Abd Elrahman, Vamsi Boyapati, Pan Li","author_ids":"7506466, 1730584, 4473337, 4747717, 8241963","abstract":"The power of riboswitches in regulation of bacterial metabolism derives from coupling of two characteristics: recognition and folding. Riboswitches contain aptamers, which function as biosensors. Upon detection of the signaling molecule, the riboswitch transduces the signal into a genetic decision. The genetic decision is coupled to refolding of the expression platform, which is distinct from, although overlapping with, the aptamer. Early biophysical studies of riboswitches focused on recognition of the ligand by the aptamer-an important consideration for drug design. A mechanistic understanding of ligand-induced riboswitch RNA folding can further enhance riboswitch ligand design, and inform efforts to tune and engineer riboswitches with novel properties. X-ray structures of aptamer/ligand complexes point to mechanisms through which the ligand brings together distal strand segments to form a P1 helix. Transcriptional riboswitches must detect the ligand and form this P1 helix within the timescale of transcription. Depending on the cell's metabolic state and cellular environmental conditions, the folding and genetic outcome may therefore be affected by kinetics of ligand binding, RNA folding, and transcriptional pausing, among other factors. Although some studies of isolated riboswitch aptamers found homogeneous, prefolded conformations, experimental, and theoretical studies point to functional and structural heterogeneity for nascent transcripts. Recently it has been shown that some riboswitch segments, containing the aptamer and partial expression platforms, can form binding-competent conformers that incorporate an incomplete aptamer secondary structure. Consideration of the free energy landscape for riboswitch RNA folding suggests models for how these conformers may act as transition states-facilitating rapid, ligand-mediated aptamer folding.","cites":"0","conferencePercentile":"18.18181818"}]}