{"Wiley_Interdisc._Rew._Data_Mini":[{"venue":"Wiley Interdisc. Rew.: Data Mining and Knowledge Discovery","id":"8695fd6a1784cd41d4cd01d0487e72a8d1845182","venue_1":"Wiley Interdisc. Rew.: Data Mining and Knowledge Discovery","year":"2011","title":"Accelerating data mining workloads: current approaches and future challenges in system architecture design","authors":"Alok N. Choudhary, Daniel Honbo, Prabhat Kumar, Berkin Özisikyilmaz, Sanchit Misra, Gokhan Memik","author_ids":"1686646, 2963927, 3258057, 1711274, 3215200, 1745634","abstract":"With the unstoppable growth in data collection, data mining is playing an important role in the way massive data sets are analyzed. Trends clearly indicate that future decision making systems would weigh on even quicker and more reliable models used for data analysis. In order to achieve this, current algorithms and computing systems have to be optimized and tuned to effectively process the large volumes of raw data to be seen in future. In this paper, we present a brief overview of the current approaches and challenges faced in system design. The paper starts out by highlighting the uniqueness of data mining applications, which actually makes current \" generic \" system designs unsuitable for mining large data. Subsequently, we summarize the current innovations and efforts made by researchers to design systems to efficiently process data mining workloads. 1 Introduction Data collection and data storage rates are growing at an exponential pace. The \" How Much Information \" project at the University of California at Berkeley [23] have recently estimated that over five exabytes of data was stored across paper, film, magnetic and optical mediums during the year 2002. Also, this number represents a near doubling of the total data stored worldwide in the previous two years. This particular study has not yet been updated to represent more recent years, but it is reasonable to assume that this exponential trend has continued. Corporations like Intel realizes this as well, since they have introduced the looming \" Era of Tera \" where people will require teraflops of computing power, ter-abits per second of communications bandwidth and terabytes of data storage [6]. One can already purchase terabytes of data storage today. If the current trends continue, such an explosion of data would clearly outstrip our ability to make meaningful use of it. While this problem is partially algo-rithmic in nature, it is also an indictment of current system architectural practices. In recent years, system performance has not been scaling well with the amount of data. Overall system performance has not been keeping up with on-chip","cites":"6","conferencePercentile":"35.71428571"},{"venue":"Wiley Interdisc. Rew.: Data Mining and Knowledge Discovery","id":"6cd12078a6e2ed75190628fab0ba361e0104e1fc","venue_1":"Wiley Interdisc. Rew.: Data Mining and Knowledge Discovery","year":"2014","title":"Data stream mining in ubiquitous environments: state-of-the-art and current directions","authors":"Mohamed Medhat Gaber, João Gama, Shonali Krishnaswamy, João Bártolo Gomes, Frederic T. Stahl","author_ids":"1698684, 1717682, 1781256, 1914540, 1778265","abstract":"In this article, we review the state-of-the-art techniques in mining data streams for mobile and ubiquitous environments. We start the review with a concise background of data stream processing, presenting the building blocks for mining data streams. In a wide range of applications, data streams are required to be processed on small ubiquitous devices like smartphones and sensor devices. Mobile and ubiquitous data mining target these applications with tailored techniques and approaches addressing scarcity of resources and mobility issues. Two categories can be identified for mobile and ubiquitous mining of streaming data: single-node and distributed. This survey will cover both categories. Mining mobile and ubiquitous data require algorithms with the ability to monitor and adapt the working conditions to the available computational resources. We identify the key characteristics of these algorithms and present illustrative applications. Distributed data stream mining in the mobile environment is then discussed, presenting the Pocket Data Mining framework. Mobility of users stimulates the adoption of context-awareness in this area of research. Context-awareness and collaboration are discussed in the Collaborative Data Stream Mining, where agents share knowledge to learn adaptive accurate models. INTRODUCTION T he phenomenal growth of mobile devices coupled with their ever-increasing computational capacity presents an exciting new opportunity for real time, intelligent data analysis in mobile and ubiquitous environments. Ubiquitous or mobile data mining refers to the process of performing data stream mining using mobile and/or embedded devices (e.g., sensors) to support critical applications such as mobile healthcare, intelligent transportation systems, mobile Conflict of interest: The authors have declared no conflicts of interest for this article. activity recognition, smart homes, and emergency or disaster management like bush fires. 1,2 Thus, the key focus is on developing data stream mining algorithms that are highly scalable or computationally efficient, energy-efficient, and context or resource-aware. These features enable the continued operation of data stream mining algorithms in a highly dynamic mobile or ubiquitous environment. The typical constraints that have to be addressed in performing mobile or ubiquitous data stream mining are: (1) data streams are generated and sent in real time in a stream format with little or no potential for persistent storage, (2) resource constraints include limited computational resources such as memory, processor speed, network bandwidth, battery power, and screen real-estate, (3) temporal constraints refer to real-time information and decision-making needs that, in turn, necessitate the analysis to be online, incremental, and continuous, (4) mobility of …","cites":"3","conferencePercentile":"45.83333333"},{"venue":"Wiley Interdisc. Rew.: Data Mining and Knowledge Discovery","id":"6e38096208c0c12e0b948b77ce0243160108e9a1","venue_1":"Wiley Interdisc. Rew.: Data Mining and Knowledge Discovery","year":"2014","title":"Alignment and dataset identification of linked data in Semantic Web","authors":"Kalpa Gunaratna, Sarasi Lalithsena, Amit P. Sheth","author_ids":"1755867, 2973556, 1709950","abstract":"The Linked Open Data (LOD) cloud has gained significant attention in the Semantic Web community over the past few years. With rapid expansion in size and diversity, it consists of over 800 interlinked datasets with over 60 billion triples. These datasets encapsulate structured data and knowledge spanning over varied domains such as entertainment, life sciences, publications, geography, and government. Applications can take advantage of this by using the knowledge distributed over the interconnected datasets, which is not realistic to find in a single place elsewhere. However, two of the key obstacles in using the LOD cloud are the limited support for data integration tasks over concepts, instances, and properties, and relevant data source selection for querying over multiple datasets. We review, in brief, some of the important and interesting technical approaches found in the literature that address these two issues. We observe that the general purpose alignment techniques developed outside the LOD context fall short in meeting the heterogeneous data representation of LOD. Therefore, an LOD specific review of these techniques (especially for alignment) is important to the community. The topics covered and discussed in this article fall under two broad categories, namely alignment techniques for LOD datasets and relevant data source selection in the context of query processing over LOD datasets.","cites":"3","conferencePercentile":"45.83333333"}]}