{"Wiley_Encyclopedia_of_Computer_":[{"venue":"Wiley Encyclopedia of Computer Science and Engineering","id":"2beae911649eb461bd430cf56afdc3340fcb9137","venue_1":"Wiley Encyclopedia of Computer Science and Engineering","year":"2008","title":"Geometric Camera Calibration","authors":"Juho Kannala, Janne Heikkilä, Sami S. Brandt","author_ids":"1776374, 1756505, 1786453","abstract":"Geometric camera calibration is a prerequisite for making accurate geometric measurements from image data and it is hence a fundamental task in computer vision. This article gives a discussion about the camera models and calibration methods used in the field. The emphasis is on conventional calibration methods where the parameters of the camera model are determined by using images of a calibration object whose geometric properties are known. The presented techniques are illustrated with real calibration examples where several different kinds of cameras are calibrated using a planar calibration object.","cites":"3","conferencePercentile":"77.08333333"},{"venue":"Wiley Encyclopedia of Computer Science and Engineering","id":"e2b52b331a87762ae7f3e0cfeff8a7669281891b","venue_1":"Wiley Encyclopedia of Computer Science and Engineering","year":"2008","title":"Spreadsheet Programming","authors":"Robin Abraham, Margaret M. Burnett, Martin Erwig","author_ids":"2768764, 1737204, 1796494","abstract":"Spreadsheets are among the most widely used programming systems in the world. Individuals and businesses use spreadsheets for a wide variety of applications, ranging from performing simple calculations to building complex financial models. In this article, we first discuss how spreadsheet programs are actually functional programs. We then describe concepts in spreadsheet programming, followed by a brief history of spreadsheet systems. Widespread use of spreadsheets, coupled with their high error-proneness and the impact of spreadsheet errors, has motivated research into techniques aimed at the prevention, detection, and correction of errors in spreadsheets. We present an overview of research effort that seeks to rectify this problem.","cites":"5","conferencePercentile":"87.5"}]}