{"WILF.csv":[{"venue":"WILF","id":"694e1d91ad25b018b9ab02a40913a706e2614d85","venue_1":"WILF","year":"2007","title":"Computational Humour: Utilizing Cross-Reference Ambiguity for Conversational Jokes","authors":"Hans Wim Tinholt, Anton Nijholt","author_ids":"2866420, 1745198","abstract":"Humour plays an important role in human conversations. People use humour to keep a conversation pleasant, to provide some relaxation during a discussion and to cover up mistakes and misunderstandings. Embodied Conversational Agents (ECAs) that are able to understand and use humour will therefore be more believable and increase the motivation of a user to interact with them (Nijholt, 2005). Until now only few attempts have been made at equipping ECAs with the ability to make conversational jokes based on the context of the conversation. This paper presents a method to utilize cross-reference ambiguity in utterances for simple jokes. The SSTH states that both script overlap and script opposition are required for something to be humorous. Based on an a script representation that is generated using Semantic Role Labelling, it is shown that cross-reference ambiguities always satisfy the SSTH requirement for script overlap. To determine whether script opposition is present a method that compares concepts based on their semantic properties is introduced. When a given cross-reference ambiguity results in script opposition it is possible to generate a joke based on this ambiguity. The IR-Theory introduces two additional properties that may be required in a joke: Taboo and Absurd. Therefore methods to check for these properties are introduced as well. The method to determine whether the property Absurd is present is based on thematic role constraints and the Taboo check uses WordNet Domains to determine whether a subject domain is taboo. A chat application that follows this approach was implemented. The application uses an AIML (Wallace et al., 2003) based chatbot to keep a conversation going with the user. The user input is parsed and all anaphoric references are analysed. When a cross-reference ambiguity is found, its candidate antecedents are compared based on the semantic properties ConceptNet reports for both candidates. If it is considered humorous to deliberately misunderstand this ambiguity a punchline is generated, otherwise the chatbot just continues the conversation. As a result of the low performance of anaphora resolution algorithms on automatically parsed texts and the data scarceness in knowledge resources like ConceptNet the application performs moderately and performing an in-depth evaluation proves difficult. Preliminary results of the evaluation show that the check for the Absurd property is inadequate and the Taboo property performs well but is rarely used. But the analysis for script-opposition (Contrast) appears to be useful and it does provide future prospects in generating conversational …","cites":"11","conferencePercentile":"93.18181818"}]}