{"WiMD_09.csv":[{"venue":"WiMD '09","id":"7451785108722ab2ec87029c100f8ae5260fb0f7","venue_1":"WiMD '09","year":"2009","title":"Robust resource management for predictable services in wireless healthcare","authors":"Cunqing Hua, Rong Zheng","author_ids":"1718010, 3647337","abstract":"Wireless use is growing in the health-care industry. A good wireless solution has the potential to reduce deployment cost, facilitate ubiquitous information access, and improve patient care by eliminating wires, which are a source of infection and physical impediment to clinical care. However, the general perception of wireless communication as being unreliable, unpredictable and unsuitable for safe-critical applications hampers wider adoption of wireless solutions beyond best effort services. In this paper, we argue and demonstrate that wireless networks can in fact be made more reliable by robust resource management. In particular, predictable services can be achieved using joint power control, channel assignment and radio interface selection in multi-radio multi-channel(MR-MC) wireless networks in presence of unpredictable channel dynamics and interferences. Trace-driven simulation study using data collected from our wireless mesh testbed show that the proposed algorithm is indeed superior to existing schemes in reducing outage and packet loss probabilities.","cites":"1","conferencePercentile":"31.81818182"},{"venue":"WiMD '09","id":"868e4334b159c62b6119c755f2a23a1ec4f801ab","venue_1":"WiMD '09","year":"2009","title":"Quality-of-inference (QoINF)-aware context determination in assisted living environments","authors":"Nirmalya Roy, Archan Misra, Sajal K. Das, Christine Julien","author_ids":"1709462, 1721672, 1734537, 3261984","abstract":"Energy-efficient determination of an individual's context (both physiological and activity) is an important technical challenge for assisted living environments. Given the expected availability of multiple sensors, context determination may be viewed as an estimation problem over multiple sensor data streams. This paper develops a formal and practically applicable model to capture the tradeoff between the accuracy of context estimation and the communication overheads of sensing. In particular, we propose the use of tolerance ranges to reduce an individual sensor's reporting frequency, while ensuring acceptable accuracy of the derived context. In our vision, applications specify their minimally acceptable value for a Quality-of Inference (QoINF) metric. We introduce an optimization technique allowing a Context Service to compute both the best set of sensors, and their associated tolerance values, that satisfy the QoINF target at minimum communication cost. Early experimental results with SunSPOT sensors are presented to attest to the promise of this approach.","cites":"9","conferencePercentile":"100"}]}