{"WiMobCityMobiHoc.csv":[{"venue":"WiMobCity@MobiHoc","id":"ac43ae0e235193079f166f6531c90fa747ab8bbc","venue_1":"WiMobCity@MobiHoc","year":"2014","title":"Social opportunistic sensing and social centric networking: enabling technology for smart cities","authors":"Stephan Sigg, Xiaoming Fu","author_ids":"1710108, 3460947","abstract":"In recent years, with tremendous advances in areas like mobile devices, algorithms for distributed systems, communication technology or protocols, all basic technological pieces to realise a Smart City are at hand. Missing, however, is a mechanism that bridges these pieces to ease the creation of Smart Cities at a larger scale. In this visionary paper, we discuss challenges of Smart Cities and propose enabling technologies to bridge the above mentioned pieces for their actual realisation. In particular, we introduce the concepts of Social Opportunistic Sensing (SOS) and Social Centric Networking (SCN). While the former is an enabling technology to interconnect all parties in a Smart City, the latter has the potential to enhance offline social networks in Internet of Things (IoT) enhanced Smart Cities by connecting individuals based on their automatically updated profile via context-based routing.","cites":"0","conferencePercentile":"42.30769231"},{"venue":"WiMobCity@MobiHoc","id":"8ef88fbcd87f8673f8ba4e8449272e66c00fe898","venue_1":"WiMobCity@MobiHoc","year":"2014","title":"A cost-benefit analysis of data processing architectures for the smart grid","authors":"Akshay Uttama Nambi Srirangam Narashiman, Matteo Vasirani, R. Venkatesha Prasad Prasad, Karl Aberer","author_ids":"1810177, 1780693, 8724655, 1751802","abstract":"Information and communication technology (ICT) infrastructure plays an important role to realize the full potential of Smart Grid applications. Smart grids utilize ICT entities to enhance efficiency, reliability and sustainability of power generation and distribution network. Majority of the architectures proposed hitherto focus only on a specific architectural aspect, like communication, storage, processing requirement, etc. Recent studies have shown that lack of knowledge on which architecture best satisfies certain information management requirements has hindered large scale smart grid deployments. In this paper, we investigate the cost-benefit analysis of four data processing architectures for various applications in smart grid. We introduce several key cost indicators to analyze hierarchical data processing architectures for the smart grid. In our evaluation, we consider realistic deployments for both dense and sparse environments. Results reported here are significant for smart grid designers, who can use them to discern the architecture that best fits the system requirements.","cites":"0","conferencePercentile":"42.30769231"},{"venue":"WiMobCity@MobiHoc","id":"01b8253b19f5fa567b060bf23ac3f91a0bb950b5","venue_1":"WiMobCity@MobiHoc","year":"2014","title":"Quantifying the achievable cellular traffic offloading gain with passpoint hotspots","authors":"Sahar Hoteit, Stefano Secci, Guy Pujolle, Sven Wiethölter, Adam Wolisz, Cezary Ziemlicki, Zbigniew Smoreda","author_ids":"2539342, 1711101, 1742339, 1920713, 1778337, 2302634, 1859982","abstract":"Wi-Fi technology has always been an attractive solution for catering the increasing data demand in mobile networks because of the availability of Wi-Fi networks, the high bit rates they provide, and the lower cost of ownership. However, the legacy WiFi technology lacks of seamless interworking between Wi-Fi and mobile cellular networks on the one hand, and between Wi-Fi hotspots on the other hand. Nowadays, the recently released Wi-Fi Certified Passpoint Program provides the necessary control-plane for these operations. Service providers can henceforth look to such Wi-Fi systems as a viable way to seamlessly offload mobile traffic and deliver added-value services, so that subscribers no longer face the frustration and aggravation of connecting to Wi-Fi hotspots. However, the technology being rather recent, we are not aware of public studies at the state of the art documenting the achievable gain in real mobile networks. In this paper, we evaluate the capacity gain that one can get by offloading cellular data traffic over Wi-Fi Passpoint hotspots as a function of different hotspot placement schemes and of access point selection policies (two enabled by the Passpoint control-plane and one independent of it). We compare the policies using real mobile data from the Orange network in Paris. We show that offloading using Passpoint control-plane information can grant up to 15\\% gain with respect to Passpoint-agnostic ones based on signal quality information. As of placement strategy, installing Passpoint hotspots in the outer annulus of the macrocell coverage grants the maximum gains.","cites":"0","conferencePercentile":"42.30769231"}]}