{"WiMob.csv":[{"venue":"WiMob","id":"4edfae96c093a54f7f6e05f595331065cc544482","venue_1":"WiMob","year":"2013","title":"Enhanced cognitive Radio Resource Management for LTE systems","authors":"Ismail AlQerm, Basem Shihada, Kang G. Shin","author_ids":"3345936, 1739466, 1730051","abstract":"—The explosive growth in mobile Internet and related services has increased the need for more bandwidth in cellular networks. The Long-Term Evolution (LTE) technology is an attractive solution for operators and subscribers to meet such need since it provides high data rates and scalable band-width. Radio Resource Management (RRM) is essential for LTE to provide better communication quality and meet the application QoS requirements. Cognitive resource management is a promising solution for LTE RRM as it improves network efficiency by exploiting radio environment information, intelligent optimization algorithms to configure transmission parameters, and mitigate interference. In this paper, we propose a cognitive resource management scheme to adapt LTE network parameters to the environment conditions. The scheme optimizes resource blocks assignment, modulation selection and bandwidth selection to maximize throughput and minimize interference. The scheme uses constrained optimization for throughput maximization and interference control. It is also enhanced by learning mechanism to reduce the optimization complexity and improve the decision-making quality. Our evaluation results show that our scheme achieved significant improvements in throughput and LTE system capacity. Results also show the improvement in the user satisfaction over other techniques in LTE RRM.","cites":"3","conferencePercentile":"69.64285714"},{"venue":"WiMob","id":"85ef2d03557106f3ae482dd15df88b40dfb218ab","venue_1":"WiMob","year":"2009","title":"Adaptive Scheduling of Prioritized Traffic in IEEE 802.16j Wireless Networks","authors":"Debalina Ghosh, Ashima Gupta, Prasant Mohapatra","author_ids":"2902878, 1746844, 1697868","abstract":"—In this paper we propose an adaptive scheduling algorithm for IEEE 802.16j based wireless broadband networks. Computation of an optimal schedule for prioritized traffic in OFDMA based IEEE 802.16 wireless network is an NP-Hard problem. Hence, we propose a scheduling heuristic for an OFDMA based WiMAX relay network. The ORS (OFDMA Relay Sched-uler) heuristic computes the zone boundaries (relay and access) in an uplink scheduling frame based on the number of RSs and MSs, the bandwidth demands and the link conditions. The ORS heuristic determines a schedule which assigns subchannels-timeslot to prioritized traffic based on the demand for various nodes while implementing frequency selectivity. The ORS adapts zone boundaries and the schedule to link and demand conditions at every scheduling period. We perform extensive simulations to demonstrate the effectiveness of adaptive zone scheduling and changes in rate conditions for various topologies.","cites":"6","conferencePercentile":"76.19047619"},{"venue":"WiMob","id":"b71e7c0eb3e2ed91891b1eb0843a6a5d5bf238c6","venue_1":"WiMob","year":"2006","title":"Mobile Service Platform: A Middleware for Nomadic Mobile Service Provisioning","authors":"Aart van Halteren, Pravin Pawar","author_ids":"2218518, 1769261","abstract":"— Ongoing miniaturization and power efficiency of mobile devices have led to widespread availability of devices that have an increasing amount of processing power and storage, and that support multiple wireless network interfaces connecting to various auxiliary devices and to the Internet. It is now feasible for a mobile device to host services and participate in a service discovery network. Roaming of a mobile device from one wireless network to another entails nomadic characteristics to the hosted services. We denote this class of services as Nomadic Mobile Services. This paper discusses the requirements for Nomadic Mobile Service provisioning and proposes the Mobile Service Platform (MSP) as a supporting infrastructure and middleware which extends the Service Oriented Architecture paradigm to the mobile device. The MSP design is based on the Jini Surrogate Architecture Specification which enables devices that can not directly participate in a Jini Network to join a Jini network with the aid of a third party. MSP consists of an HTTPInterconnect protocol to meet the specifications of Jini Surrogate Architecture and provides a custom set of APIs to develop and deploy a Nomadic Mobile Service. This paper also presents case studies of MSP enabled services in diverse domains such as healthcare, robotics and positioning services. To conclude, we outline the need for a context-aware MSP.","cites":"24","conferencePercentile":"100"},{"venue":"WiMob","id":"cfc38201ae60335144543c651c34bb7bbe63713e","venue_1":"WiMob","year":"2007","title":"Analysis of Key Distribution in Mobile Ad Hoc Networks Based on Message Relaying","authors":"Hisham Dahshan, James Irvine","author_ids":"2460775, 6296431","abstract":"Securing wireless mobile ad hoc networks (MANETs) is challenging due to the lack of centralized authority and poor connectivity. A key distribution mechanism is central to any public key management scheme. We propose a novel key distribution scheme for MANETs that exploits the routing infrastructure to effectively chain peer nodes together. Keying material propagates along these virtual chains via a message relaying mechanism. We show that the proposed approach results in a key distribution scheme with low implementation complexity, ideally suited for stationary ad hoc networks and MANETs with low to high mobility. The proposed scheme uses mobility as an aid to fuel the rate of bootstrapping the routing security, but in contrast to existing schemes does not become dependent on mobility. The key dissemination occurs completely on-demand; security associations are only established as needed by the routing protocol. We show through simulations that the scheme's communication and computational overhead has negligible impact on network performance.","cites":"1","conferencePercentile":"30.95238095"},{"venue":"WiMob","id":"385cb42af2b82abfa56d731cca64fabe232663a2","venue_1":"WiMob","year":"2013","title":"Dead Zone Penetration Protocol for Cognitive Radio Networks","authors":"Mohammed Karmoose, Karim Habak, Mustafa ElNainay, Moustafa Youssef","author_ids":"3129700, 2591376, 1791760, 1780388","abstract":"—Current routing protocols for cognitive radio networks are severely affected by the frequent activity of primary users. Nodes that are in the interference range of an appearing primary user are not allowed to transmit, and therefore existing routes which utilize such nodes are obliged to undergo a route maintenance phase. This naturally provides other routes to the destination that may incur extra delay or increase packet queuing overhead. In this work, a novel route maintenance protocol is proposed that allows existing routes to endure the event of primary user presence by forming cooperative links between neighboring nodes and nulling out transmission at the primary receiver using cooperative beamforming. Our proposed protocol can be used in conjunction with any of the existing routing protocols , thus achieving modularity. Extensive simulations are done which prove that our proposed protocol outperforms existing route maintenance techniques in terms of end-to-end delay and loss ratio, with minimal incurred overhead.","cites":"8","conferencePercentile":"91.07142857"},{"venue":"WiMob","id":"7aa3a0ccc0876ba53712eed11bcd75bcde802d22","venue_1":"WiMob","year":"2010","title":"The case for a network adaptation framework in VANETs","authors":"Carlos Fernando Caloca de la Parra, J. Antonio García-Macías, Thierry Delot","author_ids":"2455417, 1683356, 1702251","abstract":"— The diverse communication requirements of different vehicular applications and the innate dynamicity of VANET networks complicate the design of a network layer proposal adequate for all applications and network conditions. This paper highlights the necessity for adaptation of network protocols in VANETs, and describes our ongoing work on a platform (adaptation framework) that will provide VANET developers an environment where they can build network protocols that adapt based on context decisions. The design of our adaptation framework relies heavily on the separation of concerns principle by separating the adaptive protocol in subcomponents, and we model the adaptation as a combination of these subcomponents; for the network layer protocol subcomponent we define specific points where the adaptation can take place. These subcomponents will be developed and compiled independently of adaptation framework code, and linked to the framework at runtime, this thanks to the use of a plug-in platform and component-oriented programming. We describe the framework architecture and how the framework interacts with the framework users, applications and the network protocols. Lastly we briefly talk about the framework's initial implementation and a case study that we are developing to test the adaptation framework.","cites":"0","conferencePercentile":"5.882352941"},{"venue":"WiMob","id":"533e3aac86dc1193b20366caee6e418be8553597","venue_1":"WiMob","year":"2007","title":"WLocator: An Indoor Positioning System","authors":"Shaun Phillips, Michael Katchabaw, Hanan Lutfiyya","author_ids":"3030676, 1793961, 1769104","abstract":"— There exists a multitude of location-sensing systems utilizing wireless technology, though varying in cost, coverage and accuracy. In this paper we will introduce WLocator, a system that aims to strike a balance between these areas. WLocator will provide location information relative to symbolic, user-created \" landmarks \". These landmarks are easily created and maintained, thus reducing short and long term costs. Additionally, the unique matching algorithm invoked by WLocator attempts to offer a relatively high level of accuracy, given the low cost of implementing the system.","cites":"3","conferencePercentile":"57.14285714"},{"venue":"WiMob","id":"31decfde2a755cc7915a200764a12ba7f5cd3f61","venue_1":"WiMob","year":"2005","title":"New QoS control mechanism based on extension to SIP for access to UMTS core network via different kinds of access networks","authors":"Mehdi Mani, Noël Crespi","author_ids":"3224620, 1737867","abstract":"Introduction z The Universal Mobile Telecommunication System (UMTS) community has been increasingly looking for an architecture that can provide consistent networking-independent end-to-end IP QoS that is an essential for supporting real-time application and services.","cites":"3","conferencePercentile":"37.83783784"},{"venue":"WiMob","id":"06fb3db880bfe293f14a79bd7fa05b7e3422484b","venue_1":"WiMob","year":"2010","title":"A lightweight dynamic optimization methodology for wireless sensor networks","authors":"Arslan Munir, Ann Gordon-Ross, Susan Lysecky, Roman L. Lysecky","author_ids":"1748235, 1689567, 1740365, 1746906","abstract":"—Technological advancements in embedded systems due to Moore's law have lead to the proliferation of wireless sensor networks (WSNs) in different application domains (e.g. defense, health care, surveillance systems) with different application requirements (e.g. lifetime, reliability). Many commercial-off-the-shelf (COTS) sensor nodes can be specialized to meet these requirements using tunable parameters (e.g. voltage, frequency) to specialize the operating state. Since a sensor node's performance depends greatly on environmental stimuli, dynamic optimizations enable sensor nodes to automatically determine their operating state in-situ. However, dynamic optimization methodology development given a large design space and resource constraints (memory and computational) is a very challenging task. In this paper, we propose a lightweight dynamic optimization methodology that intelligently selects initial tunable parameter values to produce a high-quality initial operating state in one-shot for time-critical or highly constrained applications. Further operating state improvements are made using an efficient greedy exploration algorithm, achieving optimal or near-optimal operating states while exploring only 0.04% of the design space on average.","cites":"6","conferencePercentile":"76.47058824"},{"venue":"WiMob","id":"c7633d4963c5675573558b2df6d44a7765d4333d","venue_1":"WiMob","year":"2008","title":"VENETA: Serverless Friend-of-Friend Detection in Mobile Social Networking","authors":"Marco von Arb, Matthias Bader, Michael Kuhn, Roger Wattenhofer","author_ids":"2770963, 2852281, 1772075, 1716440","abstract":"—Recently, mobile social software has become an active area of research and development. A multitude of systems have been proposed over the past years that try to follow the success of their Internet bound equivalents. Many mobile solutions try to augment the functionality of existing platforms with location awareness. The price for mobility, however, is typically either the lack of the popular friendship exploration features or the costs involved to access a central server required for this functionality. In this paper, we try to address this issue by introducing a decentralized method that is able to explore the social neighborhood of a user by detecting friends of friends. Rather than only exploiting information about the users of the system, the method relies on real friends, and adequately addresses the arising privacy issues. Moreover, we present VENETA, a mobile social networking platform which, among other features, implements our novel friend of friend detection algorithm.","cites":"42","conferencePercentile":"97.6744186"},{"venue":"WiMob","id":"bf999d4f139d32be8972a6a301eaa3395c5f5180","venue_1":"WiMob","year":"2016","title":"Decentralized Caching in Two-layer Networks: Algorithms and Limits","authors":"Lin Zhang, Zhao Wang, Ming Xiao, Gang Wu, Shaoqian Li","author_ids":"1708615, 7135414, 1715961, 1685951, 1692924","abstract":"—The decentralized caching is studied in two-layer networks, where users request contents through intermediate nodes (helpers) from a file server. By placing contents randomly and independently in each node and carefully designing the data delivery, the correlations of the pre-stored contents across layers can be utilized to reduce the transmission rates in the network. A hybrid caching scheme is developed by exploiting the cross-layer storage correlations, the single-layer multicast opportunities from the server (each helper) to helpers (the attached users), and the cross-layer multicast opportunities from the server to users. It is observed that, by the hybrid caching scheme, the achievable rate in the first layer is reduced without compromising the achievable rate in the second layer compared with the state of art. Furthermore, the achievable rate region is shown to be order-optimal and lies within constant margins to the information-theoretic optimum. In particular, the multiplicative and additive factors are carefully sharpened to be 1 48 and 4, respectively.","cites":"2","conferencePercentile":"91.66666667"},{"venue":"WiMob","id":"a7f8e09dfabb84cf08d09eefdd874038e6324f74","venue_1":"WiMob","year":"2009","title":"Extending k-Coverage Lifetime of Wireless Sensor Networks Using Mobile Sensor Nodes","authors":"Ryo Katsuma, Yoshihiro Murata, Naoki Shibata, Keiichi Yasumoto, Minoru Ito","author_ids":"1989711, 1751497, 1781662, 1765230, 1756280","abstract":"—One of the important issues in wireless sensor network (WSN) is to k-cover the target sensing field and to extend its lifetime. We propose a method to k-cover the field and maximize the WSN lifetime by moving mobile sensor nodes to appropriate positions for a WSN consisting of both static and mobile sensor nodes which periodically collect environmental information. Our target problem is NP-hard. So, we propose a genetic algorithm (GA) based scheme to find a near optimal solution in practical time. In order to speed up the calculation, we devised a method to check a sufficient condition of k-coverage of the field. For the problem that nodes near the sink node have to forward the data from farther nodes, we make a tree where the amount of communication traffic is balanced among all nodes, and add this tree to the initial candidate solutions of our GA-based algorithm. Through computer simulations, we confirmed that our method achieves much longer k-coverage lifetime than conventional methods for 100 to 300 node WSNs. I. INTRODUCTION Wireless Sensor Network (WSN) is a network consisting of many small sensor nodes capable of wireless communication, and it is used for environmental monitoring, border guards, and so on. One of the typical applications of WSN is to periodically collect environmental information such as temperature or brightness from many sensors in a large agricultural field or a forest to a sink node. In order to make such a WSN operate for a long term, we have to carefully schedule and adjust parameters of sensor nodes for sensing data, receiving and transmitting the data. Since each sensor node consumes battery amount not only for sensing data but also for receiv-ing/transmitting the sensed data from/to other sensor nodes, the battery lifetime varies depending on the initial amount, the data size for transmission, the sensing frequency, and the radio transmission distance. Many research efforts have extended the WSN lifetime. Tang et al. reduced power consumption by regulating communication frequency among sensor nodes[1]. Heinzelman et al. reduced total data transmission by merging the data received from multiple sensor nodes[2]. Most of the existing studies suppose static sensor nodes that are not movable after being deployed in the field. WSNs consisting of only static sensor nodes cannot automatically recover unsensable areas generated by failure or battery exhaustion of the corresponding sensor nodes.","cites":"7","conferencePercentile":"83.33333333"},{"venue":"WiMob","id":"bf4137daa92ad23f90fe0acf30b5c8f26fd94e02","venue_1":"WiMob","year":"2010","title":"ARUM: A cooperative middleware and an experimentation platform for mobile systems","authors":"Marc-Olivier Killijian, Matthieu Roy, Gaëtan Séverac","author_ids":"1798219, 1807942, 2987164","abstract":"—In this paper, we present a middleware architecture for dependable mobile systems and an experimentation platform for its evaluation. The proposed architecture includes three building blocks tailored for mobile cooperative applications: a Proximity Map, a Trust and Cooperation Oracle, and a Cooperative Data Backup service. To illustrate our platform, we developed a Distributed Black-box application, whose aim is to record critical data while tolerating the failure of a node, and implemented a hardware evaluation platform of mobile systems for experimenting with the application. We provide here some insights on the development of the platform, focusing on wireless communication. Finding the proper abstractions to design middleware for the provision of dependable distributed applications on mobile devices is still a big challenge[1]. Yet, the number of mobile communicating devices one can meet in everyday life is dramatically increasing. Those devices benefit from an amazing number of sensors and communication interfaces. The interconnection of these systems does not only result in a huge distributed system. New technical and scientific challenges emerge due to the mobility of users and of their devices, or due to the massive scale of uncontrolled devices that constantly connect and disconnect, fail, etc. An important question is thus to know if and how can we design a sound middleware that offers useful building blocks for this type of system. Another crucial question is to study how we can correctly evaluate those highly mobile and dynamic systems. This paper addresses these two questions: we present a middleware architecture dedicated to the provision of cooperative data backup on mobile nodes and a platform for its experimental evaluation. This architecture is exemplified by implementing a Distributed Black-Box (DBB) application which provides a virtual device, whose semantics is similar to avionics black-boxes, that tracks cars' history in a way that can be replayed in the event of a car accident. This application ensures information is securely stored using replication mechanisms, by means of exchanging positions between cars. Our implementation is based on three services tailored for mobile cooperative applications: a Proximity Map, a Trust and Cooperation Oracle, and a Cooperative Data Backup. This DBB application is a good illustration of the use of the various middleware services and applications that users can benefit thanks to mobile communicating devices, such as in the automobile context with car-to-car communication. As a \" classical \" black-box, its aim is to record critical data, such as: engine …","cites":"1","conferencePercentile":"22.05882353"},{"venue":"WiMob","id":"c49a11d8a09dc7abdaca1649d6c1ea7b2186dc07","venue_1":"WiMob","year":"2009","title":"Investigating Deployment Strategies for Multi-radio Multi-channel Residential Wireless Mesh Networks","authors":"Bin Huang, Yan He, Dmitri Perkins","author_ids":"1788219, 1711077, 1780555","abstract":"— Multi-radio multi-channel Wireless Mesh Networks (WMNs) are being increasingly deployed for broadband provision in enterprise, community, metropolitan and rural areas, due to their lower cost and faster deployment compared to the traditional wired broadband networks. In comparison with the former single-radio WMNs, multi-radio multi-channel WMNs can provide higher capacity and more fine-grained interference management. In this paper, we compare the performance of Wireless Mesh Networks with four different backhaul configurations (with different number of radios, different antenna types and different number of parallel backhauls, etc.) for the deployments in the residential areas. Simulation results show that the interference among client access cells makes the access channel the bottleneck of the end-to-end performance no matter what backhaul configuration is used, and tuning the transmission power of the access channel radio can improve the end-to-end performance substantially. We also find that the multi-radio backhaul WMNs do not have the serious performance unfairness among clients with different hop counts from the gateways as the single-radio backhaul WMNs have.","cites":"1","conferencePercentile":"33.33333333"},{"venue":"WiMob","id":"82f271830d31d8abaaecc1ab2192ed278d110c1a","venue_1":"WiMob","year":"2008","title":"Seamless Handover Scheme for Proxy Mobile IPv6","authors":"Ju-Eun Kang, Dong-Won Kum, Yang Li, You Ze Cho","author_ids":"2654848, 2772463, 1678662, 1774291","abstract":"—In a network-based approach such as Proxy Mobile IPv6 (PMIPv6), the serving network controls mobility management on behalf of the Mobile Node (MN). Thus, the MN is not required to participate in any mobility-related signaling. PMIPv6 is being standardized in the IETF NetLMM WG. However, the PMIPv6 still suffers from a lengthy handover latency and packet loss during a handover. In this paper, we propose a seamless handover scheme for PMIPv6. The proposed handover scheme uses the Neighbor Discovery message of IPv6 to reduce the handover latency and packet buffering at the Mobile Access Gateway (MAG) to avoid the on-the-fly packet loss during a handover. In addition, it uses an additional packet buffering at the Local Mobility Anchor (LMA) to solve the packet ordering problem. Simulation results demonstrate that the proposed scheme could avoid the on-the-fly packet loss and ensure the packet sequence.","cites":"6","conferencePercentile":"76.74418605"},{"venue":"WiMob","id":"031cbf5057c53df94d6c971e7a9ef4a0ecc28dc4","venue_1":"WiMob","year":"2010","title":"TrafRoute: A different approach to routing in vehicular networks","authors":"Raphael Frank, Eugenio Giordano, Pasquale Cataldi, Mario Gerla","author_ids":"1731695, 2179191, 2543507, 8467438","abstract":"—In the near future vehicular networks based on wireless technology will be part of our lives. Efficient and robust routing algorithms will play a key role in the success of such technology. In this paper we present TrafRoute, an efficient and robust routing scheme for vehicular networks, suitable for both Vehicle-to-Vehicle and Vehicle-to-Infrastructure communications. TrafRoute introduces a novel approach to routing that involves landmark-based routes and forwarder self-election, exploiting the knowledge of the underlying road network. We demonstrate TrafRoute's efficiency and robustness through simulation studies performed with accurate mobility and propagation models.","cites":"11","conferencePercentile":"91.17647059"},{"venue":"WiMob","id":"6c0dfd6eed3c41e7b77891d3263c233a7ef89be7","venue_1":"WiMob","year":"2009","title":"Media Caching Support for Mobile Transit Clients","authors":"Hazem Gomaa, Geoffrey G. Messier, Robert J. Davies, Carey L. Williamson","author_ids":"2459193, 1778600, 1928946, 3152750","abstract":"—In this paper, we consider the design of caching infrastructure to enhance the client-perceived performance of mobile wireless clients retrieving multimedia objects from the Internet. We consider three primary issues: location of the cache, size of the cache, and management policy for the cache. We consider both infrastructure-oriented caching at the Access Point (AP), as well as peer-assisted caching at the mobile clients. Simulation is used as the methodology for evaluation and comparison of caching strategies. The simulation results show that AP caching is generally more effective than client-side caching, that adequate performance is achievable with a mix of rather modest AP and client-side caches, and that Least Frequently Used (LFU) is the most effective cache replacement policy. Additional simulation experiments show that our results are robust across different request generation rates and client turnover rates.","cites":"7","conferencePercentile":"83.33333333"},{"venue":"WiMob","id":"3ac9dbf21430b42aedfa732fe58033a691e4a139","venue_1":"WiMob","year":"2009","title":"Partial Coverage in Homological Sensor Networks","authors":"Hui Zhang, Paddy Nixon, Simon A. Dobson","author_ids":"1688592, 4361043, 1691235","abstract":"—We present a solid study on the performance of a homological sensor network with partial sensing coverage, which means the network has at least one sensing coverage \" hole \" and we demonstrate that when sacrificing a little coverage the system lifetime can be prolonged significantly. In particular, we showed that when there is one sensing coverage hole (with a coverage rate of 97%) the system lifetime can be extended to 3 – 7 times compared with a full coverage strategy which gives a system lifetime increase with 1.2 – 3 times only. An algebraic topology tool, homology group, is used in our work to calculate sensing coverage of a sensor network.Unlike other approaches, our method does not need any node location or orientation information and it does not have any assumption about the node deployment control and domain geometry either. The only thing needed to calculate sensing coverage is a node to node communication graph.","cites":"2","conferencePercentile":"40.47619048"},{"venue":"WiMob","id":"38254623891cba62ebf432c9718c133c39338e00","venue_1":"WiMob","year":"2016","title":"A multi-channel multiple access scheme using frequency offsets - Modelling and analysis","authors":"Sarwar Morshed, Mitra Baratchi, Pranab K. Mandal, Geert J. Heijenk","author_ids":"2261074, 2847012, 1814995, 1723701","abstract":"—A system using frequency offset based transmit-reference (TR) modulation allows multiple nodes to transmit simultaneously and asynchronously without any mutual timing coordination. Thus, such a system provides inherent capabilities for a multiple access in the medium access control (MAC) layer to coordinate the shared use of the common wireless medium among the nodes of the wireless sensor network (WSN). However, certain characteristics of a frequency offset based system limits its performance, for example, the number of available frequency offsets is limited as it depends on several system parameters, and the number of simultaneous communications using different frequency offsets is limited due to inter-user interference. In this paper, we introduce an extended version of the performance model of a basic slotted-Aloha system, that captures the basic phenomena of a multi-channel system with a limited set of channels and a limit to the number of simultaneously used channels. An analysis of this model reveals the potential of a MAC protocol for TR modulation with frequency offsets. I. INTRODUCTION In wireless communications, the MAC protocol performs the multiple access control for the shared medium. Wireless sensor networks mostly use single channel systems for operation. However, throughput and capacity performance of single channel systems decline as the number of communicating nodes increases with the prevalence of internet of things (IoT). Thus, the WSNs need to have efficient multiple access scheme with multiple channels. A multi-channel system attempts to increase the system throughput and efficiency by using multiple frequency channels. However, this performance improvement comes at the cost of increased power consumption, channel switching delay, channel coordination between sender and receiver, and adjacent channel interference [1]. The power consumption of a node increases if multiple transceivers are used to realize multi-channel communication. A single tunable transceiver to operate on different frequencies adds the overhead of channel switching delay. Most importantly, a detailed coordination for channel switching is necessary among the nodes to ensure that the receiver is on the same channel with the sender at the same time to receive the packet. Furthermore, multi-channel protocols also suffer from inter-channel interference. However, there exists single channel","cites":"0","conferencePercentile":"41.66666667"},{"venue":"WiMob","id":"3e6063bcf24dad28bca68565867109b1a0d2dbd8","venue_1":"WiMob","year":"2013","title":"Identification and mitigation of non-line-of-sight conditions using received signal strength","authors":"Zhuoling Xiao, Hongkai Wen, Andrew Markham, Agathoniki Trigoni, Phil Blunsom, Jeff Frolik","author_ids":"2741851, 1757372, 1725760, 3641238, 1685771, 2896030","abstract":"—Various applications, such as localisation of persons and objects could benefit greatly from non-line-of-sight (NLOS) identification and mitigation techniques. However, such techniques have been primarily investigated for ultra-wide band (UWB) signals, leaving the area of WiFi signals untouched. In this study, we propose two accurate approaches using only received signal strength (RSS) measurements from WiFi signals to identify NLOS conditions and mitigate the effects. We first explore several features from the RSS which are later demonstrated as very effective in identifying and mitigating NLOS conditions. After that, we develop and compare two major optimization problems based on a machine learning technique and hypothesis testing according to different user requirements and information available. Extensive experiments in various indoor environments have shown that our techniques can not only accurately distinguish between LOS/NLOS conditions, but also mitigate the impact of NLOS conditions as well.","cites":"5","conferencePercentile":"83.92857143"},{"venue":"WiMob","id":"fc3ef368e73978d5f8fca6516f4db5224ac28e6b","venue_1":"WiMob","year":"2008","title":"Rate Allocation with Lifetime Maximization and Fairness for Data Aggregation in Sensor Networks","authors":"Shouwen Lai, Binoy Ravindran, Hyeonjoong Cho","author_ids":"1809626, 1729107, 2420548","abstract":"—We consider the rate allocation problem for data aggregation in wireless sensor networks with two objectives: 1) maximizing the lifetime of a local aggregation cluster and, 2) achieving fairness among all data sources. The two objectives are generally correlated with each other and usually they cannot be maximized simultaneously. We adopt a lexicographic method to solve this multi-objective programming problem. First, we recursively induce the maximum lifetime for the local aggregation cluster. Under the given maximum lifetime, we then formulate the problem of maximizing fairness as a convex optimization problem, and derive the optimal rate allocation strategy. We also present low-complexity algorithms that a local aggregation cluster can use to determine the optimal rate allocation. Our simulation results validate our analytical results and illustrate the effectiveness of the approach.","cites":"1","conferencePercentile":"23.25581395"},{"venue":"WiMob","id":"3adf82a92005cdf09148774fb0d1f1f607253d4f","venue_1":"WiMob","year":"2015","title":"Augur: A delay aware forwarding protocol for delay-tolerant networks","authors":"Ahmad El Shoghri, Branislav Kusy, Raja Jurdak, Neil W. Bergmann","author_ids":"1905165, 1752891, 1770270, 1731327","abstract":"—Delay Tolerant Network s (DTN) are characterized by the absence of continuous connectivity resulting in high delivery delays that may exceed the acceptable limit for practical applications. In this paper, we address this issue by introducing Augur. Augur is a new routing protocol for DTNs targeted to minimize delays of message delivery. The routing scheme benefits from the spatiotemporal history data of the nodes to route me ssage s only through gateways having less expected delay to deliver a message to its destination. We demonstrate through a comparative evaluation that Augur outperforms the state of the art DTN protocols in terms of delivery probability, overhead ratio and latency. We found that at low traffic rate s Augur re duces the overhead ratio by up to 94%, and by up to 88% at high traffic. We also observed that the improvement in latency was reduced by up to half over the existing protocols in both traffic rates while still improving the delivery probability of me ssages. I. INTRODUCTION Recently, many wireless networks have emerged in various applications that lack pervasive network infrastructure, including extreme environments like deep space, deep oceans , battlefields and developing regions. The purpose of these networks is to gather data through wireless nodes dispersed in the field and transmit them to specific destinations for future use. However, in these environments there are no guarantees of continuous connectivity between the nodes, and this causes low delivery probability and long delivery delays. Some examples could be interplanetary networks, wild life tracking such as tracking cows and flying foxes, or providing internet connectivity to rural areas through vehicular ad hoc networks (such as buses, taxies, trains and trams). In these examples, data delivery delays are excessive. Although there are protocols to route in these environments, the nonexistence of an explicit delay aware protocol creates a gap in this area. Studies have shown that the participating nodes in the mentioned scenarios exhibit some periodic patterns in their daily tasks and their everyday movement. For instance, people commute with high regularity in terms of starting positions, destinations, starting and arrival times and routes they follow. Studies have also shown the existence of periodic mobility patterns for a range of animals and birds for certain activities like daily foraging and yearly migration. Another example is the scenario of bus movement which follows a specific time","cites":"0","conferencePercentile":"42.30769231"},{"venue":"WiMob","id":"0c68def3ce68199dc37270af1db72a87350d487c","venue_1":"WiMob","year":"2013","title":"Energy efficient and accuracy aware (E2A2) location services via crowdsourcing","authors":"Yun Huang, Anthony Tomasic, Yufei An, Charles Garrod, Aaron Steinfeld","author_ids":"1777347, 1693125, 2181486, 1895987, 1792714","abstract":"—Many mobile applications rely on location information gained from location services on mobile devices. However, continuously tracking the device location with high accuracy drains the battery quickly. Furthermore, sensing the same location can be redundant when multiple devices are co-located. In this paper, we develop a crowdsourcing-based location service, E2A2 (energy efficient and accuracy aware), which places colo-cated devices into groups, and uses group location to represent individual device location. The E2A2 location service aims to reduce individual device battery consumption associated with location services while simultaneously maintaining high location accuracy for each device. Our experimental results from a prototype system show the effectiveness of our proposed solution with different mobility patterns. We also present results on the impact of different system parameters and the number of users in a group. Compared to running GPS location services on individual devices separately, our E2A2 service saves on average 33% battery consumption rate when 4 devices are co-located at walking speed and 26% battery consumption rate when 4 devices are colocated on the same bus while meeting the same accuracy requirements.","cites":"4","conferencePercentile":"76.78571429"},{"venue":"WiMob","id":"451532a28b33189e10a848455972b4b108f801b7","venue_1":"WiMob","year":"2005","title":"SAMVAAD: speech applications made viable for access-anywhere devices","authors":"Nitendra Rajput, Amit Anil Nanavati, Mohit Kumar, Pankaj Kankar, Rajan Dahiya","author_ids":"3304776, 8641651, 1780130, 1787708, 1870725","abstract":"— The proliferation of pervasive devices has stimulated the development of applications that support ubiquitous access via multiple modalities. Since the processing capabilities of pervasive devices differ vastly, device-specific application adaptation becomes essential. We address the problem of speech application adaptation by dialog call-flow reorganisation for pervasive devices with different memory constraints. Given an atomic dialog call-flow A and device memory size m, we present optimal deterministic algorithms, RESEQUENCE and BALANCE-TREE, which minimise the number of questions in the reorganised output call-flow Am. Algorithms MASQ and MATREE produce Cm, minimally distant from input call-flow C, while accomodating the memory constraint m. These two minimisation criteria are capable of capturing various usability requirements important in dialog call-flow design. The following observation forms the cornerstone of all the algorithms in this paper: Two grammars g1 and g2 comprising of |g1| and |g2| elements respectively can be merged into a single grammar g = g1 × g2 having |g1| · |g2| elements for the sequential case, and g = g1 +g2 having |g1|+|g2| elements for the tree case. Device-specific considerations lead us to introduce the concept of an m, q-characterisation of a call-flow, defined as the set of pairs {(mi, qi)|i ∈ N }, where qi is the minimum number of questions required for memory size mi. Each call-flow has a unique, device-independent signature in its m, q-characterisation – a measure of its adaptability. We present SAMVAAD, a system that implements these algorithms on call-flows authored in VXML containing SRGS grammars. The system was tested on an IBM voice browser using a sample airline reservation system call-flow reorganised for memories ranging from 64 MB to 210 KB. We ran an experiment with 14 users to obtain feedback on the usability of the adapted call-flows.","cites":"2","conferencePercentile":"27.02702703"},{"venue":"WiMob","id":"ed1bc29c0a7f71d141d1354d0d77263f5a22382b","venue_1":"WiMob","year":"2009","title":"DAR: Distributed Adaptive Service Replication for MANETs","authors":"Asaad Ahmed, Keiichi Yasumoto, Naoki Shibata, Tomoya Kitani, Minoru Ito","author_ids":"3095357, 1765230, 1781662, 2556837, 1756280","abstract":"—Mobile Ad Hoc Networks (MANETs) can be used to provide mobile users temporary infrastructure to use services such as database retrieval service when traditional infrastructure-based networks are unavailable in infrastructure-less situations (e.g. after a destructive disaster like an earthquake). The challenging task in such dynamic environments is how we can improve the service availability. An effective strategy is replicating a service at some nodes distributed across the network. However, service replication can considerably impact the system energy consumption. Since mobile devices have a limited amount of battery, a dynamic and efficient service replication is necessary to support such environments. In this paper, we propose a distributed service replication scheme for achieving high service availability with reasonable energy consumption for MANETs. The proposed method called Distributed Adaptive Service Replication (DAR) divides the whole network into disjoint zones of at most 2-hops in diameter and builds a dynamic replication mechanism which puts replicas only in zones with high service demand. Through simulations, we have confirmed that our approach can achieve higher service availability and lower energy consumption than an existing method.","cites":"3","conferencePercentile":"52.38095238"},{"venue":"WiMob","id":"0ab2003fbc434426e2899b109154009a5190e86f","venue_1":"WiMob","year":"2009","title":"Exploiting RF-Scatter: Human Localization with Bistatic Passive UHF RFID-Systems","authors":"Dominik Lieckfeldt, Jiaxi You, Dirk Timmermann","author_ids":"1753990, 1804487, 1741106","abstract":"—In ubiquitous computing, localization of users in indoor environments is a challenging issue. On the one hand, localization data needs to have fine granularity to provide reasonable input for intention recognition and task planning. On the other hand, effects like multi-path interference and signal scattering of RF propagation in indoor environments reduces the accuracy of traditional wireless localization techniques. However, we prove that such adversary effects can be characterized and utilized conversely to localize the source of RF-scatter with passive UHF RFID. Since measuring spatial correlation requires many spatially separated transmitter and receiver pairs, cost-effective and unobtrusively attachable passive RFID-tags are especially suitable for this purpose. The passive tags are spatially distributed in a manner such that it is possible to infer the spatial correlation of Received Signal Strength (RSS). The idea is to characterize the influence of user presence on RSS, and use such relationship for localization. Three localization algorithms are investigated which consist of a Maximum Likelihood Estimator (MLE), and two Linear Least Squares variants. Algorithms are applied to measurement data which we obtained in an indoor environment. The results evidences our idea of human localization in such bistatic RFID systems.","cites":"10","conferencePercentile":"92.85714286"},{"venue":"WiMob","id":"26570223d8918434e2d904754f42b1f85ec14f57","venue_1":"WiMob","year":"2012","title":"Evaluating the threat of epidemic mobile malware","authors":"Christian Szongott, Benjamin Henne, Matthew Smith","author_ids":"3029655, 2602231, 1767286","abstract":"—While mobile malware has played a relatively small role compared to the behemoth of desktop malware, the changes both in the capability as well as in the proliferation of the mobile devices will steadily increase the attractiveness of mobile devices as resources to be attacked. The increased usage and connectivity of mobile devices opens up a much larger set of attack vectors to compromise these devices. In this paper, we discuss how the new features of mobile devices opens up the capability to create a new generation of mobile malware which is capable of realistically spreading epidemically on a fully mobile infection vector. We present a prototype of such a mobile malware that uses these features to replicate itself and spread over a mobile device-to-device vector. Using simulations we give quantitative support for the number of mobile devices and conditions needed to for an epidemic spread of mobile malware and present infection scenarios in downtown Chicago. Our results show that the recent growth and market dominance of just a handful of mobile phone companies and the trend towards mobile operating systems monoculture has already created a viable substrate for epidemic mobile malware.","cites":"6","conferencePercentile":"83.33333333"},{"venue":"WiMob","id":"33cfabebf107024c4c5af221045f7f96f52a3d0b","venue_1":"WiMob","year":"2012","title":"Mistify: Augmenting cloud storage with delay-tolerant cooperative backup","authors":"Karthik Nilakant, Jon Crowcroft, Eiko Yoneki","author_ids":"2049310, 1726850, 2004672","abstract":"—A variety of personal backup services now allow users to synchronise their files across multiple devices such as laptops and smartphones. These applications typically operate by synchronising each device with a centralised storage service across the Internet. However, access to the Internet may occasionally not be available, leaving any unsynchronised content in a vulnerable state. To address this, applications could alternatively make use of storage capacity provided by other devices within close proximity, using ad-hoc or local network connectivity. Such devices can provide a secondary storage tier in case of Internet connectivity issues, and could also be used to forward files to central storage at a later time. In our proposed design, we delegate the task of propagating information across locally networked devices to a lower layer, by making use of a content-centric opportunistic network platform (Haggle). This allows our application, Mistify, to treat the neighbourhood of peers as a single distributed content repository (or \" mist \"), in a manner similar to the way in which existing applications interface with the cloud. Mistify employs a differentiated replication strategy, with the aim of improving the safety of items in the mist. In our evaluation of the prototype, we have found that in a simulated network of locally-connected peers, the prototype was able to achieve a high level of availability for stored content, without resorting to flooding. Furthermore, Mistify was able to deliver a high proportion of content to the cloud, even when only a small proportion of nodes were given Internet connectivity.","cites":"0","conferencePercentile":"12.12121212"},{"venue":"WiMob","id":"63e2c1cb1a0056f6925b3baed79f52b9235aca9e","venue_1":"WiMob","year":"2006","title":"A Distributed Architecture for Reasoning about a Higher-Level Context","authors":"Waltenegus Dargie, Thomas Hamann","author_ids":"3149184, 1694893","abstract":"— This paper presents a distributed architecture for reasoning about a higher-level context as an abstraction of a dynamic real-world situation. Reasoning about a higher-level context entails dealing with data acquired from sensors, which can be inexact, incomplete, and/or uncertain. Inexact sensing arises mostly due to the inherent limitation of sensors to capture a real world phenomenon precisely. Incompleteness is caused by the absence of a mechanism to capture certain real-world aspects; and uncertainty stems from the lack of knowledge about the reliability of the sensing sources, such as their sensing range, accuracy, and resolution. The proposed architecture enables the modelling of an interactive computing environment with facts and beliefs to manipulate data from a variety of sensors with different sensing specifications. It will be shown how the architecture enables to reason about the whereabouts of a person in the absence of any location sensor. Depending on the available primitive contexts (temperature, relative humidity, sound pressure, light intensity and time) and the reliability of the sensors employed, the architecture enables to determine with different degree of uncertainty, whether a person is on a corridor or inside a room, a building, or outside a building.","cites":"5","conferencePercentile":"57.89473684"}]}