{"WIMS.csv":[{"venue":"WIMS","id":"773321cf179b499d81dd026c95703857bf993cb8","venue_1":"WIMS","year":"2013","title":"Data processing and semantics for advanced internet of things (IoT) applications: modeling, annotation, integration, and perception","authors":"Pramod Anantharam, Payam M. Barnaghi, Amit P. Sheth","author_ids":"2446751, 1740880, 1709950","abstract":"This tutorial presents tools and techniques for effectively utilizing the Internet of Things (IoT) for building advanced applications, including the Physical-Cyber-Social (PCS) systems. The issues and challenges related to IoT, semantic data modelling, annotation, knowledge representation (e.g. modelling for constrained environments, complexity issues and time/location dependency of data), integration, analysis, and reasoning will be discussed. The tutorial will describe recent developments on creating annotation models and semantic description frameworks for IoT data (e.g. such as W3C Semantic Sensor Network ontology). A review of enabling technologies and common scenarios for IoT applications from the data and knowledge engineering point of view will be discussed. Information processing, reasoning, and knowledge extraction, along with existing solutions related to these topics will be presented. The tutorial summarizes state-of-the-art research and developments on PCS systems, IoT related ontology development, linked data, domain knowledge integration and management, querying large-scale IoT data, and AI applications for automated knowledge extraction from real world data.","cites":"0","conferencePercentile":"28.72340426"},{"venue":"WIMS","id":"f57f82c2c7a7f116d4277428b9b7778592cb1711","venue_1":"WIMS","year":"2014","title":"Linking Social, Open, and Enterprise Data","authors":"Tope Omitola, John Davies, Alistair Duke, Hugh Glaser, Nigel Shadbolt","author_ids":"2267342, 3585934, 1750788, 2907424, 1705314","abstract":"The new world of big data, of the LOD cloud, of the app economy, and of social media means that organisations no longer own, much less control, all the data they need to make the best informed business decisions. In this paper, we describe how we built a system using Linked Data principles to bring in data from Web 2.0 sites (LinkedIn, Salesforce), and other external business sites such as OpenCorporates, linking these together with pertinent internal British Telecommunications enterprise data into that enterprise data space. We describe the challenges faced during the implementation, which include sourcing the datasets, finding the appropriate \"join points\" from the individual datasets, as well as developing the client application used for data publication. We describe our solutions to these challenges and discuss the design decisions made. We conclude by drawing some general principles from this work.","cites":"1","conferencePercentile":"64.16666667"},{"venue":"WIMS","id":"e3a91edccc2c0170e6aa26e4858041ebc30d3487","venue_1":"WIMS","year":"2012","title":"Designing privacy-aware social networks: a multi-agent approach","authors":"Andrei Ciortea, Yann Krupa, Laurent Vercouter","author_ids":"3061564, 2941283, 2100024","abstract":"People do not generally mind that some personal information is shared, but that it is shared in the wrong ways and with inappropriate others. We introduce a model for the automatic detection of incompatible relationships among agents in a virtual community. We define this model to the aim of adding to the PrivaCIAS framework a new layer that follows the theory of contextual integrity in more depth. We describe in detail the implementation of a proof of concept privacy-aware photo-sharing social network that we had developed for Android smartphones. The social network was built on the extended PrivaCIAS framework, and thus illustrates its applicability in helping users to preserve privacy.","cites":"3","conferencePercentile":"71.52777778"},{"venue":"WIMS","id":"b54a24a617e004aff80373a350d3150502e29565","venue_1":"WIMS","year":"2012","title":"\"Closing\" some doors for the open semantic web","authors":"Jeff Z. Pan","author_ids":"1704953","abstract":"John McCarthy defines <i>Artificial Intelligence (AI)</i> as the science and engineering of making intelligent machines, especially intelligent computer systems. To build intelligent systems, many of AI researchers, including experts in machine learning and data mining, focus on building \"smart applications\", which perform complex transformations and manipulations on raw data to discover insights and hidden patterns. On the other hand, the <i>Semantic Web</i>, which exploits the state of the art technologies (in particular ontology reasoning) from <i>Knowledge Representation</i>, a well established branch of AI, attempts to build intelligent systems based on \"smart data\", which is annotated and described by ontological vocabulary. The \"smart application\" and \"smart data\" directions constitute two major approaches to intelligent system. The former is generally the inductive approach that exploits the pattern of large amount of data. The later is generally the deductive approach that exploits the possibilities of even a small fraction of data. These two approaches complement each other in many complex scenarios:\n &#8226; mining technologies can be used to help discover knowledges from huge data sets;\n &#8226; semantic technologies can be used to check if the discovered knowledge are consistent with the existing knowledge and, if so, exploit them so as to meet application requirements.","cites":"0","conferencePercentile":"15.97222222"},{"venue":"WIMS","id":"6ba9593fa512d07daca0361c234c8cc4f8b3ce3c","venue_1":"WIMS","year":"2012","title":"A multi-agent supervising system for smart environments","authors":"Irina Mocanu, Adina Magda Florea","author_ids":"2595036, 1732513","abstract":"This paper presents a multi-agent architecture for a supervising system which is part of a new intelligent ambient system, called AmIHomCare. The supervising system detects the context of the person (using a domain ontology): the person location in the room together with the surrounding objects and its body posture. A sequence of these contexts is assembled in a daily activity, based on a set of rules, described by a stochastic context free grammar with attributes. Also the system predicts the next context and the next activity in order to detect emergencies in the smart environment.","cites":"0","conferencePercentile":"15.97222222"},{"venue":"WIMS","id":"e1d0ef91d22a9e2f76f5969b6b4bab2fa86949c9","venue_1":"WIMS","year":"2014","title":"When in Doubt Ask the Crowd: Employing Crowdsourcing for Active Learning","authors":"Mihai Georgescu, Dang Duc Pham, Claudiu S. Firan, Ujwal Gadiraju, Wolfgang Nejdl","author_ids":"8101903, 1781794, 3180776, 2516584, 1744808","abstract":"Crowdsourcing has become ubiquitous in machine learning as a cost effective method to gather training labels. In this paper we examine the challenges that appear when employing crowdsourcing for active learning, in an integrated environment where an automatic method and human labelers work together towards improving their performance at a certain task. By using Active Learning techniques on crowd-labeled data, we optimize the performance of the automatic method towards better accuracy, while keeping the costs low by gathering data on demand. In order to verify our proposed methods, we apply them to the task of deduplication of publications in a digital library by examining metadata. We investigate the problems created by noisy labels produced by the crowd and explore methods to aggregate them. We analyze how different automatic methods are affected by the quantity and quality of the allocated resources as well as the instance selection strategies for each active learning round, aiming towards attaining a balance between cost and performance.","cites":"2","conferencePercentile":"83.33333333"},{"venue":"WIMS","id":"e0057dcaad45f3e076daee50bae114aceebaeb02","venue_1":"WIMS","year":"2013","title":"Automatic classification of documents in cold-start scenarios","authors":"Ricardo Kawase, Marco Fisichella, Bernardo Pereira Nunes, Kyung-Hun Ha, Markus Bick","author_ids":"1727722, 8350425, 2988251, 2875523, 1808103","abstract":"Document classification is key to ensuring quality of any digital library. However, classifying documents is a very time-consuming task. In addition, few or none of the documents in a newly created repository are classified. The non-classification of documents not only prevents users from finding information but also hinders the system's aptitude to recommend relevant items. Moreover, the lack of classified documents prevents any kind of machine learning algorithm to automatically annotate these items. In this work, we propose a novel approach to automatically classifying documents that differs from previous works in the sense that it exploits the wisdom of the crowds available on the Web. Our proposed strategy adapts an automatic tagging approach combined with a straightforward matching algorithm to classify documents in a given domain classification. To validate our findings, we compared our methods against the existing and performed a user evaluation with 61 participants to estimate the quality of the classifications. Results show that, in 72% of the cases, the automatic classification is relevant and well accepted by participants. In conclusion, automatic classification can facilitate access to relevant documents.","cites":"0","conferencePercentile":"28.72340426"},{"venue":"WIMS","id":"3c860c9559cf8d8f081316c84aa19733db2ccecb","venue_1":"WIMS","year":"2012","title":"User profile based activities in flexible processes","authors":"Marco Fisichella, Juri Luca De Coi, Ricardo Kawase, Maristella Matera","author_ids":"8350425, 2417581, 1727722, 1727982","abstract":"COOPER platform is a collaborative, open environment that leverages on the idea of flexible, user-centric process support. It allows cooperating team members to define collaborative processes and flexibly modify the process activities even during process execution. In this paper we describe how the incorporation of decentralized user data through mashups, allows the COOPER platform to support the definition and execution of the so called user profile based activities, i.e., process activities that are adapted based on the preferences of the process actors. We define two basic types of user profile based activities, namely user adapted activities and user conditional activities. The first are modeled according to the user profile data, while the second employs the same user data to enable automatic workflow decisions.","cites":"0","conferencePercentile":"15.97222222"},{"venue":"WIMS","id":"47c4d67c5a6f8ee92b46523b3ab0f36a9f54182b","venue_1":"WIMS","year":"2012","title":"Everyday problems vs. UbiComp: a case study","authors":"Pawel Wozniak, Andrzej Romanowski","author_ids":"3336776, 2818124","abstract":"It is widely accepted that ubiquitous computing (UbiComp) prototyping is one of the methods that can be used to anticipate how future systems are to be designed and what problems can be solved with computational devices. This paper discusses a number of small-scale projects in which researchers attempted to apply some of the UbiComp methodologies to finding solutions to fairly simple problems that surface during everyday campus life. The process aims at finding ways to discover how pervasive technology can affect even the most trivial aspects of human lives as well as trying to make more profound changes. The projects discussed in this paper include a tool for measuring and communicating campus room occupancy, a mobile mode-of-transport detector and a context-aware application for reducing domestic carbon footprint. The applications illustrate the vast possibilities that present mobile platforms offer to the UbiComp researcher and, most importantly, the opportunity to create large numbers of prototypes by numerous users that can be easily evaluated. The authors claim that the software fulfils many UbiComp prototyping requirements and gives great opportunities for field studies. Furthermore, the wide availability of prototyping techniques suggests that computer enthusiasts are now easily immersed in the experience of the UbiComp of the present and the future face of computing can be shaped by many. If, however, one is to verify the applicability of the prototyped systems, even more users must be involved in the UbiComp experience.","cites":"1","conferencePercentile":"43.75"},{"venue":"WIMS","id":"8697affbffed8403dd5244b12f72b5dc5b243e06","venue_1":"WIMS","year":"2015","title":"Modeling and predicting information search behavior","authors":"Saraschandra Karanam, Herre van Oostendorp, Mylène Sanchiz, Aline Chevalier, Jessie Chin, Wai-Tat Fu","author_ids":"2308425, 2447073, 2968216, 3254631, 1683798, 1855095","abstract":"This paper looks at two limitations of cognitive models of web-navigation: first, they do not account for the entire process of information search and second, they do not account for the differences in search behavior caused by aging. To address these limitations, data from an experiment in which two types of information search tasks (simple and difficult), presented to both young and old participants was used. We found that in general difficult tasks demand significantly more time, significantly more clicks, significantly more reformulations and are answered significantly less accurately than simple tasks. Older persons inspect the search engine result pages significantly longer, produce significantly fewer reformulations with difficult tasks than younger persons, and are significantly more accurate than younger persons with simple tasks. We next used a cognitive model of web-navigation called CoLiDeS to predict which search engine result a user would choose to click. Old participants were found to click more often only on search engine results with high semantic similarity with the query. Search engine results generated by old participants were of higher semantic similarity value (computed w.r.t the query) than those generated by young participants only in the second cycle. Match between model-predicted clicks and actual user clicks was found to be significantly higher for difficult tasks compared to simple tasks. Potential improvements in enhancing the modeling and its applications are discussed.","cites":"4","conferencePercentile":"89.47368421"},{"venue":"WIMS","id":"ea68bee5f6a535d3df4a012d90d5308f44aa282c","venue_1":"WIMS","year":"2014","title":"Improving Efficiency of Sequence Mining by Combining First Occurrence Forest (FOF) Strategy and Sibling Principle","authors":"Kezban Dilek Onal, Pinar Senkul","author_ids":"2766922, 2777963","abstract":"Sequential pattern mining is one of the basic problems in data mining and it has many applications in web mining. The WAP-Tree (Web Access Pattern Tree) data structure provides a compact representation of single-item sequence databases. WAP-Tree based algorithms have shown notable execution time and memory consumption performance on mining single-item sequence databases. We propose a new algorithm FOF-SP, a WAP-Tree based algorithm which combines an early prunning strategy called \"Sibling Principle\" from the literature and FOF (First Occurrence Forest) strategy. Experimental results revealed that FOF-SP finds patterns faster than previous WAP-Tree based algorithms PLWAP and FOF. Moreover, FOF-SP can mine patterns faster than PrefixSpan and as fast as LAPIN on real sequence databases from web usage mining and bioinformatics.","cites":"0","conferencePercentile":"25.83333333"},{"venue":"WIMS","id":"93ef09afcf4c70e4404da5f277570faf70b91b6a","venue_1":"WIMS","year":"2011","title":"Large knowledge collider: a service-oriented platform for large-scale semantic reasoning","authors":"Matthias Assel, Alexey Cheptsov, Georgina Gallizo, Irene Celino, Daniele Dell'Aglio, Luka Bradesko, Michael J. Witbrock, Emanuele Della Valle","author_ids":"2707909, 1770552, 2730011, 3076915, 2307349, 2877011, 2819135, 2539248","abstract":"Recent advances in the Semantic Web community have yielded a variety of reasoning methods used to process and exploit semantically annotated data. However, most of those methods have only been approved for small, closed, trustworthy, consistent, and static domains. Still, there is a deep mismatch between the requirements for reasoning on a Web scale and the existing efficient reasoning algorithms over restricted subsets. This paper describes the pilot implementation of LarKC -- the Large Knowledge Collider, a platform, which focuses on supporting large-scale reasoning over billions of structured data in heterogeneous data sets. The architecture of LarKC allows for an effective combination of techniques coming from different Semantic Web domains by following a service-oriented approach, supplied by sustainable infrastructure solutions.","cites":"16","conferencePercentile":"96.15384615"},{"venue":"WIMS","id":"7e108938bb0e39901398d9e07a6fbfca74410267","venue_1":"WIMS","year":"2014","title":"Automating Web-Navigation Support Using a Cognitive Model","authors":"Sonal Aggarwal, Herre van Oostendorp, Bipin Indurkhya","author_ids":"2034897, 2447073, 1904554","abstract":"Reducing cognitive overhead is one way to ensure fast and easy web-navigation for users. We present here an automated navigation-support tool for websites. Whenever a user visits a website for searching some information, the tool will suggest relevant links to click, where they can find desired information on that website. The tool is based on a new cognitive model CoLiDeS++Pic, which combines two related models, CoLiDeS+ and CoLiDeS+Pic. The model computes semantic similarity between the user goal and the website information using latent semantic analysis technique. It also takes into account the path adequacy, performs appropriate backtracking if required, and uses semantic information from pictures. In the current implementation, the tool is not fully automated because the semantic features of pictures have to be obtained manually. To evaluate the effectiveness of the tool, we conducted an experiment with tool support and multi-tasking as independent variables. Statistical analysis showed a significant positive impact of the tool support for time needed to perform search tasks, disorientation in navigation and task-accuracy. The navigation performance in time and disorientation of the users and answering questions are improved when provided with the tool support. Multi-tasking had no effect on time needed or answering questions, but we observed an unexpected positive effect on disorientation, suggesting that perhaps the participants were more motivated to perform primary task due to the assigned secondary task (monitoring a video at the same time), which resulted in less disorientation.","cites":"1","conferencePercentile":"64.16666667"},{"venue":"WIMS","id":"2acacec2890e19a19d437805121240b968f3fdc8","venue_1":"WIMS","year":"2016","title":"Stream Reasoning for the Internet of Things: Challenges and Gap Analysis","authors":"Xiang Su, Ekaterina Gilman, Peter Wetz, Jukka Riekki, Yifei Zuo, Teemu Leppänen","author_ids":"7883788, 2977276, 1792104, 1745217, 2459034, 1967502","abstract":"The Internet of Things (IoT) is not only about interconnecting embedded devices to the Internet, but also about providing knowledge on such devices and what they sense from the physical world. One focus of IoT is put on extracting actionable knowledge and providing value-added services by means of reasoning techniques. Stream reasoning techniques offer a promising solution for processing dynamic, heterogeneous, and volume data for IoT. In this article, we identify the challenges for utilizing stream reasoners from the IoT point of view, review the landscape of stream reasoning techniques, and examine their capabilities to meet the challenges of IoT. Moreover, we present an experimental IoT system implementing stream reasoning and perform a gap analysis to evaluate stream reasoners. Finally, based on the analysis, we suggest several recommendations for future development of stream reasoners in order to overcome the identified gaps.","cites":"0","conferencePercentile":"47.22222222"},{"venue":"WIMS","id":"1c6dde16b901734d497562e440fbb6b6a6373fe5","venue_1":"WIMS","year":"2013","title":"Physical cyber social computing for human experience","authors":"Amit P. Sheth, Pramod Anantharam","author_ids":"1709950, 2446751","abstract":"Computing has a critical role in solving some of the grand challenges spanning health and wellbeing, sustainability, and prevention of crime. Traditionally, computing has focused on a single narrow view of the problem to provide solutions ignoring the essential human experience component. The availability of low-cost sensors and mobile devices leading to simultaneous and continuous access to events spanning physical, cyber, and social worlds demands rethinking of the traditional computational approaches. We propose Physical-Cyber-Social (PCS) computing, that takes a human centric and holistic view of computing by analyzing observations, knowledge, and experiences from physical, cyber, and social worlds. We exemplify real-world problems that demands the approach of PCS computing and outline the research challenges in building algorithms and techniques for PCS computing.","cites":"1","conferencePercentile":"67.0212766"},{"venue":"WIMS","id":"63a89344f62e9cd605b34e16afe30372fd351091","venue_1":"WIMS","year":"2012","title":"A literature-based method to automatically detect learning styles in learning management systems","authors":"Pham Quang Dung, Adina Magda Florea","author_ids":"3266465, 1732513","abstract":"Efficiency and effectiveness of learning process can be improved by adaptations to learners' learning styles. But for the time being, most of existing education systems lack of adaptation or personalization; every learner is delivered the same learning contents. Many researchers have been studying to find out an efficient way of students' learning style identification for a better personalization. In our study, we concentrate on intelligent agents that can provide the learners with personal assistants to carry out learning activities according to their learning styles and knowledge level. In this paper, we present a new literature-based method that uses learners' behaviours on learning objects as indicators for estimating students' learning styles during an online course conducted in our POLCA learning management system. The evaluation of learning style estimation and adaptation from our experiment show a high precision. Together with the mentioned benefits of learning style adaptation, this result indicates that our method is capable for wide use.","cites":"7","conferencePercentile":"95.83333333"},{"venue":"WIMS","id":"a59890a8c39afeb828b32ae1448c4e7d45abf3f8","venue_1":"WIMS","year":"2011","title":"What have fruits to do with technology?: the case of Orange, Blackberry and Apple","authors":"Surender Reddy Yerva, Zoltán Miklós, Karl Aberer","author_ids":"2584654, 2034074, 1751802","abstract":"Twitter is a micro-blogging service on the Web, where people can enter short messages, which then become visible to other users of the service. While the topics of these messages varies, there are a lot of messages where the users express their opinions about companies or products. Since the twitter service is very popular, the messages form a rich source of information for companies. They can learn with the help of data mining and sentiment analysis techniques, how their customers like their products or what is the general perception of the company. There is however a great obstacle for analyzing the data directly: as the company names are often ambiguous, one needs first to identify, which messages are related to the company. In this paper we address this question. We present various techniques to classify tweet messages, whether they are related to a given company or not, for example, whether a message containing the keyword \"apple\" is about the company Apple Inc.. We present simple techniques, which make use of company profiles, which we created semi-automatically from external Web sources. Our advanced techniques take ambiguity estimations into account and also automatically extend the company profiles from the twitter stream itself. We demonstrate the effectiveness of our methods through an extensive set of experiments.","cites":"11","conferencePercentile":"91.53846154"},{"venue":"WIMS","id":"e868ffa683fc6afa1f8dc94d222811f629965154","venue_1":"WIMS","year":"2014","title":"Non-Local Dictionary Based Japanese Dish Names Recognition Using Multi-Feature CRF from Online Reviews","authors":"Weichang Chen, Katsuhiko Kaji, Nobuo Kawaguchi, Kei Hiroi","author_ids":"1913188, 1728305, 1701521, 2852697","abstract":"In cuisine recommender service, online user review is an important data source avoiding a cold-start problem. Cuisine-domain named entity recognition(NER) can be used as an entrance to comprehend the semantic information of reviews. This paper describes a supervised approach recognizing Japanese dish name entity (DNE) from online reviews of Japanese cuisine website. In the first stage, this work adopts tweets as the data source to construct the dictionary of dish name elements through semantic rules and use Bayesian posterior to remove noise. Next stage, we maps first-stage dictionary as a non-local feature into Conditional Random Field (CRF) to recognize the dish name. This method can automatically add new dish name elements into the non-local dictionary by iteration during the recognition proceeding. By using 10-fold validation, experimental results show our method can reach 84.38% in F1 score and outperform the two baselines using the dictionary or CRF with term feature separately.","cites":"0","conferencePercentile":"25.83333333"},{"venue":"WIMS","id":"17ad3e4a9ae832dee6ba5ad9ba9275b65fdc7f3d","venue_1":"WIMS","year":"2011","title":"The Semantic Web 10th year update","authors":"James A. Hendler","author_ids":"1701341","abstract":"This talk is based on the fact that the Scientific American article by Tim Berners-Lee, Ora Lassila and James Hendler was published on May 21, 2001. The WIMS'11 conference is an appropriate event to reflect on the 10 years - successes and misses.","cites":"0","conferencePercentile":"12.30769231"},{"venue":"WIMS","id":"dd3fc62eac6a13b3b19520b4e3b2442a3e1e720a","venue_1":"WIMS","year":"2012","title":"Making your semantic application addictive: incentivizing users!","authors":"Roberta Cuel, Oksana Tokarchuk, Monika Kaczmarek, Jakub Dzikowski, Elena Paslaru Bontas Simperl, Szymon Lazaruk","author_ids":"2111744, 3221148, 2884100, 2713849, 2927032, 2442209","abstract":"Since many semantic content creation methods and initiatives have been developed, a fully automatic process cannot be implemented. As a consequence, many application designers are interested in the question of how to motivate users to become a part of this endeavor, compensating the limitations of purely machine-driven content creation techniques. Methods from areas as diverse as community support, participation management, usability engineering, mechanism design, and social computing, can be applied to analyze semantically enabled applications, and design incentivized variants thereof. Building on top of these theories, we revisit fundamental design issues of semantic-content authoring technology focusing on the identification of a set of incentives that drives people to contribute, and on the ways such incentives can be translated into guidelines for technology and application designers. In order to show some best practices that designers should take into account encouraging large-scale user participation in semantic applications, we describe an experiment conducted with students of the Poznan University of Economics. Following the empirical findings and insights gained during the experimental operations, we propose some general guidelines, which provide software developers with a baseline to create semantics-based technologies and end-user applications that are not just functional, but facilitate and encourage user participation.","cites":"1","conferencePercentile":"43.75"},{"venue":"WIMS","id":"13a61eba0c128f543646649d466ada4148efb5c8","venue_1":"WIMS","year":"2012","title":"Technological foundations of the current blogosphere","authors":"Vangelis Banos, Karen Stepanyan, Mike Joy, Alexandra I. Cristea, Yannis Manolopoulos","author_ids":"3003969, 2341611, 1739827, 1722663, 1796253","abstract":"In this paper, we review the technological foundations of the current Blogosphere. The review is primarily based on a large-scale evaluation of active blogs. The extensive list of examined technologies enables commenting on a range of widely adopted standards and potential trends in the Blogosphere. The evaluation has been conducted in the following stages:\n 1. Retrieving and parsing a large set of blogs\n 2. Identifying and quantifying the use of technologies such as web standards, adopted services, file formats and platforms.\n 3. Analysing collected data and reporting the results\n 4. Comparing the results with existing findings from the generic Web to identify similarities and differences in the Blogosphere.\n The presented work was performed as part of BlogForever (ICT No. 269963), an EC funded research project aiming to aggregate, preserve, manage and disseminate blogs. The results of this study are relevant within the context weblog preservation and weblog data extraction.","cites":"0","conferencePercentile":"15.97222222"},{"venue":"WIMS","id":"65a3b272853e2cb8a3a87d171ae195072775ed2e","venue_1":"WIMS","year":"2014","title":"xStreams: Recommending Items to Users with Time-evolving Preferences","authors":"Zaigham Faraz Siddiqui, Eleftherios Tiakas, Panagiotis Symeonidis, Myra Spiliopoulou, Yannis Manolopoulos","author_ids":"1710665, 2210047, 1899744, 1685612, 1796253","abstract":"Over the last decade a vast number of businesses have developed online e-shops in the web. These online stores are supported by sophisticated systems that manage the products and record the activity of customers. There exist many research works that strive to answer the question \"what items are the customers going to like\" given their historic profiles. However, most of these works miss to take into account the time dimension and cannot respond efficiently when data are huge. In this paper, we study the problem of recommendations in the context of multi-relational stream mining. Our algorithm first separates customers based on their historic data into clusters. It then employs collaborative filtering (CF) to recommend new items to the customers based on their clustering structure. We evaluate our algorithm on two data sets, MovieLens and a synthetic data set.","cites":"1","conferencePercentile":"64.16666667"},{"venue":"WIMS","id":"40e2338c189c38dd8c7e02a768f5f965c4952547","venue_1":"WIMS","year":"2011","title":"Crawling Facebook for Social Network Analysis Purposes","authors":"Salvatore Catanese, Pasquale De Meo, Emilio Ferrara, Giacomo Fiumara, Alessandro Provetti","author_ids":"3354636, 1709372, 1784579, 1777572, 1785816","abstract":"We describe our work in the collection and analysis of massive data describing the connections between participants to online social networks. Alternative approaches to social network data collection are defined and evaluated in practice, against the popular Facebook Web site. Thanks to our ad-hoc, privacy-compliant crawlers, two large samples, comprising millions of connections, have been collected; the data is anonymous and organized as an undirected graph. We describe a set of tools that we developed to analyze specific properties of such social-network graphs, i.e., among others, degree distribution, centrality measures, scaling laws and distribution of friendship.","cites":"39","conferencePercentile":"100"},{"venue":"WIMS","id":"95228d276690189bffa6684b4699e4640dc83f66","venue_1":"WIMS","year":"2012","title":"Crowdsourcing semantic data management: challenges and opportunities","authors":"Elena Paslaru Bontas Simperl","author_ids":"2927032","abstract":"Linked Data refers to a set of guidelines and best practices for publishing and accessing structured data on the Web. It builds upon established Web technologies, in particular HTTP and URIs, extended with Semantic Web representation formats and protocols such as RDF, RDFS, OWL and SPARQL, by which data from different sources can be shared, interconnected and used beyond the application scenarios for which it was originally created. RDF is a central building block of the Linked Data technology stack. It is a graph-based data model based on the idea of making statements about (information and non-information) resources on the Web in terms of triples of the form subject predicate object. The object of any RDF triple may be used in the subject position in other triples, leading to a directed, labeled graph typically referred to as an 'RDF graph'. Both nodes and edges in such graphs are identified via URIs; nodes represent Web resources, while edges stand for attributes of such resources or properties connecting them. Schema information can be expressed using languages such as RDFS and OWL, by which resources can be typed as classes described in terms of domain-specific attributes, properties and constraints. RDF graphs can be natively queried using the query language SPARQL. A SPARQL query is composed of graph patterns and can be stored as RDF triples together with any RDF domain model using SPIN to facilitate the definition of constraints and inference rules in ontologies.","cites":"4","conferencePercentile":"79.86111111"},{"venue":"WIMS","id":"a340d77685433305a8de27dce269a89cd6ea1a71","venue_1":"WIMS","year":"2013","title":"Utility-driven evolution recommender for a constrained ontology","authors":"Pramod Anantharam, Biplav Srivastava, Amit P. Sheth","author_ids":"2446751, 1681873, 1709950","abstract":"Ontology evolution continues to be an important problem that needs further research. Key challenges in ontology evolution and creation of a highly consumable ontology include accomodating: (a) the subtle changes in the meaning of a model element over time, (b) the changing relevance of various parts of the model to the user, and (c) the complexity in representing time-varying semantics of model elements in a dynamic domain.\n In this work, we address the challenge of evolving an ontology to keep up with the domain changes while focusing on the utility of its content for relevance and imposing constraints for performance. We propose a novel evidence accumulation framework as a principled approach for ontology evolution, which is sufficiently expressive and semantically clear. Our approach classifies model elements (e.g., concepts) into three categories: definitely relevant (that must be included in the ontology), potentially relevant (that can be kept as backup), and irrelevant (that should be removed). Further, our approach dynamically re-classifies models based on external triggers like evidence or internal triggers, like the age of a model in the ontology. As a result, users will have an ontology which is both effective and efficient. We evaluate our approach based on two measures - ontology concept retention and ontology concept placement. This comprehensive evaluation in a single framework is novel and we show that our approach yields promising results.","cites":"0","conferencePercentile":"28.72340426"},{"venue":"WIMS","id":"1b3c96ff6dcef3471c59a44b7fdf5dbfdef097bd","venue_1":"WIMS","year":"2012","title":"Client- and server-side revisitation prediction with SUPRA","authors":"George Papadakis, Ricardo Kawase, Eelco Herder","author_ids":"2764068, 1727722, 1706210","abstract":"Users of collaborative applications as well as individual users in their private environment return to previously visited Web pages for various reasons; apart from pages visited due to backtracking, they typically have a number of favorite or important pages that they monitor or tasks that reoccur on an infrequent basis. In this paper, we introduce a library of methods that facilitate revisitation through the effective prediction of the next page request. It is based on a generic framework that inherently incorporates contextual information, handling uniformly both server- and the client-side applications. Unlike other existing approaches, the methods it encompasses are real-time, since they do not rely on training data or machine learning algorithms. We evaluate them over two large, real-world datasets, with the outcomes suggesting a significant improvement over methods typically used in this context. We have also made our implementation and data publicly available, thus encouraging other researchers to use it as a benchmark and to extend it with new techniques for supporting user's navigational activity.","cites":"2","conferencePercentile":"61.80555556"},{"venue":"WIMS","id":"3d9afc95ef716a4efef85af5f9ba2e19ad3e4df3","venue_1":"WIMS","year":"2011","title":"Improving search in tele-lecturing: using folksonomies as trigger to query semantic datasets to extract additional metadata","authors":"Franka Moritz, Maria Siebert, Christoph Meinel","author_ids":"1734392, 1706876, 1708312","abstract":"Tele-teaching, where recorded lectures are streamed via the internet, was identified as the easiest adoptable method to produce large amounts of e-learning content. Due to the nature of the e-learning material produced, it is lacking searchable data and metadata. Social Web technologies have been identified as one way to overcome this problem, because metadata will be generated by users. But still, the amount of metadata generated that way is not sufficient and the contextual information is missing. This information can be extracted from the Semantic Web, especially from Linked Data initiatives. This paper describes a workflow that utilizes the metadata generated by users to trigger the query of semantic datasets. These datasets are providing additional metadata, that can be extracted via an interface, which is publicly available. Thereby it is possible to supply new search strategies and achieve an extension of the search space for multimedia e-learning data. An extension of an existing search functionality and the similarity detection is finally described.","cites":"1","conferencePercentile":"39.23076923"},{"venue":"WIMS","id":"0f57525cdf29c8951c669bfd14f5e1842fcf8d00","venue_1":"WIMS","year":"2014","title":"On the Use of Lanczos Vectors for Efficient Latent Factor-Based Top-N Recommendation","authors":"Athanasios N. Nikolakopoulos, Maria Kalantzi, John D. Garofalakis","author_ids":"2143706, 1956242, 1680221","abstract":"In this work we propose Lanczos Latent Factor Recommender (LLFR); a novel \"big data friendly\" collaborative filtering algorithm for top-N recommendation. Using a computationally efficient Lanczos-based procedure, LLFR builds a low dimensional item similarity model, that can be readily exploited to produce personalized ranking vectors over the item space. A number of experiments on real datasets at different density levels indicate that LLFR outperforms other state-of-the-art top-N recommendation methods from a computational as well as a qualitative perspective. Our experimental results also show that its relative performance gains, compared to competing methods, increase as the data get sparser. This is true both when the sparsity is generalized -- as in the New Community Problem -- and in the very interesting case where the sparsity is localized in a small fraction of the dataset -- as in the New Users Problem.","cites":"2","conferencePercentile":"83.33333333"},{"venue":"WIMS","id":"8381dd324465fbf2be6e3bab4b2da44d572bae5a","venue_1":"WIMS","year":"2011","title":"Tracing the provenance of linked data using voiD","authors":"Tope Omitola, Landong Zuo, Christopher Gutteridge, Ian Millard, Hugh Glaser, Nicholas Gibbins, Nigel Shadbolt","author_ids":"2267342, 2649142, 8180204, 2642047, 2907424, 1708456, 1705314","abstract":"In the open world of the (Semantic) web, a world where increasingly diverse materials from disparate sources of different qualities are being made available, an automatic mechanism for the provision of provenance information of these sources is needed. This paper describes <b>voidp</b>, a provenance extension for the <b>void</b> vocabulary, that allows data publishers to specify the provenance relationships of their data. We enumerate voidp's classes and properties, and describe a use case scenario. A wider uptake of voidp by dataset publishers will allow data consuming tools to take advantage of these metadata providing consumers with the origin, i.e., the provenance, of what is being consumed.","cites":"8","conferencePercentile":"87.69230769"}]}