{"WINE.csv":[{"venue":"WINE","id":"3c95effc4aea8334ecb8213df58f6bb6b487ca59","venue_1":"WINE","year":"2008","title":"Overlapping Coalition Formation","authors":"Georgios Chalkiadakis, Edith Elkind, Evangelos Markakis, Nicholas R. Jennings","author_ids":"3169479, 1729566, 1737120, 1786650","abstract":"In multiagent domains, agents form coalitions to perform tasks. The usual models of cooperative game theory assume that the desired outcome is either the grand coalition or a coalition structure that consists of disjoint coalitions (i.e., a partition of the set of agents). However, in practice an agent may be involved in executing more than one task, and distributing his resources between several (not necessarily disjoint) coalitions. To tackle such scenarios, we introduce a model for cooperative games with overlapping coalitions. We then focus on concepts of stability in this setting. In particular, we define and study a notion of the core, which is a generalization of the corresponding notion in the traditional models of cooperative game theory. Under some quite general conditions, we provide a characterization for the outcomes of a game to be in the core. As a corollary, we also show that any element of the core maximizes the social welfare. We then introduce a concept of balancedness for overlapping coalitional games, and use it to characterize coalition structures that can be extended to elements of the core. Furthermore, we generalize the notion of convexity to our setting, and show that under some natural assumptions convex games have a non-empty core. Finally, we explore alternative definitions of allowable deviations, and the corresponding notions of stability. To the best of our knowledge, this is the first paper to provide a generic model for overlapping coalition formation, along with a theoretical treatment of stability in this setting.","cites":"10","conferencePercentile":"65.68627451"},{"venue":"WINE","id":"d82d9019e886494b8f0540b96859c2f4db50aad1","venue_1":"WINE","year":"2012","title":"Biased Assimilation, Homophily, and the Dynamics of Polarization - (Working Paper)","authors":"Pranav Dandekar, Ashish Goel, David Lee","author_ids":"1679575, 1679667, 2344788","abstract":"We study the issue of polarization in society through a model of opinion formation. We say an opinion formation process is polarizing if it results in increased divergence of opinions. Empirical studies have shown that homophily, i.e., greater interaction between like-minded individuals, results in polarization. However, we show that DeGroot's well-known model of opinion formation based on repeated averaging can never be polarizing, even if individuals are arbitrarily homophilous. We generalize DeGroot's model to account for a phenomenon well known in social psychology as biased assimilation: When presented with mixed or inconclusive evidence on a complex issue, individuals draw undue support for their initial position, thereby arriving at a more extreme opinion. We show that in a simple model of homophilous networks, our biased opinion formation process results in polarization if individuals are sufficiently biased. In other words, homophily alone, without biased assimilation, is not sufficient to polarize society. Quite interestingly, biased assimilation also provides a framework to analyze the polarizing effect of Internet-based recommender systems that show us personalized content.","cites":"16","conferencePercentile":"86.76470588"},{"venue":"WINE","id":"6c92d8263382ad203825ed4c64d04453026315f7","venue_1":"WINE","year":"2012","title":"Mechanism Design for Time Critical and Cost Critical Task Execution via Crowdsourcing","authors":"Swaprava Nath, Pankaj Dayama, Dinesh Garg, Y. Narahari, James Y. Zou","author_ids":"2543930, 2745442, 1705626, 1681789, 4933221","abstract":"An exciting application of crowdsourcing is to use social networks in complex task execution. In this paper, we address the problem of a planner who needs to incentivize agents within a network in order to seek their help in executing an atomic task as well as in recruiting other agents to execute the task. We study this mechanism design problem under two natural resource optimization settings: (1) cost critical tasks, where the planner's goal is to minimize the total cost, and (2) time critical tasks, where the goal is to minimize the total time elapsed before the task is executed. We identify a set of desirable properties that should ideally be satisfied by a crowdsourcing mechanism. In particular, sybil-proofness and collapse-proofness are two complementary properties in our desiderata. We prove that no mechanism can satisfy all the desirable properties simultaneously. This leads us naturally to explore approximate versions of the critical properties. We focus our attention on approximate sybil-proofness and our exploration leads to a parametrized family of payment mechanisms which satisfy collapse-proofness. We characterize the approximate versions of the desirable properties in cost critical and time critical domain.","cites":"6","conferencePercentile":"60.29411765"},{"venue":"WINE","id":"8b7b3067fcc26ae4967ec0e912f657810fd47e7a","venue_1":"WINE","year":"2013","title":"Competition in the Presence of Social Networks: How Many Service Providers Maximize Welfare?","authors":"Moran Feldman, Reshef Meir, Moshe Tennenholtz","author_ids":"1715024, 1769579, 1708847","abstract":"Competition for clients among service providers is a classical situation discussed in the economics literature. While better service attracts more clients, in some cases clients may prefer to keep using a low quality service if their friends are also using the same service—a phenomenon largely encouraged by the Internet and online social networks. This is evident, for example, in competition between cloud storage service providers such as DropBox, Microsoft SkyDrive and Google Drive. In such settings, the utility of a client depends on both the proposed service level and the number of friends or colleagues using the same service. We study how the welfare of the clients is affected by competition in the presence of social connections. Quite expectantly, competition among two firms can significantly increase the clients' social welfare in comparison with the monopoly case. However, we show that a further increase in competition triggered by the entry of additional firms may be hazardous for the society (i.e., to the clients), which stands in contrast to the typical situation in competition. Indeed, we show via equilibrium analysis that the social benefit of additional firms beyond the duopoly is limited, whereas the potential loss from such an addition is unbounded.","cites":"2","conferencePercentile":"32.75862069"},{"venue":"WINE","id":"11df6efbb7d26e208bbdd41a35b20970ce4cfbec","venue_1":"WINE","year":"2010","title":"A Novel Approach to Propagating Distrust","authors":"Christian Borgs, Jennifer T. Chayes, Adam Tauman Kalai, Azarakhsh Malekian, Moshe Tennenholtz","author_ids":"1721812, 1695997, 2186481, 3079666, 1708847","abstract":"Trust propagation is a fundamental topic of study in the theory and practice of ranking and recommendation systems on networks. The Page Rank [9] algorithm ranks web pages by propagating trust throughout a network, and similar algorithms have been designed for recommendation systems. How might one analogously propagate distrust as well? This is a question of practical importance and mathematical intrigue (see, e.g., [2]). However, it has proven challenging to model distrust propagation in a manner which is both logically consistent and psychologically plausible. We propose a novel and simple extension of the Page Rank equations, and argue that it naturally captures most types of distrust that are expressed in such networks. We give an efficient algorithm for implementing the system and prove desirable properties of the system.","cites":"8","conferencePercentile":"63.15789474"},{"venue":"WINE","id":"55f57874dd87d37c393ff9f2a22eec6a1b314bbb","venue_1":"WINE","year":"2005","title":"Experimental Evaluation of an eBay-Style Self-reporting Reputation Mechanism","authors":"Kay-Yut Chen, Tad Hogg","author_ids":"1715063, 1766745","abstract":"We experimentally studied the effects of a eBay-style self-reporting reputation mechanism in an double-sided exchange economy in which participants have the option of not fulfilling their contracts. We found that submitted reports quite accurately reflected their transactions and this mechanism maintaining a high contract fulfillment rate. The inaccurate reports, which were about 5% of the total, were heavily biased towards bad ratings when the transaction is successful. This is strong evidence that the inaccurate reports were not results of random errors, but derived from an underlying behavior effect. Our experimental design allowed identifying the effect of reputation mechanism on endogenous market behavior.","cites":"2","conferencePercentile":"43.18181818"},{"venue":"WINE","id":"8322abd72edea8563b31ba3d29d3df4eb480ee0c","venue_1":"WINE","year":"2013","title":"Mitigating Covert Compromises - A Game-Theoretic Model of Targeted and Non-Targeted Covert Attacks","authors":"Aron Laszka, Benjamin Johnson, Jens Grossklags","author_ids":"1747979, 4631041, 1718732","abstract":"Attackers of computing resources increasingly aim to keep security compromises hidden from defenders in order to extract more value over a longer period of time. These covert attacks come in multiple varieties, which can be categorized into two main types: targeted and non-targeted attacks. Targeted attacks include, for example, cyber-espionage, while non-targeted attacks include botnet recruitment. We are concerned with the subclass of these attacks for which detection is too costly or technically infeasible given the capabilities of a typical organization. As a result, defenders have to mitigate potential damages under a regime of incomplete information. A primary mitigation strategy is to reset potentially compromised resources to a known safe state, for example, by reinstalling computer systems, and changing passwords or cryptographic private keys. In a game-theoretic framework, we study the economically optimal mit-igation strategies in the presence of targeted and non-targeted covert attacks. Our work has practical implications for the definition of security policies, in particular, for password and key renewal schedules.","cites":"9","conferencePercentile":"87.93103448"},{"venue":"WINE","id":"a518c89e77ec82d882ebd1495caa5da5c9719fda","venue_1":"WINE","year":"2005","title":"Incentive Compatible Multiagent Constraint Optimization","authors":"Adrian Petcu, Boi Faltings","author_ids":"2416107, 1735128","abstract":"We present in this paper an incentive-compatible distributed optimization method applied to social choice problems. The method works by computing and collecting VCG taxes in a distributed fashion. This introduces a certain resilience to manipulation from the problem solving agents. An extension of this method sacrifices Pareto-optimality in favor of budget-balance: the solutions chosen are not optimal anymore, but the advantage is that the self interested agents pay the taxes between themselves, thus producing no tax surplus. This eliminates unwanted incentives for the problem solving agents, ensuring their faithfulness.","cites":"4","conferencePercentile":"53.40909091"},{"venue":"WINE","id":"63c88936f770418e64888674d4a6f2f526342c74","venue_1":"WINE","year":"2015","title":"Online Allocation and Pricing with Economies of Scale","authors":"Avrim Blum, Yishay Mansour, Liu Yang","author_ids":"1690967, 1698413, 1745614","abstract":"Allocating multiple goods to customers in a way that maximizes some desired objective is a fundamental part of Algorithmic Mechanism Design. We consider here the problem of offline and online allocation of goods that have economies of scale, or decreasing marginal cost per item for the seller. In particular, we analyze the case where customers have unit-demand and arrive one at a time with valuations on items, sampled iid from some unknown underlying distribution over valuations. Our strategy operates by using an initial sample to learn enough about the distribution to determine how best to allocate to future customers, together with an analysis of structural properties of optimal solutions that allow for uniform convergence analysis. We show, for instance, if customers have {0, 1} valuations over items, and the goal of the allocator is to give each customer an item he or she values, we can efficiently produce such an allocation with cost at most a constant factor greater than the minimum over such allocations in hindsight, so long as the marginal costs do not decrease too rapidly. We also give a bicriteria approximation to social welfare for the case of more general valuation functions when the allocator is budget constrained.","cites":"1","conferencePercentile":"72.72727273"},{"venue":"WINE","id":"00389849d9be8cacb6b1520646ed18bac57f1551","venue_1":"WINE","year":"2005","title":"Economic Analysis of Networking Technologies for Rural Developing Regions","authors":"Shridhar Mubaraq Mishra, John Hwang, Dick Filippini, Reza Moazzami, Lakshminarayanan Subramanian, Tom Du","author_ids":"2376357, 2102939, 1845752, 3119350, 1710917, 2615211","abstract":"Providing network connectivity to rural regions in the developing world is an economically challenging problem especially given the low income levels and low population densities in such regions. Many existing connectivity technologies incur a high deployment cost that limits their affordability. Leveraging several emerging wireless technologies, this paper presents the case for economically viable networks in rural developing regions. We use the Akshaya Network located in Kerala, In-dia as a specific case study. and show that a wireless network using WiFi for the backhaul, CDMA450 for the access network, and shared PCs for end user devices has the lowest deployment cost. However, if we include the expected spectrum licensing cost for CDMA450, a network with lease exempt spectrum using WiFi for the backhaul and WiMax for access is the most economically attractive option. Even with license exemption, regulatory costs comprise nearly half the total cost in the WiFi/WiMax case suggesting the possibility of significant improvement in network economics with more favorable regulatory policies. Finally, we also demonstrate the business case for a WiFi/CDMA450 network with nearly fully subsidized cellular handsets as end user devices.","cites":"20","conferencePercentile":"84.09090909"},{"venue":"WINE","id":"12384c66b7019a7784bfe80e0fd52f1225b9fe94","venue_1":"WINE","year":"2005","title":"On the Competitive Ratio of the Random Sampling Auction","authors":"Uriel Feige, Abraham D. Flaxman, Jason D. Hartline, Robert D. Kleinberg","author_ids":"1684495, 1765721, 8051597, 2633757","abstract":"We give a simple analysis of the competitive ratio of the random sampling auction from [10]. The random sampling auction was first shown to be worst-case competitive in [9] (with a bound of 7600 on its competitive ratio); our analysis improves the bound to 15. In support of the conjecture that random sampling auction is in fact 4-competitive, we show that on the equal revenue input, where any sale price gives the same revenue, random sampling is exactly a factor of four from optimal.","cites":"29","conferencePercentile":"95.45454545"},{"venue":"WINE","id":"45eb5f7a0cb8760420b0e7f35ac5b024bbcf793e","venue_1":"WINE","year":"2005","title":"Subjective-Cost Policy Routing","authors":"Joan Feigenbaum, David R. Karger, Vahab S. Mirrokni, Rahul Sami","author_ids":"1751820, 1743286, 1728881, 2048799","abstract":"We study a model of interdomain routing in which autonomous sys-tems' (ASes') routing policies are based on subjective cost assessments of alternative routes. The routes are constrained by the requirement that all routes to a given destination must be confluent. We show that it is NP-hard to determine whether there is a set of stable routes. We also show that it is NP-hard to find a set of confluent routes that minimizes the total subjective cost; it is hard even to approximate minimum cost closely. These hardness results hold even for very restricted classes of subjective costs. We then consider a model in which the subjective costs are based on the relative importance ASes place on a small number of objective cost measures. We show that a small number of confluent routing trees is sufficient for each AS to have a route that nearly minimizes its subjective cost. We show that this scheme is trivially strategyproof and that it can be computed easily with a distributed algorithm that does not require major changes to the Border Gateway Protocol. Furthermore, we prove a lower bound on the number of trees required to contain a (1 +)-approximately optimal route for each node and show that our scheme is nearly optimal in this respect.","cites":"22","conferencePercentile":"88.63636364"},{"venue":"WINE","id":"b617e6a9d2d62d7f0af9421af67eccdea3b9606d","venue_1":"WINE","year":"2011","title":"An NTU Cooperative Game Theoretic View of Manipulating Elections","authors":"Michael Zuckerman, Piotr Faliszewski, Vincent Conitzer, Jeffrey S. Rosenschein","author_ids":"2401724, 2469517, 1749906, 1735970","abstract":"Social choice theory and cooperative (coalitional) game theory have become important foundations for the design and analysis of multiagent systems. In this paper, we use cooperative game theory tools in order to explore the coalition formation process in the coalitional manipulation problem. Unlike earlier work on a cooperative-game-theoretic approach to the manipulation problem [2], we consider a model where utilities are not transferable. We investigate the issue of stability in coalitional manipulation voting games; we define two notions of the core in these domains, the α-core and the β-core. For each type of core, we investigate how hard it is to determine whether a given candidate is in the core. We prove that for both types of core, this determination is at least as hard as the coalitional manipulation problem. On the other hand, we show that for some voting rules, the α-and the β-core problems are no harder than the coalitional manipulation problem. We also show that some prominent voting rules, when applied to the truthful preferences of voters, may produce an outcome not in the core, even when the core is not empty.","cites":"4","conferencePercentile":"34.48275862"},{"venue":"WINE","id":"6ae61074bf4f2a6adc4a1bdb0946e7949730dfd5","venue_1":"WINE","year":"2010","title":"Impersonation Strategies in Auctions","authors":"Ian A. Kash, David C. Parkes","author_ids":"2532501, 1702994","abstract":"A common approach to analyzing repeated auctions, such as sponsored search auctions, is to treat them as complete information games, because it is assumed that, over time, players learn each other's types. This overlooks the possibility that players may impersonate another type. In this paper, we show that many standard auctions, including the Kelly mechanism, generalized second price auctions, and core-selecting auctions, have profitable impersonations. We define a notion of impersonation-proofness for the process by which players learn about each other's type together with the auction mechanism and associated complete information game and give several examples.","cites":"3","conferencePercentile":"27.63157895"},{"venue":"WINE","id":"5d4b68fa9258c65229a79b90fe8f459eda914939","venue_1":"WINE","year":"2008","title":"A Game-Theoretic Analysis of Games with a Purpose","authors":"Shaili Jain, David C. Parkes","author_ids":"2931316, 1702994","abstract":"We present a simple game-theoretic model for the ESP game, an interactive game devised to label images on the web, and characterize the equilibrium behavior of the model. We show that a simple change in the incentive structure can lead to different equilibrium structure and suggest the possibility of formal incentive design in achieving desirable system-wide outcomes, complementing existing considerations of robust-ness against cheating and human factors.","cites":"32","conferencePercentile":"96.07843137"},{"venue":"WINE","id":"63e5cd4a3aa084c0971dca03a52f2efad5b97a71","venue_1":"WINE","year":"2012","title":"Triadic Consensus - A Randomized Algorithm for Voting in a Crowd","authors":"Ashish Goel, David Lee","author_ids":"1679667, 2344788","abstract":"Typical voting rules do not work well in settings with many candidates. If there are just several hundred candidates, then even a simple task such as choosing a top candidate becomes impractical. Motivated by the hope of developing group consensus mechanisms over the internet, where the numbers of candidates could easily number in the thousands, we study an urn-based voting rule where each participant acts as a voter and a candidate. We prove that when participants lie in a one-dimensional space, this voting protocol finds a (1 − ǫ/ √ n) approximation of the Condorcet winner with high probability while only requiring an expected O(1 ǫ 2 log 2 n ǫ 2) comparisons on average per voter. Moreover, this voting protocol is shown to have a quasi-truthful Nash equilibrium: namely, a Nash equilibrium exists which may not be truthful , but produces a winner with the same probability distribution as that of the truthful strategy.","cites":"6","conferencePercentile":"60.29411765"},{"venue":"WINE","id":"fd9602d30b2cae1258df958fc0795f4e4744282a","venue_1":"WINE","year":"2010","title":"Local Dynamics in Bargaining Networks via Random-Turn Games","authors":"L. Elisa Celis, Nikhil R. Devanur, Yuval Peres","author_ids":"3246450, 7692691, 1799759","abstract":"We present a new technique for analyzing the rate of convergence of local dynamics in bargaining networks. The technique reduces balancing in a bargaining network to optimal play in a random-turn game. We analyze this game using techniques from martingale and Markov chain theory. We obtain a tight polynomial bound on the rate of convergence for a nontrivial class of unweighted graphs (the previous known bound was exponential). Additionally, we show this technique extends naturally to many other graphs and dynamics.","cites":"7","conferencePercentile":"59.21052632"},{"venue":"WINE","id":"6bef9f4dbbdb7755ab53df9b46efcc9f554c0f93","venue_1":"WINE","year":"2009","title":"Contract Auctions for Sponsored Search","authors":"Sharad Goel, Sébastien Lahaie, Sergei Vassilvitskii","author_ids":"3184636, 1692293, 1749789","abstract":"In sponsored search auctions advertisers typically pay a fixed amount per click that their advertisements receive. In particular, the advertiser and the publisher enter into a contract (e.g., the publisher displays the ad; the advertiser pays the publisher 10 cents per click), and each party's subjective value for such a contract depends on their estimated click-through rates (CTR) for the ad. Starting from this motivating example, we define and analyze a class of contract auctions that generalize the classical second price auction. As an application, we introduce impression-plus-click pricing for sponsored search, in which advertisers pay a fixed amount per impression plus an additional amount if their ad is clicked. Of note, when the advertiser's estimated CTR is higher than the publisher's estimated CTR, both parties find negative click payments advantageous, where the advertiser pays the publisher a premium for the impression but the publisher then pays the advertiser per click.","cites":"5","conferencePercentile":"52.04081633"},{"venue":"WINE","id":"2ea8b7466918ea91f1c27f62a9544259ad3c091d","venue_1":"WINE","year":"2010","title":"Collusion in VCG Path Procurement Auctions","authors":"Yoram Bachrach, Peter B. Key, Morteza Zadimoghaddam","author_ids":"1698412, 7217471, 1724391","abstract":"We consider collusion in path procurement auctions, where payments are determined using the VCG mechanism. We show that collusion can increase the utility of the agents, and in some cases they can extract any amount the pro-curer is willing to offer. We show that computing how much a coalition can gain by colluding is NP-complete in general, but that in certain interesting restricted cases, the optimal collusion scheme can be computed in polynomial time. We examine the ways in which the colluders might share their payments, using the core and Shapley value from cooperative game theory. We show that in some cases the collusion game has an empty core, so although beneficial manipulations exist , the colluders would find it hard to form a stable coalition due to inability to decide how to split the rewards. On the other hand, we show that in several common restricted cases the collusion game is convex, so it has a non-empty core, which contains the Shapley value. We also show that in these cases colluders can compute core imputations and the Shapley value in polynomial time.","cites":"4","conferencePercentile":"39.47368421"},{"venue":"WINE","id":"2558274830aa79a88075dbb08643ec27f12afde7","venue_1":"WINE","year":"2005","title":"Enforcing Truthful Strategies in Incentive Compatible Reputation Mechanisms","authors":"Radu Jurca, Boi Faltings","author_ids":"2565197, 1735128","abstract":"We commonly use the experience of others when taking decisions. Reputation mechanisms aggregate in a formal way the feedback collected from peers and compute the reputation of products, services, or providers. The success of reputation mechanisms is however conditioned on obtaining true feedback. Side-payments (i.e. agents get paid for submitting feedback) can make honest reporting rational (i.e. Nash equilibrium). Unfortunately, known schemes also have other Nash equi-libria that imply lying. In this paper we analyze the equilibria of two incentive-compatible reputation mechanisms and investigate how unde-sired equilibrium points can be eliminated by using trusted reports.","cites":"26","conferencePercentile":"93.18181818"},{"venue":"WINE","id":"338260fcff45f202727183e58338efabe7f73e1f","venue_1":"WINE","year":"2006","title":"First-Passage Percolation on a Width-2 Strip and the Path Cost in a VCG Auction","authors":"Abraham D. Flaxman, David Gamarnik, Gregory B. Sorkin","author_ids":"1765721, 1708116, 1788468","abstract":"We study the time constant for first-passage percolation, and the Vickery-Clarke-Groves (VCG) payment for the shortest path, on a width-2 strip with random edge costs. These statistics attempt to describe two seemingly unrelated phenomena, arising in physics and economics respectively: the first-passage percolation time predicts how long it takes for a fluid to spread through a random medium, while the VCG payment for the shortest path is the cost maximizing social welfare among selfish agents. However, our analyses of the two are quite similar, and require solving (slightly different) recursive distributional equations. Using Harris chains, we can characterize distributions, not just expectations.","cites":"8","conferencePercentile":"40.90909091"},{"venue":"WINE","id":"b8ecd6586b648396433548d4a81ddead7f23f4e2","venue_1":"WINE","year":"2013","title":"Optimal Allocation for Chunked-Reward Advertising","authors":"Weihao Kong, Jian Li, Tie-Yan Liu, Tao Qin","author_ids":"2001138, 1701502, 1744859, 8193913","abstract":"Chunked-reward advertising is commonly used in the industry , such as the guaranteed delivery in display advertising and the daily-deal services (e.g., Groupon) in online shopping. In chunked-reward advertising , the publisher promises to deliver at least a certain volume (a.k.a. tipping point or lower bound) of user traffic to an advertiser according to their mutual contract. At the same time, the advertiser may specify a maximum volume (upper bound) of traffic that he/she would like to pay for according to his/her budget constraint. The objective of the publisher is to design an appropriate mechanism to allocate the user traffic so as to maximize the overall revenue obtained from all such advertisers. In this paper, we perform a formal study on this problem, which we call Chunked-reward Allocation Problem (CAP). In particular, we formulate CAP as a knapsack-like problem with variable-sized items and majorization constraints. Our main results regarding CAP are as follows. (1) We first show that for a special case of CAP, in which the lower bound equals the upper bound for each contract, there is a simple dynamic programming-based algorithm that can find an optimal allocation in pseudo-polynomial time. (2) The general case of CAP is much more difficult than the special case. To solve the problem, we first discover several structural properties of the optimal allocation, and then design a two-layer dynamic programming-based algorithm that can find an optimal allocation in pseudo-polynomial time by leveraging these properties. (3) We convert the two-layer dynamic programming based algorithm to a fully polynomial time approximation scheme (FPTAS), using the technique developed in [8], combined with some careful modifications of the dynamic programs. Besides these results, we also investigate some natural generalizations of CAP, and propose effective algorithms to solve them.","cites":"1","conferencePercentile":"15.51724138"},{"venue":"WINE","id":"33744610710afd786a08867a95b5bf8131c1ff70","venue_1":"WINE","year":"2008","title":"Predictive Pricing and Revenue Sharing","authors":"Bobji Mungamuru, Hector Garcia-Molina","author_ids":"2863670, 1695250","abstract":"Predictive pricing (e.g., Google's \" Smart Pricing \" and Yahoo's \" Quality-Based Pricing \") and revenue sharing are two important tools that online advertising networks can use in order to attract content publishers and advertisers. We develop a simple model of the pay-per-click advertising market to study the market effects of these tools. We then present an algorithm, PricingPolicy, for computing an advertising network's best response i.e., given the predictive pricing and revenue sharing policies used by its competitors, what policy should an advertising network use in response? Using PricingPolicy, we gain insight into the structure of optimal predictive pricing and revenue sharing policies.","cites":"2","conferencePercentile":"19.60784314"},{"venue":"WINE","id":"761067b0808c18a2fd06ba41697201cc65601464","venue_1":"WINE","year":"2012","title":"Redistribution of VCG Payments in Public Project Problems","authors":"Victor Naroditskiy, Mingyu Guo, Lachlan Dufton, Maria Polukarov, Nicholas R. Jennings","author_ids":"2149740, 1764396, 2182482, 2277974, 1786650","abstract":"Redistribution of VCG payments has been mostly studied in the context of resource allocation. This paper focuses on another fundamental model—the public project problem. In this scenario, the VCG mechanism collects in payments up to n−1 n of the total value of the agents. This collected revenue represents a loss of social welfare. Given this, we study how to redistribute most of the VCG revenue back to the agents. Our first result is a bound on the best possible efficiency ratio, which we conjecture to be tight based on numerical simulations. Furthermore , the upper bound is confirmed on the case with 3 agents, for which we derive an optimal redistribution function. For more than 3 agents, we turn to heuristic solutions and propose a new approach to designing redistribution mechanisms.","cites":"3","conferencePercentile":"35.29411765"},{"venue":"WINE","id":"02b8979f6f23ae6bb087f499457839cbef65307c","venue_1":"WINE","year":"2011","title":"Budget-Balanced and Nearly Efficient Randomized Mechanisms: Public Goods and beyond","authors":"Mingyu Guo, Victor Naroditskiy, Vincent Conitzer, Amy Greenwald, Nicholas R. Jennings","author_ids":"1764396, 2149740, 1749906, 1695633, 1786650","abstract":"Many scenarios where participants hold private information require payments to encourage truthful revelation. Some of these scenarios have no natural residual claimant who would absorb the budget surplus or cover the deficit. Faltings [7] proposed the idea of excluding one agent uniformly at random and making him the residual claimant. Based on this idea, we propose two classes of public good mechanisms and derive optimal ones within each class: Faltings' mechanism is optimal in one of the classes. We then move on to general mechanism design settings, where we prove guarantees on the social welfare achieved by Faltings' mechanism. Finally, we analyze a modification of the mechanism where budget balance is achieved without designating any agent as the residual claimant.","cites":"8","conferencePercentile":"63.79310345"},{"venue":"WINE","id":"0f2a64e7932b5e9573c06c9fed70a92558e995b4","venue_1":"WINE","year":"2010","title":"The Good, The Bad and The Cautious: Safety Level Cooperative Games","authors":"Yoram Bachrach, Maria Polukarov, Nicholas R. Jennings","author_ids":"1698412, 2277974, 1786650","abstract":"We study safety level coalitions in competitive games. Given a normal form game, we define a corresponding cooperative game with transferable utility, where the value of each coalition is determined by the safety level payoff it derives in the original—non-cooperative—game. We thus capture several key features of agents' behavior: (i) the possible monetary transfer among the coalition members; (ii) the solidarity of the outsiders against the collaborators; (iii) the need for the coalition to optimize its actions against the worst possible behavior of those outside the coalition. We examine the concept of safety level cooperation in congestion games, and focus on computing the value of coalitions, the core and the Shapley value in the resulting safety level cooperative games. We provide tractable algorithms for anonymous cooperative games and for safety level cooperative games that correspond to symmetric congestion games with singleton strategies. However, we show hardness of several problems such as computing values in games with multi-resource strategies or asymmetric strategy spaces.","cites":"1","conferencePercentile":"13.15789474"},{"venue":"WINE","id":"801001ba585c6732973409060f678bff953b09a6","venue_1":"WINE","year":"2010","title":"Efficient Computation of the Shapley Value for Centrality in Networks","authors":"Karthik V. Aadithya, Balaraman Ravindran, Tomasz P. Michalak, Nicholas R. Jennings","author_ids":"1765129, 1723632, 1806560, 1786650","abstract":"The Shapley Value is arguably the most important normative solution concept in coalitional games. One of its applications is in the domain of networks, where the Shapley Value is used to measure the relative importance of individual nodes. This measure, which is called node centrality, is of paramount significance in many real-world application domains including social and organisational networks , biological networks, communication networks and the internet. Whereas computational aspects of the Shapley Value have been analyzed in the context of conventional coalitional games, this paper presents the first such study of the Shap-ley Value for network centrality. Our results demonstrate that this particular application of the Shapley Value presents unique opportunities for efficiency gains, which we exploit to develop exact analytical formulas for Shapley Value based centrality computation in both weighted and unweighted networks. These formulas not only yield efficient (polynomial time) and error-free algorithms for computing node centralities, but their surprisingly simple closed form expressions also offer intuition into why certain nodes are relatively more important to a network.","cites":"10","conferencePercentile":"69.73684211"},{"venue":"WINE","id":"a1a18a6e5c269ea485993c6f18babbd9ed304489","venue_1":"WINE","year":"2009","title":"On the Impact of Strategy and Utility Structures on Congestion-Averse Games","authors":"Thomas Voice, Maria Polukarov, Andrew Byde, Nicholas R. Jennings","author_ids":"1769473, 2277974, 1721847, 1786650","abstract":"Recent results regarding games with congestion-averse utilities (or, congestion-averse games—CAGs) have shown they possess some very desirable properties. Specifically, they have pure strategy Nash equilibria, which may be found by a polynomial time algorithm. However, these results were accompanied by a very limiting assumption that each player is capable of using any subset of its available set of resources. This is often unrealistic—for example, resources may have complementarities between them such that a minimal number of resources is required for any to be useful. To remove this restriction, in this paper we prove the existence and tractability of a pure strategy equilibrium for a much more general setting where each player is given a matroid over the set of resources, along with the (upper and lower) bounds on the size of a subset of resources to be selected, and its strategy space consists of all elements of this matroid that fit in the given size range. (This, in particular, includes the possibility of having a full matroid, or having a set of bases of a matroid.) Moreover, we show that if a player strategy space in a given CAG does not satisfy these matroid properties, then a pure strategy equilibrium need not exist, and in fact the determination of whether or not a game has a pure strategy Nash equilibrium is NP-complete. We further prove analogous results for each of the congestion-averse conditions on utility functions, thus showing that current assumptions on strategy and utility structures in this model cannot be relaxed anymore.","cites":"3","conferencePercentile":"36.73469388"},{"venue":"WINE","id":"4bdc4ceb164663c85a9cc9cf036bb9b2b368396d","venue_1":"WINE","year":"2009","title":"News Posting by Strategic Users in a Social Network","authors":"Mangesh Gupte, Mohammad Taghi Hajiaghayi, Lu Han, Liviu Iftode, Pravin Shankar, Raluca M. Ursu","author_ids":"2928227, 1704161, 2119114, 2345961, 2846340, 2099363","abstract":"We argue that users in social networks are strategic in how they post and propagate information. We propose two models — greedy and courteous — and study information propagation both analytically and through simulations. For a suitable random graph model of a social network, we prove that news propagation follows a threshold phenomenon , hence, \" high-quality \" information provably spreads throughout the network assuming users are \" greedy \". Starting from a sample of the Twitter graph, we show through simulations that the threshold phenomenon is exhibited by both the greedy and courteous user models.","cites":"5","conferencePercentile":"52.04081633"},{"venue":"WINE","id":"479d891468019218545a66bd81bc82e60529f560","venue_1":"WINE","year":"2007","title":"The Importance of Network Topology in Local Contribution Games","authors":"Jacomo Corbo, Antoni Calvó-Armengol, David C. Parkes","author_ids":"1921014, 2426860, 1702994","abstract":"We consider a stylized model of content contribution in a peer-to-peer network. The model is appealing because it allows for linear-quadratic payoff functions and for very general interaction patterns among agents. We ask: How do different link patterns affect contributions? How are contributions affected by whether these goods are strategic complements, substitutes, or something in between? Who contributes and who free rides? How is the computational complexity of optimal play affected by the externalities of the game? What networks optimize social contributions and social welfare? And how does the worst-case equilibrium performance of a network compare to its best-case performance? The analysis finds that Nash equilibria of this game always exist and that they are computable by solving a linear complementarity problem. The equilibrium is unique when goods are strategic complements or weak substitutes and contributions are proportional to a network centrality measure called the Bonacich index. In the case of public goods, the equilibrium is non-unique and for every network there is an equilibrium where some individuals contribute optimally and others completely free-ride. Moreover , these equilibria with complete free-riders and optimal contributors are the only candidate stable equilibria are are characterized by k-order maximal independent sets. We find that the structure of optimal networks is hub-like when the game exhibits strict or weak complements. Under public good scenarios, while hub-like networks remain optimal in the best case, they also yield the worst-performing equilibria. Finally, we discuss two network-based policies for improving the equilibrium performance of networks.","cites":"14","conferencePercentile":"61.11111111"},{"venue":"WINE","id":"7695c4d5468274234125cbc0e3377652d6c94df7","venue_1":"WINE","year":"2011","title":"Prior-Independent Multi-parameter Mechanism Design","authors":"Nikhil R. Devanur, Jason D. Hartline, Anna R. Karlin, C. Thach Nguyen","author_ids":"7692691, 8051597, 1693265, 2819496","abstract":"In a unit-demand multi-unit multi-item auction, an auctioneer is selling a collection of different items to a set of agents each interested in buying at most unit. Each agent has a different private value for each of the items. We consider the problem of designing a truthful auction that maximizes the auctioneer's profit in this setting. Previously, there has been progress on this problem in the setting in which each value is drawn from a known prior distribution. Specifically, it has been shown how to design auctions tailored to these priors that achieve a constant factor approximation ratio [2, 5]. In this paper, we present a prior-independent auction for this setting. This auction is guaranteed to achieve a constant fraction of the optimal expected profit for a large class of, so called, \" regular \" distributions, without specific knowledge of the distributions.","cites":"21","conferencePercentile":"100"},{"venue":"WINE","id":"151e68e6b2541f38b3b40df8ee7fb9dcabb6b2a3","venue_1":"WINE","year":"2006","title":"Game-Theoretic Aspects of Designing Hyperlink Structures","authors":"Nicole Immorlica, Kamal Jain, Mohammad Mahdian","author_ids":"1754163, 1800444, 7962175","abstract":"We study the problem of designing the hyperlink structure between the web pages of a web site in order to maximize the revenue generated from the traffic on the web site. We show this problem is equivalent to the well-studied setting of infinite horizon discounted Markov Decision Processes (MDPs). Thus existing results from that literature imply the existence of polynomial-time algorithms for finding the optimal hyperlink structure, as well as a linear program to describe the optimal structure. We use a similar linear program to address our problem (and, by extension all infinite horizon discounted MDPs) from the perspective of cooperative game theory: if each web page is controlled by an autonomous agent, is it possible to give the individuals and coalitions incentive to cooperate and build the optimal hyperlink design? We study this question in the settings of transferrable utility (TU) and non-transferrable utility (NTU) games. In the TU setting, we use linear programming duality to show that the core of the game is non-empty and that the optimal structure is in the core. For the NTU setting, we show that if we allow \" mixed \" strategies, the core of the game is non-empty, but there are examples that show that the core can be highly inefficient.","cites":"6","conferencePercentile":"25"},{"venue":"WINE","id":"16ca35466b398f7e1b0a74f2e22d53b99cde2f99","venue_1":"WINE","year":"2015","title":"Fast Convergence in the Double Oral Auction","authors":"Sepehr Assadi, Sanjeev Khanna, Yang Li, Rakesh V. Vohra","author_ids":"1802324, 1740426, 1678662, 2539286","abstract":"A classical trading experiment consists of a set of unit demand buyers and unit supply sellers with identical items. Each agent's value or opportunity cost for the item is their private information and preferences are quasi-linear. Trade between agents employs a double oral auction (DOA) in which both buyers and sellers call out bids or offers which an auctioneer recognizes. Transactions resulting from accepted bids and offers are recorded. This continues until there are no more acceptable bids or offers. Remarkably, the experiment consistently terminates in a Walrasian price. The main result of this paper is a mechanism in the spirit of the DOA that converges to a Walrasian equilibrium in a polynomial number of steps, thus providing a theoretical basis for the above-described empirical phenomenon. It is well-known that computation of a Walrasian equilibrium for this market corresponds to solving a maximum weight bipartite matching problem. The uncoordinated but rational responses of agents thus solve in a distributed fashion a maximum weight bipartite matching problem that is encoded by their private valuations. We show, furthermore, that every Walrasian equilibrium is reachable by some sequence of responses. This is in contrast to the well known auction algorithms for this problem which only allow one side to make offers and thus essentially choose an equilibrium that maximizes the surplus for the side making offers. Our results extend to the setting where not every agent pair is allowed to trade with each other.","cites":"0","conferencePercentile":"31.81818182"},{"venue":"WINE","id":"5531e4015e9eae882a9c34658a0075b11feaa9b9","venue_1":"WINE","year":"2008","title":"Local Two-Stage Myopic Dynamics for Network Formation Games","authors":"Esteban Arcaute, Ramesh Johari, Shie Mannor","author_ids":"2506563, 1790944, 1712535","abstract":"Network formation games capture two conflicting objectives of self-interested nodes in a network. On one hand, such a node wishes to be able to reach all other nodes in the network; on the other hand, it wishes to minimize its cost of participation. We focus on myopic dynamics in a class of such games inspired by transportation and communication models. A key property of the dynamics we study is that they are local: nodes can only deviate to form links with others in a restricted neighborhood. Despite this locality, we find that our dynamics converge to efficient or nearly efficient outcomes in a range of settings of interest.","cites":"5","conferencePercentile":"44.11764706"},{"venue":"WINE","id":"0998fd0cc82baab7a2efedc4dbaeb65854b6cc08","venue_1":"WINE","year":"2007","title":"Network Formation: Bilateral Contracting and Myopic Dynamics","authors":"Esteban Arcaute, Ramesh Johari, Shie Mannor","author_ids":"2506563, 1790944, 1712535","abstract":"We consider a network formation game where nodes wish to send traffic to each other. Nodes contract bilaterally with each other to form bidirectional communication links; once the network is formed, traffic is routed along shortest paths (if possible). Cost is incurred to a node from four sources: (1) routing traffic; (2) maintaining links to other nodes; (3) disconnection from destinations the node wishes to reach; and (4) payments made to other nodes. We assume that a network is stable if no single node wishes to unilaterally deviate, and no pair of nodes can profitably deviate together (a variation on the notion of pairwise stability). We study such a game under a form of myopic best response dynamics. In choosing their action, nodes optimize their single period payoff only. We characterize a simple set of assumptions under which these dynamics converge to a stable network; we also characterize an important special case, where the dynamics converge to a star centered at a node with minimum cost for routing traffic. In this sense, our dynamics naturally select an efficient equilibrium.","cites":"16","conferencePercentile":"67.77777778"},{"venue":"WINE","id":"5fbe1c4ed415952f24466de3fe338f8bc28d20ac","venue_1":"WINE","year":"2005","title":"A Primal-Dual Algorithm for Computing Fisher Equilibrium in the Absence of Gross Substitutability Property","authors":"Dinesh Garg, Kamal Jain, Kunal Talwar, Vijay V. Vazirani","author_ids":"1705626, 1800444, 1750149, 1720384","abstract":"We provide the first strongly polynomial time exact com-binatorial algorithm to compute Fisher equilibrium for the case when utility functions do not satisfy the Gross substitutability property. The motivation for this comes from the work of Kelly, Maulloo, and Tan [15] and Kelly and Vazirani [16] on rate control in communication networks. We consider a tree like network in which root is the source and all the leaf nodes are the sinks. Each sink has got a fixed amount of money which it can use to buy the capacities of the edges in the network. The edges of the network sell their capacities at certain prices. The objective of each edge is to fix a price which can fetch the maximum money for it and the objective of each sink is to buy capacities on edges in such a way that it can facilitate the sink to pull maximum flow from the source. In this problem, the edges and the sinks play precisely the role of sellers and buyers, respectively, in the Fisher's market model. The utility of a buyer (or sink) takes the form of Leontief function which is known for not satisfying Gross substitutability property. We develop an O(m 3) exact combinatorial algorithm for computing equilibrium prices of the edges. The time taken by our algorithm is independent of the values of sink money and edge capacities. A corollary of our algorithm is that equilibrium prices and flows are rational numbers. Although there are algorithms to solve this problem but they are all based on convex programming techniques. To the best of our knowledge, ours is the first strongly polynomial time exact combinatorial algorithm for computing equilibrium prices of Fisher model under the case when buyers' utility functions do not satisfy Gross substitutability property.","cites":"10","conferencePercentile":"70.45454545"},{"venue":"WINE","id":"3b2fc3b1f615478d0e4aa98ca6e8dee4a4e1ccdf","venue_1":"WINE","year":"2005","title":"Computing Equilibria in a Fisher Market with Linear Single-Constraint Production Units","authors":"Kamal Jain, Mohammad Mahdian","author_ids":"1800444, 7962175","abstract":"We study the problem of computing equilibrium prices in a Fisher market with linear utilities and linear single-constraint production units. This setting naturally appears in ad pricing where the sum of the lengths of the displayed ads is constrained not to exceed the available ad space. There are three approaches to solve market equilibrium problems: convex programming, auction-based algorithms, and primal-dual. Jain, Vazirani, and Ye recently proposed a solution using convex programming for the problem with an arbitrary number of production constraints. A recent paper by Kapoor, Mehta, and Vazirani proposes an auction-based solution. No primal-dual algorithm is proposed for this problem. In this paper we propose a simple reduction from this problem to the classical Fisher setting with linear utilities and without any production units. Our reduction not only imports the primal-dual algorithm of Deva-nur et al. to the single-constraint production setting, but also: i) imports other simple algorithms, like the auction-based algorithm of Garg and Kapoor, thereby providing a simple insight behind the recent sophisticated algorithm of Kapoor, Mehta, and Vazirani, and ii) imports all the nice properties of the Fisher setting, for example, the existence of an equilibrium in rational numbers, and the uniqueness of the utilities of the agents at the equilibrium.","cites":"3","conferencePercentile":"50"},{"venue":"WINE","id":"43a0c09c60eff8a240fbea5366f9d60f327051ad","venue_1":"WINE","year":"2008","title":"An \"Ethical\" Game-Theoretic Solution Concept for Two-Player Perfect-Information Games","authors":"Joshua Letchford, Vincent Conitzer, Kamal Jain","author_ids":"2433553, 1749906, 1800444","abstract":"The standard solution concept for perfect-information extensive form games is subgame perfect Nash equilibrium. However, humans do not always play according to a subgame perfect Nash equilibrium, especially in games where it is possible for all the players to obtain much higher payoffs if they place some trust in each other (and this trust is not violated). In this paper, we introduce a new solution concept for two-player perfect-information games that attempts to model this type of trusting behavior (together with the \" ethical \" behavior of not violating that trust). The concept takes subgame perfect equilibrium as a starting point, but then repeatedly resolves the game based on the players being able to trust each other. We give two distinct algorithmic definitions of the concept and show that they are equivalent. Finally, we give a fast implementation of one of the algorithms for solving the game, and show that it runs in time O(n log n + nh log(n/h)).","cites":"3","conferencePercentile":"29.41176471"},{"venue":"WINE","id":"0c92b1208b6708d1431cfdc7b035e3391dc9300e","venue_1":"WINE","year":"2010","title":"Incentives in Online Auctions via Linear Programming","authors":"Niv Buchbinder, Kamal Jain, Mohit Singh","author_ids":"1727481, 1800444, 7025738","abstract":"Online auctions in which items are sold in an online fashion with little knowledge about future bids are common in the internet environment. We study here a problem in which an auctioneer would like to sell a single item, say a car. A bidder may make a bid for the item at any time but expects an immediate irrevocable decision. The goal of the auctioneer is to maximize her revenue in this uncertain environment. Under some reasonable assumptions, it has been observed that the on-line auction problem has strong connections to the classical secretary problem in which an employer would like to choose the best candidate among n competing candidates [HKP04]. However, a direct application of the algorithms for the secretary problem to online auctions leads to undesirable consequences since these algorithms do not give a fair chance to every candidate and candidates arriving early in the process have an incentive to delay their arrival. In this work we study the issue of incentives in the online auction problem where bidders are allowed to change their arrival time if it benefits them. We derive incentive compatible mechanisms where the best strategy for each bidder is to first truthfully arrive at their assigned time and then truthfully reveal their valuation. Using the linear programming technique introduced in Buchbinder et al [BJS10], we first develop new mechanisms for a variant of the secretary problem. We then show that the new mechanisms for the secretary problem can be used as a building block for a family of incentive compatible mechanisms for the online auction problem which perform well under different performance criteria. In particular, we design a mechanism for the online auction problem which is incentive compatible and is 3/16 ≈ 0.187-competitive for revenue, and a (different) mechanism that is 1 2 √ e ≈ 0.303-competitive for efficiency.","cites":"3","conferencePercentile":"27.63157895"},{"venue":"WINE","id":"50e6bb5811408aa0222bd930ab67a8a554f96374","venue_1":"WINE","year":"2005","title":"A Simple Characterization for Truth-Revealing Single-Item Auctions","authors":"Kamal Jain, Aranyak Mehta, Kunal Talwar, Vijay V. Vazirani","author_ids":"1800444, 1733057, 1750149, 1720384","abstract":"We give a simple characterization of all single-item truth-revealing auctions under some mild (and natural) assumptions about the auctions. Our work opens up the possibility of using variational calculus to design auctions having desired properties.","cites":"1","conferencePercentile":"28.40909091"},{"venue":"WINE","id":"01a4444179a7f2f6ba5ebba886ba94f7122d02de","venue_1":"WINE","year":"2008","title":"On the Equilibria and Efficiency of the GSP Mechanism in Keyword Auctions with Externalities","authors":"Ioannis Giotis, Anna R. Karlin","author_ids":"2408951, 1693265","abstract":"In the increasingly important market of online search advertising , a multitude of parameters affect the performance of advertising campaigns and their ability to attract users' attention enough to produce clicks. Thus far, the majority of the relevant literature assumed an advertisement's probability of receiving a click to be dependent on the advertisement's quality and its position in the sponsored search list, but independent of the other advertisements shown on the same webpage. We examine a promising new model [1, 16] that incorporates the ex-ternalities effect based on the probabilistic behavior of a typical user. We focus on the Generalized Second Price mechanism used in practice and examine the Nash equilibria of the model. We also investigate the performance of this mechanism under the new model by comparing the efficiency of its equilibria to the optimal efficiency.","cites":"21","conferencePercentile":"86.2745098"},{"venue":"WINE","id":"352ae24c79954847a1746a729456f4dd13843c26","venue_1":"WINE","year":"2005","title":"A Comparative Study on Marketing Mix Models for Digital Products","authors":"Kanliang Wang, Yuan Wang, Jingtao Yao","author_ids":"2799052, 1724874, 1806783","abstract":"The rise of the Internet and electronic commerce provide a huge marketspace and unique transaction process for digital products. It is significant to discuss whether established marketing models can be revised for digital products. First, the unique features of digital products are systematically reviewed, and then three typical digital products, including e-books, anti-virus, and online translation services, are analyzed and compared utilizing three established marketing models, including 4P, 4C, and 4S. We find that these marketing mix models have different suitability for three typical digital products. The intention of this paper is to provide a reference for enterprises in selecting marketing mix model according to product's categories and to provide a marketing strategy tool kit.","cites":"1","conferencePercentile":"28.40909091"},{"venue":"WINE","id":"48e0744dc931c34217ff875bd96a9e9ef5b2db29","venue_1":"WINE","year":"2005","title":"Click Fraud Resistant Methods for Learning Click-Through Rates","authors":"Nicole Immorlica, Kamal Jain, Mohammad Mahdian, Kunal Talwar","author_ids":"1754163, 1800444, 7962175, 1750149","abstract":"In pay-per-click online advertising systems like Google, Overture , or MSN, advertisers are charged for their ads only when a user clicks on the ad. While these systems have many advantages over other methods of selling online ads, they suffer from one major drawback. They are highly susceptible to a particular style of fraudulent attack called click fraud. Click fraud happens when an advertiser or service provider generates clicks on an ad with the sole intent of increasing the payment of the advertiser. Leaders in the pay-per-click marketplace have identified click fraud as the most significant threat to their business model. We demonstrate that a particular class of learning algorithms, called click-based algorithms , are resistant to click fraud in some sense. We focus on a simple situation in which there is just one ad slot, and show that fraudulent clicks can not increase the expected payment per impression by more than o(1) in a click-based algorithm. Conversely, we show that other common learning algorithms are vulnerable to fraudulent attacks.","cites":"59","conferencePercentile":"97.72727273"},{"venue":"WINE","id":"eb619c99f8cb07b6069b16724c83fb253f3b8703","venue_1":"WINE","year":"2005","title":"Outsourcing Internet Security: Economic Analysis of Incentives for Managed Security Service Providers","authors":"Wen Ding, William Yurcik, Xiaoxin Yin","author_ids":"6559488, 1713112, 3165475","abstract":"Firms hesitate to outsource their network security to outside security providers (called Managed Security Service Providers or MSSPs) because an MSSP may shirk secretly to increase profits. In economics this secret shirking behavior is commonly referred to as the Moral Hazard problem. There is a counter argument that this moral hazard problem is not as significant for the Internet security outsourcing market because MSSPs work hard to build and maintain their reputations which are crucial to surviving competition. Both arguments make sense and should be considered to write a successful contract. This paper studies the characteristics of optimal contracts (payment to MSSPs) for security outsourcing market by setting up an economic framework that combines both effects. It is shown that an optimal contract should be performance-based. The degree of performance dependence decreases if the reputation effect becomes more significant. We also show that if serving a large group of customers helps the provider to improve service quality significantly (which is observed in the internet security outsourc-ing market), an optimal contract should always be performance-based even if a strong reputation effect exists.","cites":"17","conferencePercentile":"78.40909091"}]}