{"WINSYS.csv":[{"venue":"WINSYS","id":"f75bec125b32166c6297e668f35e2e8ef6654e41","venue_1":"WINSYS","year":"2008","title":"An Evaluation of a Conservative Transmit Power Control Mechanism on an Indoor 802.11 Wireless Mesh Testbed","authors":"Karol Kowalik, Marek Bykowski, Brian Keegan, Mark Davis","author_ids":"2355593, 2463482, 5451329, 2028903","abstract":"Power control techniques for IEEE 802.11 wireless networks have already gained considerable attention. Such techniques are particularly attractive because they can improve various aspects of wireless network operation such as interference mitigation, spatial reuse in dense wireless deployments, topology control, and link quality enhancement. In this paper we propose a novel delivery ratio based Conservative Transmit Power Control (ConTPC) mechanism. Our implementation is conservative when it comes to deciding if the transmit power should be reduced for a given link. This is because we do not want poor quality wireless links to further reduce their quality and be overwhelmed by other links transmitting at maximum power. We have experimentally evaluated the benefit of the proposed power control scheme when compared with fixed power level systems. We show that our ConTPC mechanism can increase the throughput, however the magnitude of this enhancement largely depends on the topology of the wireless network.","cites":"1","conferencePercentile":"83.33333333"},{"venue":"WINSYS","id":"714472ea29bfe73deee40592d55052481cb4452d","venue_1":"WINSYS","year":"2006","title":"An Architectural Framework for Eterogeneous Networking","authors":"Glenford E. Mapp, David Naveen Cottingham, Fatema Shaikh, Pablo Vidales, Leo Patanapongpibul, Javier Baliosian, Jon Crowcroft","author_ids":"7403657, 3084709, 2544379, 2613598, 1804150, 1799501, 1726850","abstract":"The growth over the last decade in the use of wireless networking devices has been explosive. Soon many devices will have multiple network interfaces, each with very different characteristics. We believe that a framework that encapsulates the key challenges of heterogeneous networking is required. Like a map clearly helps one to plan a journey, a framework is needed to help us move forward in this unexplored area. The approach taken here is similar to the OSI model in which tightly defined layers are used to specify functionality, allowing a modular approach to the extension of systems and the interchange of their components, whilst providing a model that is more oriented to heterogeneity and mobility.","cites":"10","conferencePercentile":"100"}]}