{"Winter_Simulation_Conference.cs":[{"venue":"Winter Simulation Conference","id":"99fd144915496d03bef28947367fea7b44783f80","venue_1":"Winter Simulation Conference","year":"2014","title":"Handling big data on agent-based modeling of online social networks with mapreduce","authors":"Maíra A. de C. Gatti, Marcos R. Vieira, João Paulo F. de Melo, Paulo Rodrigo Cavalin, Claudio S. Pinhanez","author_ids":"2056375, 1849359, 3007637, 1755187, 1766240","abstract":"There is an increasing interest on using Online Social Networks (OSNs) in a wide range of applications. Two interesting problems that have received a lot of attention in OSNs is how to provide effective ways to understand and predict how users behave, and how to build accurate models for specific domains (e.g., marketing campaigns). In this context, stochastic multi-agent based simulation can be employed to reproduce the behavior observed in OSNs. Nevertheless, the first step to build an accurate behavior model is to create an agent-based system. Hence, a modeler needs not only to be effective, but also to scale up given the huge volume of streaming graph data. To tackle the above challenges, this paper proposes a MapReduce-based method to build a modeler to handle big data. We demonstrate in our experiments how efficient and effective our proposal is using the Obama's Twitter network on the 2012 U.S. presidential election.","cites":"1","conferencePercentile":"65.46242775"},{"venue":"Winter Simulation Conference","id":"1598327080ca32a2cf8492f78f3790119d3eec84","venue_1":"Winter Simulation Conference","year":"2005","title":"Representation and analysis of spatial resources in construction simulation","authors":"Cheng Zhang, Tarek M. Zayed, Amin Hammad, Gabriel A. Wainer","author_ids":"3585347, 2445872, 2453214, 1695896","abstract":"Space is one of the resources that may cause crucial problems during construction. Discrete event simulation has been widely used in construction to allocate resources and improve productivity or mitigate conflicts. However, simulation research that provides an explicit method to investigate possible space conflicts is still limited. This paper suggests a cell-based method to represent space resources in construction simulation, which enables conflict analysis and visual display of the worksite and the occupation of spaces. Different simulation models are compared to identify their limitations in space representation.","cites":"13","conferencePercentile":"93.89952153"},{"venue":"Winter Simulation Conference","id":"ec194e898764450f3c22eb7345a6fb6983583efb","venue_1":"Winter Simulation Conference","year":"2006","title":"Sensitivity analysis of construction simulation using Cell-DEVS and microcyclone","authors":"Hong Pang, Cheng Zhang, Amin Hammad","author_ids":"8011929, 3585347, 2453214","abstract":"Simulation has been widely used in the construction industry to optimize productivity and resource allocation. However, simulation research that provides an explicit method to investigate possible space conflicts is still limited. This paper suggests a cell-based modeling approach to represent space resources in construction simulation, which enables spatial conflict analysis and visualization of the worksite and of the occupation of spaces. Comparison between the cell-based modeling approach and MicroCYCLONE approach is done to investigate the validity of the new proposed approach. Sensitivity analysis is applied to both methods to find the optimal resource combination.","cites":"2","conferencePercentile":"42.97124601"},{"venue":"Winter Simulation Conference","id":"34cce1e5c939a5e4a98b3584f5caac4c52e9b528","venue_1":"Winter Simulation Conference","year":"2007","title":"Agent-based simulation for collaborative cranes","authors":"Cheng Zhang, Amin Hammad","author_ids":"3585347, 2453214","abstract":"Most of the materials and components for a construction project are lifted by cranes. Much research has been done for path planning, motion control, and online navigation to reduce conflicts and improve efficiency. This paper proposes a new simulation approach based on agents to coordinate crane operations where two cranes are working together. Agents can dynamically control the kinematic action of the two cranes respecting the functional constraints for safety and efficiency of operations. A simulation model is under development using a case study to investigate the feasibility of the proposed approach.","cites":"1","conferencePercentile":"36.96969697"},{"venue":"Winter Simulation Conference","id":"2d61f921017f0f1a2b2e5b1eb96fa5bdf84b8210","venue_1":"Winter Simulation Conference","year":"2000","title":"A perspective of batching methods in a simulation environment of multiple replications in parallel","authors":"Edjair de Souza Mota, Adam Wolisz, Krzysztof Pawlikowski","author_ids":"2457301, 1778337, 1762995","abstract":"Discrete event simulation is frequently time-consuming either because modern dynamic systems, such as telecommunication networks, are becoming increasingly complex and/or a great number of observations is required to yield reasonably accurate results. An interesting approach to reduce the time duration of simulation is that of concurrently running multiple replications in parallel (MRIP) on a number of processors connected via networking and averaging the results adequately. We present the results of our research on the suitability of batch-means-based procedures in such distributed stochastic simulation.","cites":"4","conferencePercentile":"63.27272727"},{"venue":"Winter Simulation Conference","id":"4234100f50d62875971edc7d7f92d3562d51374c","venue_1":"Winter Simulation Conference","year":"2013","title":"Stochastic kriging with qualitative factors","authors":"Xi Chen, Kai Wang, Feng Yang","author_ids":"1714741, 3751236, 1706687","abstract":"Stochastic kriging (SK) has been studied as an effective metamodeling technique for approximating the mean response surface implied by a stochastic simulation. Until recently, it has only been applied to simulation experiments with continuous decision variables or factors. In this paper, we propose a new method called stochastic kriging with qualitative factors (SKQ) that extends stochastic kriging to a broader scope of applicability. SKQ is able to build metamodels for stochastic simulations that have both quantitative (continuous) and qualitative (categorical) factors. To make this extension, we introduce basic steps of constructing valid spatial correlation functions for handling correlations across levels of qualitative factors. Two examples are used to demonstrate the advantages of SKQ in aggregating information from related response surfaces and metamodeling them simultaneously, in addition to maintaining SK's ability of effectively tackling the impact of simulation errors.","cites":"1","conferencePercentile":"59.26470588"},{"venue":"Winter Simulation Conference","id":"3b224b0c71ad623da9ead5ff7b10eefd72315753","venue_1":"Winter Simulation Conference","year":"2012","title":"Modeling agents and their environment in multi-level-DEVS","authors":"Alexander Steiniger, Frank Krüger, Adelinde M. Uhrmacher","author_ids":"3287126, 2593726, 1743841","abstract":"Environments play an important role in multi-agent systems. They present the context agents operate in. When testing multi-agent systems by simulation, the environment and partly agents have to be modeled. We explore the potential of Multi-Level-DEVS to serve as a modeling formalism for agents, their environment, and the interaction between them. Multi-Level-DEVS combines a modular, hierarchical modeling with variable structures, dynamic interfaces, and explicit means for describing up- and downward causation between different levels of the compositional hierarchy. The modeling in Multi-Level-DEVS emphasizes the role of the environment to provide information for and enforce constrains on the situated agents. A smart meeting room scenario is modeled, and an approach aimed at recognizing user activities in smart environments is tested and evaluated in a simulation study.","cites":"5","conferencePercentile":"92.7184466"},{"venue":"Winter Simulation Conference","id":"215f27ebdba2b50b90dccb2494c5b44e5646f0b8","venue_1":"Winter Simulation Conference","year":"2004","title":"Two-Step 3-Dimensional Sketching Tool for New Product Development","authors":"Ali Akgunduz, Hang Yu","author_ids":"1976582, 1792198","abstract":"This paper discusses a two-step virtual reality based conceptual design tool that enables industrial designers to create sketches of their ideas in 3-dimensional space in real time. In the developed sketching tool, the rough shapes of products are generated by tracing the trajectory of the data-gloves worn by the designer. In the model a practical solution is provided to reduce the generation of unnecessary control points. This is achieved by representing each control point by a spherical volume. Once the rough sketching is completed, NURBS surfaces are constructed by the limited number of reference points that are selected from the initial sketch by using a virtual pen. The two-steps sketching technique enables designers to perform their artistic characteristics freely in an intuitive environment and also enables designers to generate parametric representations of the surfaces to be used in CAD/CAM systems for further analysis.","cites":"0","conferencePercentile":"12.04620462"},{"venue":"Winter Simulation Conference","id":"1ac66d24b73dc9e872085260ee31410e461a356f","venue_1":"Winter Simulation Conference","year":"2009","title":"Experimental Analysis of Logical Process Simulation Algorithms in JAMES II","authors":"Bing Wang, Jan Himmelspach, Roland Ewald, Yiping Yao, Adelinde M. Uhrmacher","author_ids":"1718232, 1705136, 1740229, 2784424, 1743841","abstract":"The notion of <i>logical processes</i> is a widely used modeling paradigm in parallel and distributed discrete-event simulation. Yet, the comparison among different simulation algorithms for LP models still remains difficult. Most simulation systems only provide a small subset of available algorithms, which are usually selected and tuned towards specific applications. Furthermore, many modeling and simulation frameworks blur the boundary between model logic and simulation algorithm, which hampers the extensibility and the comparability. Based on the general-purpose modeling and simulation framework JAMES II, which has already been used for experiments with algorithms several times, we present an environment for the experimental analysis of simulation algorithms for logical processes. It separates model from simulator concepts, is extensible (in regards to the benchmark models, the algorithms used, etc.), and facilitates a fair comparison of algorithms.","cites":"2","conferencePercentile":"51.59010601"},{"venue":"Winter Simulation Conference","id":"5b5f02dd6e98d72606d9804350e959e9dc26f387","venue_1":"Winter Simulation Conference","year":"2010","title":"Summary function elasticity analysis for an individual-based System Dynamics model","authors":"Qian Zhang, Nathaniel D. Osgood","author_ids":"1737486, 2591961","abstract":"While eigenvalue elasticity analysis can offer insights into System Dynamics model behavior, such analysis is complicated, unwieldy and infeasible for larger models due to superlinear growth of the number of eigenvalue-parameter as the number of stocks rises. To overcome these difficulties, we develop a summary function elasticity analysis method, which aids in analyzing the impact of a parameter on some global summary of the system state. A summary function defines a scalar field over state space summarizing the global state of a system. Summary function elasticity with respect to a parameter measures the ratio of the proportional change in the function to the proportional change in a parameter. We use an individual-based viral spread model to demonstrate that this new method offers greater simplicity than eigenvalue elasticity analysis while retaining most of its advantages. This method can be readily scaled to analyze impacts of parameters on larger-scale System Dynamics models.","cites":"0","conferencePercentile":"13.32236842"},{"venue":"Winter Simulation Conference","id":"0fc58918ee7d8a952de28f6d9ebac5db090a091c","venue_1":"Winter Simulation Conference","year":"2011","title":"Towards real-time simulation of construction activities considering spatio-temporal resolution requirements for improving safety and productivity","authors":"Amin Hammad, Cheng Zhang","author_ids":"2453214, 3585347","abstract":"Traditional simulation models use statistical data to estimate task durations. However, to make the simulation results more realistic and reflecting the changes during the task execution, real-time simulation has been suggested by several researchers. On the other hand, little consideration is given to spatio-temporal constraints in simulation models. Several spatial modeling methods, such as maps, grids and 3D models, have been used in construction simulation. However, different resolutions of spatio-temporal representations should be used based on the specific requirements when considering spatio-temporal conflicts. The present paper aims to propose the basic concept of real-time simulation of construction activities considering spatio-temporal resolution requirements for improving safety and productivity. The objectives of the paper are: (1) to review real-time simulation methods of construction activities considering spatio-temporal conflicts; (2) to investigate the spatio-temporal requirements in the real-time simulation environment; and (3) to investigate the integration of simulation models at different spatio-temporal resolutions.","cites":"13","conferencePercentile":"98.66666667"},{"venue":"Winter Simulation Conference","id":"114ecf48dd6a380a8d9fdf48cec874c6a334f876","venue_1":"Winter Simulation Conference","year":"2012","title":"Automatic generation of dynamic virtual fences as part of BIM-based prevention program for construction safety","authors":"Amin Hammad, Shayan Setayeshgar, Cheng Zhang, Yoosef Asen","author_ids":"2453214, 3148927, 3585347, 3297181","abstract":"The present research aims to investigate a new method for the automatic generation of Dynamic Virtual Fences (DVFs) as part of a BIM-based prevention program for construction safety following the Safety Code of Quebec Provence in Canada. First, the Safety Code is reviewed to identify the information that has spatial aspects that can be represented in BIM. Then, a method is proposed for automatically identifying falling and collision risks and generating DVFs. In this method, workspaces are generated in BIM based on Work Breakdown Structure (WBS) deliverables, the project schedule, the dimensions of equipment, and the geometry of the building. One set of DVFs for collision prevention is generated based on those workspaces. Another set of DVFs is generated where physical barriers are needed for fall prevention. The generated DVFs are used coupled with Real-time Location System (RTLS) tracking of workers and physical fences to check safety requirements and to provide safety warnings.","cites":"0","conferencePercentile":"23.30097087"},{"venue":"Winter Simulation Conference","id":"22c108e8e6d047a5014c85f039a51de9b88d37ae","venue_1":"Winter Simulation Conference","year":"2012","title":"Towards the smart construction site: improving productivity and safety of construction projects using multi-agent systems, real-time simulation and automated machine control","authors":"Amin Hammad, Faridaddin Vahdatikhaki, Cheng Zhang, Mohammed Mawlana, Ahmad Doriani","author_ids":"2453214, 3171508, 3585347, 2750504, 3485759","abstract":"With the increasing complexity of construction projects grows the challenge of securing safety and achieving desirable productivity as the chief priorities of the construction industry. Addressing these issues requires robust mechanisms for on-site real-time data capturing, information processing and decision-making. The current research aims to further investigate the concept of the <i>Smart Construction Site</i> where workers, equipment, and materials are continuously tracked, and the collected information is processed in near real time to update the design model and the simulation of upcoming tasks, and to provide navigation guidance and safety warnings in case of potential collisions. The objective of our research is to improve the productivity and safety of heavy construction projects by integrating 3D design models (e.g. highway models) with the managerial and operational processes of heavy construction using advanced agent technology and multi-agent systems, real-time simulation, and automated machine control.","cites":"1","conferencePercentile":"57.03883495"},{"venue":"Winter Simulation Conference","id":"31c988e63bc942de008bb2985716cc72351e6146","venue_1":"Winter Simulation Conference","year":"2014","title":"The role of languages for modeling and simulating continuous-time multi-level models in demography","authors":"Alexander Steiniger, Adelinde M. Uhrmacher, Sabine Zinn, Jutta Gampe, Frans Willekens","author_ids":"3287126, 1743841, 2995143, 2119370, 2950984","abstract":"Demographic microsimulation often focuses on effects of stable macro constraints on isolated individual life course decisions rather than on effects of inter-individual interaction or macro-micro links. To change this, modeling and simulation have to face various challenges. A modeling language is required allowing a compact, succinct, and declarative description of demographic multi-level models. To clarify how such a modeling language could look like and to reveal essential features, an existing demographic multi-level model, i.e., the linked life model, will be realized in three different modeling approaches, i.e., ML-DEVS, ML-Rules, and attributed pi. The pros and cons of these approaches will be discussed and further requirements for the envisioned language identified. Not only for modeling but also for experimenting languages can play an important role in facilitating the specification, generation, and reproduction of experiments, which will be illuminated by defining experiments in the experiment specification language SESSL.","cites":"1","conferencePercentile":"65.46242775"},{"venue":"Winter Simulation Conference","id":"7faf44888eb255e5482423145c03c3dcf62777e6","venue_1":"Winter Simulation Conference","year":"2015","title":"On the monotonic performance of stochastic kriging predictors","authors":"Bing Wang, Jiaqiao Hu","author_ids":"1718232, 2626116","abstract":"Stochastic kriging (SK) has been recognized as a useful and effective technique for approximating the response surface of a simulation model. In this paper, we analyze the performance of SK metamodels in a fully sequential setting when design points are selected one at a time. We consider both cases when the trend term in the model is either known or estimated and show that the prediction performance of the corresponding optimal SK predictor is monotonically improving as the number of design points increases. Numerical examples are also provided to illustrate our findings.","cites":"0","conferencePercentile":"37.01298701"},{"venue":"Winter Simulation Conference","id":"4bb0da158fe52c1be0c3418de444f5433d98ad32","venue_1":"Winter Simulation Conference","year":"2014","title":"A structured devs model representation based on extended structured modeling","authors":"Yunping Hu, Jun Xiao, Gang Rong, Xiaolin Hu","author_ids":"7741441, 2781973, 1881132, 1705418","abstract":"Developing a simulation model needs lots of costs. If the model elements can be reused in newly developed models of the same physical system, the modeling costs will be reduced. Traditional DEVS model representations depend on programming languages. A modeler is difficult to identify the DEVS semantics of model elements, which limits the reuse of existing models. In this paper, the structured modeling technology is used to represent DEVS models. A DEVS model is represented as a structured model. An atomic model can be represented as a genus graph and a modular tree, and a coupled model can be represented as elemental detailed tables. Based on the visual representation, models can be stored, maintained and reused easily. Two cases for the application of structured DEVS model representation are also presented.","cites":"0","conferencePercentile":"27.4566474"},{"venue":"Winter Simulation Conference","id":"48698146c4d284d1d6be847f5b9e663ed0eece1c","venue_1":"Winter Simulation Conference","year":"2013","title":"A simulation-based approach to analyze the information diffusion in Microblogging Online Social Network","authors":"Maíra A. de C. Gatti, Ana Paula Appel, Cícero Nogueira dos Santos, Claudio S. Pinhanez, Paulo Rodrigo Cavalin, Samuel Martins Barbosa Neto","author_ids":"2056375, 2410276, 1790831, 1766240, 1755187, 3079487","abstract":"In this paper we propose a stochastic multi-agent based approach to analyze the information diffusion in Microblogging Online Social Networks (OSNs). OSNs, like Twitter and Facebook, became extremely popular and are being used to target marketing campaigns. Key known issues on this targeting is to be able to predict human behavior like posting a message with regard to some topics, and to analyze the emergent behavior of such actions. We explore Barack Obama's Twitter network as an egocentric network to present our simulation-based approach and predictive behavior modeling. Through experimental analysis, we evaluated the impact of inactivating both Obama and the most engaged users, aiming at understanding the influence of those users that are the most likely to disseminate information over the network.","cites":"5","conferencePercentile":"95.58823529"},{"venue":"Winter Simulation Conference","id":"2558130bfcbaafd080f972a87401f962239e659c","venue_1":"Winter Simulation Conference","year":"2011","title":"Development and the deployment of COSAGE 2.0","authors":"Nathan Dietrich, David N. Smith, Doug Edwards","author_ids":"2361891, 1683473, 2225446","abstract":"The &lt;u&gt;CO&lt;/u&gt;mbat &lt;u&gt;SA&lt;/u&gt;mple &lt;u&gt;GE&lt;/u&gt;nerator (COSAGE) model is a stochastic, symmetric, two-sided combat simulation model implemented in SIMSCRIPT II.5. This model is primary used as a calibration for Attrition Calibration (ATCAL) base theater-level models including the Joint Integrated Contingency Model (JICM), Synthetic Theater Operations Research Model (STORM) (AF, follow-on to Thunder), and Integrated Theater Engagement Model (ITEM) (Navy). In 2009 it was determined that CAA would re-write the model in C++ in order to improve the modularity, ability to enhance the methodology and model maintenance. This paper focuses on the entire development process of the new model from the decision to re-write the model to the testing and evaluation prior to model deployment.","cites":"0","conferencePercentile":"17.46666667"},{"venue":"Winter Simulation Conference","id":"6e45e3f2ef7802b2efcb9968b59e27a85c9f5dd2","venue_1":"Winter Simulation Conference","year":"2001","title":"Simulating networks of wireless sensors","authors":"Sung I. Park, Andreas Savvides, Mani B. Srivastava","author_ids":"2122371, 1988604, 1702254","abstract":"Recent advances in low-power embedded processors, radios, and micro-mechanical systems (MEMs) have made possible the development of networks of wirelessly interconnected sensors. With their focus on applications requiring tight coupling with the physical world, as opposed to the personal communication focus of conventional wireless networks, these wireless sensor networks pose significantly different design, implementation, and deployment challenges. In this paper, we present a set of models and techniques that are embodied in a simulation tool for modeling wireless sensor networks. Our work builds up on the infrastructure provided by the widely used ns-2 simulator, and adds a suite of new features and techniques that are specific to wireless sensor networks. These features introduce the notion of a sensing channel through which sensors detect targets, and provide detailed models for evaluating energy consumption and battery lifetime.","cites":"41","conferencePercentile":"98.14814815"},{"venue":"Winter Simulation Conference","id":"27ad02f75f92f9244d2e1e4e3c1fa03fabf8dc6c","venue_1":"Winter Simulation Conference","year":"2015","title":"ML3: a language for compact modeling of linked lives in computational demography","authors":"Tom Warnke, Alexander Steiniger, Adelinde M. Uhrmacher, Anna Klabunde, Frans Willekens","author_ids":"2149363, 3287126, 1743841, 3227928, 2950984","abstract":"Agent-based modeling and simulation is widely used in computational demography. Although existing agent-based approaches allow modeling linked lives in a rather flexible manner, the resulting models, due to typically being implemented in a general-purpose programming language, often lack the compactness required to easily access the model. With ML3 (Modeling Language for Linked Lives) we present a compact and expressive domain-specific modeling language for continuous-time agent-based models in computational demography. The language combines elements from guarded commands, process algebras, and rule-based approaches. We discuss and present the individual features of the language and illuminate its compactness by presenting the specification of an entire agent-based model from recent literature.","cites":"1","conferencePercentile":"82.72727273"},{"venue":"Winter Simulation Conference","id":"e47b44ab0cbe6ff18f423564d799880f57bf384e","venue_1":"Winter Simulation Conference","year":"2010","title":"Modeling and simulation of teachers occupational stress diffusion in China","authors":"Tianyin Liu, Bin Hu","author_ids":"2594172, 1702845","abstract":"In this paper, we present occupational stress diffusion model, which are significant for the research on simulation in Chinese teachers healthcare. Our approach is an agent-based simulation implemented by using AnyLogic 6 and MATLAB 7.0. Then virtual experiments are designed, and some results are concluded. The threshold value exists in organizational work control and occupational stress management in a social network is significant and efficient. Simultaneously, we need to focus on the changing of organization stress structure and take suitable measures to maintain middle level stress state, so as to keep teachers healthy physically and psychologically, individuals active in work and organization stable.","cites":"0","conferencePercentile":"13.32236842"},{"venue":"Winter Simulation Conference","id":"4f4ef4f258cce6cb643dac70c8f2998b11209ed4","venue_1":"Winter Simulation Conference","year":"2007","title":"Towards a conceptual framework for visual analytics of time and time-oriented data","authors":"Wolfgang Aigner, Alessio Bertone, Silvia Miksch, Christian Tominski, Heidrun Schumann","author_ids":"7250086, 2867431, 1692521, 1718009, 1729669","abstract":"Time is an important data dimension with distinct characteristics that is common across many application domains. This demands specialized methods in order to support proper analysis and visualization to explore trends, patterns, and relationships in different kinds of time-oriented data.\n The human perceptual system is highly sophisticated and specifically suited to spot visual patterns. For this reason, visualization is successfully applied in aiding these tasks. But facing the huge volumes of data to be analyzed today, applying purely visual techniques is often not sufficient. Visual analytics systems aim to bridge this gap by combining both, interactive visualization and computational analysis.\n In this paper, we introduce a concept for designing visual analytics frameworks and tailored visual analytics systems for time and time-oriented data. We present a number of relevant design choices and illustrate our concept by example.","cites":"19","conferencePercentile":"96.66666667"},{"venue":"Winter Simulation Conference","id":"3351a792d01edc065ebe3c8a4f67e478dd79a467","venue_1":"Winter Simulation Conference","year":"2015","title":"Data-driven schemes for resolving misspecified MDPs: asymptotics and error analysis","authors":"Hao Jiang, Uday V. Shanbhag","author_ids":"4795925, 1729535","abstract":"We consider the solution of a finite-state infinite horizon Markov Decision Process (MDP) in which both the transition matrix and the cost function are misspecified, the latter in a parametric sense. We consider a data-driven regime in which the learning problem is a stochastic convex optimization problem that resolves misspecification. Via such a framework, we make the following contributions: (1) We first show that a misspecified value iteration scheme converges almost surely to its true counterpart and the mean-squared error after K iterations is O(1/K 1/2−α) with 0 < α < 1/2; (2) An analogous asymptotic almost-sure convergence statement is provided for misspecified policy iteration; and (3) Finally, we present a constant steplength misspecified Q-learning scheme and show that a suitable error metric is O(1/K 1/2−α) + O(√ δ) with 0 < α < 1/2 after K iterations where δ is a bound on the steplength.","cites":"1","conferencePercentile":"82.72727273"},{"venue":"Winter Simulation Conference","id":"1120aa7d709ac7e10006010f6ebc3b0af8aca903","venue_1":"Winter Simulation Conference","year":"2001","title":"Experiences parallelizing a commercial network simulator","authors":"Hao Wu, Richard M. Fujimoto, George F. Riley","author_ids":"1739602, 1721009, 1701611","abstract":"Most current approaches of parallel simulation focus on building new parallel simulation engines that require the development of new models and software. An alternate, emerging approach is to extend sequential simulators to execute on parallel computers. We describe a methodology for realizing parallel simulations in this manner. This work is specifically concerned with parallelization of commercial simulators where source code for some or all of the sequential simulator is not available. We describe our experiences in applying this methodology to realize a parallel version of the OPNET simulator for modeling computer networks. We show significant speedup can be readily obtained for some OPNET models if proper partitioning strategies are applied and the simulation attributes are tuned appropriately. However, we observe that substantial modifications to other OPNET models are needed to achieve efficient parallel execution because of their extensive use of global variables and \"zero lookahead events\".","cites":"19","conferencePercentile":"94.44444444"},{"venue":"Winter Simulation Conference","id":"0e394177066a4f0c125be446d3f990a2068b56a6","venue_1":"Winter Simulation Conference","year":"2013","title":"Can you simulate traffic psychology? An analysis","authors":"Marco Lützenberger, Sahin Albayrak","author_ids":"2606118, 1722170","abstract":"Contemporary traffic simulation frameworks use sophisticated physical- or mathematical models to \"mimic\" traffic systems in a lifelike fashion. Nevertheless, when it comes to road traffic, there seems to be no parameter more essential than the driver himself. Most frameworks neglect human factors in traffic entirely, or \"estimate\" a particular form of human behavior without providing any connection to reality. In this work we aim to establish such connection. We explain driver behavior from a psychological perspective and analyze the most important (psychological) driver behavior conceptualizations in order to identify crucial factors of human traffic behavior. Based on this analysis we examine the ability of state-of-the-art traffic simulation to account for these factors. It is our intention to determine the capabilities of traffic simulation frameworks, to point out perspectives for future research and to provide a guideline for the selection of the right traffic simulation system.","cites":"0","conferencePercentile":"23.82352941"},{"venue":"Winter Simulation Conference","id":"62481af41130dd440cc0e81eaae411f7221b5eb3","venue_1":"Winter Simulation Conference","year":"2016","title":"Convenus: Congestion verification of network updates in software-defined networks","authors":"Xin Liu, Dong Jin, Cheol Won Lee, Jong Cheol Moon","author_ids":"1749705, 1776440, 2305670, ","abstract":"We present ConVenus, a system that performs rapid congestion verification of network updates in software-defined networks. ConVenus is a lightweight middleware between the SDN controller and network devices, and is capable to intercept flow updates from the controller and verify whether the amount of traffic in any links and switches exceeds the desired capacity. To enable online verification, ConVenus dynamically identifies the minimum set of flows and switches that are affected by each flow update, and creates a compact network model. ConVenus uses a four-phase simulation algorithm to quickly compute the throughput of every flow in the network model and report network congestion. The experimental results demonstrate that ConVenus manages to verify 90% of the updates in a network consisting of over 500 hosts and 80 switches within 5 milliseconds.","cites":"0","conferencePercentile":"48.34834835"},{"venue":"Winter Simulation Conference","id":"0cf6f9c8aa53fb27c6d335f5d61089e2026060e7","venue_1":"Winter Simulation Conference","year":"1996","title":"A Testbed for Parallel Simulation Performance Prediction","authors":"Alois Ferscha, James Johnson","author_ids":"1745790, 3002659","abstract":"The overwhelming complexity of influencing factors determining the performance of parallel simulation executions demands a performance oriented development of logical process simulators. This paper presents an incremental code development process that supports early performance predictions of Time Warp protocols and several of its optimizations. A set of tools, N-MAP, for performance prediction and visualization has been developed, representing a testbed for a detailed sensitivity analysis of the various Time Warp execution parameters. As an example, the effects of various performance factors like the event structure underlying the simulation task, the average LVT progression per simulation step, the commitment rate, state saving overhead, etc. are demonstrated. We show how the scenario management features provided by the N-MAP tool can be efficiently utilized to predict performance sensitivities. For the particular example, the Time Warp protocol, though highly involved, N-MAP was able to predict the per formance sensitivity that was measured from the full implementation executing on the Meiko CS-2.","cites":"10","conferencePercentile":"78.125"},{"venue":"Winter Simulation Conference","id":"28683b7504184cf06b4898264ede235084b0d636","venue_1":"Winter Simulation Conference","year":"1993","title":"The close combat tactical trainer program","authors":"William R. Johnson, Thomas W. Mastaglio, Paul D. Peterson","author_ids":"5649976, 1894065, 2192961","abstract":"The Close Combat Tactical Trainer (CCTT) is the first full scale development of a Distributed Interactive Simulations (DIS) training system. CCTT is being developed to support the training requirements of the U.S. Army's combined arms teams. however it also provides an entity-based battlefield which will be able to support higher level training and development activities. This paper will provide an overview of CC'IT. discuss how it will use the DIS standard protocols and semi-automated forces within its architecture, the program's development methodology, and its role in future Army training. CCTT builds on the successful technology demonstration of this approach by DARPA's SIMNET project (Thorpe 1987).","cites":"4","conferencePercentile":"67.83783784"},{"venue":"Winter Simulation Conference","id":"4af9c4cd2d706a81eb5d8a54061ca0a1c6278e37","venue_1":"Winter Simulation Conference","year":"2013","title":"REDSim: A spatial agent-based simulation for studying emergency departments","authors":"Ana Paula Centeno, Richard Martin, Robert Sweeney","author_ids":"2886835, 1907601, 1937062","abstract":"Faced with a mismatch between demand and resources, Emergency Department (ED) administrators and staff need to gauge the impacts of staff decision processes in lieu of increasing resource levels. In this paper we present REDSim, a spatial agent-based simulation framework for studying emergency departments. REDSim focuses on quantifying the impacts of staff decision processes, such as patient selection, on the length of stay, waiting and boarding times, and other variables. We show REDSim's effectiveness by comparing four patient selection strategies: longest waiting, shortest distance, random, and highest acuity. REDSim showed that although patient length of stay is not significantly reduced (1.4%) the throughput increases 17% when providers select the closest instead of the highest acuity patient for the next task.","cites":"0","conferencePercentile":"23.82352941"},{"venue":"Winter Simulation Conference","id":"3163d05834a25cad5c792e4e15d2a2ea5b5861f9","venue_1":"Winter Simulation Conference","year":"2010","title":"Multistate modeling and simulation for regulatory networks","authors":"Zhen Liu, Umme Juka Mobassera, Clifford A. Shaffer, Layne T. Watson, Yang Cao","author_ids":"1731300, 2439162, 1758750, 5972282, 4918470","abstract":"Many protein regulatory models contain chemical species best represented as having multiple states. Such models stem from the potential for multiple levels of phosphorylation or from the formation of multiprotein complexes. We seek to support such models by augmenting an existing modeling and simulation system. Interactions between multistate species can lead to a combinatorial explosion in the potential state space. This creates a challenge when using Gillespie's stochastic simulation algorithm (SSA). Both the network-free algorithm (NFA) and various rules-based methods have been proposed to more efficiently simulate such models. We show how to further improve NFA to integrate population-based and particle-based features. We then present a population-based scheme for the stochastic simulation of rule-based models. A complexity analysis is presented comparing the proposed simulation methods. We present numerical experiments for two sample models that demonstrate the power of the proposed simulation methods.","cites":"2","conferencePercentile":"58.88157895"},{"venue":"Winter Simulation Conference","id":"08dd326f8d424f3dd9e0bd9ee90337f03df88514","venue_1":"Winter Simulation Conference","year":"2002","title":"Simulation applications in the automotive industry: simulation anywhere any time: web-based simulation implementation for evaluating order-to-delivery systems and processes","authors":"Soundar R. T. Kumara, Yong-Han Lee, Kaizhi Tang, Chad Dodd, Jeffrey D. Tew, Shang-Tae Yee","author_ids":"1749112, 2809240, 3047331, 2870972, 2565474, 1697751","abstract":"GM Enterprise Systems Laboratory (GMESL) has developed a stand-alone single user simulation program for evaluating and predicting Order-to-Delivery (OTD) systems and processes. In order for more people to be able to access this simulator, to share the simulation results, and to analyze simulation collaboratively, we have designed, developed and implemented an Internet-based three-tiered client/server framework, which consists of the three tiers: database, execution and user interface. The corresponding components are: database server, execution server, and web based user interface. The relational database server enables users to interact with the persistent data sets for simulation study and maintains data integrity. The multiagent based execution server guarantees stable user responsiveness by virtue of multi-agent's flexible architecture, accordingly achieving a high level of processing scalability. Finally the web-based graphical user interface helps users to easily conduct the simulation study from anywhere at any time, and the visual simulation analysis tool helps users to make decisions effectively.","cites":"3","conferencePercentile":"72.12230216"},{"venue":"Winter Simulation Conference","id":"b9d25314b62f048e3bb4e70f98138505bc21a328","venue_1":"Winter Simulation Conference","year":"1993","title":"Employing databases for large scale reuse of simulation models","authors":"Martin Hitz, Hannes Werthner, Tuncer Ören","author_ids":"1737056, 1781757, 2064368","abstract":"To enhance reusability in the field of simulation, model bases must be equipped with powerful tools for retrieval, modification and aggregation of simulation models. In this paper, the role of database management systems supporting a modeiing environment is discussed and reuse oriented query interfaces are presented. Specifically, we advocate a graph browser operating on a semantic network of reusable components. 1 INTRODUCTION Reusability of software artifacts has become a well established requirement in the software engineering community during the last decade, and its importance in the field of simulation has also been pointed out by many authors already and Otto 199 1). However, simulation models still seem to be lacking reusability (Lung et al. 1992): Many modelers still view each simulation project as unique and often construct from scratch a specific model to meet the objectives. As a result, cost overruns and poor performance are usually associated with the simulation building process. Consequently, modeling and simulation environments must be complemented by specific features to enhance reusability. Such a reusability-oriented modeling environment has to support at least four cmcial aspects of reusability in the simulation field! 1. Storage and documentation of models, 2. Construction of new models and modification of stored models, 3. Retrieval of models which satisfy the modeler's needs, 4, Composition of new aggregate models from existing parts, paying heed to semantic constraints as far as possible. In this situation, the role of database management systems (DBMSS) in simulation environments can be envisaged as twofold: Firstly (and classically), DBMSS can be used as data stores for all kinds of data relevant to the study at hand, e.g. input or output time series and the like. In this context , DBMSS can be used as a standard interfacing mechanism between distinct simulation models, mediating the information flow in aggregate (compound) models or in experimentation / optimization submodules of integrated simulation environments (hen et al. 199% Guariso, Hitz, and Werthner 1993). Secondly, on a meta level, DBMSS may serve as tools suppotting model bases, i.e. repositories for model descriptions. Instead of storing specific model code (i.e., input to simulation packages), the structural and semantic aspects of simulation models can be managed, together with (procedural) knowledge of how to construct the input of a specific package prior to model execution. In this latter role, DBMSS significantly enhance the reusa-bility of simulation models. Naturally, it is most convenient to use a DBMS as …","cites":"4","conferencePercentile":"67.83783784"},{"venue":"Winter Simulation Conference","id":"3cbfd40aa898d5ac9cebc1a80e5bcbbdaedf239f","venue_1":"Winter Simulation Conference","year":"2008","title":"A modeling-based classification algorithm validated with simulated data","authors":"Karen Hovsepian, Peter Anselmo, Subhasish Mazumdar","author_ids":"2083740, 6141278, 2592682","abstract":"We present a Generalized Lotka-Volterra (GLV) based approach for modeling and simulation of supervised inductive learning, and construction of an efficient classification algorithm. The GLV equations, typically used to explain the biological world, are employed to simulate the process of inductive learning. In addition, the modeling approach provides a key advantage over the more conventional constraint and optimization-based classification algorithms, as influences of outliers and local patterns, which can lead to problematic overfitting, are auto-moderated by the model itself. We present the bare-bones algorithm and motivate the model through axiomatic postulates. The algorithm is validated using benchmark simulated datasets, showing results competitive with other cutting-edge algorithms.","cites":"0","conferencePercentile":"15.57591623"},{"venue":"Winter Simulation Conference","id":"3f5bab00463de028ee853701eb7f835fc185f479","venue_1":"Winter Simulation Conference","year":"2011","title":"Strategic behavior in a living environment","authors":"Marco Lützenberger, Sebastian Ahrndt, Benjamin Hirsch, Nils Masuch, Axel Heßler, Sahin Albayrak","author_ids":"2606118, 2213620, 1980193, 2603623, 8542325, 1722170","abstract":"When it comes to road traffic, there seems to be no parameter more essential than the driver himself. His internal preferences, his attitude and his perception determine the traffic situation in a crucial way. Yet, as a matter of fact, only a small number of existing traffic simulation frameworks provide a model for the driver's behavior. These existing models usually focus on tactical aspects, and neglect decisions with a strategic touch. Recently, we have introduced a driver model which is able to incorporate strategic decisions. While this model already takes infrastructural installations into account, we refine our so far presented work in this paper and extend it to account for additional criteria, the so called Regional Conditions.","cites":"1","conferencePercentile":"46"},{"venue":"Winter Simulation Conference","id":"b15efaab9d93e8d0fd081b2737dbf2ee9fc25146","venue_1":"Winter Simulation Conference","year":"2008","title":"Modelling and simulation of team effectiveness emerged from member-task interaction","authors":"Shengping Dong, Bin Hu, Jiang Wu","author_ids":"2881895, 1702845, 1685298","abstract":"A team's task process consists of allocation, processing and evaluation of a series of tasks. Team effectiveness emerges from interactions among team members. The interactions between the task process and members occur when team allocates and processes tasks. To address the effect of the interaction on team effectiveness, Multi-agent based modelling and simulation is utilized to develop a multi-agent model of team's task process, in which we put forward member relation degree and member-task matching degree to describe the social relations existing in a team and how members' competence match with tasks' demands respectively. We implement the model by Repast J and conduct experiments to validate the model using face validation technique in an actual Chinese team. The implication of the model to the team is discussed and some suggestions are offered. The conclusion is given at last.","cites":"1","conferencePercentile":"39.26701571"},{"venue":"Winter Simulation Conference","id":"3c0b3116a2dc3bf7b2bc190b9041413863e70fff","venue_1":"Winter Simulation Conference","year":"2004","title":"Parallel Simulation of Group Behaviors","authors":"Bo Zhou, Suiping Zhou","author_ids":"3738572, 1738476","abstract":"Group behaviors, e.g. birds flocking, are widely used in virtual reality, computer games, robotics and artificial life. While many methods to simulate group behaviors have been proposed, these methods are usually applied to sequential computing. Since most of these methods have a polynomial complexity, it is difficult to simulate a large group in real-time using these methods. In this paper, we propose a parallel algorithm to simulate the flocking behavior of a large group. The new partitioning and communication mechanisms in the parallel algorithm make the flocking simulation more efficient. Experimental results show that the proposed parallel algorithm provides good speedup in generating flocking behaviors compared with the sequential simulation.","cites":"18","conferencePercentile":"94.71947195"},{"venue":"Winter Simulation Conference","id":"d30b73023589f56a519f4e444c641c55f71baab7","venue_1":"Winter Simulation Conference","year":"2009","title":"Toward Simulation-based Real-time Decision-support Systems for Emergency Departments","authors":"Yariv N. Marmor, Segev Wasserkrug, Sergey Zeltyn, Yossi Mesika, Ohad Greenshpan, Boaz Carmeli, Avraham Shtub, Avishai Mandelbaum","author_ids":"1828747, 1894693, 2146823, 2836395, 2201956, 1719299, 2485193, 1802581","abstract":"Emergency Departments (EDs) require advanced support systems for monitoring and controlling their processes: clinical, operational, and financial. A prerequisite for such a system is comprehensive operational information (e.g. queueing times, busy resources,...), reliably <i>portraying and predicting</i> ED status as it evolves in time. To this end, simulation comes to the rescue, through a two-step procedure that is hereby proposed for supporting real-time ED control. In the first step, an ED manager <i>infers</i> the ED's <i>current</i> state, based on historical data and simulation: data is fed into the simulator (e.g. via location-tracking systems, such as RFID tags), and the simulator then completes unobservable state-components. In the second step, and based on the inferred present state, simulation supports <i>control</i> by <i>predicting</i> future ED scenarios. To this end, we estimate time-varying resource requirements via a novel simulation-based technique that utilizes the notion of <i>offered-load</i>.","cites":"6","conferencePercentile":"79.6819788"},{"venue":"Winter Simulation Conference","id":"3de24db26cbed47f189f263603a0ea709bdf2700","venue_1":"Winter Simulation Conference","year":"2012","title":"Seamless integration of game and learning using modeling and simulation","authors":"Dennis Maciuszek, Martina Weicht, Alke Martens","author_ids":"2158349, 3324443, 3284097","abstract":"In this paper we show our approach to make two steps towards integration of modeling and simulation and intelligent tutoring for game-based learning environments. The first step is to construct a framework for developing game-based (and also non-game-based) learning systems, which is based on fundamentals of Intelligent Tutoring System construction and on a full-fledged simulation system (JAMES II), and which allows component-based design and re-usage of existing components. The second step is to develop modeling and simulation-based learning games which seamlessly integrate game and play (immersive didactics). We show the viability of our approach in two case studies -- a racing game that can be used to learn geographical facts, and a game about marine science in which school students learn about the interrelations of an ecosystem.","cites":"2","conferencePercentile":"73.4223301"},{"venue":"Winter Simulation Conference","id":"5fc12853ef56ccdf56e1a974bb369d1e07da2546","venue_1":"Winter Simulation Conference","year":"1994","title":"Concurrent execution of timed Petri nets","authors":"Alois Ferscha","author_ids":"1745790","abstract":"The dynamics of discrete event systems can be eeec-tively described and analyized using the timed Pe-tri net formalism. The aim of this paper is to comprehensively present the achievements attained in accelerating Petri net executions by using parallel or distributed multiprocessing environments. The basic problem is to generate concurrent Petri net executions insuring correctness in the sense that the partial ordering of transition rings produced is consistent with the total event ordering that would be produced by a (hypothetical) sequential execution. Two lines of thought have been followed: in parallel simulations transition rings evolve as governed by a SIMD iteration mechanism. Distributed simulations aim at a proper synchronization of rings in spatially different net parts to avoid timing inconsistencies and alterations of the execution behavior. In both cases, structural properties of the underlying Petri net can be eeciently used to simplify and/or accelerate concurrent execution implementations.","cites":"23","conferencePercentile":"93.19371728"},{"venue":"Winter Simulation Conference","id":"32e528a146ab4d5625769e8e6e50744ee1f6c554","venue_1":"Winter Simulation Conference","year":"2010","title":"Model driven healthcare: Disconnected practices","authors":"Tillal Eldabi, Gyuchan T. Jun, P. John Clarkson, Con Connell, Jonathan H. Klein","author_ids":"2453123, 1971792, 4766875, 3163732, 3215349","abstract":"Over the past decades simulation has been recognized as a vital tool for solving problems within the healthcare sector, almost catching up with other areas. It is evident that healthcare systems are rapidly evolving into complex and dynamic environments whilst bearing a multitude of stakeholders. Simulation has originally emerged from military and manufacturing applications that mainly follow sequential processing with pre-specified targets. Such an approach is too rigid and irrelevant to the complexity and dynamism of healthcare systems, where lack of understanding is a common feature. This is mainly attributed to lack of understating of the life cycle of healthcare services. In this paper we attempt to define the life cycle of healthcare services and explore the use of modeling and simulation in supporting healthcare service development and management. We particularly explore a number of exemplars of how modeling was used to support earlier stages of the service life cycle.","cites":"1","conferencePercentile":"38.81578947"},{"venue":"Winter Simulation Conference","id":"84ae2e707793539c664bd8306a6ee8dcbadbff83","venue_1":"Winter Simulation Conference","year":"2001","title":"Roadways, vehicle, and traffic applications: defining models of urban traffic using the TSC tool","authors":"Mariana Lo Tártaro, César Torres, Gabriel A. Wainer","author_ids":"3253504, 4769628, 1695896","abstract":"ATLAS is a specification language defined to outline city sections as cell spaces. A static view of the city section to be analyzed can be defined and a modeler is able to define complex traffic models in a simple fashion. A compiler for this specification language (called TSC) was built. The language implements the ATLAS constructions as Cell-DEVS models. The rule generation for describing the traffic behavior is based on macro templates, entitling changes in the model implementation in a flexible way. The formal specification avoids a high number of errors in the developed application, and the problem solving time is highly reduced.","cites":"4","conferencePercentile":"64.58333333"},{"venue":"Winter Simulation Conference","id":"6c5150731610a489b2a007368dd6bc4b85259439","venue_1":"Winter Simulation Conference","year":"2009","title":"Simulation of Project-based Organizational Design in China: From the Perspective of Contextual Interactions","authors":"Huanhuan Wang, Bin Hu, Guoyin Jiang","author_ids":"5169302, 1702845, 2539463","abstract":"The project-based organizations engaging in engineering consultancy are at the early stage in China. For the manager of China, how to conduct the organization design for them according to contextuality that characterizes the conditions of China is an important issue. First, the factors that affect the performance of this type of the project-based organization of China are analyzed. Then, the organizational design model that has both the advantages of NK model and the ones of complementarity framework is proposed. The impacts of the interactions among the design dimensions of organization, capability to gain resource and turbulence of the environment on the organizational design are researched with simulation approach. Furthermore, the qualitative demonstration of the model is done with data and materials gathered from the actual cases. Last, the implications of the results are put forward.","cites":"0","conferencePercentile":"10.9540636"},{"venue":"Winter Simulation Conference","id":"0652aa8cc46795f891bda42b064c9dfbbe06a60f","venue_1":"Winter Simulation Conference","year":"2011","title":"Modeling the materials handling in a container terminal using electronic real-time tracking data","authors":"Yan Liu, Soemon Takakuwa","author_ids":"1681842, 1692813","abstract":"Information systems have been introduced to accumulate real-time tracking data on containers and transporters at container terminals in ports. Logistics managers of container terminals need an intelligent tool to analyze the performance of highly complex and large logistics systems using the accumulated real-time tracking data. In this paper, all of the operational activities of an actual container terminal in Japan are simulated to analyze the processing time and the bottlenecks of the operations flows. The method for collecting the required data for performing simulation is described, especially by making use of electronic real-time tracking data that is accumulated from the information systems. The procedure is applied to an actual container terminal in a port. It is found that the information obtained by performing simulation is effective for analyzing the performance of the operation.","cites":"3","conferencePercentile":"74.66666667"},{"venue":"Winter Simulation Conference","id":"1711b6101f6a35e65eb462fd6a012d3f7274fc59","venue_1":"Winter Simulation Conference","year":"2010","title":"Enhancing simulation as a decision-making support tool for a crossdocking center in a dynamic retail-distribution environment","authors":"Yan Liu, Soemon Takakuwa","author_ids":"1681842, 1692813","abstract":"To ensure just-in-time shipments from a general non-automated retail-cross-docking center, different items must be handled efficiently by different processes despite the many inbound shipments and frequent demand orders from retail stores. In this paper, a systematic and flexible procedure is proposed that efficiently provides critical decision-making support to logistics managers to help them understand and validate the material handling operation at a real retail-cross-docking center. The proposed procedure considers dynamic logistics operation information, such as inbound schedules of suppliers, demand data from retail-chain stores, and individual operator schedules. This detailed data is required for the performance of simulation. In addition, the procedure is applied to an actual non-automated retail-cross-docking center to confirm its effectiveness. Furthermore, the proposed method was found to be both practical and powerful in assisting logistics managers with their continuous decision-making efforts.","cites":"1","conferencePercentile":"38.81578947"},{"venue":"Winter Simulation Conference","id":"66b7e4af648eba38836128ba8cbed6704f91e085","venue_1":"Winter Simulation Conference","year":"2009","title":"Simulation-based Personnel Planning for Materials Handling at a Cross-docking Center under Retail Distribution Environment","authors":"Yan Liu, Soemon Takakuwa","author_ids":"1681842, 1692813","abstract":"This study focuses on the personnel planning of materials handling at a real cross-docking center under a retail distribution environment. Materials handling at a cross-docking center is complicated and labour intensive. Managers are usually under enormous pressure to optimize personnel planning to deal with an increasing variety of items handled by different processes. In this study, a flexible and stepwise procedure of personnel planning is proposed to minimize the total personnel expenses at a cross-docking center, especially taking merchandise mixing and operator skills into consideration. The procedure includes adopting simulation together with integer programming. In addition, the procedure is applied to an actual cross-docking center in order to confirm its effectiveness. Furthermore, the proposed method is found to be both practical and powerful to assist logistics managers in their personnel planning efforts.","cites":"2","conferencePercentile":"51.59010601"},{"venue":"Winter Simulation Conference","id":"40d8e4cf7635a15062ba0d6ebae4bfa065c37eb6","venue_1":"Winter Simulation Conference","year":"2001","title":"Security issues in high level architecture based distributed simulation","authors":"Asa Elkins, Jeffery W. Wilson, Denis Gracanin","author_ids":"2297073, 2900856, 1709677","abstract":"The United States Department of Defense (DoD) has, over the past several years, emphasized the need to employ simulation based acquisition (SBA) in engineering and development. Distributed simulation introduces an information assurance challenge and details of a simulation must be guarded from unauthorized access. The High Level Architecture (HLA) and its Run-Time Interface (RTI) do not define support of mandatory access controls (MACs) or discretionary access controls (DACs) required to provide necessary protection levels. We review of some current MLS approaches for HLA/RTI simulations to illustrate the deficient Multi-Level Secure (MLS) components in HLA and present options for a secure HLA interface built at the network layer. An initial implementation of a proposed solution is presented. We discuss experimental results, limitations of our implementation and future research directions.","cites":"7","conferencePercentile":"77.5462963"},{"venue":"Winter Simulation Conference","id":"c69daf3461fae9b0882a01ee493e64b88620e7ff","venue_1":"Winter Simulation Conference","year":"2000","title":"Analyzing transformation-based simulation metamodels","authors":"Maria de los A. Irizarry, Michael E. Kuhl, Emily K. Lada, Sriram Subramanian, James R. Wilson","author_ids":"2926802, 2454580, 2362992, 1702794, 1875745","abstract":"We present a technique for analyzing a simulation metamodel that has been constructed using a variance-stabilizing transformation. To compute a valid confidence interval for the expected value of the original simulation response at a selected factor-level combination (design point), we first compute the corresponding confidence interval for the transformed response at that factor-level combination and then untransform the endpoints of the resulting confidence interval. Taking the midpoint of the untransformed confidence interval as our point estimator of the expected simulation response at the selected factor-level combination and approximating the variance of this point estimator via the delta method, we formulate an approximate two-sample Student <i>t</i>-test for validating our metamodel-based estimator versus the results of making independent runs of the simulation at the selected factor-level combination. We illustrate this technique in a case study involving the design of a manufacturing cell, and we compare our results with those of a more conventional approach to analyzing transformed-based simulation metamodels. A Monte Carlo performance evaluation shows that significantly better confidence-interval coverage is maintained with the proposed procedure over a wide range of values for the residual variance of the transformed metamodel.","cites":"6","conferencePercentile":"71.45454545"},{"venue":"Winter Simulation Conference","id":"7c07800e8ba2ea914d6ae5d30e8565ddcdfbf18c","venue_1":"Winter Simulation Conference","year":"2015","title":"An approach to modeling internet of things based smart built environments","authors":"Denis Gracanin, Kresimir Matkovic, Joseph Wheeler","author_ids":"1709677, 1715967, 2227993","abstract":"Smart built environments enhanced with technology can improve the lives of individuals, groups, and the broader community. We describe an approach to modeling IOT-based smart built environments that uses a large-scale virtual environment where a building model is aligned with the physical space. This approach takes advantages of affordances and embodied cognition in a large physical space to model user interaction with built spaces. The built space contains 'smart objects' with embedded sensors/actuators/controllers (e.g., kitchen appliances). A 'smart object' has the corresponding virtual object in the virtual environment. A case study (FutureHAUS) demonstrates the proposed approach.","cites":"0","conferencePercentile":"37.01298701"},{"venue":"Winter Simulation Conference","id":"1f0b356cbfd20735968b55500da2da8bd0d20ac8","venue_1":"Winter Simulation Conference","year":"2013","title":"On the solution of stochastic optimization problems in imperfect information regimes","authors":"Hao Jiang, Uday V. Shanbhag","author_ids":"4795925, 1729535","abstract":"We consider the solution of a stochastic convex optimization problem E[<i>f</i>(<i>x</i>; <i>&theta;</i>*, &xi;)] in <i>x</i> over a closed and convex set <i>X</i> in a regime where <i>&theta;</i>* is unavailable. Instead, <i>&theta;</i>* may be learnt by minimizing a suitable metric E[<i>g</i>(<i>&theta;</i>; &eta;)] in <i>&theta;</i> over a closed and convex set &Theta;. We present a coupled stochastic approximation scheme for the associated stochastic optimization problem with imperfect information. The schemes are shown to be equipped with almost sure convergence properties in regimes where the function <i>f</i> is both strongly convex as well as merely convex. Rate estimates are provided in both a strongly convex as well as a merely convex regime, where the use of averaging facilitates the development of a bound.","cites":"2","conferencePercentile":"78.82352941"},{"venue":"Winter Simulation Conference","id":"0720bdfe734759499dc88032b40f1b6d5c4107e2","venue_1":"Winter Simulation Conference","year":"2012","title":"Towards an agent-based symbiotic architecture for autonomic management of virtualized data centers","authors":"Qi Liu, Dilma Da Silva, Georgios K. Theodoropoulos, Elvis S. Liu","author_ids":"1728293, 2746901, 1809613, 2419579","abstract":"The increasing scale and complexity of virtualized data centers pose significant challenges to system management software stacks, which still rely on special-purpose controllers to optimize the operation of cloud infrastructures. Autonomic computing allows complex systems to assume much of their own management, achieving self-configuration, self-optimization, self-healing, and self-protection without external intervention. This paper proposes an agent-based architecture for autonomic cloud management, where resources and virtual machines are associated with <i>worker agents</i> that monitor changes in their local environments, interact with each other, make their own decisions, and take adaptive actions supervised by a <i>network of management processes</i>. To fulfill global objectives, the management processes conduct what-if simulations and update the worker agents' local rules when necessary. Such a guided decentralized decision making method can mitigate the pressure on the system management stack, improve the effectiveness of resource management, and accelerate the response to failures and attacks.","cites":"1","conferencePercentile":"57.03883495"},{"venue":"Winter Simulation Conference","id":"6e01389b26720f31d0e7ef2229695846008b79e0","venue_1":"Winter Simulation Conference","year":"2000","title":"Manufacturing sypply chain management: distributed supply chain simulation across enterprise boundaries","authors":"Boon-Ping Gan, Li Liu, Sanjay Jain, Stephen John Turner, Wentong Cai, Wen-Jing Hsu","author_ids":"1794378, 3382156, 4367848, 1730222, 1750691, 1743256","abstract":"The effective practice of supply chain management (SCM) is crucial to improve corporations' competitive advantage. Many corporations have built simulation models to facilitate the application of simulation in designing, evaluating, and optimizing their supply chain. Traditionally, a supply chain involves only a single enterprise with multiple facilities and distribution centers. Hence, sharing of detailed simulation models is not a problem in this scenario. But in recent years, the scope of SCM has evolved to cross the enterprise boundaries. Applying simulation in designing, evaluating, and optimizing the supply chain becomes more difficult since the participating corporations might not be willing to share their simulation models with partners. In this paper, distributed simulation techniques are presented as an enabling technology that allows corporations to construct a cross enterprise simulation while hiding model details within the enterprise. This can be realized by either building the simulation on top of the Runtime Infrastructure of the High Level Architecture or building the simulation on top of a customized distributed discrete event simulation protocol. These alternative approaches are compared in terms of their performance and interoperability. The comparison of the performance is done through a benchmarking test of a semiconductor supply chain model.","cites":"2","conferencePercentile":"49.27272727"},{"venue":"Winter Simulation Conference","id":"6f5b9689a35a657c2e1a986a9dc65bfb9a5f305f","venue_1":"Winter Simulation Conference","year":"2015","title":"An online game simulation environment for detecting potential deceptive insiders","authors":"Hongmei Chi, Shuyuan Mary Ho, Dominique Hubbard","author_ids":"1752820, 2162111, 2997843","abstract":"This poster presents an initial attempt to simulate a corporate computing environment that can uncover hidden intent within information exchange and interaction among online social actors. The lawful interception approach is deployed in the lab to capture data and information among social actors in online environments. We designed and simulated insider threat scenarios in a controlled lab environment. Captured data is being analyzed with content analysis, LIWC (Linguistic Inquiry and Word Count) toolkits. Our preliminary results shows that deceptive actors tend of use different patterns of communication behavior that can be identified. 1 INTRODUCTION Insider threat continues to be of serious concern to government agencies and private companies. An insider threat generally refers to a person who has or had authorized access to an organization's network, system , or data, but intentionally misuses that privilege and access to negatively affect the confidentiality, integrity , or availability of the organization's information or information systems [2]. Moreover, the risk of exposure through mobile devices and Internet clouds has increased exponentially simply because mobile devices and the cloud environment extend the boundaries and controls of the corporate network domain. The consequences of insider threat or insider attacks can be devastating, and its impacts range from financial loss, damage of reputation, to loss of intellectual property and reputation [2]. The fact that insiders in many cases are current or former employees, interns, contractors and/or business partners makes it more difficult to track and differentiate routine normal behavior from anomalous conduct. Prior research showed that many deviated insiders appeared to display subtle hints in their social networking communications , such as Twitter, or Facebook [4]. One possible direction is to provide an interactive framework for corporate communication, which allows organizations to make sense computationally of their current and regular employees' communicative intent [3, 4]. This poster describes a study conducted in online simulated incorporate environment based on social networking scenario. The components below demonstrate our initial approach of detecting potential insider threat attacks. We use LIWC The proposed lab was deployed in the virtual lab located at the FSU College of Communication and Information (https://labs.cci.fsu.edu) [1, 2]. To assure the success of the lawful interception program, we identified the data service content in the data capture list for operation. We captured data in its entirety, which included the content of their communication, time-stamps, and the identities of users. Additionally, data such as the protocol types, …","cites":"0","conferencePercentile":"37.01298701"},{"venue":"Winter Simulation Conference","id":"55a5231572da8560bc1a2013cdb3b6ca8c845e1c","venue_1":"Winter Simulation Conference","year":"2009","title":"A Post-disaster Mobility Model for Delay Tolerant Networking","authors":"Md. Yusuf Sarwar Uddin, David Nicol, Tarek F. Abdelzaher, Robin Kravets","author_ids":"2987420, 4281521, 1730531, 1731585","abstract":"Delay Tolerant Networking (DTN) considers how to provide communication in contexts where it is unreasonable to assume end-to-end connectivity. Network devices exchange buffered messages when they come into communication range; messages may be buffered and carried physically several times before ultimately being received. Service characteristics of a DTN depend intimately on the underlying movement of devices through physical space; correspondingly, an assessment of DTN technology (e.g. routing protocols, message exchange policies, etc.) depends on that same movement. Existing mobility models provided in simulators lack characteristics one expects in post-disaster communication. We propose a mobility model that includes the impact of the disaster on the transportation network, and that models population and relief vehicle movement. We augment the \"Opportunistic Network Environment\" (ONE) simulator of DTNs with required extensions and show that characteristics of the DTN are very different using the new model than it is under models that ONE currently provides.","cites":"17","conferencePercentile":"97.34982332"},{"venue":"Winter Simulation Conference","id":"5ce0db7fb3c46c53862d4882af35b0389aabc3af","venue_1":"Winter Simulation Conference","year":"1991","title":"Integrated interfaces for decision-support with simulation","authors":"Philip R. Cohen","author_ids":"2305444","abstract":"A major limitation of graphical user interfaces for simulation is that users such as managers and de cision makers need to know too much. We examine the weaknesses inherent in graphical user interfaces to support these users of simulation for short-term situation assessment and scenario evaluation , a style of problem solving characteristic of military and factory command-and-control. Then, we present Shoptalk, a factory command-and-control system with an interface integrating direct manipulation and natural-language processing, and demonstrate how the Shoptalk style of interaction can overcome these limitations.","cites":"16","conferencePercentile":"91.60839161"},{"venue":"Winter Simulation Conference","id":"becb1977732fc2f171f7cc6135f52a29c064a0a2","venue_1":"Winter Simulation Conference","year":"2005","title":"Learning simulation through team projects","authors":"Omer Tsimhoni, Changxu Wu","author_ids":"1723297, 1701007","abstract":"For several years, team projects have been an integral part of the simulation course at the department of Industrial and Operations Engineering at the University of Michigan. We believe that team projects are an effective tool for learning how to perform simulation. In this paper, we present a brief summary of research on cooperative learning from the field of Education Research. Based on findings from that research, we present the procedure we follow in assigning, running, and evaluating team projects during an academic semester. We analyze students' responses to a survey on their preference and perceived value of the team project as conducted in this course.Two student papers, published in this conference, provide for examples of completed team projects.","cites":"2","conferencePercentile":"53.11004785"},{"venue":"Winter Simulation Conference","id":"d09b604804bb8fa82188e60e9326b8d1cddede72","venue_1":"Winter Simulation Conference","year":"2000","title":"Toward a standard process: the use of UML for designing simulation models","authors":"Hendrik Richter, Lothar März","author_ids":"1803618, 2228763","abstract":"Designing complex simulation models is a task essentially associated with software engineering. In this paper, the Unified Modeling Language (UML) is used to specify simulation models. It is shown that, similar to the \"Unified Process\" in software engineering, such a methodology forms a sound base for developing complex simulation models. An example is provided to illustrate how this approach supports the design process.","cites":"10","conferencePercentile":"82"},{"venue":"Winter Simulation Conference","id":"73fb6c86631607a0e0689ec4dd85a21126d1fd00","venue_1":"Winter Simulation Conference","year":"2014","title":"Controlling scalability of distributed virtual environment systems","authors":"H. Lally Singh, Denis Gracanin, Kresimir Matkovic","author_ids":"3240547, 1709677, 1715967","abstract":"A Distributed Virtual Environment (DVE) system provides a shared virtual environment where physically separated users can interact and collaborate over a computer network. There are three major challenges to improve DVE scalability: effective DVE system performance measurement, understanding the controlling factors of system performance/quality and determining the consequences of DVE system changes. We describe a DVE Scalability Engineering (DSE) process that addresses these three major challenges for DVE design. The DSE process allows us to identify, evaluate, and leverage trade-offs among DVE resources, the DVE software, and the virtual environment. We integrate our load simulation and modeling method into a single process to explore the effects of changes in DVE resources.","cites":"1","conferencePercentile":"65.46242775"},{"venue":"Winter Simulation Conference","id":"41c10393ad03ccf2e6d01d7d67921f4b0969a416","venue_1":"Winter Simulation Conference","year":"2006","title":"Comparative analysis of process interaction and activity scanning approaches in simulation of construction operations","authors":"Rita Awwad, Amir Behzadan, Omer Tsimhoni","author_ids":"2509596, 2153789, 1723297","abstract":"This work illustrates the modeling and implementation differences between Process Interaction (PI) and Activity Scanning (AS) approaches in simulation of construction operations. AS has been widely used in simulation of construction activities while PI is a common approach in simulating manufacturing and industrial operations. A rock quarry site has been chosen as a sample construction operation which inherits some degrees of uncertainty primarily in limited resource levels. The two simulation tools used are ProModel (for process interaction) and STROBOSCOPE (for activity scanning). Relevant details of implementation are described on each software in an attempt to show that both programs can sufficiently be used to model the task. We compare the results and discuss the differences.","cites":"0","conferencePercentile":"12.14057508"},{"venue":"Winter Simulation Conference","id":"a9bc2f516c709f8ab1c8a0873538070ee19271a2","venue_1":"Winter Simulation Conference","year":"2006","title":"A simulation analysis of multicasting in delay tolerant networks","authors":"Muhammad Abdulla, Robert Simon","author_ids":"2715356, 1982318","abstract":"Delay tolerant networks (DTNs) are a class of systems that experience frequent and long-duration partitions. As in all distributed systems, DTN multicasting is a desirable feature for applications where some form of group communication is needed. The topological impairments experienced within a DTN pose unique challenges for designing effective DTN multicasting protocols. In this paper, we examine multicasting in DTNs. Unlike earlier work we assume no knowledge of node connectivity or mobility patterns. We propose the use of both single-copy and multi-copy routing DTN routing algorithms. We also explore the use of gossiping and core nodes in DTNs to decrease the number of redundant messages while maintaining high message delivery ratios. We have performed extensive evaluations of our proposed methods. Our results show that with careful protocol parameter selection it is possible to achieve high delivery rates for various system scenarios.","cites":"7","conferencePercentile":"79.71246006"},{"venue":"Winter Simulation Conference","id":"4c8327752efe7c3832df8108a9c5cfdde210a6af","venue_1":"Winter Simulation Conference","year":"2002","title":"Web-based simulation 2: configuration, simulation and animation of manufacturing systems via the internet","authors":"Tom-David Graupner, Hendrik Richter, Wilfried Sihn","author_ids":"2279544, 1803618, 1802752","abstract":"In the light of growing demand for individualized products, configuration systems are becoming increasingly important. Most interesting are configurators that can be accessed over the Internet. They can be used by sales representatives and customers independent of location and time. In this paper, a new electronic service for configuration, simulation and animation of manufacturing systems is considered. It allows to present, test and optimize manufacturing systems via the Internet.","cites":"1","conferencePercentile":"48.02158273"},{"venue":"Winter Simulation Conference","id":"fb656b97266e67bcade7d0bbda5a9fe453cbb18c","venue_1":"Winter Simulation Conference","year":"2015","title":"Multi-objective optimization for a hospital inpatient flow process via discrete event simulation","authors":"Yang Wang, Loo Hay Lee, Ek Peng Chew, Sean Shao Wei Lam, Seng Kee Low, Marcus Eng Hock Ong, Haobin Li","author_ids":"1747927, 1793268, 1695403, 2229304, 3008976, 2846037, 2020617","abstract":"This paper describes a Discrete Event Simulation (DES) model for a hypothetical inpatient flow process of a large acute-care hospital. The implementation of the Multi-Objectives Convergent Optimization via Most-Promising-Area Stochastic Search (MO-COMPASS) approach in this DES model for the identification of promising Pareto optimal solutions is also discussed. The MO-COMPASS algorithm implemented within the DES modelling paradigm demonstrates how the Multi-Objective Discrete Optimization via Simulation (MDOvS) framework can be applied to identify process improvement opportunities for a hypothetical inpatient boarding processes of a large acute care hospital.","cites":"1","conferencePercentile":"82.72727273"},{"venue":"Winter Simulation Conference","id":"3c7dbbbcfcebdffd86107b36b57da4a12d0a7104","venue_1":"Winter Simulation Conference","year":"2011","title":"Comparison of the experimental and simulation results for distributed virtual environments applications framework","authors":"Xiaoyu Zhang, Denis Gracanin","author_ids":"1791962, 1709677","abstract":"In our previous work we developed <i>Caffe Neve</i> framework that allows application developers to create flexible and extensible Distributed Virtual Environments (DVEs) applications from the distributed components. The components can serve as remote content sources that stream down interactive 3D content to the application integrator. Since DVEs are interactive, multi-user and networked systems, it is important to ensure good responsiveness and overall performances of the developed applications. We investigate the performance of the integrated applications to evaluate the framework capability. We conducted experiments and used OMNeT++ simulation tool to explore the scalability issues. We use various metrics such as the response latency and service load estimation to evaluate the framework performance.","cites":"0","conferencePercentile":"17.46666667"},{"venue":"Winter Simulation Conference","id":"52f1d9a663e51c812f4df5dac50997b1429950d2","venue_1":"Winter Simulation Conference","year":"2013","title":"Improving patient length-of-stay in emergency department through dynamic queue management","authors":"Kar Way Tan, Hoong Chuin Lau, Francis Chun Yue Lee","author_ids":"2021773, 1809379, 2492066","abstract":"Addressing issue of crowding in an Emergency Department (ED) typically takes the form of process engineering or single-faceted queue management strategies such as demand restriction, queue prioritization or staffing the ED. This work provides an integrated framework to manage queue <i>dynamically</i> from both demand and supply perspectives. More precisely, we introduce intelligent dynamic patient prioritization strategies to manage the demand concurrently with dynamic resource adjustment policies to manage supply. Our framework allows decision-makers to select both the demand-side and supply-side strategies to suit the needs of their ED. We verify through a simulation that such a framework improves the patients' length-of-stay in the ED without restricting the demand.","cites":"1","conferencePercentile":"59.26470588"},{"venue":"Winter Simulation Conference","id":"173cfcfe40fef111cc2cc05440146cae60fb0573","venue_1":"Winter Simulation Conference","year":"2013","title":"Energy saving information cascades in online social networks: An agent-based simulation study","authors":"Qi Wang, John E. Taylor","author_ids":"4849112, 3307389","abstract":"Information shared through online social networking platforms is spread from user to user. Although some researchers have argued that this phenomenon can unfold similarly to an epidemic, others have found that information disseminates within a narrow range, propagating only a few levels in a communication network. In an effort to resolve these conflicting findings, we developed an information cascade model to conduct a variance-based global sensitivity analysis (GSA) to determine the influence of two network attributes on the diffusion of energy saving information. The simulation results of the base model showed that energy saving information failed to generate deep cascades. Also, the results from the GSA demonstrated that network density and the number of an initiator's connections had limited influence on information cascades. These findings suggest that massive network structures and a large number of potential recipients do not engender deep cascades of energy saving information in online social networks.","cites":"0","conferencePercentile":"23.82352941"},{"venue":"Winter Simulation Conference","id":"617b4303972e5dc3c32106a6bd18c775dea9f362","venue_1":"Winter Simulation Conference","year":"2010","title":"Highway Mobility and Vehicular Ad-Hoc Networks in NS-3","authors":"Hadi Arbabi, Michele C. Weigle","author_ids":"2417177, 1793181","abstract":"The study of vehicular ad-hoc networks (VANETs) requires efficient and accurate simulation tools. As the mobility of vehicles and driver behavior can be affected by network messages, these tools must include a vehicle mobility model integrated with a quality network simulator. We present the first implementation of a well-known vehicle mobility model to ns-3, the next generation of the popular ns-2 networking simulator. Vehicle mobility and network communication are integrated through events. User-created event handlers can send network messages or alter vehicle mobility each time a network message is received and each time vehicle mobility is updated by the model. To aid in creating simulations, we have implemented a straight highway model that manages vehicle mobility, while allowing for various user customizations. We show that the results of our implementation of the mobility model matches that of the model's author and provide an example of using our implementation in ns-3.","cites":"22","conferencePercentile":"99.01315789"},{"venue":"Winter Simulation Conference","id":"457dcf34cfdaef8f30bf4e860af9d4b68a5466da","venue_1":"Winter Simulation Conference","year":"2006","title":"Improving confidence in network simulations","authors":"Michele C. Weigle","author_ids":"1793181","abstract":"Simulation has become the tool of choice for an increasing number of networking researchers. Unfortunately, standard statistical techniques often cannot be applied when Internetlike heavy-tailed workloads are used as input. We present issues involved in using heavy-tailed distributions in network simulations, including three different methods for dealing with such distributions in simulation. We also discuss the proper use of the random number generator implemented in the <i>ns</i>-2 simulator and the impacts of improper usage.","cites":"7","conferencePercentile":"79.71246006"},{"venue":"Winter Simulation Conference","id":"43e4be3e0340ec91f6adf74363798ce59264aec5","venue_1":"Winter Simulation Conference","year":"2016","title":"Data-driven simulation of urban human mobility constrained by natural disasters","authors":"Qi Wang, John E. Taylor","author_ids":"4849112, 3307389","abstract":"Understanding of human movements in urban areas plays a key role in improving our disaster response, evacuation, and relief plans. However, there is a lack of research on human mobility perturbation under the influence of hurricanes. Furthermore, limited simulation studies have had access to empirical human travel data in urban areas during natural disasters. In this paper we developed a computational model to simulate human mobility during the approaching and strike of hurricanes. Inspired by animal movements in a fragmented habitat, we examined human movements in New York City and its adjacent areas during the striking of Hurricane Sandy. Based on the patterns observed, we established a data-driven model to simulate human movements during hurricanes. The model integrated multiple resources of urban informatics including U.S. census data, Twitter data, and Google Maps. The research effort aims to inform policy-makers and support decision-making under different emergency situations that can arise during hurricanes. 1 INTRODUCTION Cities are facing an increasing amount of threats from natural disasters. Natural disasters cause significant disruption on human society and damages on buildings and infrastructure. A 2013 report from UNISDR (2013) summarized that from 2002 to 2012, natural disasters caused 1.2 million deaths, influenced 2.9 billion people, and resulted in a total of 1.7 trillion dollars of economic loss. It is predicted that the numbers will increase due to ongoing climate change. Humans are facing an ever-pressing challenge to remain resilient during natural disasters. Current disaster response and evacuation plans are not effective enough. Take New Yorkers' actions during Hurricane Sandy as an example. While 71 percent of the New Yorkers living in evacuation areas were aware of the mandatory order to evacuate, more than 50 percent of them stayed nonetheless (Schuerman 2013). Regretfully, many of the fatalities occurred in the evacuation areas (CDC 2013). Even the people who evacuated were not entirely safe. Data from FEMA (US Federal Emergency Management Agency) show that the flooding areas in NYC during Hurricane Sandy were 15 percent larger than the evacuation areas, putting people who stayed in some of the assumed safe areas in severe threat (Rosenzweig and Solecki 2014). Existing research has already pointed out that human mobility plays a key role in disaster evacuations (Pan et al. 2007; Schneider et al. 2011). A bottom-up understanding of human mobility can help reduce the reoccurrences of traffic jams during emergencies. Furthermore, deep understanding and accurate prediction of human mobility …","cites":"0","conferencePercentile":"48.34834835"},{"venue":"Winter Simulation Conference","id":"e2ee98a37c77b96f3c6742d077c9b5540853d265","venue_1":"Winter Simulation Conference","year":"2006","title":"Eucalyptus: intelligent infrastructure enabled participatory design studio","authors":"Michael Jemtrud, Philam Nguyen, Bruce Spencer, Martin Brooks, Sandy Liu, Yong Liang, Bo Xu, Libo Zhang","author_ids":"1823833, 2243278, 1907917, 3354665, 3602724, 1782929, 1749224, 2783407","abstract":"A new notion of participation is at stake with advances in technologically mediated work environments. Insufficient bandwidth and insufficiently powerful, crudely coordinated tools resulted in distributed task-based modes of collaboration that did not allow full participation by members of distributed design teams. The emergence of Service Oriented Architectures (SOA) and User-Controlled Light-Paths (UCLP) herald the beginning of a new age where fully participatory multi-site design may become possible.While most service-oriented solutions are developed for gluing systems or data together, the Participatory Design Studio (PDS) Eucalyptus is developed to manage and configure the resources needed by users engaging in a participatory design session, such as a videoconference application, and a visualization server. Harnessing the power of UCLP, Eucalyptus strives to provide a set of upper layer services for non-technical users to provision devices and applications running on high-speed broadband networks, in addition to conventional TCP/IP networks.","cites":"4","conferencePercentile":"60.06389776"},{"venue":"Winter Simulation Conference","id":"1d715ade86ac0c694e0fc979e24b15be59bc9208","venue_1":"Winter Simulation Conference","year":"2016","title":"V-shaped sampling based on Kendall-Distance to enhance optimization with ranks","authors":"Haobin Li, Giulia Pedrielli, Min Chen, Loo Hay Lee, Ek Peng Chew, Chun-Hung Chen","author_ids":"2020617, 2669215, 1711628, 1793268, 1695403, 4683292","abstract":"In the area of discrete optimization via simulation (DOvS), optimization over rank values has been of concern in computer science and, more recently, in multi-fidelity simulation optimization. Specifically, Chen et al. (2015) proposes the concept of Ordinal Transformation to translate multi-dimensional discrete optimization problems into single-dimensional problems which are simpler, and the transformed solution space is referred as ordinal space. In this paper, we build on the idea of ordinal transformation and its properties in order to derive an efficient sampling algorithm for identifying the solution with the best rank in the setting of multi-fidelity optimization. We refer to this algorithm as V-shaped and we use the concept of Kendall distance adopted in the machine learning theory, in order to characterize solutions in the OT space. The algorithm is presented for the first time and preliminary performance results are provided comparing the algorithm with the sampling proposed in Chen et al. (2015).","cites":"0","conferencePercentile":"48.34834835"},{"venue":"Winter Simulation Conference","id":"8c3d03a8f8d90cbfc197787171a138111be83438","venue_1":"Winter Simulation Conference","year":"2006","title":"Executable biology","authors":"Jasmin Fisher, Thomas A. Henzinger","author_ids":"1792550, 1710285","abstract":"Computational modeling of biological systems is becoming increasingly common as scientists attempt to understand biological phenomena in their full complexity. Here we distinguish between two types of biological models --- mathematical and computational--- according to their different representations of biological phenomena and their diverse potential. We call the approach of constructing computational models of biological systems <i>Executable Biology</i>, as it focuses on the design of executable computer algorithms that mimic biological phenomena. We give an overview of the main modeling efforts in this direction, and discuss some of the new challenges that executable biology poses for computer science and biology. We argue that for executable biology to reach its full potential as a mainstream biological technique, formal and algorithmic approaches must be integrated into biological research, driving biology towards a more precise engineering discipline.","cites":"7","conferencePercentile":"79.71246006"},{"venue":"Winter Simulation Conference","id":"b2b20ceddd90e66db8a6a8fe1d6e2817bbc5d7b7","venue_1":"Winter Simulation Conference","year":"1995","title":"A High Fidelity ATM Traffic and Network Simulator","authors":"Brian W. Unger, Fabian Gomes, Xiao Zhonge, Pawel Gburzynski, Theodore Ono-Tesfaye, Srini Ramaswamy, Carey L. Williamson, Alan Covington","author_ids":"1748839, 2250114, 2020649, 1731130, 1889532, 3757958, 3152750, 3025786","abstract":"The design of an ATM traffic and network (ATM-TN) simulator which characterizes cell level network behavior is presented. The simulator incorporates three classes of ATM traffic source models: an aggregate ethernet model, an MPEG model and a World Wide Webb transactions model. Six classes of ATM switch architectures are modeled including output buffered, shared memory buffered and cross bar switch models, and then multistage switches which can be built from these three basic models. The ATM-TN simulator can be used to characterize arbitrary ATM networks with dynamic multimedia traffic loads. Call set up and tear down via ATM signaling is implemented in addition to the various types of cell traffic streams generated by voice, video and data. The simulator is built on a simple, efficient simulation language called SimKit which is capable of supporting both fast sequential and parallel execution. Parallel execution is supported using WarpKit, an optimistically synchronized kernel that is aimed at shared memory multiprocessor platforms such as the Silicon Graphics Powerchallenge and Sun Spare 1000 series machines. The paper outlines general requirements for ATM traffic and network simulation, presents an ATM-TN simulator architecture, describes its major components and discusses the major issues associated with cell level ATM modeling and simulation.","cites":"12","conferencePercentile":"86.25"},{"venue":"Winter Simulation Conference","id":"9234349be55a9113d8924b094dbf5782bce4f444","venue_1":"Winter Simulation Conference","year":"2003","title":"New simulation methodology for risk analysis: importance sampling for a mixed Poisson model of portfolio credit risk","authors":"Paul Glasserman, Jingyi Li","author_ids":"1756697, 2231629","abstract":"Simulation is widely used to estimate losses due to default and other credit events in financial portfolios. The challenge in doing this efficiently results from (i) rare-event aspects of large losses and (ii) complex dependence between defaults of multiple obligors. We discuss importance sampling techniques to address this problem in two portfolio credit risk models developed in the financial industry, with particular emphasis on a mixed Poisson model. We give conditions for asymptotic optimality of the estimators as the portfolio size grows.","cites":"1","conferencePercentile":"55.72519084"},{"venue":"Winter Simulation Conference","id":"1c4bbc5b5a6e11d6c1861499f6209071e7222873","venue_1":"Winter Simulation Conference","year":"2011","title":"A methodology for managing distributed virtual environment scalability","authors":"H. Lally Singh, Denis Gracanin","author_ids":"3240547, 1709677","abstract":"Distributed Virtual Environments (DVEs) are a large class of real-time simulation systems. We present an implementation-independent methodology for measuring, analyzing, and comparing DVE systems performance. The methodology comprises of a process of requirements elicitation and their conversion into measurable objectives. The process for determining quality requirements for a DVE is discussed, with a focus on interaction-based scenario analysis. An example is given with a simple game --- Asteroids --- that has been modified to support two players (users).","cites":"1","conferencePercentile":"46"},{"venue":"Winter Simulation Conference","id":"13b52fe84db62a69312fb2aaeaa1832b1f07614b","venue_1":"Winter Simulation Conference","year":"2004","title":"Easy-SC: A Supply Chain Simulation Tool","authors":"Juqi Liu, Wei Wang, Yueting Chai, Yi Liu","author_ids":"2732084, 1706612, 2783949, 1691635","abstract":"To assist the decision makers, we develop a new supply chain simulation software: Easy-SC, a Java-based tool that simplifies the supply chain simulation. In its current state of development, Easy-SC is a modeling tool for assessing the pros and cons of new facility locations, resource allocations and different combinations of policies. It can be used in the modeling of small projects such as single inventory units to large-scale projects such as world wide supply chains. This paper introduces Easy-SC by an examination of its current software module architecture, modeling elements, basic features and simulation processes.","cites":"9","conferencePercentile":"85.64356436"},{"venue":"Winter Simulation Conference","id":"0369e0c814093fa2fd3590671596b425b4752f05","venue_1":"Winter Simulation Conference","year":"2013","title":"An agent-based simulation approach to experience management in theme parks","authors":"Shih-Fen Cheng, Larry Lin, Jiali Du, Hoong Chuin Lau, Pradeep Varakantham","author_ids":"2089330, 2657785, 8491051, 1809379, 1718824","abstract":"In this paper, we illustrate how massive agent-based simulation can be used to investigate an exciting new application domain of experience management in theme parks, which covers topics like congestion control, incentive design, and revenue management. Since all visitors are heterogeneous and self-interested, we argue that a high-quality agent-based simulation is necessary for studying various problems related to experience management. As in most agent-base simulations, a sound understanding of micro-level behaviors is essential to construct high-quality models. To achieve this, we designed and conducted a first-of-its-kind real-world experiment that helps us understand how typical visitors behave in a theme-park environment. From the data collected, visitor behaviors are quantified, modeled, and eventually incorporated into a massive agent-based simulation where up to 15,000 visitor agents are modeled. Finally, we demonstrate how our agent-based simulator can be used to understand the crowd build-up and the impacts of various control policies on visitor experience.","cites":"3","conferencePercentile":"89.26470588"},{"venue":"Winter Simulation Conference","id":"a74a42109699494b454f952598baad769afab57d","venue_1":"Winter Simulation Conference","year":"2016","title":"A method to avoid smartphone memory errors impacting encryption keys","authors":"Jianing Zhao, Peter Kemper","author_ids":"2690510, 1796126","abstract":"Encryption is used as the method of choice to control access to sensitive data on a smartphone by systems such as CleanOS. We present a simulation study to demonstrate the potential damaging effect that memory errors can have on encrypted data if errors corrupt encryption keys. We show how simple algorithmic strategies to detect and correct a faulty key can marginalize the risk of such errors.","cites":"0","conferencePercentile":"48.34834835"},{"venue":"Winter Simulation Conference","id":"8da3c2f965d9bb851193b0db784b03cc69c12640","venue_1":"Winter Simulation Conference","year":"2014","title":"Effective and scalable uncertainty evaluation for large-scale complex system applications","authors":"Junfei Xie, Yan Wan, Yi Zhou, Kevin Mills, James J. Filliben, Yu Lei","author_ids":"2236670, 3317875, 4017197, 3157968, 1820984, 6834380","abstract":"Effective uncertainty evaluation is a critical step toward real-time and robust decision-making for complex systems in uncertain environments. A Multivariate Probabilistic Collocation Method (M-PCM) was developed to effectively evaluate system uncertainty. The method smartly chooses a limited number of simulations to produce a low-order mapping, which precisely predicts the mean output of the original system mapping up to certain degrees. While the M-PCM significantly reduces the number of simulations, it does not scale with the number of uncertain parameters, making it difficult to use for large-scale applications that typically involve a large number of uncertain parameters. In this paper, we develop a method to break the curse of dimensionality. The method integrates M-PCM and Orthogonal Fractional Factorial Designs (OFFDs) to maximally reduce the number of simulations from 2<sup>2<i>m</i></sup> to 2&lceil;log2(m+1)&rceil; for a system mapping of <i>m</i> parameters. The integrated M-PCM-OFFD predicts the correct mean of the original system mapping, and is the most robust to numerical errors among all possible designs of the same number of simulations. The analysis also provides new insightful formal interpretations on the optimality of OFFDs.","cites":"0","conferencePercentile":"27.4566474"},{"venue":"Winter Simulation Conference","id":"546891ef76d08bafd100bb71cdf66ec69876dd99","venue_1":"Winter Simulation Conference","year":"1998","title":"Enterprise Architecture for Business Process Simulation","authors":"Ali Bahrami, Deborah A. Sadowski, Soheila Bahrami","author_ids":"3333398, 1722460, 1984195","abstract":"Many simulation systems are standalone, running only on a desktop and having limited capabilities to integrate with other technologies such as company databases, workflow engines, and other desktop solutions. At the same time, leading corporations have discovered the value of simulation technology. Many companies require simulation to be used as standard procedure in support of process improvements. A much greater return on investment is possible if process descriptions and simulation results can be accessed throughout the enterprise. A tool that can assist in business process modeling and simulation across an entire organization can enable these gains. This paper addresses the benefits of creating a comprehensive system for the modeling and simulation of business processes on an enterprise-wide basis and presents an architecture for an enabling tool to accomplish these objectives.","cites":"10","conferencePercentile":"71.94570136"},{"venue":"Winter Simulation Conference","id":"6db1d3632beab4586e46513d910ecaf3bf399a28","venue_1":"Winter Simulation Conference","year":"2001","title":"On the impact of concurrent downloads","authors":"Yong Liu, Weibo Gong, Prashant J. Shenoy","author_ids":"7135550, 1807361, 1705052","abstract":"Concurrent downloads accelerate information access speed for individual web users. The speed-up comes from multiple connections launched for one subject download, which leads to unfairness at user level. In this paper, we study the impact of concurrent downloads on the network. Particularly, we investigate the fairness between users who employ different downloading concurrency. We also discuss how concurrent downloads affect the transient behavior of the network.","cites":"16","conferencePercentile":"92.12962963"},{"venue":"Winter Simulation Conference","id":"02be889d74e06516cd9411262071d323bf59a675","venue_1":"Winter Simulation Conference","year":"2015","title":"Using simulation to examine appointment overbooking schemes for a medical imaging center","authors":"Yan Chen, Yong Hong Kuo, Hari Balasubramanian, Chaobai Wen","author_ids":"1700696, 2039775, 1826188, 2043613","abstract":"In this paper, we present an appointment scheduling problem faced by a medical imaging center in a major hospital in Macau. We developed an empirically calibrated simulation model to represent the appointment and medical diagnosis procedure as a multi-server queuing network with multiple patient classes. Four appointment overbooking schemes are proposed to compensate for patient no-shows and unpunctuality. The focus of this study is to integrate overbooking schemes with existing appointment rules to improve the operational efficiency of the center. Simulation results show that our proposed overbooking schemes significantly enhance the performance of the center. Compared with the current practice, the best performing overbooking scheme reduces the overtime by 58.32% and the idle time by 23.65%, increases the number of patients served by 15.9%, while still ensuring that patient waiting times remain acceptable. 1 INTRODUCTION Patients' no-show behavior and its negative impact on medical practice have been documented in many studies. A 12% no-show rate is reported at general practices and outpatient clinics in the United Kingdom (Sharp and Hamilton 2001). Dreiher et al. (2008) report a 30% proportion of non-attendance in an outpatient obstetrics and gynecology clinic. Defife et al. (2010) report a 21% no-show rate in psychotherapy appointments. All of these facts indicate that patient no-shows are prevalent in different healthcare units all over the world. Our research is motivated by an appointment scheduling problem in a medical imaging center of one of the major hospitals in Macau. Due to the increasing patient demand for medical diagnostic services, our project team was asked by the hospital administrators to improve the efficiency of the medical imaging center. In addition to anticipating the increasing patient demand, the center has also been suffering from patient no-shows and unpunctuality, and is looking for solutions to reduce the idle time of valuable resources and staff overtime.","cites":"0","conferencePercentile":"37.01298701"},{"venue":"Winter Simulation Conference","id":"0c780fcfae0d5e7fc92b2e77d287079284c63658","venue_1":"Winter Simulation Conference","year":"2006","title":"Meta-level control architecture for massively multiagent simulations","authors":"Shohei Yamane, Toru Ishida","author_ids":"3300808, 1709883","abstract":"Various situations in a massively multi-agent simulation will emerge in a simulation or the period of the simulation will become too long. These situations cause problems for system operators in that each action scenario becomes too complex to maintain and a simulation costs very long time. Therefore, flexible control of the simulation, such as changing simulation speed and switching agents' action scenarios, is required. We propose a meta-scenario description language and a meta-level control architecture. The meta-scenario description language describes how to control simulations and agents based on an extended finite state machine. Meta-level control architecture achieves control on the basis of meta-scenarios provided by a meta-scenario interpreter, which controls interpreters of agents' action scenarios and the simulation environment. In addition, our proposed architecture does not lose scalability of massively multi-agent systems for some applications.","cites":"3","conferencePercentile":"51.91693291"},{"venue":"Winter Simulation Conference","id":"6edcae6d60f75dc24abe2d6878e558b077e43f15","venue_1":"Winter Simulation Conference","year":"2005","title":"A simulation model for facilitators of Tony Rizzo's bead game","authors":"David B. Roggenkamp, Dave Park, Omer Tsimhoni","author_ids":"2074037, 2923260, 1723297","abstract":"As the culmination of a simulation course at the University of Michigan, we simulated the physical structure and outcomes of Tony Rizzo's Bead Game. The game is a pedagogic tool to teach the effects of multitasking in a multiproject environment. During the game, time constraints limit the scope of the activity. Since the outcomes are fairly dramatic, many participants have a difficult time believing that the results they witnessed are truly representative of \"typical\" outcomes. The simulation model of the game was conceived as an opportunity to provide a more robust example of outcomes including the ability to demonstrate probabilistic distributions as well as potential extensions to the parameters of the game. In practice, the simulation model was effective in duplicating the observed game outcomes. Additionally, the model provides a starting point for potential further research in organizational throughput in a multi-project environment such as research or new product development.","cites":"3","conferencePercentile":"63.99521531"},{"venue":"Winter Simulation Conference","id":"f0411260fb0ff378e98c68465bf93b5e36e06b98","venue_1":"Winter Simulation Conference","year":"2005","title":"Integrating agent based modeling into a discrete event simulation","authors":"Benjamin Dubiel, Omer Tsimhoni","author_ids":"2460180, 1723297","abstract":"Movement of entities in discrete event simulation typically requires predefined paths with decision points that dictate entity movement. Human-like travel is difficult to model correctly with these constraints because that is not how people move and large individual differences exist in capabilities and strategies. Agent based modeling is considered a better way to simulate the real-time interaction of people with their environment. In this paper we propose to integrate agent based modeling with discrete event simulation to simulate the movement of people in a discrete event system. An agent based module was constructed within the AutoMod simulation package, and a test case was modeled in which people (agents) at a theme-park interact with objects and people in their environment to get directions and then walk or take a tram to their final destination. We explain the details of model implementation and describe the verification and initial validation of the model.","cites":"10","conferencePercentile":"88.99521531"},{"venue":"Winter Simulation Conference","id":"848d80bbf9e1001cd6011bd63e562b51da89d031","venue_1":"Winter Simulation Conference","year":"2014","title":"Integrating electric vehicles into smart grid infrastructures a simulation-based approach that became reality","authors":"Marco Lützenberger, Tobias Küster, Sahin Albayrak","author_ids":"2606118, 3133639, 1722170","abstract":"The development of software that controls real life processes can be highly difficult and error prone. In the case that the destination test-bed does not fully exist, the situation becomes significantly more challenging. We developed a control software for charging processes of an electric vehicle fleet in a smart grid architecture. To accelerate the development and to ease the integration process, we used an agent-based approach and embedded the optimization software within a simulation environment. Later we enhanced this simulation environment to a consultant tool which can be used to assess the impact of structural extensions. In this paper we present both, the optimization mechanism as well as the simulation environment.","cites":"1","conferencePercentile":"65.46242775"},{"venue":"Winter Simulation Conference","id":"36aceda64c84254177494e4dc8ebe448f3f7e2da","venue_1":"Winter Simulation Conference","year":"2003","title":"Emerging areas: urban operations and UCAVs: a game engine based simulation of the NIST urban search and rescue arenas","authors":"Jijun Wang, Michael Lewis, Jeffrey Gennari","author_ids":"2800786, 1740579, 2874938","abstract":"We are developing interactive simulations of the National Institute of Standards and Technology (NIST) Reference Test Facility for Autonomous Mobile Robots (Urban Search and Rescue). The NIST USAR Test Facility is a standardized disaster environment consisting of three scenarios of progressive difficulty: Yellow, Orange, and Red arenas. The USAR task focuses on robot behaviors, and physical interaction with standardized but disorderly rubble filled environments. The simulation will be used to test and evaluate designs for teleoperation interfaces and robot sensing and cooperation that will subsequently be incorporated into experimental robots. This paper describes our novel simulation approach using an inexpensive game engine to rapidly construct a visually and dynamically accurate simulation for both individual robots and robot teams.","cites":"31","conferencePercentile":"99.61832061"},{"venue":"Winter Simulation Conference","id":"4eaaa7cb4aab949ae8cbf8a1361321874ec1614d","venue_1":"Winter Simulation Conference","year":"2015","title":"Interactive visual analysis of large simulation ensembles","authors":"Kresimir Matkovic, Denis Gracanin, Mario Jelovic, Helwig Hauser","author_ids":"1715967, 1709677, 1916791, 1699740","abstract":"Recent advancements in simulation and computing make it possible to compute large simulation ensembles. A simulation ensemble consists of multiple simulation runs of the same model with different values of control parameters. In order to cope with ensemble data, a modern analysis methodology is necessary. In this paper, we present our experience with simulation ensemble exploration and steering by means of interactive visual analysis. We describe our long-term collaboration with fuel injection experts from the automotive industry. We present how interactive visual analysis can be used to gain a deep understanding in the ensemble data, and how it can be used, in a combination with automatic methods, to steer the ensemble creation, even for very complex systems. Very positive feedback from domain experts motivated us, a team of visualization and simulation experts, to present this research to the simulation community.","cites":"1","conferencePercentile":"82.72727273"},{"venue":"Winter Simulation Conference","id":"3d65e719f60ed89f9be6ea3ca474612465ba6ace","venue_1":"Winter Simulation Conference","year":"1996","title":"Parallel Simulation Environment for Mobile Wireless Networks","authors":"Winston W. Liu, Ching-Chuan Chiang, Eric Hsiao-Kuang Wu, Vikas Jha, Mario Gerla, Rajive L. Bagrodia","author_ids":"2467707, 1787360, 1700728, 7754462, 8467438, 1722527","abstract":"A parallel simulator has been designed for the evaluation of wireless, multihop, mobile networks. This paper describes the process of porting the simulator from a sequential to a parallel environment. Parallelization is critical in large radio networks, where the complexity of radio propagation models, channel access schemes and interference patterns makes sequential simulation very time consuming - in the order of several hours for 100 nodes experiments. With parallel execution, speedups of up to tenfold have been observed on a 16 processor SP/2, making large net work simulations viable.","cites":"26","conferencePercentile":"93.48958333"},{"venue":"Winter Simulation Conference","id":"149dcdc3071257ea3a009440c41879e71d4c3f6c","venue_1":"Winter Simulation Conference","year":"1995","title":"A Hierarchical Simulation Environment for Mobile Wireless Networks","authors":"Rajive L. Bagrodia, Mario Gerla, Leonard Kleinrock, Joel Short, Tzu-Chieh Tsai","author_ids":"1722527, 8467438, 1780414, 2262340, 3294091","abstract":"A hierarchical simulator has been designed for multimedia communication protocols in a wireless mobile environment. The hierarchical approach integrates performance evaluation of protocols with their implementation. The approach supports scalability studies of the protocols in an efficient manner using coarse grain models that abstract implementation details of the protocol and its execution environment by a few key parameters. Fine grain, low level models that capture implementation details are used for detailed evaluation of small networks and for automatic implementation on radio platforms. The design, evaluation, and implementation cycle is closed by feeding the measurements from the implementation back into the model to improve its accuracy. The paper describes the use of the environment in the evaluation and implementation of a cluster based multihop protocol for multimedia traffic.","cites":"17","conferencePercentile":"89"},{"venue":"Winter Simulation Conference","id":"1e4763338c7cfeb71b1597a33e43d1fea9075e8b","venue_1":"Winter Simulation Conference","year":"2012","title":"A framework for agent-oriented parallel simulation of discrete event systems","authors":"Tao Zhang, Oliver Rose","author_ids":"1743147, 1804920","abstract":"Event-oriented serial simulation is a major method for discrete event systems while real-time parallel simulation is used mainly in agent-based models. Combining the advantages of these two methods, an agent-oriented parallel simulation approach using process interaction worldview is proposed on the basis of an agent-based model. Activations and delays are conveyed in the form of messages between simulator and agents. The simulation clock advances in a sequence of activation points. All concurrent activations are sent to agents at a time and associated agents respond in parallel. A brief framework is developed by means of multi-threading and synchronization technology and applied to analyze a queuing system where the results show the validity of the proposed method.","cites":"0","conferencePercentile":"23.30097087"},{"venue":"Winter Simulation Conference","id":"0d1f163a803a7257a4feb57b616ce72fb99b3b0f","venue_1":"Winter Simulation Conference","year":"1995","title":"Simulation Modeling within Workflow Technology","authors":"John A. Miller, Amit P. Sheth, Krys J. Kochut, Xuzhong Wang, Arun Murugan","author_ids":"1791975, 1709950, 1685452, 1763509, 3334153","abstract":"This paper presents an approach for integrating simulation modeling and analysis capabilities within the workflow management system (WFMS) being developed in the Large Scale Distributed Information Systems (LSDIS) Lab at the University of Georgia. Simulation modeling can be used for studying the efficiency of workflow designs as well as studying the general performance and reliability of WFMSs. We also discuss the importance of using sophisticated monitoring and animation capabilities, and the use of workflow management technology to advance simulation technology itself. Finally, we demonstrate a sample simulation where tasks and task managers are simulated.","cites":"14","conferencePercentile":"88"},{"venue":"Winter Simulation Conference","id":"70a862db838737fd569f256add2d7c0c4bea52a9","venue_1":"Winter Simulation Conference","year":"2014","title":"Lifecycle evaluation of building sustainability using BIM and RTLS","authors":"Cheng Zhang, Jia Chen, Xiao Sun, Amin Hammad","author_ids":"3585347, 5562274, 1685943, 2453214","abstract":"The purpose of this research is to provide a lifecycle building sustainability evaluation method to guide different stakeholders in how to apply sustainable practices and maintain the expected sustainability. Building Information Modeling (BIM) is selected to be a platform to integrate all the information to improve interoperability. Green standards are embedded in the BIM model and a rule-based system is developed to automatically evaluate the design and the building performance. Data are collected by using a Real-Time Location System (RTLS) and are used to update the BIM model. The as-built model is checked to see if it matches the sustainability aspects regarding the construction processes. During operation, energy consumption data are collected and analyzed. The performance of the building is checked to see if the designed features reach the sustainability goals. By integrating the BIM, RTLS, and other information, a prototype system of lifecycle sustainability evaluation is developed and tested.","cites":"0","conferencePercentile":"27.4566474"},{"venue":"Winter Simulation Conference","id":"b30a334058bdbdf0c0230a3c89e54dec9e586a02","venue_1":"Winter Simulation Conference","year":"1992","title":"Requirements for a Repository-Based Simulation Environment","authors":"Tuncer Ören, Douglas G. King, Louis G. Birta, Martin Hitz","author_ids":"2064368, 1907715, 1736146, 1737056","abstract":"Simulation tools and environments can provide several types of computer assistance. It is envisaged that this functionality is going to increase. Even though this increase of functionality is highly desirable, it is anticipated that there will bean interface problem between the simulation tools and environments, similar to the interface problems in computer-aided software engineering (CASE) tools and environments. The problem is diagnosed and a solution is proposed.","cites":"2","conferencePercentile":"47.92899408"},{"venue":"Winter Simulation Conference","id":"4e359837f8bbd65f4438fbb038bf31378a23a92c","venue_1":"Winter Simulation Conference","year":"2001","title":"A crowd of little man computers: visual computer simulator teaching tools","authors":"William Yurcik, Hugh Osborne","author_ids":"1713112, 3062322","abstract":"This paper describes the use of a particular type of computer simulator as a tool for teaching computer architecture. The Little Man Computer (LMC) paradigm was developed by Stuart Madnick of MIT in the 1960s and has stood the test of time as a conceptual device that helps students understand the basics of how a computer works. With the success of the LMC paradigm, LMC simulators have also proliferated. We compare and contrast the current crowd of LMC simulators highlighting visual features. We found unexpected insights since despite starting with the same paradigm with the same goals, each implementation is distinct with different strengths and weaknesses. It is our intention that interested educators will find this a useful starting point or useful reference for incorporating simulation into their courses.","cites":"11","conferencePercentile":"88.42592593"},{"venue":"Winter Simulation Conference","id":"1a90bdec6c2d12e52efe4720a175ef61f93099eb","venue_1":"Winter Simulation Conference","year":"2005","title":"Reducing service time at a busy fast food restaurant on campus","authors":"Sara A. Curin, Jeremy S. Vosko, Eric W. Chan, Omer Tsimhoni","author_ids":"2224937, 2924911, 1881800, 1723297","abstract":"As part of an undergraduate engineering class project, a Tim Hortons restaurant on the University of Michigan campus was simulated to improve its efficiency. Using the standard simulation study steps, several service scenarios were modeled and evaluated based on customer system time. A detailed analysis of the simulation revealed that, in the current setup, the utilization of the cash registers is high (88%); consequently, several scenarios that decrease the load on the cash registers were explored. To reduce customer wait times and, therefore, serve more customers per hour, it is recommended that Tim Hortons operate with five servers. A five-person setup with three cashiers, a soup server, and a sandwich server could reduce customer system time by over two minutes per customer. As an alternative, transferring all food preparation to the secondary service location and adding a dual-purpose server could reduce customer system time by over one half.","cites":"5","conferencePercentile":"74.88038278"},{"venue":"Winter Simulation Conference","id":"ba74fe7248ae5fbd060501ef02e9b1e5f1276bb5","venue_1":"Winter Simulation Conference","year":"1995","title":"Panel Discussion on the Role of Modeling and Simulation in Business Process Reengineering","authors":"Anthony Levas","author_ids":"3250836","abstract":"Modeling and simulation are important technologies that can be applied to business process reengineering (BPR). Dynamic process models afford the analysis of alternative process scenarios through simulation by providing quantitative process metrics such as cost, cycle time, serviceability and resource utilization. These metrics form the basis for evaluating alternatives and selecting the most promising scenario for implementation. Tradeoffs can be made on the basis of measurements as opposed to intuition, resulting in more informed business decisions. The paper summarizes the ideas to be presented in a panel discussion session on the role of modeling and simulation in business process reengineering. Each panelist represents a different perspective: 1) a theoretical view, 2) a BPR practitioner's view and 3) a software system view. The objective of this session is to highlight key issues in modeling and simulation of business processes from each of these perspectives and to motivate research and tool development in this area.","cites":"7","conferencePercentile":"68"},{"venue":"Winter Simulation Conference","id":"0cdd61a4783d36250750814b2e03b9d875334ee7","venue_1":"Winter Simulation Conference","year":"2007","title":"A hybrid inventory control system approach applied to the food industry","authors":"David Claudio, Jie Zhang, Ying Zhang","author_ids":"1741885, 1698586, 1752812","abstract":"The appropriate production and inventory control policy is a key factor for modern enterprises' success in competitive environment. In the food industry, most of food manufacturers adopt the make-to-order policy to improve their punctuality and flexibility, while some scholars provided other different opinions. This study provides a hybrid policy combining a make-to-order push strategy with priority with a make-to-stock pull strategy. In this policy, the pull strategy is considered for the regular demands while customers who tell their demand needs in advance are treated with a push strategy and are given a higher priority than those who don't share information. Through a set of simulation experiments by AutoMod model, this policy is proved to be of great efficiency, effectiveness and applicability.","cites":"0","conferencePercentile":"13.93939394"},{"venue":"Winter Simulation Conference","id":"0864c6ed3b6cb84faeda6342888846eca7839b6f","venue_1":"Winter Simulation Conference","year":"2002","title":"XML-based modeling and simulation: web service technologies and their synergy with simulation","authors":"Senthilanand Chandrasekaran, Gregory A. Silver, John A. Miller, Jorge S. Cardoso, Amit P. Sheth","author_ids":"2616103, 3253678, 1791975, 1736432, 1709950","abstract":"The World Wide Web has had an huge influence on the computing field in general as well as simulation in particular (&#60;i>e.g.&#60;/i>, Web-Based Simulation). A new wave of development based upon XML has started. Two of the most interesting aspects of this development are the Semantic Web and Web Services. This paper examines the synergy between Web service technology and simulation. In one direction, Web service processes can be simulated for the purpose of correcting/improving the design. In the other direction, simulation models/components can be built out of Web services. Work on seamlessly using simulation as a part of Web service composition and process design, as well as on using Web services to re-build the JSIM Web-based simulation environment is highlighted.","cites":"11","conferencePercentile":"94.96402878"},{"venue":"Winter Simulation Conference","id":"7807fd8885dc4d208e0d06efc6b496c5b12d8fa8","venue_1":"Winter Simulation Conference","year":"1994","title":"Analyzing and re-engineering business processes using simulation","authors":"R. Bhaskar, Ho Soo Lee, Anthony Levas, Raja Pétrakian, Flora Tsai, Bill Tulskie","author_ids":"2060073, 2751847, 3250836, 2668482, 2273965, 3123167","abstract":"Increasingly, companies around the world are re-engineering their core business processes to be more profitable and to improve customer satisfaction. Model-ing and analysis are two critical steps in any process ~design effort. In this paper, we discuss the need for simulation tools that can be used effectively to model, document , and analyze business processes. We also present the design of such a hierarchical simulation tool called BPMAT and discuss its implementation.","cites":"13","conferencePercentile":"86.12565445"},{"venue":"Winter Simulation Conference","id":"b5f9c9af1a8908c9c53b5517b8c6c9b216c9d908","venue_1":"Winter Simulation Conference","year":"2015","title":"A bim-based educational gaming prototype for undergraduate research and education in design for sustainable aging","authors":"Wei Wu, Ishan Kaushik","author_ids":"2581478, 2247482","abstract":"This paper discusses an educational gaming prototype developed with building information modeling (BIM) inputs that aims to facilitate undergraduate education and research in the subject of design for sustainable aging. Motivated by the steadily growing market demands for senior housing in conjunction of academic goals in graphical communication and building codes education, experiments have been conducted in an undergraduate construction management curriculum seeking for innovative pedagogical approaches. The integration of BIM and game engine creates a meaningful learning environment and research framework that features with enriched visualization and interaction wherein students can explore design criteria and code compliance requirements of senior-friendly housing design via task-driven gaming simulation. This paper introduces the theoretic framework, the design approach, and the developed prototype with use case demonstrations. Initial assessment and user feedback are discussed for further improvement on the developed prototype.","cites":"0","conferencePercentile":"37.01298701"},{"venue":"Winter Simulation Conference","id":"68d8b23f238a3deb1c59f5a53388dfabab71b88d","venue_1":"Winter Simulation Conference","year":"2015","title":"Building crowd movement model using sample-based mobility survey","authors":"Larry Lin, Shih-Fen Cheng, Hoong Chuin Lau","author_ids":"2657785, 2089330, 1809379","abstract":"Crowd simulation is a well-studied topic, yet it usually focuses on visualization. In this paper, we study a special class of crowd simulation, where individual agents have diverse backgrounds, ad hoc objectives, and non-repeating visits. Such crowd simulation is particularly useful when modeling human agents movement in leisure settings such as visiting museums or theme parks. In these settings, we are interested in accurately estimating aggregate crowd-related movement statistics. As comprehensive monitoring is usually not feasible for a large crowd, we propose to conduct mobility surveys on only a small group of sampled individuals. We demonstrate via simulation that we can effectively predict agents' aggregate behaviors, even when the agent types are uncertain, and the sampling rate is as low as 1%. Our findings concur with prior studies in urban transportation, and show that sampled-based mobility survey would be a promising approach for improving the accuracy of crowd simulations.","cites":"0","conferencePercentile":"37.01298701"},{"venue":"Winter Simulation Conference","id":"80690cc483de2cd6553362dc4821b7b4c2362e8f","venue_1":"Winter Simulation Conference","year":"2008","title":"Optimized maintenance design for manufacturing performance improvement using simulation","authors":"Ahad Ali, Xiaohui Chen, Zimin Yang, Jay Lee, Jun Ni","author_ids":"1952927, 2184658, 1844671, 4333318, 8564371","abstract":"This research presents optimized maintenance design using simulation to analyze the capability of auto part manufacturing production system. The integration of simulation and optimization is used to identify critical stations, an optimal system design and maintenance scheduling schemes and evaluates their effects on the overall system performance. Most emphasis is focused on the impact on system by individual station reliability and the fluctuation of maintenance availability. The proposed simulation and optimization for maintenance design is validated through real-life application. This simulation modeling and optimization could help for manufacturing performance improvement.","cites":"5","conferencePercentile":"79.45026178"},{"venue":"Winter Simulation Conference","id":"238391ef24e50e9d65f12b85acce46eb900e5c0c","venue_1":"Winter Simulation Conference","year":"2006","title":"Challenges for modeling and simulation methods in systems biology","authors":"Herbert M. Sauro, David Harel, Marta Z. Kwiatkowska, Clifford A. Shaffer, Adelinde M. Uhrmacher, Michael Hucka, Pedro Mendes, Lena Strömbäck, John J. Tyson","author_ids":"1700921, 1725726, 1701316, 1758750, 1743841, 2406512, 1713498, 3232115, 1794360","abstract":"Systems Biology is aimed at analyzing the behavior and interrelationships of biological systems and is characterized by combining experimentation, theory, and computation. Dedicated to exploring current challenges, the panel brings together people from a variety of disciplines whose perspectives illuminate diverse facets of Systems Biology and the challenges for modeling and simulation methods.","cites":"14","conferencePercentile":"91.69329073"},{"venue":"Winter Simulation Conference","id":"1142e89eb6746d2bc30d828571fdac7be72a058d","venue_1":"Winter Simulation Conference","year":"1997","title":"Java Based Conservative Distributed Simulation","authors":"Alois Ferscha, Michael Richter","author_ids":"1745790, 2208496","abstract":"Distributed discrete event simulation techniques aim at an acceleration of the execution of a self-contained simulation model by the spatial decomposition of that model and the concurrent simulation of the submod-els by so called logical processes (LPs), each executing on a dedicated node of a (closed) multiprocessor system. The dedication of parallel simulators to specific platforms and their adaptation to the respective hardware and software intrinsics has widely preven-tend an industrial and/or commercial success of such high performance simulation methods. In this work we propose the building of logical prdcess simulators that use the World Wide Web as an execution platform. We have developed and implemented a Java-based simulation engine along the conservative Chandy/Misra/Bryant (CMB) synchronization protocol, allowing for a platform independent , scalable, and performance efficient distributed simulation model execution. Our simulation engine is open and general purpose in the sense that it can be reused in various simulation domains by simply \" plugging in \" different simulation models, and simulation codes that, once written, can be executed anywhere (on the Internet). The potential performance improvement of Web-based distributed simulation is investigated in a sensitivity analysis conducted on a hypothetical simulation model executed in a Java-enabled workstation LAN. Even for very small simulation models, a speedup of about 3.5 could be attained on a 4 processor (heterogeneous) host LAN.","cites":"9","conferencePercentile":"73.92473118"},{"venue":"Winter Simulation Conference","id":"ddeda9b7cf8b0bb567199bb80f8609d9c3ec9954","venue_1":"Winter Simulation Conference","year":"2002","title":"Parallel and distributed systems: simulation analysis of RLC timers in UMTS systems","authors":"Xiao Xu, Yi-Chiun Chen, Hua Xu, Eren Gonen, Peijuan Liu","author_ids":"1993318, 2088154, 1718800, 3059837, 1944083","abstract":"Radio Link Control (RLC) is the layer two protocol used in 3G UMTS cellular systems for flow control and error recovery. Due to the complexity of the protocol and the multitude of parameter configurations available, it is extremely difficult to model RLC analytically. Therefore we present a simulation model to study RLC performance in UMTS systems. We focus on the impacts of the poll prohibit timer and the poll timer on RLC throughput, goodput and delay. Our simulation results provide some insight into the optimization of these two timer values.","cites":"3","conferencePercentile":"72.12230216"},{"venue":"Winter Simulation Conference","id":"bd4e083e714c4cfad58a2a12e4a672ed7cc582f1","venue_1":"Winter Simulation Conference","year":"2012","title":"Application of simulation-based decision support systems to optimization of construction corporation processes","authors":"Konstantin A. Aksyonov, Eugene A. Bykov, Kai Wang, Olga Aksyonova","author_ids":"2511947, 2994145, 3751236, 2559206","abstract":"The poster focuses on development and application of a decision support system BPsim.DSS, which greatly simplifies analysts work and allows them make their job more efficiently and allows prediction of consequences of taken decisions. The poster gives an example of the system deployment in production environment, a construction company and presents achieved results.","cites":"0","conferencePercentile":"23.30097087"},{"venue":"Winter Simulation Conference","id":"b81af14f447bf1e1c1e4ef1aabd56d8f770b5d29","venue_1":"Winter Simulation Conference","year":"2001","title":"A capacity planning tool for the tuxedo middleware used in transaction processing systems","authors":"Tayfur Altiok, Wei Xiong, Mesut Gunduc","author_ids":"2379625, 6737623, 3097622","abstract":"In this paper, we present a brief overview of Tuxedo middleware system (BEA Systems) and introduce an object-oriented computer simulation template developed for the purpose of capacity planning and performance analysis of Tuxedo application environments. Arena/Siman (Rockwell Software) simulation software is chosen and a <i>CP_Tool</i> template specific to Tuxedo environment is developed. The template consists of a number of modules representing client and server nodes, network nodes and other critical components of the system. Any Tuxedo environment can be created using the modules from the <i>CP_Tool.</i> The paper discusses the tool and its capabilities.","cites":"5","conferencePercentile":"69.90740741"},{"venue":"Winter Simulation Conference","id":"02d00d1b8f7c76e4a21fd7001f169b64e565bfb4","venue_1":"Winter Simulation Conference","year":"2013","title":"Learning-based adaptive dispatching method for batch processing machines","authors":"Long Chen, Hui Xu, Li Li, Lu Chen","author_ids":"1737625, 1712085, 1682059, 1745299","abstract":"This study aims to solve the scheduling problem of batch processing machines (BPMs) in semiconductor manufacturing by using a learning-based adaptive dispatching method (LBADM). First, an adaptive ant system algorithm (AAS) is proposed to solve the scheduling problem of BPMs according to their characteristics. Then AAS generates a lot of solutions for the jobs with different distribution of arrival time and due date. These solutions are taken as learning samples. Second, we analyze influencing factors by sample learning method from those solutions. With the help of linear regression, the coefficients of influencing factors can be calculated to build a dynamic dispatching rule adaptive to running environments. Finally, simulation results based on a Minifab model show that the proposed method is better than traditional ways (such as FIFO and EDD with maximum batchsize) with lower makespan and weighted tardiness.","cites":"0","conferencePercentile":"23.82352941"},{"venue":"Winter Simulation Conference","id":"340e6f88e8984191ee3e616fba4f9f50aeb807ee","venue_1":"Winter Simulation Conference","year":"2004","title":"A Near Optimal Approach to Quality of Service Data Replication Scheduling","authors":"Kevin Adams, Denis Gracanin, Dusan Teodorovic","author_ids":"2874936, 1709677, 1800534","abstract":"This paper describes an approach to real-time decision-making for quality of service based scheduling of distributed asynchronous data replication. The proposed approach addresses uncertainty and variability in the quantity of data to replicate over low bandwidth fixed communication links. A dynamic stochastic knapsack is used to model the acceptance policy with dynamic programming optimization employed to perform offline optimization. The obtained optimal values of the input variables are used to build and train a multi-layer neural network. The obtained neural network weights and configuration can be used to perform near optimal accept/reject decisions in real-time. Off-line processing is used to establish the initial acceptance policy and to verify that the system continues to perform near-optimally. The proposed approach is implemented via simulation enabling the evaluation of a variety of scenarios and refinement of the scheduling portion of the model. The preliminary results are very promising.","cites":"1","conferencePercentile":"31.68316832"},{"venue":"Winter Simulation Conference","id":"0bc85c552c0ba5edb39ef52ed0d64c273ce000ca","venue_1":"Winter Simulation Conference","year":"1995","title":"Simulation-Based Real-Time Decision Making for Route Planning","authors":"Jin Joo Lee, Paul A. Fishwick","author_ids":"2689649, 1734138","abstract":"Decision making is an active area of research in simulation, systems engineering and artificial intelligence. One subset area of decision making, automated route planning, is covered with our approach being based on the technique of simulation rather than on purely heuristic or geometric techniques. This new technique is called simulation-based planning. Simulation-based planning is useful for route planning under various conditions including uncertain locations and events with potential adversarial activity. We claim that it is only by using simulation that one can make the most effective plan in uncertain and complex environments. An experimental design is outlined along with our plans for further development.","cites":"2","conferencePercentile":"40.75"},{"venue":"Winter Simulation Conference","id":"6679c692589724dd688a80896d84c42debddc0ee","venue_1":"Winter Simulation Conference","year":"2009","title":"Agent-based Modeling for Household Level Hurricane Evacuation","authors":"Bo Zhang, Satish V. Ukkusuri, Wai Kin Chan","author_ids":"1696318, 6874623, 2135975","abstract":"In this paper, we present an agent-based model for hurricane evacuation which captures the interactions among evacuees during the evacuation process. Both normal and greedy household agents are considered. The normal agents simply follow the shortest route toward their destinations regardless of the congestion on each route segment. The greedy agents on the other hand make choices between the shortest route and the least congested route according to a certain probabilistic rule, taking into account the evolving network conditions. In the experiments, we simulate different scenarios on a test network and present the results and analysis. The simulation results indicate that greedy agents can sometimes reduce the individual evacuation times by detouring and avoiding congestions, but the greedy behavior makes the whole evacuation inefficient.","cites":"8","conferencePercentile":"87.80918728"},{"venue":"Winter Simulation Conference","id":"0625404cc29a513f759973909292692541119571","venue_1":"Winter Simulation Conference","year":"1997","title":"Simulation-based Planning for Multi-Agent Environments","authors":"Jin Joo Lee, Paul A. Fishwick","author_ids":"2689649, 1734138","abstract":"One of the key issues in reasoning with multiple interacting intelligent agents is how to model and code the decision making process of the agents. In Artificial Intelligence (AI), the major focus has been on modeling individual intelligence and a common ap preach has been to use operator or rule-based models to represent the decision making intelligence of an agent. If the purpose of the simulation is to precisely emulate a particular agent's intelligence, then such rule-based models may often be most appropriate. However, when the goal is to win the engagement in the battlefield, where the overall outcome may depend on individual execution of each task, the level of detail must be extended to the level of simulating individual task execution. In these cases, we have created a methodology, Simulation-Based Planning (SBP), that embeds one simulation inside another. The embedded simulation simulates the actions of agents before committing to a plan so that it may evaluate the desiredness of the actions. Plan alternatives are generated based on discrete paths through spatial regions of a domain, while specific optimal plans are generated through the use of experimental design and simulation. We have found that, through simulation-based planning, near-optimal plans can be selected by using simulation, in addition to using simulation once a plan has been adopted.","cites":"3","conferencePercentile":"39.51612903"},{"venue":"Winter Simulation Conference","id":"5de802fb1c6c8761a5eb617a52bb25f2dead9934","venue_1":"Winter Simulation Conference","year":"2012","title":"Modeling social groups in crowds using common ground theory","authors":"Seung In Park, Francis K. H. Quek, Yong Cao","author_ids":"1938434, 1740663, 4610410","abstract":"Social interaction and group coordination are important factors in the simulation of human crowd behavior. To date, few simulation methods have been informed by models of human group behavior from the social science studies. In this paper we advance a computational model informed by Common Ground (CG) Theory that both inherits the social realism provided by the CG model and is computationally tractable for a large number of groups and individuals. The task of navigation in a group is viewed as performing a joint activity among agents, which requires effective coordination among group members. Our model includes both macro and micro coordination, addressing the joint plans, and the actions for coordination respectively. These coordination activities and plans inform the high-level route and walking strategies of the agents. We demonstrate a series of studies to show the qualitative and quantitative differences in simulation results with and without incorporation of the CG model.","cites":"5","conferencePercentile":"92.7184466"},{"venue":"Winter Simulation Conference","id":"0130aec56b084cd9cb751e6fa8e53632a0e60035","venue_1":"Winter Simulation Conference","year":"2008","title":"A recursion-based approach to simulating airline schedule robustness","authors":"Marcial Lapp, Shervin AhmadBeygi, Amy Mainville Cohn, Omer Tsimhoni","author_ids":"3309002, 1854511, 3257709, 1723297","abstract":"Flight disruptions due to events such as inclement weather or mechanical failure are an increasing occurrence in today's air travel. It is important to develop flight schedules that are not only economically feasible, but also provide opportunities to absorb these disruptions so as to reduce downstream delays. In this paper, we present a simulation algorithm to evaluate a flight schedule's ability to mitigate disruptions by analyzing propagation effects on the flight network. This task is challenging for two reasons: the interdependence of flights, due to shared resources (e.g. cockpit/flight crews, aircraft), and the cyclic nature of the schedule, which repeats on a daily basis. We show how a recursion-based approach to the simulation enables us to overcome these challenges.","cites":"1","conferencePercentile":"39.26701571"},{"venue":"Winter Simulation Conference","id":"59ae9a32d98b11c770f3e5c93658055d4c7acca1","venue_1":"Winter Simulation Conference","year":"2011","title":"Adaptive probabilistic branch and bound for level set approximation","authors":"Zelda B. Zabinsky, Wei Wang, Yanto Prasetio, Archis Ghate, Joyce W. Yen","author_ids":"3149686, 1706612, 2014412, 1761927, 2499634","abstract":"We present a probabilistic branch-and-bound (PBnB) method for locating a subset of the feasible region that contains solutions in a level set achieving a user-specified quantile. PBnB is designed for optimizing noisy (and deterministic) functions over continuous or finite domains, and provides more information than a single incumbent solution. It uses an order statistics based analysis to guide the branching and pruning procedures for a balanced allocation of computational effort. The statistical analysis also prescribes both the number of points to be sampled within a sub-region and the number of replications needed to estimate the true function value at each sample point. When the algorithm terminates, it returns a concentrated sub-region of solutions with a probability bound on their optimality gap and an estimate of the global optimal solution as a by-product. Numerical experiments on benchmark problems are presented.","cites":"3","conferencePercentile":"74.66666667"},{"venue":"Winter Simulation Conference","id":"5921d192a2d5c91abe625582f1e6126dbbe95086","venue_1":"Winter Simulation Conference","year":"2011","title":"Agent-based discrete-event hybrid space modeling approach for transportation evacuation simulation","authors":"Bo Zhang, Wai Kin Chan, Satish V. Ukkusuri","author_ids":"1696318, 2135975, 6874623","abstract":"This paper presents an agent-based discrete-event simulation (AB-DES) modeling approach for transportation evacuation simulation based on a hybrid continuous and cell space. This approach combines advantages of agent-based simulation and discrete-event simulation to allow flexibilities in simulating evacuation scenarios. Its hybrid space of the simulation environment overcomes the limitation of cellular space in cell-based evacuation models. We construct the model by using the Parallel DEVS formalism and develop algorithms for the corresponding DEVS simulators. This modeling approach achieves efficient event-based scheduling by executing only necessary agent interactions. Therefore, this approach has a low computational costs and high degree of scalability compared with traditional approaches.","cites":"9","conferencePercentile":"96.26666667"},{"venue":"Winter Simulation Conference","id":"067bc28f8312801d84b0ae6696829347a32f428e","venue_1":"Winter Simulation Conference","year":"2016","title":"Using model-based simulation for augmenting Incident Command System for disaster response","authors":"David Wood, Meena Nagarajan, Alexandra Opp, Subhashini Ganapathy, Michelle Cheatham, John Gallagher, Jim Gruenberg, Jack Smith","author_ids":"7862519, 3041479, , 1793624, 3298045, 3518337, , 2434940","abstract":"The National Incident Management System has become the dominant organizational model for the management of emergency and disaster response and recovery operations. The Incident Command System (ICS) provides reporting and operational templates that structure activities and the management of resources and communications during an incident or event. In an emergency situation, information can be sometimes contradictory and may not be \" clean \". In order for Command Officers to maintain good situation awareness of these dynamic situations, the system should be able to adapt by taking into account the type of information available, the specific task at hand, and knowledge derived from the information integration agent. This paper presents a design of ICS model and discusses the simulation architecture to support ICS commanders to potentially minimize cognitive load on decision makers, exploit semantic relationships in reports and sensor data to advice of invisible occurrences to better reflect ongoing developments during crisis management. 1 INTRODUCTION The National Incident Management System (NIMS) and the Incident Command System (ICS) possess strengths in unified command, common terminology, modular organization, management by objective, and hard limits on span-of-control, defined as the number of resources managed by any one individual. In addition to other organizational benefits, its limiting span-of-control protects decision makers and responders from cognitive overload and associated mental fatigue. Overtaxed decision makers are poor decision makers. Therefore, protections from cognitive overload are important in preventing hazards from","cites":"0","conferencePercentile":"48.34834835"},{"venue":"Winter Simulation Conference","id":"99d6bfbbdff9f15a9467025c725cef8d3465625b","venue_1":"Winter Simulation Conference","year":"2016","title":"Analysis of future UAS-based delivery","authors":"Mariusz A. Balaban, Thomas W. Mastaglio, Christopher J. Lynch","author_ids":", 1894065, 1760421","abstract":"Commercial use of Unmanned Aerial System (UAS) has the potential to reshape the delivery market and to open new business opportunities to small businesses, e.g. can examine the value added to current business operations, the effects of radical shifts in current operations, and the formation of new types of businesses. This paper presents an envisioned future UAS delivery business operation models and develops a theoretical constructive simulation model. The conducted simulation analysis based on full factorial design estimated causalities between multiple independent and dependent business and policy factors e.g. drone velocity, flying altitude, number of drones, delivery demand, route type, maximum drone fly-time, number of orders completed, time average drone density, order time, drone utilization, and reachability of customers. 1 INTRODUCTION Although military is traditionally a major user of UASs (Blyenburgh 1999), commercial applications of UASs are clearly on the move. Small commercial drones are used to create marketing videos, capture news, develop movies, support agriculture, and in hobby activities e.g. racing. Teal Group calculated the 2015 UAS market at 72% military, 23% consumer, and 5% civil cumulative for the decade (Teal 2015). Of the three areas, civil UASs will grow most rapidly over the forecast period, but it grows from a very low base. Unmanned Aerial Vehicle (UAV) production will soar from current worldwide UAS production of $4 billion annually to $14 billion, totaling $93 billion in the next ten years. Note that in this paper words \" drone \" , \" UAS \" , and \" UAV \" are used as synonyms. Finnegan said that \" UAVs are no longer of interest only to aerospace companies, but increasingly technology companies like Google, Facebook and Amazon see a need to be in the market \" (Teal 2015). The drone industry is expected to climb to a $8.4 billion by 2019 (ABI 2015). \" Application services, data services, licensing and legal services \" are expected to fuel this climb, according to Dan Kara, an ABI Research Director, at the RoboUniverse Conference in New York (Kara 2015). In the future, commercial UASs have the potential to open new opportunities to small businesses, It is likely that UASs will enable both, the option for a direct delivery service offered by a business to their customers as well as the use of UASs in a business to business (B2B) model. In both cases services may be related to delivery of goods, inspections, and …","cites":"1","conferencePercentile":"97.8978979"},{"venue":"Winter Simulation Conference","id":"1df6c835327aa2cbf5918d5d0f5b79ed36bca098","venue_1":"Winter Simulation Conference","year":"2011","title":"Optimizing local pickup and delivery with uncertain loads","authors":"Weiwei Chen, Jie Song, Leyuan Shi","author_ids":"1689131, 1719329, 2474894","abstract":"The local pickup and delivery problem (LPDP) is an essential operational problem in intermodal industry. While the problem with deterministic settings is already difficult to solve, in reality, there exist a set of loads, called uncertain loads, which are unknown at the beginning of the day. But customers may call in during the day to materialize these loads. In this paper, we call the LPDP considering these uncertain loads as the stochastic LPDP. The problem description and the mathematical modeling of stochastic LPDP are discussed. Then, a simulation-based optimization approach is proposed to solve the problem, which features in a fast solution generation procedure and an intelligent simulation budget allocation framework. The numerical examples show the best strategy to consider the stochastic loads in the planning process and validate the benefits compared to its deterministic counterpart.","cites":"1","conferencePercentile":"46"},{"venue":"Winter Simulation Conference","id":"78cbc00fcca00d1f5fbd50f9abceb872e4b3912d","venue_1":"Winter Simulation Conference","year":"2000","title":"DoD initiatives in distributed simulation technology: a panel discussion","authors":"Phillip Barry, Philomena M. Zimmerman, Jim Metzger, Fred Hartman, Cindy Porubcansky, Joseph S. Stewart","author_ids":"3271267, 3174588, 3180518, 2698771, 2644543, 7406621","abstract":"Panelists respond to three questions, \"How does your DoD initiative promise to increase readiness for the fighting forces?\", \"Where will the distributed simulation technology in your program take us by 2005?\" and \"What changes in available DoD infrastructure would facilitate the use of the system(s) emerging from your program?\" The panelists include senior members of the Department of Defense civilian management team working in the Modeling and Simulation field.","cites":"1","conferencePercentile":"37.45454545"},{"venue":"Winter Simulation Conference","id":"01db6ec9f33914b442898167065533d6d62f6dfc","venue_1":"Winter Simulation Conference","year":"2011","title":"Developing a web-enabled HLA federate based on portico RTI","authors":"Zhiying Tu, Gregory Zacharewicz, David Chen","author_ids":"3292633, 1678479, 3698743","abstract":"This paper presents an approach to implement distributed simulation software to test, validate and improve information exchange between enterprises. The approach assumes some of the recently released HLA Evolved standard web service requirements. The implementation is based on improving the open source poRTIco HLA RTI tool. The paper mainly focuses on the presentation of the HLA web-enabled federate proposed to fulfill the web service needs of the brand new HLA 1516-2010 standard. The idea is that a federate is being connected to an HLA federation based on previous HLA standards version (1516-2000 or 1.3) and, in parallel, to other federates outside the LAN federation via the WAN. This approach intends to improve federate components interoperability and agility in a heterogeneous, distributed and dynamic context. To achieve that goal, time management mechanisms have been developed. The concept is validated through distributed simulation of a car selling enterprise modeling test case.","cites":"3","conferencePercentile":"74.66666667"},{"venue":"Winter Simulation Conference","id":"99fb634c6ac59db7baf4938dffc24f447e225f61","venue_1":"Winter Simulation Conference","year":"2014","title":"Variability based surgical scheduling: a simulation approach","authors":"Jamie Schultz, David Claudio","author_ids":"3126364, 1741885","abstract":"Variability in the duration of surgical procedures is one cause of delayed start times for scheduled procedures in operating theaters. While historical procedure durations are frequently used in assigning surgery times to schedule surgery blocks, taking into account the level of variability associated with specific procedures is not commonly utilized in creating surgery schedules in a multiple room operating suite. This article proposes a new methodology for surgical scheduling which sequences procedures based on duration groups and their level of variability. Discrete event simulation was used to model and validate the ratio of delayed starts versus on-time starts due to incorrectly estimated procedure length using a hospital's current scheduling algorithm and historical data. A statistical analysis was used to compare the proposed methodology against the current scenario to determine if delayed starts can be reduced by sequencing procedures based on duration variability.","cites":"1","conferencePercentile":"65.46242775"},{"venue":"Winter Simulation Conference","id":"72e3f9e615f051a2e4b1b8c5d67a97e8f8c09d24","venue_1":"Winter Simulation Conference","year":"2011","title":"Discrete optimization via approximate annealing adaptive search with stochastic averaging","authors":"Jiaqiao Hu, Chen Wang","author_ids":"2626116, 1710899","abstract":"We propose a random search algorithm for black-box optimization with discrete decision variables. The algorithm is based on the recently introduced Model-based Annealing Random Search (MARS) for global optimization, which samples candidate solutions from a sequence of iteratively focusing distribution functions over the solution space. In contrast with MARS, which requires a sample size (number of candidate solutions) that grows at least polynomially with the number of iterations for convergence, our approach employs a stochastic averaging idea and uses only a small constant number of candidate solutions per iteration. We establish global convergence of the proposed algorithm and provide numerical examples to illustrate its performance.","cites":"1","conferencePercentile":"46"},{"venue":"Winter Simulation Conference","id":"93a8c52b7b66b74f99821731f6cbd8b302ef5a1c","venue_1":"Winter Simulation Conference","year":"2008","title":"Experience in the broadening of a single-purpose simulation model","authors":"Reid L. Kress, Pete Bereolos, Karen Bills, James Clinton, Jack Dixon, Phil Dunn, Julie Moore, Rob Wilson","author_ids":"8660334, 1970052, 2773050, 3067558, 2216205, 1917917, 2363078, 2283355","abstract":"Simulation models are often developed for a single purpose. However, once a model is accepted by management and other stake-holders, it is quite common and desirable to wish to broaden the application of the model to several areas. This is not always a straight-forward evolution because a model designed to evaluate one performance measure may not be well-suited for others. This paper summarizes the experience of the Y-12 National Security Complex's simulation modeling group in broadening its equipment-scoping simulation model into a model that could examine plant mass balance, model internal products including complex feedback loops, include chemical sampling and analysis, evaluate in-process storage, and perform basic scheduling analyses. Results of the effort were successful and the paper concludes that single-purpose-model broadening can be achieved with the correct mix of planning and execution.","cites":"0","conferencePercentile":"15.57591623"},{"venue":"Winter Simulation Conference","id":"e7ba62b6781a755356fccdf887f2d751898ad165","venue_1":"Winter Simulation Conference","year":"2016","title":"Impact of time bound constraints and batching on metallization in an opto-semiconductor fab","authors":"Falk Stefan Pappert, Tao Zhang, Oliver Rose, Fabian Suhrke, Jonas Mager, Thomas Frey","author_ids":"2949223, 1743147, 1804920, , , 1867192","abstract":"Time bound sequences are constraints deemed necessary to ensure product quality and avoid yield loss due to time dependent effects. Although they are commonly applied in production system control they cause severe logistical challenges. In this paper, we evaluate the effects of time constraints in combination with batching on a real metallization work center of an opto-semiconductor fab. We use simulation to analyze the impact of these production constraints and point out potentials to increase work center performance. We have a closer look at the required planning horizon, the influence of dedication, the capacity loss due to time bounds and the effects of batching strategies on wafer cost. Our results show the importance to tackle these issues. Furthermore, we will discuss actions taken in response to the experiments. 1 INTRODUCTION Time bound sequences are a common constraint in semiconductor manufacturing. These constraints represent time bounds in which a number of succeeding process steps should be performed. Violating these constraints usually necessitates rework or, even worse, the scrapping of the affected wafers. The reason for these constraints is usually to keep particle contamination and surface reactions to a level where it does not influence the process quality. To avoid violating these time bounds effective dispatching or scheduling is used to keep them to a statistical minimum. The effect on the system is usually that some lots, batches or wafers are on hold until sufficient resources are available to ensure that they can be processed before the time runs out. While trying to ensure non-violation release strategies we basically trade equipment utilization for cycle time. There are several approaches in literature to tackle this issue. Robinson (1998) and Robinson and Giglio (1999) presented a basic approach to capacity planning with time bound constraints and calculations to estimate time bound violations. Scholl and Domaschke (2010) proposed a Kanban-type approach where tool capacity is limited directly. Klemmt and Mönch (2012) proposed a heuristic and an MIP based approach of scheduling lots in a time bound sequence. In general, there is always some loss of capacity to ensure as few as possible violations. In this paper, we want to present a first study of a coating work center and its time bound sequences to evaluate the impact of different logistical characteristics on the system. The system at hand is a group of batch coating equipment with a number of tools supporting preprocessing and handling steps. …","cites":"1","conferencePercentile":"97.8978979"},{"venue":"Winter Simulation Conference","id":"59a9c0f1764c2ac0a9b173fd99bced08408555d0","venue_1":"Winter Simulation Conference","year":"2011","title":"Simulation-based assessment of change propagation effect in an aircraft design process","authors":"Dong Xu, Sai Srinivas Nageshwaraniyer, Young-Jun Son, Shuguang Song","author_ids":"1714390, 2655013, 3644385, 2201444","abstract":"In the current work, a simulation-based approach is proposed to assess the change propagation effect in an aircraft design process. To this end, three extensions are made to the conventional approach using design structure matrix to model change propagation effect. They are: 1) logistics factor associated with the component supplies of aircraft; 2) manufacturing system flexibility factor; 3) uncertainty in design change parameters. Then the effects of change propagation are simulated using a discrete-event simulation model in Arena involving detailed design process of totally eight components of a real aircraft. Finally, what-if analyses are performed by varying logistics and flexibility factors under uncertainty in design change parameters to assess the change propagation effect. An optimization problem is also solved using OptQuest to determine the change propagation path that minimizes the total risk of design change. Future work is discussed for extending the proposed approach to other related areas.","cites":"0","conferencePercentile":"17.46666667"},{"venue":"Winter Simulation Conference","id":"1ed6abea99b48026ec4e40bd3203e1251cc0e3a7","venue_1":"Winter Simulation Conference","year":"2005","title":"Reservation storage policy for AS/RS at air cargo terminals","authors":"Chulung Lee, Huei Chuen Huang, Paul Goldsman, Bin Liu, Zhiyong Xu","author_ids":"1714861, 1738061, 3110792, 1702756, 1731670","abstract":"At air cargo terminals, the operations of an automatic storage and retrieval system (AS/RS) have certain special characteristics that both cargo arrival rates and storage duration are stochastic, and the probability distributions can only come from the empirical data. According to such particularities, this paper proposes a class-based <i>reservation storage policy</i> for AS/RS at air cargo terminals and an analytical model is developed. Two classes are investigated and a certain storage spaces are reserved for one priority class in such a way that the one-way travel time of S/R machine is minimized. The optimal reservation space is obtained by numerical searching. A simulation model is developed and the simulation results validate the optimal solution from the analytical model.","cites":"1","conferencePercentile":"40.31100478"},{"venue":"Winter Simulation Conference","id":"289eeeecf1734940c0e67650edf5793a1f1a6a6c","venue_1":"Winter Simulation Conference","year":"2013","title":"Agent-based hardware-in-the-loop simulation for UAV/UGV surveillance and crowd control system","authors":"Amirreza M. Khaleghi, Dong Xu, Alfonso Lobos, Sara Minaeian, Young-Jun Son, Jian Liu","author_ids":"2356026, 1714390, 2727654, 1880136, 3644385, 2106964","abstract":"An agent-based hardware-in-the-loop simulation framework is proposed to model the UAV/UGV surveillance and crowd control system. To this end, a planning and control system architecture is discussed first, which includes various modules such as sensory data collection, crowd detection, tracking, motion planning, control command generation, and control strategy evaluation. The modules that are highly related with agent-based modeling (focus of this paper) are then discussed, which includes the UAV/UGV motion planning considering multi-objectives, crowd motion modeling via social force model, and enhancement of simulation environment via GIS 3D coordinates conversion. In the experiment, Repast Simphony is used as the agent-based modeling tool, which transmits sensory data and control commands with QGroundControl as hardware interface that further conducts radio communications with ArduCopter as a real UAV. Preliminary results show that finer grid scale and larger vehicle detection range generate a better crowd coverage percentage. Finally, conclusions and future works are discussed.","cites":"3","conferencePercentile":"89.26470588"},{"venue":"Winter Simulation Conference","id":"6013d8edaecce5d722c97e712d655e6a527fabcc","venue_1":"Winter Simulation Conference","year":"2010","title":"Modeling and simulation for user assistance in smart environments","authors":"Alexander Steiniger, Adelinde M. Uhrmacher","author_ids":"3287126, 1743841","abstract":"Smart environments are slowly but surely entering our everyday life. Their design provides many challenges. Not only heterogeneous devices acting and interacting in a dynamic environment but also intentions and activities of humans have to be taken into account. Diverse processes are responsible for achieving unobtrusive and pro-active user assistance. Those can be structured into a pipeline of perception, sensor interpretation, intention analysis, strategy synthesis, and actuation. Along this pipeline we analyze specific possibilities and requirements for modeling and simulation.","cites":"0","conferencePercentile":"13.32236842"},{"venue":"Winter Simulation Conference","id":"0ea23c7d14d2d3786787a26af11c038693641bdb","venue_1":"Winter Simulation Conference","year":"2009","title":"Concept of Operations for a Regional Telemedicine Hub to Improve Medical Emergency Response","authors":"Hui Wang, Wei Xiong, Nathaniel Hupert, Christian Sandrock, Javeed Siddiqui, Aaron E. Bair","author_ids":"1721516, 6737623, 2137422, 7307146, 2332366, 2399809","abstract":"Telemedicine (TM) is a tool that permits medical services to be provided remotely. Applications of telemedicine to disaster response began in the mid-1980s for natural disasters such as earthquakes, tsunamis, and hurricanes and for \"staged\" disasters in experiments and exercises. These activities led to the concept of a regional telemedicine hub (TMH) with an extended network of clinical providers, which potentially could alleviate problems associated with surge capacity during disaster response. However, health-related benefits associated with this organizational model for disaster-related telemedicine remain to be quantitatively tested. In this paper, we describe a simulation study used to examine the operation of a regional telemedicine hub during the acute phases of hospital patient management in a hypothetical earthquake scenario. We explore the impact of using telemedicine to provide emergency specialty care to expand surge capacities at both local and regional levels.","cites":"0","conferencePercentile":"10.9540636"},{"venue":"Winter Simulation Conference","id":"26dfd9e8d56fcac0b149d98e911064711a3022d7","venue_1":"Winter Simulation Conference","year":"2014","title":"Efficient monte carlo CVA estimation","authors":"Samim Ghamami, Bo Zhang","author_ids":"3334723, 1696318","abstract":"This paper presents an overview of the efficient Monte Carlo counterparty credit risk (CCR) estimation framework recently developed by Ghamami and Zhang (2014). We focus on the estimation of credit value adjustment (CVA), one of the most widely used and regulatory-driven counterparty credit risk measures. Our proposed efficient CVA estimators are developed based on novel applications of well-known mean square error (MSE) reduction techniques in the simulation literature. Our numerical examples illustrate that the efficient estimators outperform the existing crude estimators of CVA substantially in terms of MSE.","cites":"0","conferencePercentile":"27.4566474"},{"venue":"Winter Simulation Conference","id":"124f756a695316605456ab33d0b6adee3be23277","venue_1":"Winter Simulation Conference","year":"1994","title":"Model sensitivity analysis in environmental emergency management: a case study in oil spill modeling","authors":"William Lehr, Donna Calhoun, Robert Jones, Andrzej Lewandowski, Roy Overstreet","author_ids":"2554833, 7562522, 1922345, 3274134, 1776976","abstract":"When simulation models are used as decision support systems in environmental emergency response, it is important to know the confidence of simulation results generated by a model. The Hazardous Material Response and Division (HAZMAT) at NOAA uses the oil weathering software package named Automated Data Inquiry for Oil Spills (ADIOS) to investigate the oil weathering process. This model combines a database of physical and chemical properties of oils, with a simulation model computing mass losses, densitY , viscositY, and water content of an oil spill due to evaporation, dispersion, and emulsification. The sensitivity analysis of the ADIOS model with respect to environmental conditions and oil physical parameters is discussed in the paper. To perform the sensitivity analysis, the Object–Oriented Mod-eling System was used, together with the Sensitivity Analysis Laboratory, both being developed at NOAA. The preliminary results of sensitivity y analysis of evaporation process are presented in the paper. According to these preliminary results it is expected that it will be possible to provide the taxonomy of oils with respect to the reliability of results generated by the ADIOS model. Sensitivity analysis of the complete ADIOS model is in progress. 1 INTRODUCTION Stochastic methods can be used in solving environmental models characterized by only a few parameters. However, most models cent ain relatively large numbers of parameters and this technique is not feasible for emergency use because of prohibitive computer time. Hence, emergency response models are generally deterministic in formulation. Explicit statements of the uncertainty in these models' output become very imp ortant, especially when this must be translated into decisions about response or mitiga-tion measures. However, this element of environmental prediction modeling is often overlooked, even in cases where the level of uncertainty in the input data is known. In other words, the output of these models represents essentially the response to the nominal values of input data and model parameters, but contains little information about their confidence level. Reckhow and Chapra (1983) also recognize another important aspect of this problem: J> ... Uncertainty is a problem because analysis do not like to admit that uncertainty M present in their work. To the uninitiated, the existence and admission of uncertainty m a study implies that the study has iess va-lidtty and utility than does a study which exhibits no mention of uncertainty. Ironically, ofien just the opposzte is true. Reluctance on the part of analysts to consider uncertainty is …","cites":"3","conferencePercentile":"54.45026178"},{"venue":"Winter Simulation Conference","id":"8a54a89151268ea44d4806dab4b47d3fe48941f9","venue_1":"Winter Simulation Conference","year":"1997","title":"Visualizing Parallel Simulations in Network Computing Environments: A Case Study","authors":"Christopher D. Carothers, Brad Topol, Richard M. Fujimoto, John T. Stasko, Vaidy S. Sunderam","author_ids":"1759102, 2193414, 1721009, 1691661, 1718805","abstract":"Parallel discrete event simulation systems (PDES) are used to simulate large-scale applications such as modeling telecommunication networks, transportation grids, and battlefield scenarios. While a large amount of PDES research has focused on employing multiprocessors and multicomputers, the use of networks of workstations interconnected through Ether-net or ATM has evolved into a popular and effective platform for PDES. To improve performance in these environments, we investigate the use of graph-ical visualization to provide insight into performance evaluation and simulator execution. We began with a general-purpose network computing visualization system , PVaniM, and used it to investigate the execution of an advanced version of Time Warp, called Geor-gia Tech Time Warp (GTW), which executes in network computing environments. Because PDES systems such as GTW are essentially middleware that support their own applications, we soon realized these systems require their own middleware-specific visu-alization support. To this end we have extended PVaniM into a new system, called PVaniM-GTW by adding middleware-specific views. Our experiences with PVaniM-GTW indicate that these enhancements enable one to better satisfy the needs of PDES middleware than general-purpose visualization systems while also not requiring the development of application specific visualizations by the end user.","cites":"10","conferencePercentile":"76.34408602"},{"venue":"Winter Simulation Conference","id":"715ce693863c616ff2677eeebd4e80cecb3aabbc","venue_1":"Winter Simulation Conference","year":"2008","title":"Yard crane dispatching based on real time data driven simulation for container terminals","authors":"Xi Guo, Shell-Ying Huang, Wen-Jing Hsu, Malcolm Yoke-Hean Low","author_ids":"2957487, 1746606, 1743256, 1735888","abstract":"This paper studies the problem of real time yard crane dispatching in container terminals. Many technologies, including transponders, RFID and GPS have been used in the container terminal setting for real-time tracking of terminal equipment. A judicious integration of real-time data into the yard crane management system will allow better utilization of terminal resources to improve overall terminal productivity. We propose a yard crane dispatching algorithm based on real time data driven simulation to solve the problem of yard crane job sequencing to minimize average vehicle waiting time. The algorithm will produce optimal operation sequence for each planning window. Several policies to select jobs to form the planning window are also proposed. Our simulation results show that dispatching yard crane based on real time data driven simulation is of great value in improving yard crane performance in 3 scenarios with different vehicle arriving patterns and our results are 10% worse off a loosely estimated overall optimal performance result.","cites":"9","conferencePercentile":"90.83769634"},{"venue":"Winter Simulation Conference","id":"55f5fe2322ef6bcf43bf684af9cfb100ec394d0b","venue_1":"Winter Simulation Conference","year":"1998","title":"Implementing On-line Simulation upon the World-Wide Web","authors":"Wayne J. Davis, Xu Chen, Andrew L. Brook","author_ids":"1709076, 1734498, 2339335","abstract":"This paper addresses the implementation of advanced, on-line simulation experiments upon the WorldWide Web. The paper first discusses the system considered for this study. The paper then discusses the distributed object computing environment that has been employed in the study, including the specialized displays that would be accessed by a remote participant when viewing the on-line simulation analysis on the Web. Finally, directions for future research are outlined.","cites":"7","conferencePercentile":"61.31221719"},{"venue":"Winter Simulation Conference","id":"4646c7de2a61e4a3a4e333b18ee82245e9d747a3","venue_1":"Winter Simulation Conference","year":"2014","title":"Parallel bayesian policies for finite-horizon multiple comparisons with a known standard","authors":"Weici Hu, Peter I. Frazier, Jing Xie","author_ids":"1898292, 2884935, 5035226","abstract":"We consider the problem of multiple comparisons with a known standard, in which we wish to allocate simulation effort efficiently across a finite number of simulated systems, to determine which systems have mean performance exceeding a known threshold. We suppose that parallel computing resources are available, and that we are given a fixed simulation budget. We consider this problem in a Bayesian setting, and formulate it as a stochastic dynamic program. For simplicity, we focus on Bernoulli sampling, with a linear loss function. Using links to restless multi-armed bandits, we provide a computationally tractable upper bound on the value of the Bayes-optimal policy, and an index policy motivated by these upper bounds.","cites":"4","conferencePercentile":"96.24277457"},{"venue":"Winter Simulation Conference","id":"39be4be80c7978699dec819608b186e641ff6f31","venue_1":"Winter Simulation Conference","year":"2008","title":"Supply chain risks analysis by using jump-diffusion model","authors":"Xianzhe Chen, Jun Zhang","author_ids":"2162669, 1752214","abstract":"This paper investigates the effects of demand risk on the performance of supply chain in continuous time setting. The inventory level has been modeled as a jump-diffusion process and the two-number inventory policy has been implemented in the supply chain system. The simulated annealing algorithm has been used to search the optimal critical values of the two-number policy. The jump magnitude has been considered in two cases: constant and Laplace distribution which has favorable property, i.e. leptokurtic. Numerical studies have been conducted for various scenarios to provide insights of effects of demand disruption on the performance of the supply chain.","cites":"0","conferencePercentile":"15.57591623"},{"venue":"Winter Simulation Conference","id":"8187d83e378c0d283241e40a345791165f64d954","venue_1":"Winter Simulation Conference","year":"2008","title":"Panel discussion: What makes good research in modeling and simulation: Sustaining the growth and vitality of the M&S discipline","authors":"Levent Yilmaz, Paul Davis, Paul A. Fishwick, Xiaolin Hu, John A. Miller, Maria Hybinette, Tuncer Ören, Paul Reynolds, Hessam S. Sarjoughian, Andreas Tolk","author_ids":"7988136, 4478986, 1734138, 1705418, 1791975, 3135781, 2064368, 4598903, 2359380, 1696792","abstract":"The aim of this panel session is to promote discussion on emergent challenges and the need for advancements in the theory, methodology, applications, education in M&S. The changing landscape in science and engineering (e.g., industrial and defense application, medicine, predictive homeland security, energy and environment) introduces new types of problems and challenges into the M&S domain. In light of these emergent needs how can M&S stay relevant as new critical fields such as global climate change mitigation, energy restructuring, genetic engineering impacts on society and universal health care emerge and come into prominence? Surely the systems point of view and the tools that M&S brings to the table are key to these new directions. So, what are the critical issues and challenges facing M&S community in the face of change and need for rapid discovery?","cites":"9","conferencePercentile":"90.83769634"},{"venue":"Winter Simulation Conference","id":"40aa52f1c9ef9b2683866f080fc1bf4edfad8d32","venue_1":"Winter Simulation Conference","year":"2013","title":"Upper bounds on the Bayes-optimal procedure for ranking & selection with independent normal priors","authors":"Jing Xie, Peter I. Frazier","author_ids":"5035226, 2884935","abstract":"We consider the Bayesian formulation of the ranking and selection problem, with an independent normal prior, independent samples, and a cost per sample. While a number of procedures have been developed for this problem in the literature, the gap between the best existing procedure and the Bayes-optimal one remains unknown, because computation of the Bayes-optimal procedure using existing methods requires solving a stochastic dynamic program whose dimension increases with the number of alternatives. In this paper, we give a tractable method for computing an upper bound on the value of the Bayes-optimal procedure, which uses a decomposition technique to break a high-dimensional dynamic program into a number of low-dimensional ones, avoiding the curse of dimensionality. This allows calculation of the optimality gap for any given problem setting, giving information about how much additional benefit we may obtain through further algorithmic development. We apply this technique to several problem settings, finding some in which the gap is small, and others in which it is large.","cites":"4","conferencePercentile":"93.08823529"},{"venue":"Winter Simulation Conference","id":"381f07bbb7da2093e4bbd13f2f7484a6bcecf5b2","venue_1":"Winter Simulation Conference","year":"2011","title":"Value of information methods for pairwise sampling with correlations","authors":"Peter I. Frazier, Jing Xie, Stephen E. Chick","author_ids":"2884935, 5035226, 7759889","abstract":"We consider optimization via simulation over a finite set of alternatives. We employ a Bayesian value-of-information approach in which we allow both correlated prior beliefs on the sampling means and correlated sampling. Correlation in the prior belief allow us to learn about an alternative's value from samples of similar alternatives. Correlation in sampling, achieved through common random numbers, allows us to reduce the variance in comparing one alternative to another. We allow for a more general combination of both types of correlation than has been offered previously in the Bayesian ranking and selection literature. We do so by giving an exact expression for the value of information for sampling the difference between a pair of alternatives, and derive new knowledge-gradient methods based on this valuation.","cites":"11","conferencePercentile":"97.6"},{"venue":"Winter Simulation Conference","id":"a6ca423fb3941b32fa0286be25bf2fd057c4d74d","venue_1":"Winter Simulation Conference","year":"2005","title":"A family of market-based shipment methodologies for delivery supply chain","authors":"Seog-Chan Oh, Soundar R. T. Kumara, Shang-Tae Yee, Jeffrey D. Tew","author_ids":"2996903, 1749112, 1697751, 2565474","abstract":"Load building is an important step to make the delivery supply chain efficient. We present a family of load makeup algorithms using market control-based strategy, named <b><i>LoadMarket</i></b>, in order to build efficient loads where each load consists of a certain number of finished products having destinations. LoadMarket adopts minimum spanning tree graph algorithm for generating initial endowment for <i>Load Traders</i> who cooperate to minimize either total travel distance or the variance with respect to the travel distances of loads through a spot market or double-sided auction market mechanism. For the simulated load shipment market, the efficiency of the LoadMarket algorithms is analyzed using simulation experiments.","cites":"0","conferencePercentile":"17.10526316"},{"venue":"Winter Simulation Conference","id":"17d7d1c89aa0158c22a22052ee2a8fa360b6588f","venue_1":"Winter Simulation Conference","year":"2009","title":"Accelerating Traffic Microsimulations: A Parallel Discrete-event Queue-based Approach for Speed and Scale","authors":"Sunil Thulasidasan, Stephan Eidenbenz","author_ids":"1780360, 1937685","abstract":"We present <i>FastTrans</i> -- a parallel, distributed-memory simulator for transportation networks that uses a queue-based event-driven approach to traffic microsimulation. Queue-based simulation models have been shown to be significantly faster than cellular-automata type approaches, sacrificing spatial granularity for speed, while preserving link and intersection dynamics with high fidelity. Significant advances over previous work include the size of the simulated network, support for dynamic responses to congestion and the absence of precomputed routes -- all routing calculations are executed online. We present initial results from a scalability study using a real-world network from the North-East region of the United States comprising over 1.5 million network elements and over 25 million vehicular trips. Simulation of an entire day's worth of realistic vehicular itineraries involving approximately five billion simulated events executes in less than an hour of wall-clock time on a distributed computing cluster. Initial results suggest almost linear speed-ups with cluster size.","cites":"7","conferencePercentile":"83.74558304"},{"venue":"Winter Simulation Conference","id":"3809cd7b7d8b7b9de3fbcc74d26f17654d4dd0c7","venue_1":"Winter Simulation Conference","year":"2009","title":"A Simulation based Hybrid Algorithm for Yard Crane Dispatching in Container Terminals","authors":"Xi Guo, Shell-Ying Huang, Wen-Jing Hsu, Malcolm Yoke-Hean Low","author_ids":"2957487, 1746606, 1743256, 1735888","abstract":"The problem of yard crane dispatching in container terminals is addressed in this paper. We proposed two new hybrid algorithms which combine the advantages of A* heuristic search and Recursive Backtracking with prioritized search order to accelerate the solution process. The algorithms proposed use real time data-driven simulation to accurately predict the time taken by the yard crane in performing its operations and this helps in getting an optimal dispatching sequence that can be followed by the yard crane. Experiments carried out show that the proposed algorithms consistently perform very well over all tested cases. The best performing algorithm is able to find the optimal solution over <i>2.4 &#215; 10</i><sup><i>18</i></sup> possible dispatching sequences in about 0.3 to 0.4 seconds under heavy workload. The characteristics of memory-saving and interruptibility enable the algorithm to be easily integrated into a complete yard crane management system in real world applications. In such real time yard crane management system, our proposed algorithms can be used as an effective and efficient tool to support complex and intelligent higher level planning in addition to managing the yard crane operations in its appointed zone.","cites":"2","conferencePercentile":"51.59010601"},{"venue":"Winter Simulation Conference","id":"6dfc7768f518219350bd0a1dadec40110f61f0b2","venue_1":"Winter Simulation Conference","year":"1991","title":"Modelling physical objects for simulation","authors":"Paula Sweeney, Alan Norton, Robert Bacon, David R. Haumann, Greg Turk","author_ids":"2105066, 3131524, 2379289, 2912247, 1713189","abstract":"We present a framework for modelling and simulating objects with physical attributes. Rather than at-t aching physical properties to geometric shapes, we directly design and manipulate objects with intrinsic dynamic properties such as stiffness, mass, angular momentum, Flexible and rigid bodies can interact in the same simulated physical environment, responding to collisions, fluid velocity fields, friction and gravity. A modeller and simulator organized along these principles haa been implemented and used in computer animation. The results obtained with these systems are presented. 1 INTRODUCTION Physically based animation is a new area in the field of computer graphics. Using physics to determine the motion of objects adds realistic effects to anima-tions. Animations are automatically created from an initial set of physical properties and models. Physical laws are used to produce animations that are visually appealing and communicate information about how different models interact in a simulated environment. Introducing physics as a way to generate motion has produced a variety of effects. Realistic motion of rigid bodies has been used by Hahn (1988) and Barzel and Barr (1988). The motion of flexible objects has been used by Terzopouloa et al. The motion of rigid and flexible objects can also be simulated together as in Terzopoulos and Witkin (1988). Fracture of objects has been studied by Terzopoulos and Fleischer (1988) and Norton et al. (1990). Fluid flows have been studied using particles systems aa in Reeves (1983) and Sims (1990). Wind field represented by fluid flow techniques is used by Wejchert and Haumann (1991). Most of the referenced methods above use a specific mathematical model to produce a specific physical ef-feet. Our goal is to create an animation system for experimenting with different physically basecl animation techniques. We currently have a system that has allowed us to model a breaking teapot, a flexible swing affected by wind, and leaves which float or move in wind velocity fields (Haumann et al, 1991). In our system objects are represented in a topologi-cal hierarchy associated with points, edges, faces and cells. This structure permits simulation of objects with O, 1, 2, and 3 dimensional components. Operators are defined that permit topological modification of the structures; e.g. aggregate objects are built by physically attaching subcomponents, and solid objects are disintegrated during fracture. Mass and velocity are associated with points, spring forces are transmitted through edges, and wind forces are applied to faces. Cells are required to represent …","cites":"6","conferencePercentile":"77.97202797"},{"venue":"Winter Simulation Conference","id":"2e5c9332b8e9cc00e0d9036038f1e0d895776ddd","venue_1":"Winter Simulation Conference","year":"2009","title":"A Comparison of SOAP and REST Implementations of a Service based Interaction Independence Middleware Framework","authors":"Gavin Mulligan, Denis Gracanin","author_ids":"3086472, 1709677","abstract":"This paper describes the conceptual design of an interaction independence middleware framework and describes the role that web services plays within it. We investigate two pervasive service-oriented architecture paradigms, SOAP and REST, in order to gauge their potential effectiveness in meeting underlying back-end data transmission requirements; provide implementations for the service-oriented architecture and data model; and, finally, critically evaluate both implementations with an emphasis on their performance with regard to both efficiency and scalability.","cites":"14","conferencePercentile":"95.05300353"},{"venue":"Winter Simulation Conference","id":"4c6b3671df65eee200f8a367afc8a8fd82c1a301","venue_1":"Winter Simulation Conference","year":"2008","title":"An agent-based simulation study of the dynamics of mobile viral advertising","authors":"Jiang Wu, Bin Hu","author_ids":"1685298, 1702845","abstract":"In the mobile era, mobile advertising is essential and has been developing very fast. Marketers are eager to turn to mobile viral advertising for benefiting from initially targeting customers. In this paper, we propose a computational model to reconstruct the spreading of advertisements in social networks. Using this computational model as a test-bed and running a series of virtual experiments, we acquire observations and implications about how to choose an initial set of people to maximize the performance of spreading advertisements. Also, we observe and analyze the impacts of the network structures including topology, size and density and the initial selected number of targeted people on the dynamics of mobile viral advertising. The virtual experiments also help us to examine the suitable policies for combining viral adverting with mass marketing in mobile commerce. In addition, we run virtual experiments (simulations) in a real mobile-online social network to validate the model and to provide an example for practitioners to apply this computational model. In practice, we use the attributes of people and the interest groups they are members of in social networks to infer the spreading probability between people.","cites":"0","conferencePercentile":"15.57591623"},{"venue":"Winter Simulation Conference","id":"76d400034384bda44cb330f03ae7d792edc0bf0d","venue_1":"Winter Simulation Conference","year":"2014","title":"Simulation based analytics for efficient planning and management in multimodal freight transportation industry","authors":"Parijat Dube, João P. M. Gonçalves, Shilpa Mahatma, Francisco Barahona, Milind R. Naphade, Mark Bedeman","author_ids":"1805411, 3074070, 2809895, 1691706, 1780080, 2313571","abstract":"The multimodal freight transportation planning is a complex problem with several factors affecting decisions, including network coverage, carriers and their schedules, existing contractual agreements with carriers and clients, carrier capacity constraints, and market conditions. Day-to-day operations like booking and bidding are mostly done manually and there is a lack of decision support tools to aid the operators. These operations are governed by a complex set of business rules involving service agreements with the clients, contractual agreements with the carriers and forwarder's own business objectives. The multimodal freight transportation industry lacks a comprehensive solution for end-to-end route optimization and planning. We developed analytics for trade lane managers to identify and exploit opportunities to improve procurement, carrier selection, capacity planning, and business rules management. Our simulation based analytics tool is useful for managing business rules and for doing what-if analysis which can lead to better resource planning, cost management, and rate negotiations.","cites":"0","conferencePercentile":"27.4566474"},{"venue":"Winter Simulation Conference","id":"92bae2a66c0ec4ded5b1dd9b78fe80f439790f60","venue_1":"Winter Simulation Conference","year":"2010","title":"Automated stowage planning for large containerships with improved safety and stability","authors":"Min Zeng, Malcolm Yoke-Hean Low, Wen-Jing Hsu, Shell-Ying Huang, Fan Liu, Cho Aye Win","author_ids":"8063157, 1735888, 1743256, 1746606, 3875759, 3334082","abstract":"Stowage planning for container ships is a core activity of shipping lines. As the size of containership increases, generating a stowage plan with good safety and stability for a large containership becomes increasingly difficult. In this paper, we present an automated stowage planning system for large containerships which consists of three modules: the stowage plan generator, the safety and stability adjustment module, and the optimization engine. This paper focuses on the safety and stability adjustment module which resolves the stability issues of a stowage plan by adjusting the distribution of container weights by stowing containers in alternative feasible locations and fine-tuning stability parameters through adjusting the ballast in tanks onboard. Using shipping data for a large 7000 TEUs containership on a multi-port voyage, we demonstrate that our system can generate stowage plans with improved safety and stability compared to those generated by experienced planners.","cites":"1","conferencePercentile":"38.81578947"},{"venue":"Winter Simulation Conference","id":"0506abcbde5e5b3723ea114220b3ce4b3ab9135d","venue_1":"Winter Simulation Conference","year":"2008","title":"Service-Oriented-Architecture based framework for multi-user virtual environments","authors":"Xiaoyu Zhang, Denis Gracanin","author_ids":"1791962, 1709677","abstract":"Service-Oriented Architecture (SOA) is an application framework used for creating complex enterprise systems by integrating distributed services. The SOA standards are primarily focused on the service composability and data interoperability. Because of the featured capabilities of SOA, it is also used in distributed simulations. However, SOA has its limitations in terms of the performance of real-time message exchanging. In order to address the disadvantages and improve the application performance, we propose a framework that combines the streaming technology and SOA. The proposed framework is used for constructing multi-user Virtual Environment (VE) applications by integrating the application content from distributed services. The additional streaming channels applied to SOA enable the services to actively propagate the real-time messages. The VE applications constructed using the framework have better performance. However, due to the distributed architecture of SOA and the heavy payload of message exchange in the framework, the application performance needs to be evaluated. We describe the metrics used to evaluate the performance and present the evaluation results. Based on the interaction latency we collected from the experiments, we discuss the categories of applications that can fit well in our framework.","cites":"4","conferencePercentile":"74.60732984"},{"venue":"Winter Simulation Conference","id":"99c298f78255d0bb07397d4e33d43d42624ebce5","venue_1":"Winter Simulation Conference","year":"2011","title":"A simulation-based approach to enhancing project schedules by the inclusion of remedial action scenarios","authors":"Sanja Lazarova-Molnar, Rabeb Mizouni","author_ids":"1749726, 1722280","abstract":"Project schedules are typically defined in relatively strict terms and often rely on well-defined task ordering. Commonly, each task has either a pre-determined duration, or, a minimum, a maximum and a most-likely duration length. In real-life, however, projects are subject to numerous uncertainties. They often impact durations of tasks and may lead to project re-scheduling. In such cases managers need to decide about some remedial action scenario (RAS) to limit the impact of uncertainty on the overall project success. They are usually left clueless on what the most appropriate action to take is. To solve this problem, we propose a novel approach to enhance project schedules by the inclusion of an optimal RAS to be followed when uncertainties occur. This defines the <i>enhanced project schedule</i> model. The particular RAS, modeled by a set of fuzzy rules and selected using proxel-based simulation, becomes an integral part of the enhanced project schedule.","cites":"3","conferencePercentile":"74.66666667"},{"venue":"Winter Simulation Conference","id":"952a02f7ceeb4e7526e69d63373ff6d498d66075","venue_1":"Winter Simulation Conference","year":"2012","title":"An integrated approach to mission analysis and mission rehearsal","authors":"Marcel Kvassay, Ladislav Hluchý, Stefan Dlugolinsky, Michal Laclavik, Bernhard Schneider, Holger Bracker, Ales Tavcar, Matjaz Gams, Dariusz Król, Michal Wrzeszcz, Jacek Kitowski","author_ids":"2729351, 1744707, 2160638, 1751605, 1747840, 1976261, 2032051, 1723500, 1801577, 2663996, 1741908","abstract":"Although simulation techniques are widely used to support both mission rehearsal and mission analysis, these two applications tend to be considered as distinctly separate. In this article we argue that integrating them in a unified framework can benefit the end-users of the system (armed forces or police and security forces). We demonstrate this on project EUSAS (\"European Urban Simulation of Asymmetric Scenarios\") financed by 20 nations under the <i>Joint Investment Program Force Protection</i> of the European Defence Agency, where such a unified infrastructure is being developed. We show how a novel approach to integration through behaviour cloning enables the system to capture the operational knowledge of security experts in a non-verbal way. This capability in fact emerges as essential for the operation of the integrated system, and we illustrate how the interplay between the system components for mission analysis and mission rehearsal is realized.","cites":"0","conferencePercentile":"23.30097087"},{"venue":"Winter Simulation Conference","id":"6f2cb606d393bfa745f74c3521421982a242bd29","venue_1":"Winter Simulation Conference","year":"2007","title":"Modeling and simulation of group behavior in e-government implementation","authors":"Jiang Wu, Bin Hu","author_ids":"1685298, 1702845","abstract":"This study proposes a multi-agent modeling and simulation approach using EGGBM (E-Government Group Behavior Model) to research complex group behavior in E-government implementation. A multi-agent simulation decision system based on Java-REPAST is developed for qualitative validation to show that EGGBM is consistent with common sense. We give an example of EGGBM application to show that EGGBM method can help decision-makers choose appropriate decisions to improve the level of accepting information technology (LAIT) of groups. Finally, we conclude that this approach could provide a new attempt for the research of group behavior in E-government organization.","cites":"3","conferencePercentile":"64.24242424"},{"venue":"Winter Simulation Conference","id":"1a76cf03d46f5a5b37d982cbd6d99a3b3a11b55e","venue_1":"Winter Simulation Conference","year":"2008","title":"Who's your Tiger? Using simulation to optimize the lineup of the Detroit Tigers offense","authors":"Jared Davis, Barbara Fordyce, James Cicala, Matthew L. Cooper, Omer Tsimhoni","author_ids":"1793605, 2432683, 3276596, 6108444, 1723297","abstract":"As part of an undergraduate engineering class project, a simulation of the Detroit Tigers offense was created to explore potential changes that would increase number of wins. More specifically, we seek to determine a lineup for an MLB team, the Detroit Tigers, that would maximize their potential runs. To answer our ultimate question of whether a manager actually maximizes runs scores, we compare our results to the Tigers' 2007 performance. We determine that though the Tigers did not use the ideal lineup as determined by our model, the lineup they did utilize was moderately robust, with ours winning 89.6 games versus the actual wins of 88 games. Additionally, we apply our model to a normative analysis of the Tigers ideal lineup for the 2008 season. This ideal lineup only changes the middle of the batting order (acceptable by management) and is predicted to win 99 games in the 2008 season.","cites":"0","conferencePercentile":"15.57591623"},{"venue":"Winter Simulation Conference","id":"72b8d71a79fdc89a79ca613ad1b3c11e08e2bbe4","venue_1":"Winter Simulation Conference","year":"2011","title":"Modeling and simulation of building energy performance for portfolios of public buildings","authors":"Young M. Lee, Fei Liu, Lianjun An, Huijing Jiang, Chandra Reddy, Raya Horesh, Paul Nevill, Estepan Meliksetian, Pawan Chowdhary, Nat Mills, Young Tae Chae, Jane L. Snowdon, Jayant Kalagnanam, Joe Emberson, Al Paskevicous, Elliott Jeyaseelan, Robert Forest, Chris Cuthbert, Tony Cupido, Michael Bobker, Janine Belfast","author_ids":"1767066, 1742065, 1851993, 1716350, 1784966, 2539798, 2683118, 3188750, 1808548, 1920612, 2727935, 2407643, 1682581, 2576068, 3181800, 2118814, 3102484, 2469468, 1905822, 2361928, 1838821","abstract":"In the U.S., commercial and residential buildings and their occupants consume more than 40% of total energy and are responsible for 45% of total greenhouse gas (GHG) emissions. Therefore, saving energy and costs, improving energy efficiency and reducing GHG emissions are key initiatives in many cities and municipalities and for building owners and operators. To reduce energy consumption in buildings, one needs to understand patterns of energy usage and heat transfer as well as characteristics of building structures, operations and occupant behaviors that influence energy consumption. We develop heat transfer inverse models and statistical models that describe how energy is consumed in commercial buildings, and simulate the impact of energy saving changes that can be made to commercial buildings including structural, operational, behavioral and weather changes, on energy consumption and GHG emissions. The analytic toolset identifies energy savings opportunities and quantifies the savings for a large portfolio of public buildings.","cites":"1","conferencePercentile":"46"},{"venue":"Winter Simulation Conference","id":"04b93f4f32d25af29e1d9f225aacb61ba9cb4f55","venue_1":"Winter Simulation Conference","year":"2012","title":"Scheduling with preemption for incident management: when interrupting tasks is not such a bad idea","authors":"Marcos Dias de Assunção, Victor F. Cavalcante, Maíra A. de C. Gatti, Marco Aurélio Stelmar Netto, Claudio S. Pinhanez, Cleidson R. B. de Souza","author_ids":"1803634, 3167844, 2056375, 1777317, 1766240, 1809430","abstract":"Large IT service providers comprise hundreds or even thousands of system administrators to handle customers' IT infrastructure. As part of the Information Systems that support the decision making of this environment, Incident Management Systems are used and usually provide human resource assignment functionalities. However, the assignment poses several challenges, such as establishing priorities to tasks and defining when and how tasks are allocated to available system administrators. This paper describes a set of incident dispatching policies that can be used, and by using workloads from different departments of an IT service provider, this work evaluates the impact of task preemption on incident resolution and service level agreement attainment.","cites":"0","conferencePercentile":"23.30097087"},{"venue":"Winter Simulation Conference","id":"58a8ea36250aebec436a3d29068c1a52aa6e3a44","venue_1":"Winter Simulation Conference","year":"2003","title":"Next generation modeling II - applications: improving the development process for eukaryotic cell cycle models with a modeling support environment","authors":"Nicholas A. Allen, Clifford A. Shaffer, Marc Vass, Naren Ramakrishnan, Layne T. Watson","author_ids":"3004337, 1758750, 7361612, 1755938, 5972282","abstract":"Biological pathway modelers attempt to describe cellular processes and regulatory networks with continuous and discrete models of the cell cycle. Previous practice has been to develop these models largely by hand, and then to validate models primarily by comparing time series plots versus the observed experimental results. This paper reports our experiences in designing and building a modeling support environment (MSE) for cell cycle models. We describe improvements to the development process for cell cycle models by (a) identifying the key elements of the existing modeling process, (b) applying simulation methodology to construct a revised modeling process, and (c) building and testing software that supports the revised modeling process.","cites":"0","conferencePercentile":"23.85496183"},{"venue":"Winter Simulation Conference","id":"95309f04c4252bb374f9f1f989033d357b9f81d2","venue_1":"Winter Simulation Conference","year":"2003","title":"Agent models I: UTSAF: a multi-agent-based framework for supporting military-based distributed interactive simulations in 3D virtual environments","authors":"Joseph Manojlovich, Phongsak Prasithsangaree, Stephen B. Hughes, Jinlin Chen, Michael Lewis","author_ids":"3295693, 2892798, 3029149, 2516644, 1740579","abstract":"A Military-based distributed interactive simulation (DIS) such as ModSAF has been used for many years. Several problems of the DIS-based simulation to support a large and heterogeneous virtual simulation environments have been discovered (Stone, Zyda, Brutzman, and Falby 1996). To solve these problems, we propose an architectural multi-agent-based framework to support a large military-based simulation with 3D visualization using inexpensive game simulators. Several software agents are used to support interoperability between DIS-based military simulation nodes and Unreal Tournament game simulators. An agent is used to reduce DIS traffic to efficiently utilize network bandwidth. It also performs protocol conversion between DIS protocol and a game engine protocol. Additionally, using a multi-agent system, our work is easily expandable to support several network environments and also to support agent-based intelligent operations. Our main contribution is twofold. We use a multi-agent system which is scalable to support our framework. In addition, our framework builds a simulation bridge that enables affordable high-quality 3D viewer node using affordable game simulations for military simulations.","cites":"10","conferencePercentile":"95.99236641"},{"venue":"Winter Simulation Conference","id":"2558e1a446a45a5b35c827690bf8040d4f9e062f","venue_1":"Winter Simulation Conference","year":"2014","title":"A DDDAMS-based UAV and UGV team formation approach for surveillance and crowd control","authors":"Amirreza M. Khaleghi, Dong Xu, Sara Minaeian, Mingyang Li, Yifei Yuan, Jian Liu, Young-Jun Son, Christopher Vo, Jyh-Ming Lien","author_ids":"2356026, 1714390, 1880136, 3853937, 7810021, 2106964, 3644385, 1741985, 1693715","abstract":"The goal of this paper is to study the team formation of multiple UAVs and UGVs for collaborative surveillance and crowd control under uncertain scenarios (e.g. crowd splitting). A comprehensive and coherent dynamic data driven adaptive multi-scale simulation (DDDAMS) framework is adopted, with the focus on simulation-based planning and control strategies related to the surveillance problem considered in this paper. To enable the team formation of multiple UAVs and UGVs, a two stage approach involving 1) crowd clustering and 2) UAV/UGV team assignment is proposed during the system operations by considering the geometry of the crowd clusters and solving a multi-objective optimization problem. For the experiment, an integrated testbed has been developed based on agent-based hardware-in-the-loop simulation involving seamless communications among simulated and real vehicles. Preliminary results indicate the effectiveness and efficiency of the proposed approach for the team formation of multiple UAVs and UGVs.","cites":"2","conferencePercentile":"83.09248555"},{"venue":"Winter Simulation Conference","id":"69ead674b6e532ab535351a50b5f2d0229f4a091","venue_1":"Winter Simulation Conference","year":"2008","title":"Simulation and optimization for construction repetitive projects using promodel and simrunner","authors":"Chachrist Srisuwanrat, Photios G. Ioannou, Omer Tsimhoni","author_ids":"2628328, 2912445, 1723297","abstract":"We introduce a new approach, called Relative Start and Idle Time (RSIT), to solve probabilistic scheduling problems of construction repetitive projects. RSIT is a process of determining a range of input variables and employing optimization through simulation to solve scheduling problems. RSIT reduces the modeler's effort because it does not heavily rely on manual trial-and-error. The two primary advantages of this approach are: (1) it does not require additional solving algorithm code and (2) it does not impose unnecessary limitations on the simulation model in order to solve the scheduling problem. The new approach is presented in detail and applied to a real past repetitive project of four four-story buildings. Results from RSIT are evaluated and compared to the results from a deterministic approach. The example is modeled in Pro-Model and optimized in SimRunner.","cites":"1","conferencePercentile":"39.26701571"},{"venue":"Winter Simulation Conference","id":"19927a080e279efa2d1d58e84aeda21ec6bf68f2","venue_1":"Winter Simulation Conference","year":"2012","title":"Hardware-in-the-loop simulation for automated benchmarking of cloud infrastructures","authors":"Qi Liu, Márcio Silva, Michael R. Hines, Dilma Da Silva","author_ids":"1728293, 8458388, 2524649, 2746901","abstract":"To address the challenge of automated performance benchmarking in virtualized cloud infrastructures, an extensible and adaptable framework called CloudBench has been developed to conduct scalable, controllable, and repeatable experiments in such environments. This paper presents the hardware-in-the-loop simulation technique used in CloudBench, which integrates an efficient discrete-event simulation with the cloud infrastructure under test in a closed feedback control loop. The technique supports the decomposition of complex resource usage patterns and provides a mechanism for statistically multiplexing application requests of varied characteristics to generate realistic and emergent behavior. It also exploits parallelism at multiple levels to improve simulation efficiency, while maintaining temporal and causal relationships with proper synchronization. Our experiments demonstrate that the proposed technique can synthesize complex resource usage behavior for effective cloud performance benchmarking.","cites":"1","conferencePercentile":"57.03883495"},{"venue":"Winter Simulation Conference","id":"6ccd6ca3a5cb4734006775d6c2177519dcfa756f","venue_1":"Winter Simulation Conference","year":"2013","title":"Consistent use of emulation across different stages of plant development - The case of deadlock avoidance for cyclic cut-to-size processes","authors":"Ruth Fleisch, Robert Schöch, Thorsten Prante, Robert Pflegerl","author_ids":"2812162, 3174814, 1726731, 3245625","abstract":"This paper presents an emulation tool and the way in which it supports the test-driven design of zero-deadlock cut-to-size plants. In contrast to previous plant layouts featuring a linear material flow, panels can now be allocated to the same saw again for their further partitioning. The resulting circles in the material flow of cut-to-size plants impose new challenges as they may cause deadlocks, which means that the manufacturing system or parts of it remains indefinitely blocked. In order to prevent deadlock occurrences, an algorithm is developed and implemented into the software controlling the cut-to-size plant. The necessary tests are performed in an iterative way with the help of our emulation tool, which connects the plant control software with the virtual analogs of the control and the field layers.","cites":"1","conferencePercentile":"59.26470588"},{"venue":"Winter Simulation Conference","id":"71a1b656a9b776723664a918a84730080ad805b4","venue_1":"Winter Simulation Conference","year":"2006","title":"PLSE-based generic simulation training platform for typical weapon equipments","authors":"Ying Liu","author_ids":"1718041","abstract":"With the development of simulation technologies, virtual training for the military has become more and more important. Combining system and software engineering theory, based on the PLSE (Product Line Software Engineering) idea and method, we analyze and design simulation training characteristics for typical field equipment. We set up the domain-oriented system architecture and implement the domain framework. The research involves: putting forward the conceptual simulation platform based on PLSE, applying the domain engineering method, analyzing commonalities in the training for typical equipment, and implementing a general architecture. Using relevant technologies, we develop reusable core assets systematically and strategically, and build the object-oriented development platform and the platform-based developing models.","cites":"0","conferencePercentile":"12.14057508"},{"venue":"Winter Simulation Conference","id":"c1177136d70196e8de7c6451d865122497c2603f","venue_1":"Winter Simulation Conference","year":"2011","title":"Modeling PCB assembly lines in EMS provider's environment: integrating product design into simulation models","authors":"Jing Li, Nagen Nagarur, Krishnaswami Srihari","author_ids":"1742253, 2366607, 2139147","abstract":"The manufacturing pattern of most Electronic Manufacturing Services (EMS) suppliers in US has transformed to accommodate a high mix and low volume environment. Printed Circuit Board (PCB) assembly at EMS is characterized as `product oriented production': based on product designs, assemblies are processed with different routings, while operation times and process yields also vary depending on the complexity of products. Therefore, in order to simulate PCB assembly line, it is necessary to combine design information into simulation models. This research endeavor is focused on integrating design factors into a planning system, which is developed based on Discrete Event Simulation (DES) modeling. By applying this proposed system, EMS suppliers can effectively plan the required manufacturing resources, predict production cycle time and `optimize' resource deployment for a specific product. This architecture can significantly reduce the uncertainties of predictions that are caused by product mixes and provide customized production profile for individual product.","cites":"0","conferencePercentile":"17.46666667"},{"venue":"Winter Simulation Conference","id":"70e93926c9107552292f6aa8a87887e9f47b222c","venue_1":"Winter Simulation Conference","year":"2012","title":"Effective crowd control through adaptive evolution of agent-based simulation models","authors":"Nan Hu, James Decraene, Wentong Cai","author_ids":"2836784, 1694641, 1750691","abstract":"We report an approach to achieve effective crowd control strategies through adaptively evolving an agent-based model of Crowd Simulation for Military Operations (COSMOS). COSMOS is a complex system simulation platform developed to address challenges posed by the Military Operations in Urban Terrains (MOUT). Modeling and simulating soldiers' tactical behaviors in MOUT scenarios is challenging due to the complex and emerging behaviors of crowds and large parameter space of the models. Consequently, it is difficult to search for effective crowd control strategies through tuning the model parameters manually. We employ an adaptive evolutionary computation approach, using the Complex Adaptive Systems Evolver (CASE), to address this challenge. Specifically, we conduct experiments using a \"building-protection\" scenario, where the operation plans of soldier agents are adaptively evolved to best control a crowd. The results suggest this approach using agent-based simulation and evolutionary computation techniques is promising for the study of complex military operations.","cites":"1","conferencePercentile":"57.03883495"},{"venue":"Winter Simulation Conference","id":"4661564fc0598fa12e2390e9c2265172424894b8","venue_1":"Winter Simulation Conference","year":"2016","title":"Managing egress of crowd during infrastructure disruption","authors":"Teck-Hou Teng, Shih-Fen Cheng, Trong-Nghia Truong, Hoong Chuin Lau","author_ids":"2834527, 2089330, , 1809379","abstract":"In a large indoor environment such as a sports arena or convention center, smooth egress of crowd after an event can be seriously affected if infrastructure such as elevators and escalators break down. In this paper, we propose a novel crowd simulator known as SIM-DISRUPT for simulating egress scenarios in non-emergency situations. To surface the impact of disrupted infrastructure on the egress of crowd, SIM-DISRUPT includes features that allows users to specify selective disruptions as well as strategies for controlling the distribution and egress choices of crowd. Using SIM-DISRUPT, we investigate effects of crowd distribution, egress choices and infrastructure disruptions on crowd egress time and measure efficacies of different egress strategies under various infrastructure disruption scenarios. A real-world inspired use case is used to demonstrate the usefulness of SIM-DISRUPT in planning egress under various operational conditions.","cites":"0","conferencePercentile":"48.34834835"},{"venue":"Winter Simulation Conference","id":"1c4ea7a4e36533556463fb81e19665297672c863","venue_1":"Winter Simulation Conference","year":"2016","title":"An agent-based approach to human migration movement","authors":"Larry Lin, Kathleen M. Carley, Shih-Fen Cheng","author_ids":"2657785, 1702030, 2089330","abstract":"How are the populations of the world likely to shift? Which countries will be impacted by sea-level rise? This paper uses a country-level agent-based dynamic network model to examine shifts in population given network relations among countries, which influences overall population change. Some of the networks considered include: alliance networks, shared language networks, economic influence networks, and proximity networks. Validation of model is done for migration probabilities between countries, as well as for country populations and distributions. The proposed framework provides a way to explore the interaction between climate change and policy factors at a global scale.","cites":"0","conferencePercentile":"48.34834835"},{"venue":"Winter Simulation Conference","id":"1b04b097897c8752821ccfb434fb1db1edea8e4f","venue_1":"Winter Simulation Conference","year":"2014","title":"Enabling fine-grained load balancing for virtual worlds with distributed simulation engines","authors":"Arthur Valadares, Cristina V. Lopes, Huaiyu Liu","author_ids":"1694487, 8265496, 2882764","abstract":"Virtual worlds are general-purpose real-time simulation of three-dimensional environments, and serve for several purposes, such as physics simulation, collaboration, and entertainment. Due to the real-time nature of these simulations, scaling the number of in-world entities and interacting users is challenging. In this paper we present a novel approach to scalable virtual worlds, combining two dimensions of workload partitioning: space and operations. We present this new design as the Distributed Scene Graph with microcells (DSG-M), and evaluate our approach in a distributed physics intensive evaluation aimed at testing two hypothesis: (1) the space partitioning approach improves scalability by balancing the load of an overwhelmed physics dedicated simulator; and (2) simulation precision can be maintained by assigning read-only spaces near the partition borders. Results show evidence to confirm both hypotheses, and of successfully scaling the simulation of an overwhelming workload.","cites":"3","conferencePercentile":"92.34104046"},{"venue":"Winter Simulation Conference","id":"c4cde48562dac11bcdb90d84344adf563383ea52","venue_1":"Winter Simulation Conference","year":"2002","title":"Transportation and material handling: solving logistics and transportation problems in a job shop","authors":"Kambiz Farahmand, Arun Balasubramanian","author_ids":"2935131, 2187214","abstract":"A discrete event simulation model was developed to study the flow of material and product in a shop floor. It uses real time data available from a job shop sole dedicated to noncommercial contracts and as such deals with very seasonal demand. The objective of this model is to provide the shop with a decision support tool that will assist in evaluating the movement of products throughout the shop. The simulation will be useful in assessing the length of queues formed at each shop as well as in pointing out bottlenecks. Actual operational and flow data are utilized in developing the model. The simulation is implemented using the Arena software (Kelton 1997). In effect, the model is to be used for a better understanding of operation of the shop floor and better utilization of all the available resources.","cites":"0","conferencePercentile":"19.0647482"},{"venue":"Winter Simulation Conference","id":"c3eac9162f6d4e381fa0056096b663225122d274","venue_1":"Winter Simulation Conference","year":"1999","title":"Enterprise simulations: theoretical foundations and a practical perspective","authors":"Thomas W. Mastaglio","author_ids":"1894065","abstract":"Simulating business enterprises is the next major application approach to using simulation technology effectively. Although the term enterprise simulation or something similar is being use with ever-increasing frequency the field lacks a clear definition and discussion of the theoretical basis for what is meant by the term. In this paper I offer my concepts and ideas of how we encapsulate this notion and what theoretical foundations can help us come to a common understanding and eventually help articulate a clear and agreed upon definition of the concept of an enterprise simulation.","cites":"2","conferencePercentile":"31.63716814"},{"venue":"Winter Simulation Conference","id":"04105fd1b83ad4fd9875eb71a2b4780a2d72c090","venue_1":"Winter Simulation Conference","year":"2006","title":"The role of composition and aggregation in modeling macromolecular regulatory networks","authors":"Clifford A. Shaffer, Ranjit Randhawa, John J. Tyson","author_ids":"1758750, 3333411, 1794360","abstract":"Today's macromolecular regulatory network models are small compared to the amount of information known about a particular cellular pathway, in part because current modeling languages and tools are unable to handle significantly larger models. Thus, most pathway modeling work today focuses on building small models of individual pathways since they are easy to construct and manage. The hope is someday to put these pieces together to create a more complete picture of the underlying molecular machinery. While efforts to make large models benefit from reusing existing components, unfortunately, there currently exists little tool or representational support for combining or composing models. We have identified four distinct modeling processes related to model composition: fusion, composition, aggregation, and flattening. We present concrete proposals for implementing all four processes in the context of the Systems Biology Markup Language (SBML).","cites":"6","conferencePercentile":"74.76038339"},{"venue":"Winter Simulation Conference","id":"4d61a36644f96ca263fad23c281f04d4467dcd78","venue_1":"Winter Simulation Conference","year":"2012","title":"Using simulation and rough set learning to detect fault location in distribution network","authors":"Wei Wu, Feng Jin, Wen Jun Yin, Ming Zhao, Lei Ye","author_ids":"2581478, 2383033, 1999741, 1736537, 3869098","abstract":"Fault occurs owning to a variety of reasons in distribution network, such as equipment failure, overloading, tree, vehicle etc. It is very important for utility to detect the fault location as quickly as possible for helping to reduce the outage time. This paper proposed a method for distribution network fault location diagnosis which employs simulation and rough set learning. Based on the topology structure of distribution network and the probability model of equipment failure, the simulation model is firstly built for training the sample data. The rough set theory is applied to establish the rules of the relationship between outage zone and the equipment failure. And the enhanced learning process is used to improve the completeness of rules library. The numerical testing results are also presented to illustrate the method.","cites":"0","conferencePercentile":"23.30097087"},{"venue":"Winter Simulation Conference","id":"05bbcf42ce4703536e88d69b005a12aa68efa34e","venue_1":"Winter Simulation Conference","year":"2016","title":"CADIS: Aspect-Oriented architecture for collaborative modeling and simulation","authors":"Arthur Valadares, Cristina V. Lopes, Rohan Achar, Mic Bowman","author_ids":"1694487, 8265496, , 6940604","abstract":"The development of large and complex simulated models often requires teams to collaborate. One approach is to break a large model into independently developed partial models that, when combined, capture the overall behavior. However, maintaining consistent world state across independently developed simulations is a challenge. In this paper, we introduce the Collaborative Aspect-Oriented Distributed Interactive Simulation (CADIS) architecture and development platform. CADIS embodies a new paradigm for integrating independently developed time-discrete partial models and simulations, focusing on transparently maintaining synchronized shared state. Data is pulled and instantiated in the beginning of each time step, and pushed at the end of each time step. An urban simulation is used to demonstrate CADIS capabilities and performance. We show how simple optimizations can bring the performance of the framework to acceptable levels, making CADIS a viable modeling and simulation methodology supporting separation of concerns.","cites":"0","conferencePercentile":"48.34834835"},{"venue":"Winter Simulation Conference","id":"dfbeb4bde8ae49be63f0e2541bc8d51f3982ba35","venue_1":"Winter Simulation Conference","year":"2016","title":"Extended Kernel Regression: A multi-resolution method to combine simulation experiments with analytical methods","authors":"Ziwei Lin, Andrea Matta, Na Li, J. George Shanthikumar","author_ids":"3406923, 2314648, 1748656, 1751375","abstract":"Simulation is widely used to predict the performance of complex systems. The main drawback of simulation is that it is slow in execution and the related compute experiments can be very expensive. On the other hand, analytical methods are used to rapidly provide performance estimates, but they are often approximate because of their restrictive assumptions. Recently, Extended Kernel Regression (EKR) has been proposed to combine simulation with analytical methods for reducing the computational effort. This paper has different purposes. Firstly, EKR is tested on different cases and compared with other techniques. Secondly, two different methods for calculation of confidence band are proposed. Numerical results show that the EKR method provides accurate predictions, particularly when the computational effort is low. Results also show that the performance of the two confidence band methods depends on the case analyzed. Thus, further studies are necessary to develop a robust method for confidence band calculation.","cites":"0","conferencePercentile":"48.34834835"},{"venue":"Winter Simulation Conference","id":"e4393942a2640117fc54b407523a0914a3c2a267","venue_1":"Winter Simulation Conference","year":"2015","title":"Quantifying the influence of temperature setpoints, building and system features on energy consumption","authors":"Ali Ghahramani, Kanu Dutta, Zheng Yang, Gokce Ozcelik, Burcin Becerik-Gerber","author_ids":"2383835, 3199059, 1785641, 2876036, 1844090","abstract":"HVAC systems are the major energy consumers in commercial buildings in the United States. Selection of setpoints impacts the amount of energy consumed by these systems. However, the influence of temperature setpoints on energy consumption and the potential energy savings are not yet fully identified. Through simulation this paper provides a systematic approach for quantifying the influence of different factors (i.e., construction category, climate, setpoint, and deadband) on building energy consumption. We implemented the approach on the medium-sized DOE reference office building of three construction categories in five climates using the EnergyPlus software. N-way ANOVA analysis ranked the factors as from the most influential to the least influential as: (1) construction category, (2) climate, (3) deadband, and (4) setpoint. Further analyses showed extending the deadband from 3 K to 6 K reduces energy consumption by 16.2%. Optimal annual setpoints varied across climates, and could lead to 6.63% average savings.","cites":"1","conferencePercentile":"82.72727273"},{"venue":"Winter Simulation Conference","id":"0cae95e6309ead944fab229739defc9703fe7836","venue_1":"Winter Simulation Conference","year":"2010","title":"3D CAD modeling and visualization of the tunnel construction process in a distributed simulation environment","authors":"Yang Zhang, Elmira Moghani, Simaan M. AbouRizk, Siri Fernando","author_ids":"4449904, 2390371, 1736325, 3123495","abstract":"Computer simulation has been successfully implemented in the construction industry for the decision making process; however, current modeling approaches focus mainly on process modeling and cannot integrate or assimilate information from different software. For a more complex project, 3D CAD models will help decision makers to improve integrity between design and construction process simulation, and process visualization will help them to detect deficiencies during the construction phase. High Level Architecture-based distributed simulation as a new simulation technique in construction facilitates integration and collaboration among various simulation models and allows us to standardize the integration process for computer software. It therefore enables us to integrate CAD models and 3D animation to visually control as-planned and as-built information. This paper proposes a methodology to integrate 3D modeling and visualization techniques with the tunneling construction simulation. The feasibility of the proposed methodology is validated in a real-life tunnel project in Edmonton, Alberta, Canada.","cites":"2","conferencePercentile":"58.88157895"},{"venue":"Winter Simulation Conference","id":"f9d4f557c709960fe3c8d148a67216f2b1f13f69","venue_1":"Winter Simulation Conference","year":"1991","title":"Generating customized text and graphics in the COMET explanation testbed","authors":"Michael Elhadad, Steven K. Feiner, Kathleen McKeown, Dorée D. Seligmann","author_ids":"1754680, 1809403, 1727037, 2034307","abstract":"For many applications that must explain reasoning, processes, or plans to their users, multimedia explanations are more effective than text or pictures alone the use of two or more modalities makes it possible to communicate the same or complementary itiormation in different ways. While hypermedia is a currently available technology for providing such explanations, conventional implementations do not adequately address the needs of different users. In this paper, we show how COMET, a system that uses natural language and graphics generation components to produce the text and pictures of its explanations dynamically, can create a variety of different explanations to explain the s:lme concepts, and thus better meets the needs of ditlerent users. We focus on four ways in which COMET produces dit%erent explanations for the same concepts, describing how it is influenced by the plan containing the concept, by user background knowledge, by previous dialogue, and by interactive exploration of an explanation.","cites":"1","conferencePercentile":"38.81118881"},{"venue":"Winter Simulation Conference","id":"ac8404d04fad0220ad0f33fc5499736c94e61f44","venue_1":"Winter Simulation Conference","year":"2005","title":"Extend SRML schema based on DEVS: an executable DEVS language","authors":"Chen Liu, Qun Li, Weiping Wang, Yifan Zhu","author_ids":"4773812, 1686663, 1958841, 2079257","abstract":"This paper analyzes the significance of the representation and reusability of SRML when being used in simulation models as well as its drawbacks. The paper also discusses the ways to extend SRML schema based on DEVS. The emphasis is placed on the elaboration of mapping DEVS onto SRML schema to formulate SRML's basic syntax and semantics for the structure and behavior representation of atomic model and coupled model. The model structure, such as property, input interface, output interface and sub-model composition, are described by a group of XML marks. The model behavior, such as external transition, internal transition, output and time-advance functions are described by script language and a group of standard interface offered by SRML simulator in Script marks. The paper then reviews the SRML element architecture and finally gives a simulation demo of using SRML to build differential equation model.","cites":"1","conferencePercentile":"40.31100478"},{"venue":"Winter Simulation Conference","id":"5b028e492816b28f50b3d82c049b263b6901e023","venue_1":"Winter Simulation Conference","year":"2015","title":"Iterative reassignment algorithm: leveraging occupancy based HVAC control for improved energy efficiency","authors":"Zheng Yang, Ali Ghahramani, Burcin Becerik-Gerber","author_ids":"1785641, 2383835, 1844090","abstract":"Building occupancy significantly impacts HVAC system energy consumption. Occupancy is stochastic in nature, and occupancy from different spaces could be heterogeneous, resulting in heterogeneous distributions of loads, therefore HVAC energy inefficiencies. This paper proposes a framework for conditionally redistributing loads by reassigning occupants at the building level for elevating the effects of occupancy based control, and simulates a real-world office building for validation. Predefined constraints are integrated, and an agglomerate hierarchical clustering-based reassignment algorithm is designed for iteratively assigning occupancy with zone adjacency, orientation, and HVAC layout being considered. Simulation results show that the integration of occupancy based control and occupant reassignment could save up to 9.6% of energy compared to simply applying occupancy based control (18.9% compared to the baseline control that is used in the building. The proposed framework helps reducing unnecessary loads and improves energy efficiency through better-informed decision making for occupancy based HVAC controls. 1 INTRODUCTION With the ever-rising energy demands and diminishing supplies of nonrenewable energy resources, sustainability and energy conservation have become increasingly important topics. In the U.S., approximately 40% of the total energy consumption is attributed to buildings, with 45.8% consumed by commercial buildings (USDOE 2014). Commercial buildings are promising targets for increasing energy efficiency, considering their long lifespan, rapid increase of area, large amount of CO 2 emissions, high intensity of energy consumption per square foot, and lack of incentives for energy reduction, (USDOE 2014; ACEEE 2013). Since more than 40% of commercial building energy is used by HVAC (Heating, Ventilation, and Air Conditioning) systems to maintain comfortable and healthy indoor thermal environments, efficiency for HVAC systems should be given the priority (USDOE 2014). In general, there is a difference between nominal demands, amount of energy required to maintain the thermal conditions of spaces, and actual demands, amount of energy required to maintain the thermal conditions for occupants. It has been widely recognized that occupancy is one of the most important factors impacting actual demands for HVAC systems. There is great potential for energy efficiency if occupancy is considered in the operations of HVAC systems since one way of improving efficiency is to minimize the difference between actual demands and nominal demands (Kwok et al. 2011).","cites":"1","conferencePercentile":"82.72727273"},{"venue":"Winter Simulation Conference","id":"8e73a6901f426d8d1ec1d90c283d145e9fbf4b17","venue_1":"Winter Simulation Conference","year":"2014","title":"Coupling occupancy information with HVAC energy simulation: a systematic review of simulation programs","authors":"Zheng Yang, Burcin Becerik-Gerber","author_ids":"1785641, 1844090","abstract":"Adjusting for occupancy, when controlling an HVAC (Heating, Ventilation, and Air Conditioning) system, is an important way to realize demand-driven control and improve energy efficiency in buildings. Energy simulation is an efficient way to examine the effects of occupancy on a building's energy consumption and a cost-effective and non-intrusive solution to test occupancy-based HVAC control strategies. However, more than one hundred building energy simulation programs are used in research and practice, and large discrepancies exist in simulated results when different simulation programs are used to model the same building under same conditions. This paper evaluates different methods and sequences of coupling occupancy information with building HVAC energy simulation. A systematic review is conducted to analyze five energy simulation programs, including DOE-2, EnergyPlus, IES-VE, ESP-r, and TRNSYS, from the following five perspectives of heat transfer and balance, load calculation, occupancy-HVAC system connection, HVAC system modeling, and HVAC system simulation process.","cites":"2","conferencePercentile":"83.09248555"},{"venue":"Winter Simulation Conference","id":"01fd99686af632531c9c9fa22028ec0f30846c4b","venue_1":"Winter Simulation Conference","year":"2015","title":"An agent-based model of edit wars in wikipedia: how and when is consensus reached","authors":"Arun Kalyanasundaram, Wei Wei, Kathleen M. Carley, James D. Herbsleb","author_ids":"3143456, 1725923, 1702030, 1705550","abstract":"Edit wars are conflicts among editors of Wikipedia when editors repeatedly overwrite each other's content. Edit wars can last from a few days to several years before reaching consensus often leading to a loss of content quality. Therefore, the goal of this paper is to create an agent-based model of edit wars in order to study the influence of various factors involved in consensus formation. We model the behavior of agents using theories of group stability and reinforcement learning. We show that increasing the number of credible or trustworthy agents and agents with a neutral point of view decreases the time taken to reach consensus, whereas the duration is longest when agents with opposing views are in equal proportion. Our model can be used to study the behavior of members in online communities and to inform policies and guidelines for participation.","cites":"1","conferencePercentile":"82.72727273"},{"venue":"Winter Simulation Conference","id":"214766fa92a5e027d2ff6dae94fd84fcc8d6a6e2","venue_1":"Winter Simulation Conference","year":"2005","title":"Building modeling tools that support verification, validation, and testing for the domain expert","authors":"Nicholas A. Allen, Clifford A. Shaffer, Layne T. Watson","author_ids":"3004337, 1758750, 5972282","abstract":"Successfully building a model requires a combination of expertise in the problem domain and in the practice of modeling and simulation (M&amp;S). Model verification, validation, and testing (VV&T) are essential to the consistent production of models that are useful and correct. There are significant communities of domain experts that build and use models without employing dedicated modeling specialists. Current modeling tools relatively underserve these communities, particularly in the area of model testing and evaluation. This paper describes several techniques that modeling tools can use to support the domain expert in performing VV&T, and discusses the advantages and disadvantages of this approach to modeling.","cites":"6","conferencePercentile":"79.18660287"},{"venue":"Winter Simulation Conference","id":"08dbf1c82e1a711ec5c5ae0520b8ca16e125af82","venue_1":"Winter Simulation Conference","year":"2005","title":"Simulating users to support the design of activity management systems","authors":"Julie S. Weber, Martha E. Pollack","author_ids":"2862265, 1801194","abstract":"We describe a simulation system that models the user of a calendar-management tool. The tool is intended to learn the user's scheduling preferences, and we employ the simulator to evaluate learning strategies. The simulated user is instantiated with a set of preferences over local and global features of a schedule such as the level of importance of a particular meeting and the amount of preparation time available before it is to begin. The system then processes a set of simulated meeting requests, and over time and through user feedback, it learns the user's preferences, affording it the ability to thereafter manage the user's schedule more autonomously.","cites":"3","conferencePercentile":"63.99521531"},{"venue":"Winter Simulation Conference","id":"22776e6e2115c7aff3ea2dedd01af147d80caa73","venue_1":"Winter Simulation Conference","year":"2013","title":"Simulation-based overhead-crane scheduling for a manufacturing plant","authors":"Tao Zhang, Oliver Rose","author_ids":"1743147, 1804920","abstract":"The overhead-crane scheduling problem with spatial constraints has attracted extensive attention and lots of approaches are introduced to solve the problem. As we all know, in the manufacturing plant the crane scheduling is one part of the production scheduling. However, most of approaches concern the crane scheduling in isolation. In this paper, we include the crane scheduling problem into the production scheduling environment and combine them together to obtain an integrated schedule. A simulation-based optimization solves this integrated scheduling problem. A genetic algorithm is introduced to determine the allocation of machines and cranes. A simulation model referring to a queuing network is used to evaluate the crane and machine allocation results and provides the fitness value for the genetic algorithm. The sequences of operations (processing and transporting) on each machine and each crane are determined by using the dispatching rule LPT. A heuristic deals with crane collision events.","cites":"1","conferencePercentile":"59.26470588"},{"venue":"Winter Simulation Conference","id":"5f01411f825a03a00c9302e09b98f780000e88fa","venue_1":"Winter Simulation Conference","year":"2014","title":"Using agent-based simulation to analyse the effect of broadcast and narrowcast on public perception: a case in social risk amplification","authors":"Bhakti S. S. Onggo, Jerry S. Busby, Yun Liu","author_ids":"1788304, 3150912, 1801632","abstract":"Individuals often use information from broadcast news (e.g. media) and narrowcast news (e.g. personal social network) to form their perception on a certain social issue. Using a case study in social risk amplification, this paper demonstrates that simulation modelling, specifically agent-based simulation, can be useful in analysing the effect of broadcast and narrowcast processes on the formation of public risk perception. The first part of this paper explains the structure of a model that allows easy configuration for testing various behaviours about which the empirical literature cannot make definitive predictions. The second part of this paper discusses the effect of personal social network and the role of media in the dynamics of public risk perception. The results show the undesirable effect of the extreme narrowcast process in society and a media that simply broadcasts the average public risk perception.","cites":"2","conferencePercentile":"83.09248555"},{"venue":"Winter Simulation Conference","id":"25acbfaa845fdd1957a550b59405755e4a372d84","venue_1":"Winter Simulation Conference","year":"2008","title":"Multi-Agent Resource Allocation (MARA) for modeling construction processes","authors":"Yang Liu, Yasser Mohamed","author_ids":"1750084, 3124093","abstract":"Multi-Agent Resource Allocation (MARA) is a field developing solutions to the problem of distributing a number of resources amongst multiple agents. This field has interdisciplinary characteristics and relates to a wide range of applications, such as industrial procurement, scheduling and network routing. Many construction operations involve entities sharing and competing for limited resources. The decision to allocate these resources to entities usually has a significant impact on the schedule and cost of these operations. The dynamic and continuously changing nature of construction operations justifies the need for decision support tools with high adaptability and handling of uncertainty which is featured by MARA. This paper presents the main elements and techniques in MARA and discusses a sample case applying these techniques for the modeling of industrial construction assembly processes, also presents the conceptual model of the sample case and a prototype implementation of that model using Repast multi-agent simulation package.","cites":"0","conferencePercentile":"15.57591623"},{"venue":"Winter Simulation Conference","id":"5236e5bf0685999befcbdcd0af18573210c289e7","venue_1":"Winter Simulation Conference","year":"2016","title":"Time bound control in a stochastic dynamic wafer fab","authors":"Tao Zhang, Falk Stefan Pappert, Oliver Rose","author_ids":"1743147, 2949223, 1804920","abstract":"Time bounds are a common constraint in wafer fabs. Releasing wafer into a time bound sequence leads to a tradeoff between capacity loss and yield loss due to violations. Two common approaches to tackle this challenge are static scheduling and dispatching rules. While static scheduling faces problems with the dynamic and stochastic nature of a wafer fab dispatching rules often lack the global perspective causing either unnecessary violations or capacity waste. In this paper, we present an approach taking elements of both these solution approaches to address time bound constraints and compare it to existing approaches. 1 INTRODUCTION Semiconductor manufacturing is a very complex production environment. Besides other challenging features, time bounds are commonly introduced to the system to safeguard against yield and quality loss due to particle contamination and oxidation. Time bounds basically define a sequence of processing steps, which needs to be completed within a certain time frame. There are different ways to define the start and end points of a time bound. For the purpose of this paper, we will define the beginning of a time bound sequence as the moment a lot/batch leaves the first preparation step. The end is considered to be the moment when the lot/batch enters the last tool needed in the sequence. Figure 1 shows some possible time bound configurations. Time bounds may be set between two consecutive steps, i.e., T1 in Figure 1, or between two non-adjacent steps, i.e., T3. Moreover, sometimes two or more time bounds are required together and may overlap, i.e., T3 and T4. Complex nested time bounds may form in this way. Klemmt and Mönch (2012) presented more details on interactions of time bounds. step1 step2 step3 step4 stpe5 T1 T2 T3 T4 Figure 1: Time bounds and their combinations in wafer fabs. To ensure successful compliance to these time bounds, tools are reserved or even kept empty. Time bound control strategies therefore try to strike a balance between capacity loss and yield loss due to violations. Basically, time bound control ensures that lots can be finished within time bounds, which is done by deciding whether lots should start into the first step of a time bound sequence. If a lot starts at the first","cites":"1","conferencePercentile":"97.8978979"},{"venue":"Winter Simulation Conference","id":"44cbc9119049f4b31d2388d53481845096240b44","venue_1":"Winter Simulation Conference","year":"2015","title":"Flexible job-shop scheduling with overlapping machine sets","authors":"Tao Zhang, Shufang Xie, Oliver Rose","author_ids":"1743147, 1889683, 1804920","abstract":"In practice, the complexity of the flexible job-shop scheduling problem is quite large, i.e., it is often impossible to find the optimal solution in a reasonable time. But for small problems the optimal solution can be found in a very short time. In our study, a simulation-based segmentation procedure divides the problem into several small subproblems, and then a branch and bound method is used to solve the subproblems one after another. The solutions of the subproblems make up the solution of the whole problem. A method to determine the size of the subproblem is provided. The heuristic for the branching is developed from the machine overlapping features. The experimental results show that the approach performs better than some decision rules. 1 INTRODUCTION In the flexible job-shop scheduling problem (FJSP), an operation may be processed on several machines. These machines form a machine set. Comparing to the job-shop scheduling problem, the raised issue is the machine allocation, i.e., assigning each operation to a machine from the machine set. In this study, we will consider a special case in which the machine sets can be overlapping. In other words, one machine can process different types of operations. This adds some new features to the problem. The FJSP is one of the most important combinatorial optimization problems. It has been proved to be a NP-hard problem. Usually FJSP is formularized as a mixed binary integer linear programming problem (MBILP) (Demir and Kürşat İşleyen 2013) in which the machine allocation variables are binary and the starting times of the operations are continuous. The disjunctive constraint relaxation also generates some binary variables. There are some exact methods to solve the MBILP problem, such as branch and bound (B&B) (Brucker, Jurisch and Sievers 1994, Pan and Chen 2005), cutting-plane, branch and cut (Karimi-Nasab and Seyedhoseini 2013), and so on. Most of these methods are based on the simplex algorithm which is not a polynomial time algorithm for linear programming. They are also no polynomial time algorithms for MBILP. Therefore, because the size of the practical FJSP can become very large, these methods are unable to find an optimal solution in a reasonably short time. Thus, in order to shorten the computing time, researchers are trying to find an approximate optimal solution instead of the exact solution. Hence, a variety of heuristic procedures and meta-heuristic procedures have been used. Decision rules are typical heuristic procedures (Holthaus …","cites":"0","conferencePercentile":"37.01298701"},{"venue":"Winter Simulation Conference","id":"606eed0ef730facea103252539f357197f0d210a","venue_1":"Winter Simulation Conference","year":"2014","title":"Reconstructing input models via simulation optimization","authors":"Aleksandrina Goeva, Henry Lam, Bo Zhang","author_ids":"2816338, 4269441, 1696318","abstract":"In some service operations settings, data are available only for system outputs but not the constituent input models. Examples are service call centers and patient flows in clinics, where sometimes only the waiting time or the queue length data are collected for economic or operational reasons, and the data on the \"input distributions\", namely interarrival and service times, are limited or unavailable. In this paper, we study the problem of estimating these input distributions with only the availability of the output data, a problem usually known as the inverse problem, and we are interested in the context where stochastic simulation is required to generate the outputs. We take a nonparametric viewpoint, and formulate this inverse problem as a stochastic program by maximizing the entropy of the input distribution subject to moment matching. We then propose an iterative scheme via simulation to approximately solve the program.","cites":"2","conferencePercentile":"83.09248555"},{"venue":"Winter Simulation Conference","id":"ae18735c8a4dbc3b68fb432bbd20f00414d47537","venue_1":"Winter Simulation Conference","year":"2003","title":"Algorithms and analyses: pre-reckoning algorithm for distributed virtual environments","authors":"Thomas P. Duncan, Denis Gracanin","author_ids":"2171200, 1709677","abstract":"This paper proposes a pre-reckoning algorithm for distributed virtual environments. First, an overview of dead reckoning techniques used in distributed virtual environments is provided. The benefits and drawbacks of implementing dead reckoning within specific types of distributed virtual environments are discussed. An alternative to traditional dead reckoning techniques used in DIS-compliant distributed virtual environments is proposed. The alternative, referred to as \"pre-reckoning,\" seeks to significantly reduce prediction error with a minimal increase in the number of entity state update packets issued. The performance of the pre-reckoning algorithm is compared to one of the DIS standard algorithms for location prediction. The test cases are based upon a game-based environment where the movements of participants are influenced by physical boundaries.","cites":"3","conferencePercentile":"76.90839695"},{"venue":"Winter Simulation Conference","id":"b3c467e8f82a7c90c2102bde8241a3d170587385","venue_1":"Winter Simulation Conference","year":"2015","title":"Adaptive routing and guidance approach for transportation evacuation","authors":"Bo Zhang, Wai Kin Chan, Satish V. Ukkusuri","author_ids":"1696318, 2135975, 6874623","abstract":"We propose an adaptive routing and guidance approach called Adjacent Node Score (ANS). This approach is integrated with an agent-based simulation model and avoids several common assumptions made in conventional evacuation models. ANS does not assume altruistic travelers and considers traffic interaction, variable link travel times, and their dependencies. This makes it more realistic than network flow models and stochastic routing algorithms. ANS can generate effective and good solutions at a low computational cost. It only requires local network information for routing and guidance. ANS can be easily implemented in practice. We test the ANS method on two networks and compare it with other four network routing strategies including the user-equilibrium condition, myopic, aggressive, and a naïve strategy that is based on static network information. Experimental results show that ANS can disperse highly concentrated traffic flows and reduce network clearance time compared with other methods.","cites":"0","conferencePercentile":"37.01298701"},{"venue":"Winter Simulation Conference","id":"0944787583dc2a805c4a179d796684cbf01a3aa4","venue_1":"Winter Simulation Conference","year":"2015","title":"A computational model of team assembly in emerging scientific fields","authors":"Alina Lungeanu, Sophia Sullivan, Uri Wilensky, Noshir S. Contractor","author_ids":"3337347, 2833983, 7137713, 6203716","abstract":"This paper examines the assembly of interdisciplinary teams in emerging scientific fields. We develop and validate a hybrid systems dynamics and agent-based computational model using data over a 15 year period from the assembly of teams in the emerging scientific field of Oncofertility. We found that, when a new field emerges, team assembly is influenced by the reputation and seniority of the researchers, prior collaborators, prior collaborators' collaborators, and the prior popularity of an individual as a collaborator by all others. We also found that individuals are more likely to assemble into an Oncofertility team when there is a modicum of overlap across its global ecosystem of teams; the ecosystem is defined as the collection of teams that share members with other teams that share members with the Oncofertility team. Interdisciplinary scientific teams are frequently at the root of innovative breakthroughs (Uzzi and Spiro 2005). As a result, understanding the mechanisms behind the assembly of scientific teams has attracted scholarly interest. A first step has been to examine the compositional and relational mechanisms affecting the formation of scientific teams (Guimera et al. Most prior research has treated teams as well-defined entities with a stable set of members who work interdependently toward a common goal (Cohen and Bailey 1997). However, the reality is that most knowledge workers hold membership in multiple teams simultaneously (O'Leary, Mortensen, and Woolley 2011), making membership in an ecosystem consisting of multiple teams with overlapping members the rule rather than the exception. Such ecosystems are dynamic and complex networks of prior collaborations (Poole and Contractor 2011) which enable and constrain the assembly of future scientific teams. Yet the effects of the ecosystem on team assembly have not been explored, perhaps because it entails complex statistical analyses across multiple levels. In response to this research gap we develop a multi-theoretical multilevel model that incorporates the impact of ecosystem factors on the assembly of interdisciplinary teams. Specifically, we draw upon theories on the formation of social networks (Contractor, Wasserman, and Faust 2006) and their application to the assembly of teams (Contractor 2013), as well as the more extensive research on groups and teams (Levine and Moreland 1998), to examine factors leading to assembly of interdisciplinary scientific teams. We implement a hybrid-agent-based and system dynamics-computational model that articulates the multilevel multi-theoretical mechanisms team assembly. We empirically validate our model with data on the assembly of teams in the emerging scientific …","cites":"0","conferencePercentile":"37.01298701"},{"venue":"Winter Simulation Conference","id":"2afe3425fd11322f9f1a4f9fbfd98d7a76289a9d","venue_1":"Winter Simulation Conference","year":"2014","title":"Job release under due date constraints in job shops with time-varying product mix","authors":"Tao Zhang, Oliver Rose","author_ids":"1743147, 1804920","abstract":"Job shops produce products on the basis of manufacturing orders which specify the due date and the volume. The orders accepted by the shop floor are put into a job pool. The job release decides when to start each job in the pool. It attempts not only to balance this time-varying demand against available capacity, but also manages to meet the due date constraints. The general job release policies, such as output-based or workload-based policies, have poor due date performance. A multi-time-periods release policy is proposed to match the time-varying demand. The due date pressure is distributed to every period. In each time period a near optimal short-term throughput of each product is obtained by an optimization model. The optimization problem is solved by an improved ant colony algorithm. In iteration processes of the algorithm ants are evaluated by the simulation which involves the setup and breakdown of machines.","cites":"0","conferencePercentile":"27.4566474"},{"venue":"Winter Simulation Conference","id":"8381a8ba19229f4649978852c9a7ce00f9a23e7a","venue_1":"Winter Simulation Conference","year":"2016","title":"Towards airspace rules for future UAS-based delivery","authors":"Mariusz A. Balaban, Thomas W. Mastaglio, Christopher J. Lynch","author_ids":", 1894065, 1760421","abstract":"The growth of the nascent UAS industry will be affected by the airspace coordination rules between drones because these rules can impact business profitability. Few analyses have been reported to support design of commercial UAS operations in low-altitude commercial urban airspace. Analysis of minimum horizontal separation is critical for designing safe and efficient UAS delivery systems. In this paper a constructive simulation model is used to analyze and evaluate proposed UAS airspace traffic. A high density of delivery drones could create a bottleneck in a drone-based supply chain very quickly, especially when a high minimum horizontal separation standard is required. This paper proposes a simple idea on how to organize low-altitude UAS traffic, and evaluates the idea using a simulation model. Additional implications and future work needed in relation to UAS-based delivery are also discussed. 1 INTRODUCTION This paper is concerned with the lower portion of Class G airspace, which includes elevations up to 1,200 feet above the surface where there is no Air Traffic Control (ATC) designated to manage that airspace (FAA 2015). Current Federal Aviation Agency (FAA) regulations do not facilitate pro-business climate for UAS-based low-altitude delivery systems. FAA requires aircraft to be 1,000 feet above the highest obstacle within a horizontal distance of 4 nautical miles from the course to be flown and does not provide enabling guidance for the use of autonomous UAS in this airspace (FAA 2015). The lack of FAA rules does not allow for explicit description of future UAS-related businesses operations, but this indicates an opportunity to investigate management options by using simulation models that can inform the FAA about business perspectives related to this endeavor. More well-defined system and structural rules are needed to both guarantee safety and provide economic justification due to potential crowding of future low-altitude urban airspace. For instance, a mix of centralized and decentralized controls of UAS could offer both resilient and redundant operation. Infrastructure that could enable safe and widespread use of low-altitude airspace for UAS operations does not yet exist; therefore, NASA has initiated research, within the 2014-2020 timeline, that should lead to the development of a prototype UAS traffic management (UTM) solution (Kopardekar 2014). Low altitude UTM could provide services such as dynamic configuration, dynamic geo-fencing, severe weather and wind avoidance, congestion management, terrain avoidance, route planning and rerouting , separation management, sequencing and spacing, and contingency management (Kopardekar 2014). Initially, the UTM system is …","cites":"0","conferencePercentile":"48.34834835"},{"venue":"Winter Simulation Conference","id":"01ef83e63b0e0e591e886963fcd6b9377a1d25e4","venue_1":"Winter Simulation Conference","year":"2002","title":"Weapon and communication systems: modeling the wireless network architecture of land warrior","authors":"Fernando Maymi, John R. Surdu, Andrew Hall, Ryan Beltramini","author_ids":"3274416, 2962160, 7406226, 1991436","abstract":"The United States Army is designing and implementing a revolutionary advance in the combat power of individual infantrymen on the battlefield: Land Warrior. In Land Warrior, each soldier becomes a node in a wireless local area network (WLAN). In order to account for likely losses of line of site between soldiers, the On Demand Multicast Routing Protocol (ODMRP) is used. The purpose of this research was to construct a simulation study to determine whether the communications architecture of Land Warrior was sufficiently scalable to use in large Army units. This paper describes the input analysis conducted to determine probability distributions used to generate message traffic. This paper also describes the development of the simulation model used to determine the scalability of the Land Warrior communications architecture.","cites":"0","conferencePercentile":"19.0647482"},{"venue":"Winter Simulation Conference","id":"7ef64a7bb4fceb3d76149bb8d87b20f63bdeebd4","venue_1":"Winter Simulation Conference","year":"2012","title":"Developing an agent-oriented parallel simulator for production processes","authors":"Tao Zhang, Oliver Rose","author_ids":"1743147, 1804920","abstract":"Within the framework of agent-oriented parallel simulation, an agent-based model of production processes including release agents, tool group agents and job agents is built. The model, the data collector, and the simulation controller make up the simulator for production processes. The simulation controller is responsible to manage activation points and advance the simulation time. The communications among the agents and the simulation controller are designed in detail. A large variety of dispatch rules and release policies are preset in the model. Data of the production processes are stored in XML files. Applying the simulator to a wafer FAB model, the simulation results already match to the results from commercial simulators like Factory Explorer.","cites":"1","conferencePercentile":"57.03883495"},{"venue":"Winter Simulation Conference","id":"61e3eae5bdc3b5869953d3df5c2ed22c6bf8222e","venue_1":"Winter Simulation Conference","year":"1994","title":"Developing a large-scale distributed interactive simulation system","authors":"Thomas W. Mastaglio","author_ids":"1894065","abstract":"The Close Combat Tactical Trainer (CCIT). is a simulation-based training system being developed using a concurrent engineering approach. industry and government engineers together with prototypical system users comprise the concurrent engineering teams. User representatives are locatexL along with industry, in an integrated development facility where they interact on a daily basis with the rest of the engineering team. CCTT is a large-scale complex simulation its primary purpose is to improve human performance through its use in training. Foeusing on human pCxfOIIIMll(X improvement as a simulation system product mandates a development effort based on usability engineering. Because CCTT has complex Human-Computer Interaction requirements, field users have been integrated throughout the desigq development and evaluation phases of the program.","cites":"2","conferencePercentile":"43.97905759"},{"venue":"Winter Simulation Conference","id":"17513af41d77b00eb337097e2bcf7f6de3c93d2f","venue_1":"Winter Simulation Conference","year":"2005","title":"Using system dynamics for safety and risk management in complex engineering systems","authors":"Nicolas Dulac, Nancy G. Leveson, David Zipkin, Stephen Friedenthal, Joel Cutcher-Gershenfeld, John Carroll, Betty Barrett","author_ids":"2656053, 1777378, 2731149, 2944702, 2485997, 2052966, 2484846","abstract":"This paper presents a new approach to modeling and analyzing organizational culture, particularly safety culture. We have been experimentally applying it to the NASA manned space program as part of our goal to create a powerful new approach to risk management in complex systems. We describe the approach and give sample results of its applications to understand the factors involved in the Columbia accident and to perform a risk analysis of the new Independent Technical Authority (ITA) structure for NASA, which was introduced to improve safety-related decision-making.","cites":"2","conferencePercentile":"53.11004785"},{"venue":"Winter Simulation Conference","id":"086ded2856d75fdb06fd24936697b4aea125eb29","venue_1":"Winter Simulation Conference","year":"2010","title":"Empirical methods for two-echelon inventory management with service level constraints based on simulation-regression","authors":"Lin Li, Karthik Sourirajan, Kaan Katircioglu","author_ids":"1686030, 1789505, 2897089","abstract":"We present a simulation-regression based method for obtaining inventory policies for a two-echelon distribution system with service level constraints. Our motivation comes from a wholesale distributor in the consumer products industry with thousands of products that have different cost, demand, and lead time characteristics. We need to obtain good inventory policies quickly so that supply chain managers can run and analyze multiple scenarios effectively in reasonable amount of time. While simulation-based optimization approaches can be used, the time required to solve the inventory problem for a large number of products is prohibitive. On the other hand, available quick approximations are not guaranteed to provide satisfactory solutions. Our approach involves sampling the universe of products with different problem parameters, obtaining their optimal inventory policies via simulation-based optimization and then using regression methods to characterize the inventory policy for similar products. We show that our method obtains near-optimal policies and is quite robust.","cites":"0","conferencePercentile":"13.32236842"},{"venue":"Winter Simulation Conference","id":"a2b1f4f0571362eeea49cc3e2f9b622c11af870d","venue_1":"Winter Simulation Conference","year":"1998","title":"Simulation Applied to Theme Park Management","authors":"Roland R. Mielke, Adham Zahralddin, Damanjit Padam, Thomas W. Mastaglio","author_ids":"3251953, 2337573, 3218662, 1894065","abstract":"This paper describes the application of computer simulation to a new and interesting problem area, the management of major theme parks. The operation and management of theme parks is becoming continually more difficult and competitive. The level of customer expectation for excitement and quality of experience is increasing at a much greater rate than the public's willingness to accept admission price increases. As a consequence, theme park management is asked to deliver more services, at a faster pace and with higher quality, with fewer and fewer seasonal employees. VMASC has begun to work with two local theme parks, Water Country USA located in Williamsburg, Virginia and operated by Anheuser-Busch, and Kings Dominion located in Richmond, Virginia and operated by Paramount Parks. The objective is to identify management issues and operational problems where simulation may serve as an important tool to assist in the decision-making process.","cites":"6","conferencePercentile":"56.78733032"},{"venue":"Winter Simulation Conference","id":"515b86cfda50b802ab38219ea40d3039602698db","venue_1":"Winter Simulation Conference","year":"2007","title":"Visualization of users' activities in a specific environment","authors":"Zdenek Mikovec, Ivo Malý, Pavel Slavík, Jan Curín","author_ids":"2394609, 2374510, 2307764, 3096483","abstract":"Evaluation of user interface design is usually based on usability testing methods. In this paper we analyzed and described the user behavior in the form of the user model. The user model is built on a data set which was acquired through observation of user behavior. The criterion we use for the evaluation of the usability of interface design is the user cognitive load. We present different tools for visualization, simulation and easier analysis of the user model. Because each of the methods and tools presented use only part of the user model, in the end we present methods on how to use the complete user model to correctly describe user behavior. In order to understand such a complex model we need to have a proper visualization tool. The concept of such a visualization tool is presented at the end of this paper.","cites":"4","conferencePercentile":"71.36363636"},{"venue":"Winter Simulation Conference","id":"33877f230ba88be5ee1b33e647ec3cc025fd2af5","venue_1":"Winter Simulation Conference","year":"2013","title":"Intelligent dispatching in dynamic stochastic job shops","authors":"Tao Zhang, Oliver Rose","author_ids":"1743147, 1804920","abstract":"Dispatching rules are common method to schedule jobs in practice. However, they consider only limited factors which influence the priority of jobs. This limited consideration narrows the rules' scope of application. We develop a new hierarchical dispatching approach based on two types of factors: local factors and global factors, where each machine has its own dispatching rule setup. According to the global factors, the dispatchers divide the state of the manufacturing system into several patterns, and parameterize a neural network for each pattern to map the relationships between the local factors and the priorities of jobs. When making decisions, the dispatchers determine which pattern the current state belongs to. Then the appropriate neural network computes priorities according to the jobs' local factors. The job with the highest priority will be selected. Finally, the proposed approach is introduced on a manufacturing line and the performance is compared to classical dispatching rules.","cites":"0","conferencePercentile":"23.82352941"},{"venue":"Winter Simulation Conference","id":"9d7d31c988242bcb88902db502b534d8538ab1a4","venue_1":"Winter Simulation Conference","year":"2015","title":"An aspect-oriented approach to large-scale urban simulations","authors":"Arthur Valadares, Cristina V. Lopes","author_ids":"1694487, 8265496","abstract":"Within the Modeling and Simulation (M&S) field, a major challenge that lies ahead is integrating massively complex urban simulations. The urban environment is a multifaceted model with many components, such as transportation, land use, and water and power distribution. To produce a high fidelity simulation of a city, all components should interact as they do in the real world. Furthermore, an urban simulation should be within an ecosystem of cities, states, and nations. This study presents an aspect-oriented approach for designing distributed simulations that achieves 2 goals: 1) enables M&S experts to focus on the simulation, not on the platform or on interoperability; and 2) is scalable in terms of simulated entities and models. A middleware called Urban Simulation Platform is proposed, using an aspect-oriented approach to interface between the well known High Level Architecture interoperability standard and the traditional simulation design.","cites":"0","conferencePercentile":"37.01298701"}]}