{"WINTECH.csv":[{"venue":"WiNTECH","id":"52e3ca081af52d8074ba266f267a869a25d2a565","venue_1":"WiNTECH","year":"2014","title":"BeHop: a testbed for dense WiFi networks","authors":"Yiannis Yiakoumis, Manu Bansal, G. Adam Covington, Johan van Reijendam, Sachin Katti, Nick McKeown","author_ids":"2714783, 3088529, 2374209, 2072079, 8439679, 1708241","abstract":"We present BeHop, a wireless testbed for dense WiFi networks often seen in residential and enterprise settings. BeHop aims to provide insights on the operation of dense deployments, and evaluate how different WiFi management strategies affect user experience and network behavior. It has sufficient flexibility to let us try different management techniques and setups (e.g. residential or enterprise, client or infrastructure-driven operation). It is deployed at a university dorm, where it acts as the main network for a diverse set of users and devices, exposing practical insights and implications on the operation of the network. In this paper we discuss the design and implementation of BeHop, and share our early experience over a five-month period.","cites":"10","conferencePercentile":"100"},{"venue":"WiNTECH","id":"022b043870e90bd7e832c3f557ef71bd900484d7","venue_1":"WiNTECH","year":"2014","title":"Towards a characterization of white spaces databases errors: an empirical study","authors":"Ahmed Saeed, Khaled A. Harras, Moustafa Youssef","author_ids":"3390749, 1748216, 1780388","abstract":"Spectrum regulators consider geo-location databases as the most reliable source of spectrum information for White Space Devices (WSDs). Geo-location databases protect TV band incumbents by keeping track of TV transmitters, and their protected service areas based on their location, transmission parameters, and sophisticated propagation models. However, propagation models inaccuracies can cause an overestimation of the protected area of TV transmitters leading to the inefficient usage of white spaces. In this paper, we present a large scale study, spanning an area of around 3000 km^2 over a driving path of around 190 km, showing that one of the most accurate propagation models, the Irregular Terrain Model (IMT), overestimates the signal power by up to 97% of the time. Based on this study, we provide a characterization of spectrum sensory readings that can be used to amend the prediction of propagation models. This characterization allows spectrum sensors to detect the absence of white spaces with a fairly high threshold of -84 dbm, which enables low cost and accurate spectrum sensing. Furthermore, we present the initial design of SPOC, a system that combines spectrum sensing and propagation modeling in order to better detect white spaces.","cites":"1","conferencePercentile":"53.84615385"},{"venue":"WiNTECH","id":"293283defa7e3933f3711dfbf80f22a8e1045967","venue_1":"WiNTECH","year":"2014","title":"Potential pitfalls of the message in message mechanism in modern 802.11 networks","authors":"Wei Wang, Wai Kay Leong, Ben Leong","author_ids":"1706612, 2960440, 3038892","abstract":"We study the performance impact of the Message in Message (MIM) mechanism in modern 802.11 networks. The MIM mechanism refers to the capability of receiver to abandon an ongoing reception of an 802.11 MAC frame and shift to decode another frame with a higher signal strength. MIM is a common feature in modern 802.11 adapters and it has been shown to improve spatial concurrency. However, our measurement study in a campus WLAN shows that under certain conditions, MIM could cause a throughput degradation of more than 30% when enabled, instead of improving it as expected. With comprehensive experiments using commercial 802.11n adapters, we characterize the impact of MIM for a range of parameters and for different scenarios. We show that a simple adaptive MIM scheme can potentially achieve throughput that is close to the optimal. Our method is practical because it can be easily implemented in existing commodity 802.11 adapters.","cites":"0","conferencePercentile":"23.07692308"}]}