{"WINTECH_09.csv":[{"venue":"WINTECH '09","id":"bad60cec302beeb9de4afd6dffb6abbe7bf42817","venue_1":"WINTECH '09","year":"2009","title":"Interference mitigation in WiFi networks using multi-sector antennas","authors":"Henrik Lundgren, Anand Prabhu Subramanian, Theodoros Salonidis, Marianna Carrera, Pascal Le Guyadec","author_ids":"1713467, 3268158, 2522394, 2930154, ","abstract":"Sectorized antennas provide an attractive solution to increase wireless network capacity through interference mitigation. Despite their increasing popularity, the real-world performance characteristics of such antennas in dense wireless mesh networks are not well understood. We demonstrate our multi-sector antenna prototypes and their performance through video streaming over an indoor wireless network in the presence of interfering nodes. We use our graphical tool to vary the sender, receiver, and interferer antenna configurations and the resulting performance is directly visible in the video quality displayed at the receiver.","cites":"1","conferencePercentile":"26.19047619"},{"venue":"WINTECH '09","id":"a5d116e72c64e44dfd046d93fb92454f5c566f12","venue_1":"WINTECH '09","year":"2009","title":"A measurement study of zigbee-based indoor localization systems under RF interference","authors":"Seng-Yong Lau, Tsung-Han Lin, Te-Yuan Huang, I-Hei Ng, Polly Huang","author_ids":"1722464, 2137872, 2651153, 2155552, 1700573","abstract":"With an expected market value of 2.71 billion in 2016, supporting daily use of real-time location systems in households and commercial buildings is an increasingly important subject of study. A growing problem in providing robust indoor location estimations in real time is the use of wireless transmissions in RF frequencies. Having implemented a simple RSSI-signature-based location system on a 24-node IEEE 802.15.4-based sensor network testbed, we are able to analyze the effect of background IEEE 802.11 traffic on localization error. The measurement results demonstrate that the 80th-percentile of the localization error may increase by 141% at worst in an office building with active use of IEEE 802.11 for data. Such performance degradation results from RSSI reading loss as the beacon messages collide with background traffic.","cites":"9","conferencePercentile":"80.95238095"},{"venue":"WINTECH '09","id":"1f70d8a1cafcdcb356efd9fdfca6cef9d81052c3","venue_1":"WINTECH '09","year":"2009","title":"The Stanford OpenRoads deployment","authors":"Kok-Kiong Yap, Masayoshi Kobayashi, David Underhill, Srinivasan Seetharaman, Peyman Kazemian, Nick McKeown","author_ids":"2517293, 1946418, 2270957, 2309295, 2408776, 1708241","abstract":"We have built and deployed OpenRoads [11], a testbed that allows multiple network experiments to be conducted concurrently in a production network. For example, multiple routing protocols, mobility managers and network access controllers can run simultaneously in the same network. In this paper, we describe and discuss our deployment of the testbed at Stanford University. We focus on the challenges we faced deploying in a production network, and the tools we built to overcome these challenges. Our goal is to gain enough experience for other groups to deploy OpenRoads in their campus network.","cites":"36","conferencePercentile":"100"},{"venue":"WINTECH '09","id":"c3821fb4cc5f673fe5f6841337d71bc8a637b487","venue_1":"WINTECH '09","year":"2009","title":"A multi-radio wireless P2P network testbed","authors":"Ze Zhao, Qiang Liu, Guang-Hua Yang, Victor Li, Li Cui","author_ids":"2277825, 1726270, 2025427, 1854815, 1759760","abstract":"Wireless peer-to-peer (P2P) networks have been widely studied in recent years. Testing and evaluating wireless P2P network protocols are challenging tasks because they require a powerful and flexible hardware platform and supervision interface. In this work, EZ270, a novel wireless node with multi-radio support is designed and developed. Based on EZ270, a general purpose wireless P2P network testbed with user-friendly supervision features is built. The functionality and effectiveness of the wireless nodes and of the testbed are demonstrated.","cites":"1","conferencePercentile":"26.19047619"}]}