{"WiNTECH_11.csv":[{"venue":"WiNTECH '11","id":"98630ec3a38aecb20f02d9939a7a5135a723994b","venue_1":"WiNTECH '11","year":"2011","title":"AROMA: Automatic Generation of Radio Maps for Localization Systems","authors":"Ahmed Eleryan, Mohamed Elsabagh, Moustafa Youssef","author_ids":"3034136, 1818817, 1780388","abstract":"Current methods for building radio maps for wireless localization systems require a tedious, manual and error-prone calibration of the area of interest. Each time the layout of the environment is changed or different hardware is used, the whole process of location fingerprinting and constructing the radio map has to be repeated. The process gets more complicated in the case of localizing multiple entities in a device-free scenario, since the radio map needs to take all possible combinations of the location of the entities into account.\n In this demo, we present a novel system (AROMA) that is capable of generating accurate radio maps for a given site of interest. AROMA constructs radio maps for both deterministic and probabilistic wireless localization systems. According to our knowledge, AROMA is the first system to generate radio maps for device-free localization. It uses 3D ray tracing enhanced with the uniform theory of diffraction (UTD) to model the electric field behavior and the human shadowing effect. AROMA also automates a number of routine tasks, such as importing building models and automatic sampling of the area of interest.","cites":"7","conferencePercentile":"97.5"},{"venue":"WiNTECH '11","id":"2ab25ed60730262c51e4f3b17d85d6a3b91ef3ac","venue_1":"WiNTECH '11","year":"2011","title":"LENS: resource specification for wireless sensor network experimentation infrastructures","authors":"Xi Ju, Hongwei Zhang, Wenjie Zeng, Mukundan Sridharan, Jing Li, Anish Arora, Rajiv Ramnath, Yufeng Xin","author_ids":"3100799, 4975757, 2675480, 3053044, 1742253, 1693812, 2579933, 1795167","abstract":"As a first step towards predictable, repeatable WSN experimentation, we propose the resource specification language LENS (a.k.a. Language for Embedded Networked Sensing) for WSN experimentation infrastructures. Using the Resource Description Framework (RDF) and the Web Ontology Language (OWL), LENS defines a semantic ontology for WSN resources; LENS enables explicit control and measurement of uncertainty factors, and it enables reasoning about the relationships between WSN resources. Focusing on basic concepts of WSNs, LENS supports resource specification in a wide range of WSN experimentation infrastructures, and it is extensible to support potentially unforeseen technologies. LENS is also compatible with specification languages for other network resources such as optical networks. As a part of the NSF GENI initiative, we have implemented LENS in the KanseiGenie control framework, and LENS has been actively used to support experimentation in the federated WSN infrastructure involving Kansei and NetEye. Enabling reasoning about uncertainty factors in experimentation, LENS is expected to serve as a basis for developing methodologies and tools for predictable, repeatable WSN experimentation.","cites":"1","conferencePercentile":"60"},{"venue":"WiNTECH '11","id":"c5b3207b8b9e1fb16695cd080bbceb00a4852ed3","venue_1":"WiNTECH '11","year":"2011","title":"Kalman filter-based tracking of a device-free passive entity in wireless environments","authors":"Moustafa Anwar Seifeldin, Amr Fawzy El-keyi, Moustafa Amin Youssef","author_ids":"3102206, , 1780388","abstract":"Device-free passive (DfP) localization has been recently proposed to allow localizing a stationary entity that neither carries a device nor participates actively in the localization process. In this paper, we present a Kalman filter-based system that enables tracking a continuously moving entity in a typical wireless environment rich in multipath. The concept behind DfP tracking is that the received signal strength at monitoring points in a wireless environment is influenced by any changes in the environment. These changes include the movement of an entity, such as a human being, within the environment. This can be utilized to track an entity in many military and civil applications. We evaluate the performance of our system by conducting experiments in a typical office environment rich in multipath. Our results show that we were able to track a passive entity in a long corridor with a 1.2m median distance error and a less than 4.6m distance error with probability one.","cites":"6","conferencePercentile":"90"}]}