{"WiNTECHMobiCom.csv":[{"venue":"WiNTECH@MobiCom","id":"1fd9a9b545d2ca91bd30cf3d23971d8d48ae6189","venue_1":"WiNTECH@MobiCom","year":"2016","title":"Demystifying low-power wide-area communications for city IoT applications","authors":"Sokratis Kartakis, Babu D. Choudhary, Alexander D. Gluhak, Lambros Lambrinos, Julie A. McCann","author_ids":"1766435, 7331010, 8462891, 2611653, 1770523","abstract":"Low Power Wide Area (LPWA) communication technologies have the potential to provide a step change in the enablement of cost-effective and energy efficient Internet of Things (IoT) applications. With an increase in the number of offerings available the real performance of these emerging technologies remain unclear. That is, each technology comes with its own advantages and limitations; yet there is a lack of comparative studies that examine their trade-offs based on empirical evidence. This poses a major challenge to IoT solution architects and developers in selecting an appropriate technology for an envisioned IoT application in a given deployment context.\n In this paper, we look beyond data sheets and white papers of LPWA communication technologies and provide insights into the performance of three emerging LPWA solutions based on real world experiments with different traffic loads and in different urban deployment contexts. Under the context of this study, specialized hardware was created to incorporate the different technologies and provide scientific quantitative and qualitative information related to data rates, success rates, transmission mode energy and power consumption, and communication ranges. The results of experimentation highlight the practicalities of placing LPWA technologies in real spaces and provide guidelines to IoT solution developers in terms of LPWA technology selection. Overall aim is to facilitate the design of new LPWA technologies and adaptive communication strategies that inform future IoT platforms.","cites":"1","conferencePercentile":"90"},{"venue":"WiNTECH@MobiCom","id":"4cea716342c7dc14a495de2092a1d67864654243","venue_1":"WiNTECH@MobiCom","year":"2016","title":"Automating 3D wireless measurements with drones","authors":"Ethan Yu, Xi Xiong, Xia Zhou","author_ids":"7430277, 2075720, 2253140","abstract":"Wireless signals and networks are ubiquitous. Though more reliable than ever, wireless networks still struggle with weak coverage, blind spots, and interference. Having a strong understanding of wireless signal propagation is essential for increasing coverage, optimizing performance, and minimizing interference for wireless networks. Extensive studies have analyzed the propagation of wireless signals and proposed theoretical models to simulate wireless signal propagation. Unfortunately, models of signal propagation are often not accurate in reality. Real-world signal measurements are required for validation.\n Existing methods for collecting wireless measurements either involve researchers walking to each location of interest and manually collecting measurements, or place sensors at each measurement location. As such, they require large amounts of time and effort and can be costly. We propose DroneSense, a system for measuring wireless signals in the 3D space using autonomous drones. Drone-Sense reduces the time and effort required for measurement collection, and is affordable and accessible to all users. It provides researchers with an efficient method to quickly analyze wireless coverage and test their wireless propagation models.","cites":"0","conferencePercentile":"42.5"},{"venue":"WiNTECH@MobiCom","id":"e52d201ca16e775bfa735af2564a881ca03c6b76","venue_1":"WiNTECH@MobiCom","year":"2016","title":"Pilot deployment of early warning system for landslides in eastern himalayas: poster","authors":"Sangeeth Kumar, P. Venkat Rangan, Maneesha Vinodini Ramesh","author_ids":"2893621, 1719775, 1750198","abstract":"Using wireless networks to connect and communicate between geological sensors is a more scalable and suitable way for designing landslide monitoring and warning system for larger areas spanning many acres. Added to this, if the system has the capability to function in solar power, then it becomes autonomous system with self-organizing and self-healing networks. But high terrain, steep slopes, dense vegetation and lack of light during monsoon season to generate solar power pose serious challenges to develop such an autonomous system with good wireless coverage. This paper is about efforts to design, develop and deploy one such landslide warning system in eastern Himalayas. Pilot deployment is already in place and full deployment is under progress.","cites":"0","conferencePercentile":"42.5"},{"venue":"WiNTECH@MobiCom","id":"87e2ee6474fcafca9e687f00bcf01fcf6a0654b1","venue_1":"WiNTECH@MobiCom","year":"2013","title":"Characterizing WiFi connection and its impact on mobile users: practical insights","authors":"Suranga Seneviratne, Aruna Seneviratne, Prasant Mohapatra, Pierre-Ugo Tournoux","author_ids":"3342663, 1678254, 1697868, 1806954","abstract":"Smartphones and WiFi networks are becoming pervasive. As a result, new applications and services are being offered to smartphone users through WiFi networks. Some of the more novel applications provide data services to pedestrians as they move through WiFi coverage areas in public loca- tions such as railway stations. One significant factor that will influence the data transfers for users when they are on the move, is the connection set-up time. In this paper we characterize the WiFi connection set-up process. Using data from voluntary Android smartphone users, we show that WiFi connection setup have significant delays, sometimes as high as 10s. Then through a detailed analysis of the con- nection set-up process we show that, contrary to previous findings, this is due to losses of DHCP messages at the WiFi access point. We also show that some of the methods that have been adopted by device manufactures are suboptimal and this can be addressed at the WiFi access point. Finally using this insight we extend a known mathematical model, which will help in the dimensioning of WiFi networks for pedestrian smartphone users.","cites":"2","conferencePercentile":"66.66666667"},{"venue":"WiNTECH@MobiCom","id":"d260617c3a4e7e09ad12d03ff2a0659c72b7cda5","venue_1":"WiNTECH@MobiCom","year":"2013","title":"From ground to aerial communication: dissecting WLAN 802.11n for the drones","authors":"Mahdi Asadpour, Domenico Giustiniano, Karin Anna Hummel","author_ids":"1771574, 2485577, 1746763","abstract":"Micro Unmanned Aerial Vehicles (UAVs) employed in civil missions are receiving remarkable attention from both research and industry. UAVs embed more and more sensor technology, and their small mounted cameras allow for efficient mapping of large areas in short time. Yet, civil missions such as rescue operations would need a timely delivery of high-resolution images, which calls for high-speed communication such as provided by WLAN IEEE 802.11n. Driven by extensive experiments, the key finding of this contribution is that 802.11n performs poorly in highly mobile and aerial scenarios, as the throughput between UAVs drops far below the theoretical maximum as soon as they become airborne. This is partially caused by the limitations of the embedded hardware, but also a result of the network dynamics of the aerial links. In order to dissect the origins of the low performance figures, we isolate the potential causes of degradation by analyzing our data of throughput, packet loss, aircraft and antenna orientation, and cruise speed. We discuss quantitatively how practical it is to deliver high-resolution images when being exposed to aerial throughput. We believe that it will be a long way until micro UAVs transferring large-size data become reality and argue for a new amendment of IEEE 802.11 addressing the communication among highly-mobile UAVs.","cites":"4","conferencePercentile":"83.33333333"},{"venue":"WiNTECH@MobiCom","id":"8c765735b5dcbba1a2c58ecc63bdd50cb57d8d81","venue_1":"WiNTECH@MobiCom","year":"2013","title":"Evaluating perceptual video quality for mobile clients in 802.11n WLAN","authors":"Victor Omwando, Amit Pande, Yunze Zeng, Prasant Mohapatra","author_ids":"3158062, 7205991, 1950350, 1697868","abstract":"In this paper, we characterize the performance of HD video streaming in 802.11n WLANs under user mobility. We conducted experiments in QuRiNet, a large-scale outdoor wireless testbed that experiences little electromagnetic interference. We observe the variation in video quality with the variance of both speed of a mobile user and his distance from access point (AP). Using subjective scores and objective video quality assessment metrics, we build a non-linear regression model to estimate video quality based on user speed and distance. An ensemble machine learning kernel, bagging, is used in conjunction with Reduced Error Pruning Decision Trees to build a non-linear prediction model that scores 69% correlation with video quality. Overall, we find that distance has larger impact on video quality than speed. However, the physical factors such as speed and distance cannot be used in isolation to estimate video quality accurately.","cites":"1","conferencePercentile":"50"},{"venue":"WiNTECH@MobiCom","id":"74c5cf90087eaac3905cc27fe1bd0a836df03931","venue_1":"WiNTECH@MobiCom","year":"2013","title":"UAV networks in rescue missions","authors":"Mahdi Asadpour, Domenico Giustiniano, Karin Anna Hummel, Simon Egli","author_ids":"1771574, 2485577, 1746763, 8345702","abstract":"Small-scale unmanned aerial vehicles (UAVs) have received high attention by the robotics community for delivering sensory data of limited size. Yet, the communication capabilities of off-the-shelf UAVs are insufficient for high volume data, such as images and videos. In this demo, we present our networking solution to this problem, residing next to the auto-pilot, and able to create an ad-hoc multi-hop network of UAVs. We show the effectiveness of our implementation in two representative scenarios of rescue missions: [(i)] the establishment of end-to-end connectivity for a smartphone in an area with network outage and the delivery of a high-resolution video of a supervised area from a flying UAV to the ground station.","cites":"2","conferencePercentile":"66.66666667"},{"venue":"WiNTECH@MobiCom","id":"8f19b969bc31a73a040577ffb3d39a65ec226cec","venue_1":"WiNTECH@MobiCom","year":"2013","title":"Using ORBIT for evaluating wireless content-centric network transport","authors":"Feixiong Zhang, Alex Reznik, Hang Liu, Chenren Xu, Yanyong Zhang, Ivan Seskar","author_ids":"1923665, 7399034, 1691876, 2338071, 1813845, 1813870","abstract":"Evaluation of Content-Centric Networking (CCN) transport protocols, especially over wireless networks, brings about new requirements for testbeds. Typical CCN transport features such as hop-by-hop transfer, caching support, and receiver-driven traffic and congestion control differ significantly from those of classical transport protocols, most notably TCP. In this paper, we highlight an implementation of a transport protocol designed specifically for CCN and demonstrating its over-the-air, real time operation using ORBIT - an open access platform maintained by WINLAB, Rutgers University, USA.","cites":"3","conferencePercentile":"77.77777778"}]}