{"WiNTECH_12.csv":[{"venue":"WiNTECH '12","id":"a0be353c01787b1b519a8b22263a3bc70fe87603","venue_1":"WiNTECH '12","year":"2012","title":"Measurement-driven performance analysis of indoor femtocellular networks","authors":"Trung-Tuan Luong, Vigneshwaran Subbaraju, Archan Misra, Srinivasan Seshan","author_ids":"3253876, 2148678, 1721672, 1730191","abstract":"This paper describes initial empirical studies, performed on a 6-node 3G indoor femtocellular testbed, that investigate the impact of pedestrian mobility on network parameters, such as handoff behavior and data throughput. The studies establish that, owing to the small radii of cells, even modest changes in movement speed can have disproportionately large impact on handoff patterns and network throughput. By also revealing a strong temporal dependency effect, the studies motivate the need for algorithms to accurately predict RF signal strength distributions in dynamic indoor environments. We present such an RF prediction algorithm, based on crowd-sourced signal strength readings, and show that the algorithm can predict RF signal strengths with an average estimation error of 3 dBm.","cites":"2","conferencePercentile":"83.33333333"},{"venue":"WiNTECH '12","id":"03c25d1123ebaa1cb8b965c45e14d1e4cb7588c1","venue_1":"WiNTECH '12","year":"2012","title":"Evaluating solar panel-driven systems in the laboratory","authors":"Stanislav Bobovych, James P. Parkerson, Nilanjan Banerjee","author_ids":"3284772, 1976479, 1698909","abstract":"Evaluating and debugging solar panel driven systems can be a tedious and cumbersome process. The system must be deployed outdoors and evaluated across a wide range of lighting and temperature conditions. Therefore, for ease, several solar panel driven sensor and embedded systems today are evaluated at a particular location for a relatively short period of time. Consequently, the evaluation lacks external validity and the results cannot be generalized to a wide range of experimental conditions. To mitigate the above problem, we present the preliminary design and evaluation of a solar replayer and a solar profiler platform. The profiler system can be used to generate accurate I-V traces for solar cells, annotated with temperature and barometric pressure readings. The replayer is used to replay solar panel I-V curves on variable loads. The system allows in-lab evaluation of renewable energy driven systems for a wide range of current and voltage specifications (~(0-2 A) and ~(0-16V)).","cites":"2","conferencePercentile":"83.33333333"},{"venue":"WiNTECH '12","id":"6a5aa7bfbeddbefe694352a6b8214fd11a23fa42","venue_1":"WiNTECH '12","year":"2012","title":"Enabling large scale flexible deployment of cognitive radio routing protocols","authors":"Ahmed Saeed, Mohamed Ibrahim, Khaled Harras, Moustafa Youssef","author_ids":"3390749, 4060659, 1748216, 1780388","abstract":"Building large-scale testbeds for cognitive radio networks has been identified as one of the main challenging problems and basic needs for advancing cognitive radio research. The cost of buying and maintaining a large-scale cognitive radio networks using special RF interfaces can not be ignored. In this paper we introduce CogFrame, a framework that facilitates large-scale deployment of cognitive routing protocols by enabling the deployment of these protocols on off-the-shelf laptops nodes using their built-in Wi-Fi interfaces for RF communication. The framework is built on top on the Click modular router to ensure the easy of development of new protocols while providing new modules to handle cognitive radio functionalities.","cites":"0","conferencePercentile":"20"},{"venue":"WiNTECH '12","id":"1dfb6dcc7f2770548d7db68fdb3bef85992fc11c","venue_1":"WiNTECH '12","year":"2012","title":"Demonstrating practical provably secure multi-node communication","authors":"Omar Mohammad Hassan, Mahmoud Fouad Ayoub, Moustafa Youssef","author_ids":"2748468, 1950192, 1780388","abstract":"We demonstrate a practical and provably-secure multi-node communication scheme in the presence of a passive eavesdropper. The scheme is based on a random scheduling approach that hides the identity of the transmitter from the eavesdropper.\n This random scheduling leads to ambiguity at the eavesdropper with regard to the origin of the transmitted frame. We demonstrate the internal details of the technique and quantify the secrecy-overhead tradeoff. Our implementation is based on Crossbow Telosb motes, equipped with CC2420 radio chips. The demo will allow the attendees to see the scheme in action and how the scheme can achieve significant secrecy gains with vanishing outage probability. The demo also compared the proposed scheme to other direct extensions the two node case.","cites":"1","conferencePercentile":"56.66666667"}]}