{"WiOpt.csv":[{"venue":"WiOpt","id":"8cc5126d94b7ad1ee631cf3b5186c2c91112502d","venue_1":"WiOpt","year":"2008","title":"Characterization of multi-channel interference","authors":"Özlem Durmaz Incel, Pierre G. Jansen","author_ids":"2915257, 2909764","abstract":"— Multi-channel communication protocols in wireless networks usually assume perfect orthogonality between wireless channels or consider only the use of interference-free channels. The first approach may overestimate the performance whereas the second approach may fail to utilize the spectrum efficiently. Therefore, a more realistic approach would be the careful use of interfering channels by controlling the interference at an acceptable level. We present a methodology to estimate the packet error rate (PER) due to inter-channel interference in a wireless network. The methodology experimentally characterizes the multi-channel interference and analytically estimates it based on the observations from the experiments. Furthermore, the analytical estimation is used in simulations to derive estimates of the capacity in larger networks. Simulation results show that the achievable network capacity, which is defined as the number of simultaneous transmissions, significantly increases with realistic interfering channels compared with the use of only orthogonal channels. When we consider the same number of channels, the achievable capacity with realistic interfering channels can be close to the capacity of idealistic orthogonal channels. This shows that overlapping channels which constitute a much smaller band, provides more efficient use of the spectrum. Finally, we explore the correctness of channel orthogonality and show why this assumption may fail in a practical setting.","cites":"4","conferencePercentile":"55.45454545"},{"venue":"WiOpt","id":"2a16614f2e1cdbce64ed26c2e110a72b1e5a40ed","venue_1":"WiOpt","year":"2007","title":"Locally Optimized Scheduling and Power Control Algorithms for Multi-hop Wireless Networks under SINR Interference Models","authors":"Joohwan Kim, Xiaojun Lin, Ness B. Shroff","author_ids":"7950477, 1710865, 1750487","abstract":"— In this paper, we develop locally optimized scheduling and power control algorithms for multi-hop wireless networks under SINR interference models. Our scheme can be implemented in a fully distributed manner and requires only that each node solve a simple local optimization problem. Since, in our algorithms, each node operates independently of other nodes, it needs to predict the behavior of neighboring nodes when carrying out its local optimization. For such prediction, our proposed algorithms exploit the past records of neighboring nodes' scheduling and power control decisions. Through simulations, we show that our algorithms significantly outperform the state-of-the-art. I. INTRODUCTION In this paper, we develop efficient scheduling and power control algorithms that support high data rates in multi-hop wireless networks. In recent years, throughput-optimal scheduling and power control algorithms that maximize the achievable throughput of multi-hop wireless networks have been extensively studied in the literature [1], [2], [3]. However , these throughput-optimal algorithms are often difficult to implement mainly because of the following reasons: first, the optimal algorithm operates in a fully centralized manner. Thus, a centralized scheduler needs to collect global information of the queue lengths from the entire network and to distribute its scheduling and power control decision back to the entire network. Both information collection and decision distribution could result in significant communication overhead. Second, these throughput-optimal algorithms require the centralized scheduler to solve a complex global optimization problem, whose complexity could exponentially increase in the network size. There have been recent efforts to develop efficient scheduling algorithms that alleviate the communication and computation overheads. Progress has been made under restrictive classes of interference models. A commonly used model is the K-hop interference model, in which two links that are within K-hops of each other cannot simultaneously communicate, and the capacity of a link is a constant value if there is no Matching (MM) scheduling algorithm is used under the node-exclusive interference model (the special case of the K-hop","cites":"5","conferencePercentile":"46.22641509"},{"venue":"WiOpt","id":"6bac747257ce4bab1ff90ff3bfff3357ab3213a6","venue_1":"WiOpt","year":"2008","title":"Linear programming models for jamming attacks on network traffic flows","authors":"Patrick Tague, David Slater, Radha Poovendran, Guevara Noubir","author_ids":"2331637, 1798923, 1678631, 1742346","abstract":"—We present a new class of network attacks, referred to as flow-jamming attacks, in which an adversary with multiple jammers throughout the network jams packets to reduce traffic flow. We propose a linear programming framework for flow-jamming attacks, providing a foundation for the design of future protocols to mitigate flow-jamming. We propose metrics to evaluate the effect of a flow-jamming attack on network flow and the resource expenditure of the jamming adversary. We develop, evaluate, and compare a variety of flow-jamming attacks using the proposed metrics and the linear programming formulation. In addition, we formulate two approaches for distributed flow-jamming attacks for a set of jammers operating without centralized control and compare the performance to the centralized attacks using the linear programming formulation.","cites":"28","conferencePercentile":"96.36363636"},{"venue":"WiOpt","id":"a57582ad4a48de044e41648bf0a10c2ddbfcdfc6","venue_1":"WiOpt","year":"2010","title":"Characterizing high-bandwidth real-time video traffic in residential broadband networks","authors":"Ramya Raghavendra, Elizabeth M. Belding-Royer","author_ids":"1787509, 2377614","abstract":"—Users are generating and uploading multimedia content to the Internet at an unprecedented rate. Residential broadband networks, however, have low upload capacities and large packet latencies. Wi-Fi networks that are used to access the Internet can suffer from high packet losses and contention latencies. All of these factors can result in poor video quality for residential users. Using packet traces and active measurements from houses, we study video quality in residential scenarios. We analyze the primary factors that contribute to poor performance and compare the performance over both the wireless and the broadband hop. Our measurements show that the upload capacities on the broadband links restrict the video bitrate (and hence the resolution) that can be transmitted. Residential wireless networks, however, have much higher capacities than the broadband links and, despite being densely deployed, do not see extended periods of high utilization. Our measurements shed light on the video transmission quality that is typically achievable from residences and are used to characterize the reasons behind quality deterioration.","cites":"4","conferencePercentile":"57.85714286"},{"venue":"WiOpt","id":"57651168eb51a91d7c924c041d3963d6774398a8","venue_1":"WiOpt","year":"2007","title":"Towards Realistic Models of Wireless Workload","authors":"Stefan Karpinski, Elizabeth M. Belding-Royer, Kevin C. Almeroth","author_ids":"3312685, 2377614, 3131174","abstract":"— Performance predictions from wireless networking laboratory experiments rarely seem to match what is seen once technologies are deployed. We believe that one of the major factors hampering researchers' ability to make more reliable forecasts is the inability to generate realistic workloads. To redress this problem, we take a fundamentally new approach to measuring the realism of wireless traffic models. In this approach, the realism of a model is defined directly in terms of how accurately it reproduces the performance characteristics of actual network usage. This cuts through the Gordian knot of deciding which statistical features of traffic traces are significant. We demonstrate that common experimental traffic models, such as uniform constant bit-rate traffic (CBR), drastically misrepresent performance metrics at all levels of the protocol stack. We also define and explore the space of synthetic traffic models, thereby advancing the understanding of how different modeling techniques affect the accuracy of performance predictions. Our research takes initial steps that will ultimately lead to comprehensive , multi-level models of realistic wireless workloads.","cites":"6","conferencePercentile":"55.66037736"},{"venue":"WiOpt","id":"3f9e1f9ab5b93a859738b56c620bc2639c19c320","venue_1":"WiOpt","year":"2009","title":"Transmission schedule optimization for half-duplex multiple-relay networks","authors":"Wei Wang, Lawrence Ong, Mehul Motani","author_ids":"1769730, 1694330, 1770486","abstract":"Half duplex devices are widely used in today's wireless networks. These devices can only send or receive, but not do both at the same time. In this paper, we use cooperative decode-forward relay strategies to increase the throughput of half-duplex wireless networks. Due to the half duplex constraint, relays need to carefully choose their transmission states in order to maximize the throughput. We show that the transmission schedule optimization can be formulated as a linear programming problem. Although the number of possible states grows exponentially as the number of relays increases, only a small subset of these states needs to be used in the optimal transmission schedule. This observation allows us to use heuristic algorithms to solve for near-optimal schedule in large networks. Our numerical results show that the decode-forward strategy can provide nearly 3 times more throughput than the traditional multi-hop relaying strategy in half duplex wireless networks.","cites":"4","conferencePercentile":"58.92857143"},{"venue":"WiOpt","id":"ca862d9028bb45d541f2d7d042ca69f5c7dff4b4","venue_1":"WiOpt","year":"2013","title":"Buffered-relay selection in an underlay cognitive radio network","authors":"Radwa A. Sultan, Ahmed Sultan, Moustafa Youssef","author_ids":"2573956, 1802713, 1780388","abstract":"—We consider an underlay relay-assisted time-slotted cognitive radio network operating on the same band used by a primary link. For implementation simplicity, one relay is selected at any time slot for reception from the secondary source, or for transmission to the secondary destination. Relay selection depends on the instantaneous channel gains and the occupancy status of the relays' buffers. Selection is constrained by a maximum tolerable interference level at the primary receiver. We provide a theoretical framework based on a Markov chain to model the system and obtain the secondary throughput and average queueing delay. We verify our obtained expressions via numerical system simulations and investigate the impact of the various system parameters on performance.","cites":"0","conferencePercentile":"15.47619048"},{"venue":"WiOpt","id":"7e423b9607b129759c3794eb81f91f53da7f5ea3","venue_1":"WiOpt","year":"2006","title":"Reverse engineering MAC","authors":"Ao Tang, Jang-Won Lee, Jianwei Huang, Mung Chiang, A. Robert Calderbank","author_ids":"1804911, 4133403, 1678659, 1683977, 1721787","abstract":"— This paper reverse-engineers backoff-based random-access MAC protocols in ad-hoc networks. We show that the contention resolution algorithm in such protocols is implicitly participating in a non-cooperative game. Each link attempts to maximize a selfish local utility function, whose exact shape is reverse engineered from the protocol description, through a stochastic subgradient method in which the link updates its persistence probability based on its transmission success or failure. We prove that existence of a Nash equilibrium is guaranteed in general. The minimum amount of backoff aggressiveness needed for uniqueness of Nash equilibrium and convergence of the best response strategy are established as a function of user density. Convergence properties and connection with the best response strategy are also proved for variants of the stochastic-subgradient-based dynamics of the game. Together with known results in reverse engineering TCP and BGP, this paper completes the recent efforts in reverse engineering layers 2-4 protocols.","cites":"10","conferencePercentile":"66.12903226"},{"venue":"WiOpt","id":"a0c41c49b49ba24e4078febf1ed3363fe25178f9","venue_1":"WiOpt","year":"2014","title":"An adaptive route optimization scheme for nested mobile IPv6 NEMO environment","authors":"Li Qiang, Jie Li, Mohsen Guizani, Yusheng Ji","author_ids":"1996779, 1684133, 1731676, 7753600","abstract":"—We address the route optimization problem for a nested mobile IPv6 NEtwork MObility (NEMO) environment. We propose an adaptive scheme which can optimize the routing process of the data communication, and minimize the end-to-end delay. The adaptive scheme consists of two sub-schemes: mobility-transparency sub-scheme and time-saving sub-scheme. The mobility-transparency sub-scheme performs well for the high mobility scenarios, while the time-saving sub-scheme performs well for the low mobility and large communication traffic scenarios. A threshold is used to determine which sub-scheme should be applied for the current situation. Theoretical analysis and simulation results demonstrate that the proposed scheme can reduce the end-to-end delay of data communication for nested mobile IPv6 NEMO environment significantly. Keywords—Adaptive scheme, end-to-end delay, nested mobile IPv6 NEMO, pinball routing problem, route optimization.","cites":"0","conferencePercentile":"24.74226804"},{"venue":"WiOpt","id":"2f06705ab556f63261e80a710fafb6973af3e28f","venue_1":"WiOpt","year":"2011","title":"Deadline constrained scheduling for data aggregation in unreliable sensor networks","authors":"Srikanth Hariharan, Ness B. Shroff","author_ids":"2664011, 1750487","abstract":"—We study the problem of maximizing the aggregated information in a wireless sensor network. We consider a sensor network with a tree topology, where the root corresponds to the sink, and the rest of the network detects an event and transmits data to the sink. We formulate an integer optimization problem that maximizes the aggregated information that reaches the sink under deadline and interference constraints. This framework allows using a variety of error recovery schemes to tackle link unreliability. We show that the optimal solution involves solving a Job Interval Selection Problem (JISP) which is known to be MAX SNP-Hard. We construct a sub-optimal version, and develop a low complexity, distributed optimal solution to this version. We investigate tree structures for which this solution is optimal to the original problem. Our numerical results show that the sub-optimal solution outperforms existing JISP approximation algorithms even for general trees.","cites":"4","conferencePercentile":"40.54054054"},{"venue":"WiOpt","id":"3921d43418fabd1ed49cd0cfc1c12a710fa45457","venue_1":"WiOpt","year":"2016","title":"Understanding the intermittent traffic pattern of HTTP video streaming over wireless networks","authors":"Ibrahim Ben Mustafa, Mostafa Uddin, Tamer Nadeem","author_ids":"1878995, 2902076, 2459493","abstract":"—We are experiencing huge growth of video streaming traffic, which is creating big challenges for video providers in guaranteeing a satisfactory level of viewing experience to end users. Furthermore, the increase in video streaming demands on mobile devices over dynamic wireless links is creating another obstacle toward providing a high quality video service. In order to overcome most of these challenges, HTTPs adaptive video streaming technology was introduced, along with other great features for streaming videos. However, we found that HTTPs adaptive protocol can still suffer under certain situations and conditions. Mostly, these issues are likely experienced when multiple concurrent players compete over the same bottleneck. Several studies have proposed a network side solution at the home gateway or at the cloud aiming to assist the video players to maximize the viewing experience to all users sharing the same bottleneck. Although these proposed systems could provide some enhancements to the video streaming , they are unable to provide fine-grained monitoring and understanding of the video traffic to apply desire level of dynamic resource management. Considering the above issues, in this paper we conduct extensive analysis of the video traffic of YouTube; the most popular HTTPs adaptive video player. In our study, we argue that through a deep understanding and careful analysis of the HTTPs video traffic, valuable information about the competing streams can be obtained and could be utilized in developing a network based solution that can significantly improve the video QoE and assist the video players to perform much better.","cites":"0","conferencePercentile":"39.28571429"},{"venue":"WiOpt","id":"c8898d71fbe69bcefda01448e2efe87711b19baa","venue_1":"WiOpt","year":"2010","title":"Multi-scale modularity in complex networks","authors":"Renaud Lambiotte","author_ids":"1706831","abstract":"—We focus on the detection of communities in multi-scale networks, namely networks made of different levels of organization and in which modules exist at different scales. It is first shown that methods based on modularity are not appropriate to uncover modules in empirical networks, mainly because modularity optimization has an intrinsic bias towards partitions having a characteristic number of modules which might not be compatible with the modular organization of the system. We argue for the use of more flexible quality functions incorporating a resolution parameter that allows us to reveal the natural scales of the system. Different types of multi-resolution quality functions are described and unified by looking at the partitioning problem from a dynamical viewpoint. Finally, significant values of the resolution parameter are selected by using complementary measures of robustness of the uncovered partitions. The methods are illustrated on a benchmark and an empirical network.","cites":"37","conferencePercentile":"100"},{"venue":"WiOpt","id":"114210421d7c717f5d504bec81f52f436ec4b556","venue_1":"WiOpt","year":"2012","title":"Imitative spectrum access","authors":"Xu Chen, Jianwei Huang","author_ids":"1734498, 1678659","abstract":"—In this paper, we study how secondary users can share the spectrum in a distributed fashion based on imitations. We propose an imitative spectrum access mechanism, where each secondary user estimates its expected throughput based on local observations, and imitates the channel selection of another user who achieves a higher throughput. We show that the imitative spectrum access mechanism converges to an imitation equilibrium, where no beneficial imitation can be further carried out on the time average. Numerical results show that when the number of users is large, the imitative spectrum access mechanism can converge to a Nash equilibrium, which is a special case of the imitation equilibrium.","cites":"7","conferencePercentile":"79.83870968"},{"venue":"WiOpt","id":"df002931c555c551cdc14e743d3d614f70be3f2f","venue_1":"WiOpt","year":"2014","title":"Experiments with aLS-Coop-Loc cooperative combined localization and time-synchronization","authors":"Wouter van Kleunen, Niels A. Moseley, Nirvana Meratnia, Paul J. M. Havinga","author_ids":"2643047, 2819098, 1784678, 1679046","abstract":"—Performing real world experiments with underwater communication is difficult and time-consuming. Input for evaluation of localization and time-synchronization derived from experiments is not readily available. Using real-world experiments we evaluate the performance of our cooperative combined localization and time-synchronization approach called aLS-Coop-Loc and a non-cooperative approach. We perform experiments using the SeaSTAR Proteus node and a Commercial Off-the-Shelf (COTS) node from Kongsberg Maritime at a lake and at Strindfjorden in Norway. These experiments provide realistic insight into ranging performance in real-world environments. Evaluation shows that the cooperative approach outperforms non-cooperative approaches in terms of accuracy of localization and time-synchronization. aLS-Coop-Loc provides about about 2% to 34% better position accuracy and 50% improved time-synchronization.","cites":"2","conferencePercentile":"72.68041237"},{"venue":"WiOpt","id":"b2872415dd03e8c4b1eae3dbcb29602718c92ce5","venue_1":"WiOpt","year":"2008","title":"ABBA: A Balls and bins approach to secure aggregation in WSNs","authors":"Claude Castelluccia, Claudio Soriente","author_ids":"1691730, 2678175","abstract":"—Sensor networks pledge to solve many monitoring problems: thousands of small inexpensive devices can be easily deployed in any environment and can provide measurements about diverse phenomenons, such as temperature, pollution, birds migration, etc. As sensors are low-capabilities, battery powered devices, several protocols have been proposed to maximize their lifetime, but only recently research has focused on security issues such as privacy and integrity: sensors are also very easy to tamper with and usually deployed in hostile environments, where they can be easily corrupted by an attacker in order to manipulate the information provided by the network. In this paper, we present a novel secure data aggregation protocol that provides security and integrity for sensor networks using inexpensive cryptographic tools. Our scheme protects against both internal and external attackers and balances message size, as well as energy consumption among network nodes. It provides the sink with a great amount of information, as it is able to compute mean, standard deviation, frequency distribution, etc. of the sensed values, with only one query.","cites":"6","conferencePercentile":"68.18181818"},{"venue":"WiOpt","id":"c384c0c9391b32d3832e9c1df18ce51f66567d15","venue_1":"WiOpt","year":"2007","title":"Reinforcement Learning for Routing in Ad Hoc Networks","authors":"Petteri Nurmi","author_ids":"2583077","abstract":"— We show how routing in ad hoc networks can be modeled as a sequential decision making problem with incomplete information. More precisely, we show how to map routing into a reinforcement learning problem involving a partially observable Markov decision process, and present an algorithm for optimizing the performance of the nodes in this model. We also present simulation results with our model.","cites":"9","conferencePercentile":"71.69811321"},{"venue":"WiOpt","id":"d72a782f05aec039777d0352378bf414d2d7623a","venue_1":"WiOpt","year":"2011","title":"On optimal dynamic scheduling for sum-queue minimization in trees","authors":"Srikanth Hariharan, Ness B. Shroff","author_ids":"2664011, 1750487","abstract":"—We investigate the problem of minimizing the sum of the queues of all the nodes in a wireless network with a tree topology. Nodes send their packets to the tree's root (sink). We consider a time-slotted system, and a primary interference model. We first consider the case where the root has only one child while the rest of the tree is arbitrary, and provide a causal sample-path delay optimal scheduling policy, i.e., at each time slot, for any traffic arrival pattern, the sum of the queues of all the nodes is minimum among all policies. We are able to fully characterize tree structures for which such policies exist. In particular, when the root has multiple children, there exists a causal sample-path delay optimal policy as long as only one child is not a leaf node. We also show that for any other tree structure there exists no causal sample-path delay optimal policy, thus underscoring the inherent limitation of using sample-path optimality as a performance metric and implying that other weaker metrics of delay performance should be investigated.","cites":"5","conferencePercentile":"50"},{"venue":"WiOpt","id":"e8c1308baf8eaa3c351844ad023bc8c0837816df","venue_1":"WiOpt","year":"2015","title":"Realtime detection of degradation in WiFi network's goodput due to probe traffic","authors":"Dheryta Jaisinghani, Vinayak S. Naik, Sanjit Krishnan Kaul, Sumit Roy","author_ids":"2204616, 1720018, 3047487, 2404638","abstract":"—IEEE 802.11 WLAN (Wireless or WiFi LAN) clients discover neighboring APs (Access Points) by active or passive scanning. Such an active scan of WLAN injects probe frames in the network. Network conditions like packet losses, roaming, etc. result in increased active scanning and hence, an excessive increase of the probe traffic. Of the several causes inherent to WLANs like interference, we find an excessive probe traffic also has a potential of hampering goodput of a WiFi network. We confirm this behavior in a controlled home environment as well as in an uncontrolled enterprise environment. Our analysis of 36 hours of wireless traffic collected over a period of 5 months with approximately 45 million wireless frames reveals that goodput of a WLAN drops exponentially with increase in the probe traffic. Therefore, realtime detection of increase in probe traffic and knowledge of a threshold for acceptable probing is crucial for WLAN's performance. In this paper, we formulate a metric to measure the increase in probe traffic in realtime and evaluate its functioning empirically. The metric not only reflects increase in probe traffic correctly, it is even simple enough to allow its realtime measurement.","cites":"1","conferencePercentile":"67.76315789"},{"venue":"WiOpt","id":"14bce8a78929fe02848bb4c95af74e8dc4f75b37","venue_1":"WiOpt","year":"2006","title":"Scheduling sensor activity for point information coverage in wireless sensor networks","authors":"Bang Wang, Kee Chaing Chua, Vikram Srinivasan, Wei Wang","author_ids":"1719003, 1769477, 1773350, 1769730","abstract":"— An important application of wireless sensor networks is to perform the monitoring missions, for example, to monitor some targets of interests at all times. Sensors are often equipped with non-rechargeable batteries with limited energy and energy saving is a critical aspect for wireless sensor networks. If a target is monitored simultaneously by serval sensors, some of them can be switched off to save energy without causing mission failure and by which their operational times as well as the network lifetime can be prolonged. In this paper, we study the problem of scheduling sensor activity to cover a set of targets with known locations such that all targets can be monitored all the time and the network can operate as long as possible. A solution to this scheduling problem is to partition all sensors into sensor covers such that each cover can monitor all targets and the covers are activated successively. In this paper, we propose to use the notion of information coverage which is based on the estimation theory to exploit the collaborative nature of wireless sensor networks, instead of using the conventional definition of coverage. Due to the use of information coverage, a target that is not within the sensing disk of any single sensor can still be considered to be monitored (information covered) by the cooperation of more than one sensor. This change of the problem settings complicates the solutions compared to that by using a disk coverage model and we propose a heuristic to approximately solve our problem. Simulation results show that our cover formation algorithm is better than an existing formation algorithm when only the conventional definition of coverage is used. Simulation results also illustrate that the network lifetime can be significantly improved by using the notion of information coverage compared with that by using the conventional definition of coverage.","cites":"10","conferencePercentile":"66.12903226"},{"venue":"WiOpt","id":"4dd23433ef0b83f7956d14824ddd73146e1f065e","venue_1":"WiOpt","year":"2006","title":"A general probabilistic model for improving key assignment in wireless networks","authors":"Patrick Tague, Radha Poovendran","author_ids":"2331637, 1678631","abstract":"— We study the problem of establishing secure communication channels in resource-constrained wireless networks using key predistribution. Pairwise communication channels between nodes are secured using link keys which are established as a function of cryptographic seeds predistributed to each node. We propose a general model for seed assignment which regulates the number of nodes sharing each seed. In addition, we provide a general model for wireless network connectivity where communication is restricted by both radio range and an independent pairwise relationship. We provide probabilistic analysis for network connectivity and resilience to node capture in terms of our seed assignment and network connectivity models. Finally, we provide a numerical example demonstrating how the proposed approach reduces key wastage while maintaining resilience to node capture of prior results.","cites":"2","conferencePercentile":"11.29032258"},{"venue":"WiOpt","id":"58e486316faa00701b2e9886ee911edb1cfe0730","venue_1":"WiOpt","year":"2015","title":"Cluster-centric medium access control for WSNs in structural health monitoring","authors":"Saurabh Singh, Winston Khoon Guan Seah, Bryan Ng","author_ids":"3213383, 2390462, 3241273","abstract":"—Wireless sensor networks (WSNs) are designed for sensing phenomenon and acquiring data. In structural health monitoring (SHM) of critical infrastructure, increasingly large number of sensor nodes are deployed to acquire data at the spatial density needed for structural integrity assessment. After rare catastrophic events (like earthquakes) a large volume of data related to the event can be produced in an instant, and need to be sent (to remote locations) for analysis. When many nodes are trying to transmit their data simultaneously, the contention for the wireless channel increases the probability of packet collisions resulting in packet drops, multiple retransmission attempts and consequently delays; it is also not uncommon to find certain nodes (e.g. closer to the sink) having better chances of successful transmission leading to biased data delivery. While clustering has been extensively used to reduce contention in wireless networks, the performance criteria for the network is still very node-focused. This paper presents a new perspective on cluster-based WSNs and proposes a cluster centric design that aims to tackle medium access control (MAC) layer congestion associated with burst packet generation in an unbiased manner, making it suitable for applications like SHM.","cites":"1","conferencePercentile":"67.76315789"},{"venue":"WiOpt","id":"b19724905cf870346a03d5e38cac26eabf56a7d4","venue_1":"WiOpt","year":"2013","title":"End-to-end quality adaptation scheme based on QoE prediction for video streaming service in LTE networks","authors":"Huifang Chen, Xin Yu, Lei Xie","author_ids":"1810024, 4092561, 4043707","abstract":"—How to measure the user's feeling about mobile video service and to improve the quality of experience (QoE), has become a concern of network operators and service providers. In this paper, we first investigate the QoE evaluation method for video streaming over Long-Term Evolution (LTE) networks, and propose an end-to-end video quality prediction model based on the gradient boosting machine. In the proposed QoE prediction model, cross-layer parameters extracted from the network layer, the application layer, video content and user equipment are taken into account. Validation results show that our proposed model outperforms ITU-T G.1070 model with a smaller root mean squared error and a higher Pearson correlation coefficient. Second, a window-based bit rate adaptation scheme, which is implemented in the video streaming server, is proposed to improve the quality of video streaming service in LTE networks. In the proposed scheme, the encoding bit rate is adjusted according to two control parameters, the value of predicted QoE and the feedback congestion state of the network. Simulation results show that our proposed end-to-end quality adaptation scheme efficiently improves user-perceived quality compared to the scenarios with fixed bit rates.","cites":"0","conferencePercentile":"15.47619048"},{"venue":"WiOpt","id":"436c1d2fd06806fa6099ba7f44e3e398680d3193","venue_1":"WiOpt","year":"2012","title":"Low-complexity Optimal Scheduling over Correlated Fading Channels with ARQ Feedback","authors":"Wenzhuo Ouyang, Atilla Eryilmaz, Ness B. Shroff","author_ids":"2305306, 1688915, 1750487","abstract":"—We investigate the downlink scheduling problem under Markovian ON/OFF fading channels, where the instantaneous channel state information is not directly accessible, but is revealed via ARQ-type feedback. The scheduler can exploit the temporal correlation/channel memory inherent in the Markovian channels to improve network performance. However, designing low-complexity and throughput-optimal algorithms under temporal correlation is a challenging problem. In this paper, we find that under an average number of transmissions constraint, a low-complexity index policy is throughput-optimal. The policy uses Whittle's index value, which was previously used to capture opportunistic scheduling under temporally correlated channels. Our results build on the interesting finding that, under the intricate queue length and channel memory evolutions, the importance of scheduling a user is captured by a simple multiplication of its queue length and Whittle's index value. The proposed queue-weighted index policy has provably low complexity which is significantly lower than existing optimal solutions. I. INTRODUCTION In wireless networks with randomly fluctuating channels, intelligently scheduling users is critical for achieving high network efficiency. Under the assumption that the scheduler possesses accurate instantaneous Channel State Information (CSI), maximum-weight scheduling algorithms (e.g., [1]-[3]) are known to be throughput-optimal, i.e., no scheduling policy can ensure system stability for arrival rates that are not supportable by a max-weight scheduler. In practice, accurate instantaneous CSI is difficult to obtain at the scheduler. Hence, in this work we consider the important scenario where the instantaneous CSI is not directly accessible to the scheduler, but is instead revealed through ARQ-type feedback only after each scheduled data transmission. The time-correlation or channel memory inherent in the fading channels can be exploited by the scheduler for more informed decisions, and hence to obtain large throughput gains (e.g., [4][5]). In this paper, we incorporate the temporal correlation by modeling the fading channels as Markov-modulated ON/OFF processes. Under imperfect CSI, channel memory, and limited network resources, designing throughput-optimal scheduling","cites":"5","conferencePercentile":"72.58064516"},{"venue":"WiOpt","id":"0075f26b085bd10a15e8e494dd00ded4910374f5","venue_1":"WiOpt","year":"2011","title":"Scheduling with Per-link Queues and No Per-flow information in Multi-hop Wireless Networks","authors":"Bo Ji, Changhee Joo, Ness B. Shroff","author_ids":"7464840, 1693651, 1750487","abstract":"This paper focuses on designing and analyzing throughput-optimal scheduling policies that avoid the use of per-flow information, maintain one single data queue for each link, exploit only local information, and potentially improve the delay performance, for multi-hop wireless networks under general interference constraints. Although the celebrated back-pressure algorithm maximizes throughput, it requires per-flow information (which may be difficult to obtain and maintain), maintains per-flow (or per-destination) queues at each node, relies on constant exchange of queue length information among neighboring nodes to calculate link weights, and may result in poor delay performance. In contrast, the proposed schemes can circumvent these drawbacks while guaranteeing throughput optimality. We rigorously analyze the throughput performance of the proposed schemes and show that they are throughput-optimal using fluid limit techniques via an inductive argument. We also conduct simulations to show that the proposed schemes can substantially improve the delay performance.","cites":"1","conferencePercentile":"10.81081081"},{"venue":"WiOpt","id":"04ba30a3db90d1fe15677a15f448e0c227102fbc","venue_1":"WiOpt","year":"2013","title":"Life-Add: Lifetime Adjustable design for WiFi networks with heterogeneous energy supplies","authors":"Shengbo Chen, Tarun Bansal, Yin Sun, Prasun Sinha, Ness B. Shroff","author_ids":"1769616, 3268059, 1709839, 1705629, 1750487","abstract":"—WiFi usage significantly reduces the battery lifetime of handheld devices such as smartphones and tablets, due to its high energy consumption. In this paper, we propose \" Life-Add \" : a Lifetime Adjustable design for WiFi networks, where the devices are powered by battery, electric power, and/or renewable solar energy. In Life-Add, a device turns off its radio to save energy when the channel is sensed to be busy, and sleeps for a random time period before sensing the channel again. Life-Add carefully controls the average sleep periods of the devices to improve their throughput while satisfying their operation time requirement. It is proven that Life-Add achieves near-optimal proportional-fair utility performance for the single access point (AP) scenarios. Moreover, Life-Add alleviates the near-far effect and the hidden terminal problem in general multiple AP scenarios. Our ns-3 simulations show that Life-Add simultaneously improves the lifetime, throughput, and fairness performance of WiFi networks, and can coexist harmoniously with IEEE 802.11.","cites":"2","conferencePercentile":"60.11904762"},{"venue":"WiOpt","id":"4ec1528e5f724d550a82f0a18ecd33d7ab0afb85","venue_1":"WiOpt","year":"2012","title":"A comparison between one-way delays in operating HSPA and LTE networks","authors":"Markus Laner, Philipp Svoboda, Peter Romirer-Maierhofer, Navid Nikaein, Fabio Ricciato, Markus Rupp","author_ids":"1969641, 2377370, 2007801, 3218053, 1729578, 1729118","abstract":"—The detailed understanding of packet delays in modern wireless networks is crucial to optimize applications and protocols. We conducted high precision latency measurements in operational LTE and HSPA networks, deploying a hybrid approach of active probing and withe-box testing. It allowed us to separately assess the one-way delay contributions of the radio access network and the core network for both technologies. The results show that LTE outperforms HSPA in the case of medium to high data rates. However, due to differences in the radio access procedures, the HSPA uplink connection offers lower delay for specific traffic patterns. A comparison between our measurement results and the requirements for delay sensitive applications exhibits that LTE is not (yet) the generally preferable technology. Hence, further optimizations of the LTE scheduling and resource allocation policies are required to fully exhaust all feasible latency improvements.","cites":"15","conferencePercentile":"98.38709677"},{"venue":"WiOpt","id":"5e88cf75ecb667c2c933cef6557bfe7e8581d039","venue_1":"WiOpt","year":"2012","title":"Maximizing a submodular utility for deadline constrained data collection in sensor networks","authors":"Zizhan Zheng, Ness B. Shroff","author_ids":"1723278, 1750487","abstract":"—We study the utility maximization problem for data collection in sensor networks subject to a deadline constraint, where the data on a selected subset of nodes are collected through a routing tree rooted at a sink subject to the 1-hop interference model. Our problem can be viewed as a Network Utility Maximization (NUM) problem with binary decisions. However, instead of a separable concave form of system utility commonly seen in NUM, we consider the class of monotone submodular utility functions defined on subsets of nodes, which is more appropriate for the applications we consider. While submodular maximization subject to a cardinality constraint has been well understood, our problem is more challenging due to the multi-hop data forwarding nature even under a simple interference model. We have derived efficient approximation solutions to this problem both for raw data collection and when in-network data aggregation is applied.","cites":"3","conferencePercentile":"54.83870968"},{"venue":"WiOpt","id":"c49178abced7694135a8a67e0e18e414b19f9017","venue_1":"WiOpt","year":"2012","title":"Energy minimization in cooperative relay networks with sleep modes","authors":"Yiqun Wu, Ness B. Shroff, Zhisheng Niu","author_ids":"2685940, 1750487, 8252841","abstract":"—We consider a cooperative relay network where a source node communicates to a destination node with the help of multiple relay nodes (RNs). RNs are assumed to be able to work in either active mode or sleep mode. To minimize the total energy consumption, working modes of RNs and power allocation need to be optimized. Based on the time scales of mode transition, we formulate two different energy minimization problems. In the case of fast transition, where the transition can be applied in each frame, the problem is shown to be a supermodular minimization problem. We propose a relaxation based algorithm with a provable performance bound. In the case of slow transition, where the working modes of RNs are fixed, the problem is proven to be NP-hard even for the single relay selection case. Approximation algorithms are proposed based on the supermodular structure of the problem. Simulation results show that the proposed algorithms perform close to optimal, and significant energy saving can be achieved. The effect of the transition cost and the comparison between fast transition and slow transition are also presented.","cites":"2","conferencePercentile":"39.51612903"},{"venue":"WiOpt","id":"22d859abd35f39a6d241143fb6c1016b0e9fef36","venue_1":"WiOpt","year":"2014","title":"An economic model of subscriber offloading between Mobile Network Operators and WLAN operators","authors":"Cameron W. Patterson, Allen B. MacKenzie, Savo Glisic, Beatriz Lorenzo, Juha Röning, Luiz A. DaSilva","author_ids":"2833326, 1740708, 2250236, 2234848, 3213064, 1690016","abstract":"—With increasing mobile data demand there is a push towards heterogeneous networks. Small-scale operators (SSOs) of WLANs are becoming more prevalent, while Mobile Network Operators (MNOs) seek an outlet for their customers' data usage. These conditions prompt the need for an effective relationship between the two parties for the purpose of offloading cellular data traffic to WLANs in a way that is economically beneficial to all involved. This paper presents a model of such a relationship, in which the SSO sets a strategic offloading price per subscriber and the MNO chooses how many subscribers it wants to offload in order to minimize its costs. The application of this model is simulated in a real-world WLAN deployment in Oulu, Finland. Our findings can be used by both MNOs and SSOs to make informed network deployment decisions, even before engaging in an offloading relationship.","cites":"0","conferencePercentile":"24.74226804"},{"venue":"WiOpt","id":"08a7ccfd63396cba015ac9efea108df91ea37d9d","venue_1":"WiOpt","year":"2015","title":"Cooperative Wi-Fi deployment: A one-to-many bargaining framework","authors":"Haoran Yu, Man Hon Cheung, Jianwei Huang","author_ids":"1710712, 2455756, 1678659","abstract":"—We study the cooperation of the mobile network operator (MNO) and the venue owners (VOs) on the public Wi-Fi deployment. We consider a one-to-many bargaining framework, where the MNO bargains with VOs sequentially to determine where to deploy Wi-Fi and how much to pay. Taking into account the negative externalities among different steps of bargaining, we analyze the following two cases: for the exogenous bargaining sequence case, we compute the optimal bargaining solution on the cooperation decisions and payments under a predetermined bargaining sequence; for the endogenous bargaining sequence case, the MNO decides the bargaining sequence to maximize its payoff. Through exploring the structural property of the optimal bargaining sequence, we design a low-complexity Optimal VO Bargaining Sequencing (OVBS) algorithm to search the optimal sequence. More specifically, we categorize the VOs into three types based on the impact of the Wi-Fi deployment at their venues, and show that it is optimal for the MNO to bargain with these three types of VOs sequentially. Numerical results show that compared with the random and worst bargaining sequences, the optimal bargaining sequence improves the MNO's payoff by up to 14.8% and 45.3%, respectively.","cites":"1","conferencePercentile":"67.76315789"},{"venue":"WiOpt","id":"9237533844f0c9086ad9138e6e6fedc5df81f2c1","venue_1":"WiOpt","year":"2009","title":"Gaming the jammer: Is frequency hopping effective?","authors":"Konstantinos Pelechrinis, Christos Koufogiannakis, Srikanth V. Krishnamurthy","author_ids":"2096978, 1797995, 1791108","abstract":"—Frequency hopping has been the most popularly considered approach for alleviating the effects of jamming attacks. In this paper, we provide a novel, measurement-driven, game theoretic framework that captures the interactions between a communication link and an adversarial jammer, possibly with multiple jamming devices, in a wireless network employing frequency hopping (FH). The framework can be used to quantify the efficacy of FH as a jamming countermeasure. Our model accounts for two important factors that affect the aforementioned interactions: (a) the number of orthogonal channels available for use and (b) the frequency separation between these orthogonal bands. If the latter is small, then the energy spill over between two adjacent channels (considered orthogonal) is high; as a result a jammer on an orthogonal band that is adjacent to that used by a legitimate communication, can be extremely effective. We account for both these factors and using our framework we provide bounds on the performance of proactive frequency hopping in alleviating the impact of a jammer. The main contributions of our work are: (a) Construction of a measurement driven game theoretic framework which models the interactions between a jammer and a communication link that employ FH. (b) Extensive experimentation on our indoor testbed in order to quantify the impact of a jammer in a 802.11a/g network. (c) Application of our framework to quantify the efficacy of proactive FH across a variety of 802.11 network configurations. (d) Formal derivation of the optimal strategies for both the link and the jammer in 802.11 networks. Our results demonstrate that frequency hopping is largely inadequate in coping with jamming attacks in current 802.11 networks. In particular, we show that if current systems were to support hundreds of additional channels, FH would form a robust jamming countermeasure 1 .","cites":"19","conferencePercentile":"92.85714286"},{"venue":"WiOpt","id":"5710995e700dd72cc2d79e0e3da2011f40889942","venue_1":"WiOpt","year":"2006","title":"GMAC: A game-theoretic MAC protocol for mobile ad hoc networks","authors":"Fan Wang, Marwan Krunz","author_ids":"6701355, 1741829","abstract":"— The conservative nature of the 802.11 ad hoc scheme has instigated extensive research whose goal is to improve the spatial reuse and/or energy consumption of this scheme. Transmission power control (TPC) was shown to be effective in achieving this goal. Despite their demonstrated performance gains, previously proposed power-controlled channel access protocols often incur extra hardware cost (e.g., multiple transceivers). Furthermore, they do not fully exploit the potential of power control due to the heuristic nature of power allocation and \" interference margin \" computations. In this paper, we propose a distributed, single-channel MAC protocol (GMAC) that is inspired by game theory. In GMAC, multiple potential transmitters are first involved in an admission phase, which enables terminals to compute the transmission powers that achieve a Nash equilibrium (NE) for the given utility function. Subsequently, successful contenders can simultaneously proceed with their transmissions. Simulation results indicate that GMAC improves the network throughput over the 802.11 scheme by about 80%, and over another single-channel power-controlled MAC protocol (POWMAC) by about 40%. These gains are achieved at no extra energy cost.","cites":"12","conferencePercentile":"79.03225806"},{"venue":"WiOpt","id":"06059c7268c1a0db0d664284bea3150d5c98816f","venue_1":"WiOpt","year":"2010","title":"Optimal revocations in ephemeral networks: A game-theoretic framework","authors":"Igor Bilogrevic, Mohammad Hossein Manshaei, Maxim Raya, Jean-Pierre Hubaux","author_ids":"1934140, 2534900, 2152296, 1757221","abstract":"—Revocation of public-key certificates is an important security primitive. In this paper, we design a fully distributed local certificate revocation scheme for ephemeral networks-a class of extremely volatile wireless networks with short-duration and short-range communications-based on a game-theoretic approach. First, by providing incentives, we can guarantee the successful revocation of the malicious nodes even if they collude. Second, thanks to the records of past behavior, we dynamically adapt the parameters to nodes' reputations and establish the optimal Nash equilibrium (NE) on-the-fly, minimizing the social cost of the revocation. Third, based on the analytical results, we define a unique optimal NE selection protocol and evaluate its performance through simulations. We show that our scheme is effective in quickly and efficiently removing malicious devices from the network.","cites":"3","conferencePercentile":"46.42857143"},{"venue":"WiOpt","id":"8a21c1043792fdb39b4edd1d6922fe04a3fbb56d","venue_1":"WiOpt","year":"2005","title":"Modeling and Analysis of Opportunistic Routing in Low Traffic Scenarios","authors":"Rahul C. Shah, Sven Wiethölter, Adam Wolisz, Jan M. Rabaey","author_ids":"1683188, 1920713, 1778337, 1714291","abstract":"Opportunistic routing protocols have been proposed as efficient methods to exploit the high node densities in sensor networks to mitigate the effect of varying channel conditions and non-availability of nodes that power down periodically. They work by integrating the network and data link layers so that they can take a joint decision as to the next hop forwarding node based on its availability and suit-ability as a forwarder. This cross-layer integration makes it harder to optimize the protocol due to the dependencies among the different components of the protocol stack. In this paper, we provide a framework to model opportunistic routing that breaks up the functionality into three separate components and simplifies analysis. The framework is used to model two variants of opportunistic routing and is shown to match well with simulation results. In addition, using the model for performance analysis yields important guidelines for the future design of such protocols.","cites":"19","conferencePercentile":"88.46153846"},{"venue":"WiOpt","id":"848f5a72301c0d6a2bb175ec4ccff05c2ad28317","venue_1":"WiOpt","year":"2009","title":"Joint resource allocation and admission control in wireless mesh networks","authors":"Tae-Suk Kim, Yong Yang, Jennifer C. Hou, Srikanth V. Krishnamurthy","author_ids":"3119062, 7135232, 1704715, 1791108","abstract":"—Many next generation applications (such as video flows) are likely to have associated minimum data rate requirements to ensure satisfactory quality as perceived by end-users. While there have been prior approaches on supporting quality-of-service (QoS) in mesh networks, they have largely ignored the issues that arise due to self-interference, the interference between different link layer transmissions of a single flow along a multi-hop path. In this paper, we develop a framework to address the problem of maximizing the aggregate utility of traffic flows in wireless mesh networks, with constraints imposed both due to self-interference and minimum rate requirements. The output of our framework is a schedule that dictates which links are to be activated simultaneously, and provides specifications of the resources associated with each of those links. Utilizing the proposed framework as a basis, we build an admission control module that intelligently manages the resources among the flows in the network and admits as many new flows as possible without violating the QoS of the existing flows. We provide numerical results to demonstrate the efficacy of our framework.","cites":"6","conferencePercentile":"71.42857143"},{"venue":"WiOpt","id":"0e759819091b66b42858129434d69b8142c57b65","venue_1":"WiOpt","year":"2008","title":"Large system design and analysis of protocols for decode-forward relay networks","authors":"Laura Cottatellucci, Terence Chan, Nadia Fawaz","author_ids":"1806143, 2134024, 1809989","abstract":"— In this work we consider a relay assisted CDMA network with a large number of sources and half duplex relays and a unique destination. We propose two relaying protocols called direct relaying (DR) and full relaying (FR). By dividing the relays in groups and adopting different forwarding delays for each group both protocols introduce diversity which depends on the number of groups and on the protocol. In DR mode, the relays forward only signals received directly from the sources. In FR mode, relays forward both signals received by the sources and the other relay groups by applying network coding at the physical layer. This implies a different level of diversity at the destination for the two schemes. Then, we propose an analytical framework for the analysis of the achievable rates in such a network, as the number of nodes and relays become asymptotically large.","cites":"2","conferencePercentile":"36.36363636"},{"venue":"WiOpt","id":"0dc7f969a1a3be28dc3136311a143167d9684a3a","venue_1":"WiOpt","year":"2009","title":"A new collision-free pseudonym scheme in mobile ad hoc networks","authors":"Ji Won Yoon, Hyoungshick Kim","author_ids":"8163480, 1802864","abstract":"—A mobile ad hoc network (MANET) is a decentralized network of mobile nodes. Due to the broadcast nature of radio transmissions, communication in MANETs is more susceptible to malicious traffic analysis. An interesting problem is how to thwart malicious traffic analysis. Most anonymous communication protocols are based on the pseudonyms of mobile nodes. However, conventional pseudonym schemes have some limitations such as collisions of pseudonyms and high computational complexity due to the use of cryptographic hash functions. Collisions of identities are not desirable since they are the main causes for reduced effective bandwidth, increased energy consumption and non-deterministic data delivery. In this paper, we propose a new collision-free pseudonym scheme to enable anonymous communication. In our approach, each node generates pseudonyms by using a permutation matrix without collisions. The challenging issue is how to store the overall permutation matrix. It is practically hard to assume that mobile nodes maintain the permutation matrix due to the limitation of resources. Therefore we design the online computation of each node's own pseudonym without loading the overall matrix.","cites":"2","conferencePercentile":"33.03571429"},{"venue":"WiOpt","id":"6e4a9d95d886ba606beede068a5e7ddcaf6b9d28","venue_1":"WiOpt","year":"2014","title":"A near-optimal randomized algorithm for uplink resource allocation in OFDMA systems","authors":"Yang Yang, Changwon Nam, Ness B. Shroff","author_ids":"3432913, 2050831, 1750487","abstract":"—OFDMA has been selected as the multiple access scheme for emerging broadband wireless communication systems. However, designing efficient resource allocation algorithms for OFDMA systems is a challenging task, especially in the uplink, due to the combinatorial nature of subcarrier assignment and the distributed power budget for different users. Inspired by Glauber dynamics, in this paper, we propose a randomized iteration-based uplink OFDMA resource allocation algorithm. We show that our algorithm is near-optimal in the sense that by increasing the number of iterations (which scales up the complexity), with arbitrarily large probability, the algorithm can converge to the subcar-rier/power allocation pattern with the maximum sum-utility. We also show that this algorithm can be generalized to solve a joint uplink-downlink allocation problem in full-duplex OFDMA systems. Simulations are conducted to compare the performance of our algorithm with existing ones.","cites":"2","conferencePercentile":"72.68041237"}]}