{"Wireless_Networks_and_Systems_f":[{"venue":"Wireless Networks and Systems for Developing Regions","id":"0df887879694a1296fedd189f064bff9e176787d","venue_1":"Wireless Networks and Systems for Developing Regions","year":"2008","title":"Optimizing high latency links in the developing world","authors":"Yaw Anokwa, Colin Dixon, Gaetano Borriello, Tapan S. Parikh","author_ids":"2934454, 2599579, 1735801, 1755518","abstract":"Long distance Wi-Fi links, satellite connections, and other low-bandwidth, high-latency, intermittent options are becoming the norm for providing connectivity in the developing world. For network administrators who must manage these connections, providing users the \"best\" (or even adequate) service is not a trivial problem.\n Previous work has focused on optimizing throughput and while we acknowledge the importance of this approach, we argue that latency is an important and often ignored component of network performance. The intrinsically high latencies seen in the developing world are exacerbated by excessive queueing from traffic which often swamp links with miss-sized queues. Current solutions to this problem tend to require resources (people, time and money) that are generally not available in developing environments. In this paper, we demonstrate that latency is a problem in real world deployments and propose an easy to deploy solution.","cites":"5","conferencePercentile":"61.11111111"},{"venue":"Wireless Networks and Systems for Developing Regions","id":"c366681b8265d1789e3bcd87a3011033c1fa6928","venue_1":"Wireless Networks and Systems for Developing Regions","year":"2008","title":"Design principles for opportunistic communication in constrained computing environments","authors":"Earl A. Oliver, Srinivasan Keshav","author_ids":"1998774, 1692842","abstract":"Constrained computing environments, such as smartphones and embedded wireless devices, are becoming increasingly prevalent. Driven by the need to minimize power usage, these devices are characterized by their low-power CPUs, limited memory, slow yet vast amounts of persistent storage, and one or more wireless network interfaces. As the dominant form of future computing, understanding and adapting to the trade offs that exist between computing and communication resources and energy consumption will become increasingly important.\n In this paper we consider the effect of a constrained computing environment on opportunistic communication. Drawing from our experiences with two existing mobile systems, we detail the constraints that inhibit opportunistic communication. We also show how these constraints can be satisfied using a set of design principles for systems that depend on opportunistic communication.","cites":"0","conferencePercentile":"16.66666667"},{"venue":"Wireless Networks and Systems for Developing Regions","id":"17ac5b1308405b8a39885059724d6dc6d82e1933","venue_1":"Wireless Networks and Systems for Developing Regions","year":"2008","title":"A radio multiplexing architecture for high throughput point to multipoint wireless networks","authors":"Ramakrishna Gummadi, Rabin K. Patra, Sergiu Nedevschi, Sonesh Surana, Eric A. Brewer","author_ids":"2491388, 2055347, 1733120, 3165258, 1759010","abstract":"WiFi-based point-to-multipoint systems are a cost-effective solution for providing high-bandwidth connectivity to remote rural regions. However, current point-to-multipoint deployments are hampered by several challenges. Their capacity to support a large number of clients simply by increasing the number of radios at the base station is limited because space restrictions on radio towers bound the number of antennas that can be installed at one physical location. Also the limited availability of wireless channels restricts the number of clients that can be simultaneously supported by a base station at any point of time.\n In this paper, we explore high-throughput architectures for point-to-multipoint networks. We show how we can increase the number of radios at the base station without increasing the number of antennas simultaneously. We propose a simple yet practical multiplexing design that uses cheap RF combiner/splitter devices for multiplexing several radios onto a single antenna. We also examine a more general design that uses RF switches, and which allows us to allocate radios to antennas dynamically based on client traffic demands.\n As a proof of concept, we demonstrate and evaluate the simple case of combining up to three radios operating on different channels onto only one antenna, using off-the-shelf combiner/splitters and attenuators. We show that not only is such a design feasible, but also that the achieved link throughput in both directions is as good as the one obtained by using separate antennas for each radio, as long as we provide sufficient RF isolation between the multiplexed radios.","cites":"3","conferencePercentile":"38.88888889"},{"venue":"Wireless Networks and Systems for Developing Regions","id":"4abf3dc742498b5aeaae186b05fd93b5e62ff752","venue_1":"Wireless Networks and Systems for Developing Regions","year":"2008","title":"A framework for multi-region delay tolerant networking","authors":"Mirco Musolesi, Cecilia Mascolo","author_ids":"1806767, 1733840","abstract":"Almost all the existing work on routing in delay tolerant networks has focussed on the problem of delivery of messages inside a single region, characterized by the same network infrastructure and namespace. However, many deployment scenarios, especially in developing regions, will probably involve routing among different regions composed of several heterogeneous types of network domains such as WiMAX or satellite networks and ad hoc networks composed of short-range radio enabled devices, like mobile phones with Bluetooth interface.\n In this paper, we introduce a proposal for inter-region routing based on both probabilistic and deterministic forwarding mechanisms, embedded in an architectural framework able to support it. We also compare our solution to existing approaches in delay tolerant networking, discussing the main requirements and possible solutions, and outlining the open research problems.","cites":"3","conferencePercentile":"38.88888889"}]}