{"Wireless_Personal_Communication":[{"venue":"Wireless Personal Communications","id":"84663e5fd109dfdec4c22ab00342f1eb2b903562","venue_1":"Wireless Personal Communications","year":"2007","title":"Moving toward seamless mobility: state of the art and emerging aspects in standardization bodies","authors":"Marc Emmelmann, Sven Wiethölter, Andreas Köpsel, Cornelia Kappler, Adam Wolisz","author_ids":"5547697, 1920713, 2418066, 2883988, 1778337","abstract":"The challenge to provide seamless mobility in the near future emerges key aspects in various standardization bodies. This includes firstly the support of seamless homogeneous handovers. Distinct technologies—such as IEEE 802.11WLANs and 802.16WiMax—have recently amended such support to existing standards. Contrary, cellular networks already included this inherently from their design perspective. Since considerable effort has been made towards coupling of different radio access technologies, the second key aspect includes seamless heterogeneous handovers. IEEE, IETF, as well as 3GPP consider different approaches towards architectures and protocols enabling seamless mobility management. In this work, we discuss recent and ongoing standardization activities within IEEE, IETF, and 3GPP towards seamless homogeneous as well as heterogeneous mobility support.","cites":"4","conferencePercentile":"69.23076923"},{"venue":"Wireless Personal Communications","id":"1ffef7f24c6340c4ce807f7f818a2fede18c76ba","venue_1":"Wireless Personal Communications","year":"2005","title":"Enhancing Transport Layer Capability in HAPS-Satellite Integrated Architecture","authors":"Claudio E. Palazzi, Cesare Roseti, Michele Luglio, Mario Gerla, M. Y. Sanadidi, James Stepanek","author_ids":"1678881, 2680426, 1804831, 8467438, 1708056, 2607542","abstract":"The use of HAPS/UAV to enhance telecommunication capabilities has been proposed as an effective solution to support hot spot communications in limited areas. To ensure communication capabilities even in case of emergency (earthquake, power blackout, chemical/nuclear disaster, terrorist attack), when terrestrial fixed and mobile infrastructures are damaged or become unavailable, the access to satellites represents a reliable solution with worldwide coverage, even though it may suffer from shadowing impairment, especially in an urban environment. In this paper we approach an innovative and more challenging architecture foreseeing HAPS/UAV connected to the satellite in order to enlarge coverage and to allow interconnection with very remote locations. In this scenario, we have analysed TCP-based applications proposing some innovative techniques, both at protocol and at architectural level, to improve performance. In particular, we propose the use of a PEP technique, namely splitting, to speed up window growth in spite of high latency, combined with TCP Westwood as a very efficient algorithm particularly suitable and well performing over satellite links.","cites":"6","conferencePercentile":"87.93103448"},{"venue":"Wireless Personal Communications","id":"00c487a0f9eed55cd2cab8915f1dd103605e5857","venue_1":"Wireless Personal Communications","year":"2011","title":"Analysis of QoS Provisioning in Cognitive Radio Networks: A Case Study","authors":"Ashwini Kumar, Jianfeng Wang, Kiran S. Challapali, Kang G. Shin","author_ids":"2400099, 5040264, 1804960, 1730051","abstract":"Dynamic Spectrum Access (DSA) is a promising solution to the problem of spectrum inefficiency. Based on Cognitive Radio (CR) technology, DSA allows a CR device to opportunistically access unused or less crowded spectrum while ensuring protection for the incumbents. Though DSA shows great potential to enhance network performance, its adverse side-effects on application QoS may limit its usefulness. QoS support in a DSA-based network is not trivial due to the fact that in addition to unfavorable characteristics of the wireless medium, the secondary devices must face additional interference and interruption from incumbents that have to be protected. In this paper, we present a case study of key DSA protocol characteristics necessary for QoS provisioning. Specifically, we consider a personal/portable CR system that supports high quality multimedia (including HDTV) streaming over UHF frequency bands. We model and evaluate the QoS-oriented CR system together with the underlying QoS-Provisioned DSA Protocol (called QPDP) through extensive simulations. The results show the effectiveness of the proposed DSA QoS provisioning approach in sustaining high levels of QoS, e.g., supporting HDTV streaming in TV bands. This outcome is significant as FCC has recently approved UHF bands for unlicensed operations in the USA, and various DSA-based CR systems are being actively designed by the wireless industry. The techniques outlined in this work can be generalized to be applicable to generic DSA design in various spectrum bands. 123 A. Kumar et al.","cites":"1","conferencePercentile":"43.93939394"},{"venue":"Wireless Personal Communications","id":"01e9e69acce71f77afe4ba652d7900720f1926aa","venue_1":"Wireless Personal Communications","year":"2002","title":"Cross-Layer Design for Data Accessibility in Mobile Ad Hoc Networks","authors":"Kai Chen, Samarth H. Shah, Klara Nahrstedt","author_ids":"2262178, 2978103, 1688353","abstract":"Mobile ad hoc networks (MANET) are becoming an integral part of the ubiquitous computing and communication environment, providing new infrastructure for multimedia applications such as video phone, multimedia-on-demand, and others. In order to access multimedia information in MANET, Quality of Service (QoS) needs to be considered, such as high success rate to access multimedia data, bounded end-to-end delay, and others. In this paper, we present a data accessibility service for a group of mobile users to access desired data with high success rate. This accessibility service is only possible if we utilize advanced data advertising, lookup and replication services, as well as a novel predictive location-based QoS routing protocol in an integrated fashion. Using cross-layer design, we illustrate how the QoS routing protocol assists data advertising, lookup and replication services to achieve high data access success rate. Simulation results have shown that our design is successful in a dynamic MANET.","cites":"82","conferencePercentile":"95"},{"venue":"Wireless Personal Communications","id":"def98e7038f049a8b66f08ea67b1453532c2fc83","venue_1":"Wireless Personal Communications","year":"2013","title":"A Self-Adaptive Spectrum Management Middleware for Wireless Sensor Networks","authors":"Robert Thompson, Gang Zhou, Lei Lu, Sudha Krishnamurthy, Hover Dong, Xin Qi, Yantao Li, Matthew Keally, Zhen Ren","author_ids":"1746494, 1720964, 6059296, 1715059, 1703621, 1720357, 1682115, 1745920, 1734622","abstract":"The vision of the Internet of Things, wherein everyday objects are embedded with smart wireless sensor devices, is making these sensor devices increasingly pervasive. As the density of their deployment in overlapping or adjacent areas increases, the contention for the unlicensed 2.4 GHz ISM band will also increase. To deal with the crowded spectrum, nodes must use the channels more judiciously and be able to adapt by detecting and switching to the most available channel. The SAS middleware that we have developed, is a self-adaptive spectrum management middleware for wireless sensor networks that enhances single-frequency MAC protocols with multi-frequency capability, without any change in hardware. It allows a single-frequency MAC protocol, like B-MAC, to automatically adapt to the least congested physical channel at runtime. SAS supports a combination of receiver-initiated and sender-initiated schemes to decide when to switch the channel and which channel to switch to. We have implemented the B-MAC protocol integrated with SAS in TinyOS 2.1 on TelosB sensor devices and evaluated its performance on the conditions of varied data flows and the interference produced by a jammer. The results demonstrate that the integrated B-MAC protocol outperforms B-MAC in terms of packet reception ratio, system throughput, average packet delay, and energy consumption.","cites":"2","conferencePercentile":"64"},{"venue":"Wireless Personal Communications","id":"951f8195c38e5bbad0dd2efaaed4f0bffe42fbc9","venue_1":"Wireless Personal Communications","year":"2012","title":"A Study of MIMO Gaussian Channels Based on Synergetics","authors":"Hailin Xiao, Shan Ouyang, Cheng-Xiang Wang, Feng Zhao","author_ids":"1741675, 2440594, 1698245, 5164095","abstract":"By interpolating between information theory and synergetics, we provide a bridge to connect the two kinds of subjects. As an application, the capacity formula of multiple-input multiple-output Gaussian channels based on the Fokker-Planck Equation of the synergetics is derived. It is in accordance with Telatar's capacity formula in information theory and gives a physical explanation (order parameters) of the observed channel characteristics. Moreover, the master equation of the information theory is also derived to obtain error exponents. Error exponents provide a partial solution to how to get close to channel capacity by giving an upper bound to the probability of error. These results demonstrate that the notion of synergetics introduced here can serve as an intuitive tool in information theory.","cites":"0","conferencePercentile":"21.2962963"},{"venue":"Wireless Personal Communications","id":"66131eb1fae92e1fc2ea751d12d8befcb902ac61","venue_1":"Wireless Personal Communications","year":"2004","title":"Providing Fault-Tolerant Ad hoc Routing Service in Adversarial Environments","authors":"Yuan Xue, Klara Nahrstedt","author_ids":"1713594, 1688353","abstract":"Most existing designs of ad hoc networks are based on the assumption of non-adversarial environments, where each node in the network is cooperative and well-behaved. When misbehaving nodes exist in the network, the performance of current routing protocols degrades significantly. Since ad hoc networks, consisting of autonomous nodes, are open and distributed in nature, maintaining a fault-free network environment is extremely difficult and expensive. In this paper, we propose a new routing service named best-effort fault-tolerant routing (BFTR). The design goal of BFTR is to provide packet routing service with high delivery ratio and low overhead in presence of misbehaving nodes. Instead of judging whether a path is good or bad, i.e., whether it contains any misbehaving node, BFTR evaluates the routing feasibility of a path by its end-to-end performance (e.g. packet delivery ratio and delay). By continuously observing the routing performance, BFTR dynamically routes packets via the most feasible path. BFTR provides an efficient and uniform solution for a broad range of node misbehaviors with very few security assumptions. The BFTR algorithm is evaluated through both analysis and extensive simulations. The results show that BFTR greatly improves the ad hoc routing performance in the presence of misbehaving nodes.","cites":"28","conferencePercentile":"100"},{"venue":"Wireless Personal Communications","id":"2b5882785e21602dad00050a132402c48d339b5f","venue_1":"Wireless Personal Communications","year":"2011","title":"A Simple and Robust Vertical Handoff Algorithm for Heterogeneous Wireless Mobile Networks","authors":"Daojing He, Caixia Chi, Sammy Chan, Chun Chen, Jiajun Bu, Mingjian Yin","author_ids":"1776387, 1700795, 3506035, 5371645, 8475311, 2987199","abstract":"Wireless networking is becoming an increasingly important and popular way of providing global information access to users on the move. One of the main challenges for seamless mobility is the availability of simple and robust vertical handoff algorithms, which allow a mobile node to roam among heterogeneous wireless networks. In this paper, motivated by the facts that vertical handoff procedure is done on mobile nodes and battery power may be one crucial parameter for certain mobile nodes, a simple and robust two-step vertical handoff decision algorithm is proposed for heterogeneous wireless mobile networks. To the best of our knowledge, this is the first vertical handoff algorithm that takes the classification of mobile nodes into consideration, one is resource-poor mobile nodes, and the other is resource-rich mobile nodes. This new feature makes it more applicable in the real world. In addition, dynamic new call blocking probability is firstly introduced by this paper to make handoff decision for wireless networks. The experiment results have shown that the proposed algorithm outperforms traditional algorithms in bandwidth utilization, handoff dropping rate and handoff rate.","cites":"9","conferencePercentile":"89.39393939"},{"venue":"Wireless Personal Communications","id":"0315c33863d1c2dc5e39be831c3a4315da208bc8","venue_1":"Wireless Personal Communications","year":"2013","title":"Continuous Location Dependent Queries in Mobile Wireless Sensor Networks","authors":"Liang Hong, Gang Zhou, Bo Liu, Sang Hyuk Son","author_ids":"1688062, 1720964, 1724237, 1806873","abstract":"Query processing in mobile Wireless Sensor Networks (WSNs) is still a challenging problem because sensor mobility causes frequent changes of network topology. In this paper, we study the problem of processing Continuous Location Dependent Query (CLDQ) that retrieves the sampling data of the sensors within a specific area (i.e. query area) around a mobile sensor. Existing query processing approaches can not efficiently process CLDQs with continuously moving query areas. We propose scalable techniques to process CLDQs efficiently and accurately, including a dissemination approach, a Contention-based Distance-aware Message Scheduling scheme, in which each stationary sensor's data transmissions are smartly scheduled according to its distance to the mobile sensor, and an optimization scheme for continuous processing of CLDQs. Extensive experiments indicate that our techniques demonstrate better efficiency of processing CLDQs over state-of-the-art techniques while achieving high accuracy and short query latency under various network settings.","cites":"1","conferencePercentile":"44"},{"venue":"Wireless Personal Communications","id":"662cd7a6d6a3393c7aa6df4815de32b7091037ab","venue_1":"Wireless Personal Communications","year":"2013","title":"Discrete-time Markov Model for Wireless Link Burstiness Simulations","authors":"Yantao Li, Daniel Graham, Gang Zhou, Xin Qi, Shaojiang Deng, Di Xiao","author_ids":"1682115, 2328309, 1720964, 1720357, 2682477, 1753197","abstract":"Link burstiness can negatively affect the performance of wireless networking protocols, by causing an extra of 15 % transmission cost. It describes the underlying behavior of packet delivery and provides insights into tuning protocols to improve performance. In this paper, we propose a discrete-time Markov model to simulate the burstiness behavior of wireless links, which provides a novel approach for link burstiness studies. More specifically, we first present a discrete-time Markov model with the input of β value and the output of a sequence trace of burstiness traffic. Then we design an algorithm to simulate the Markov model, where the state transition represents the packet receptions or losses. Finally, we evaluate the proposed model in terms of distribution of link burstiness, accuracy and cost, and the results demonstrate that our model is able to accurately simulate the burstiness behavior. 123 988 Y. Li et al.","cites":"1","conferencePercentile":"44"},{"venue":"Wireless Personal Communications","id":"0f7eecb115190e7245e81938ad29a1e72cb0b534","venue_1":"Wireless Personal Communications","year":"2013","title":"EAOMDV-MIMC: A Multipath Routing Protocol for Multi-Interface Multi-Channel Mobile Ad-Hoc Networks","authors":"Gin-Xian Kok, Chee Onn Chow, Yi-Han Xu, Hiroshi Ishii","author_ids":"3000619, 3284688, 2564997, 1749649","abstract":"Multipath routing has been proposed to improve performance of mobile ad-hoc networks (MANETs). However, due to: (1) nodes lacking of network interface and (2) route coupling, using multiple paths concurrently in conventional single channel MANETs rarely exhibit performance gain. To improve performance, an ad-hoc routing protocol (and its extension) that utilizes multiple homogeneous network interface is proposed in this paper. Unlike other related multi-channel routing protocols, channels are not assigned. Instead, nodes are allowed to make use of all available channels they are tuned to. In the base protocol, nodes estimate channel conditions by monitoring their network interface queues and distribute data packets to different channels and next-hops according to their conditions. In the extended protocol, estimated channel condition at a node is further propagated to neighboring nodes by piggybacking channel condition information in data packets. With overhearing, other nodes can retrieve this information to make better next-hop selections. Extensive simulation studies show that our protocol outperforms other related multi-channel routing protocols.","cites":"0","conferencePercentile":"16.5"},{"venue":"Wireless Personal Communications","id":"8e9357c60e613647065f74932596f47adbeec57d","venue_1":"Wireless Personal Communications","year":"2012","title":"AdaSynch: A General Adaptive Clock Synchronization Scheme Based on Kalman Filter for WSNs","authors":"Qiang Liu, Xue Liu, Jinglun Zhou, Gang Zhou, Guang Jin, Quan Sun, Min Xi","author_ids":"1726270, 1723807, 2815548, 1720964, 6609247, 4845904, 8486879","abstract":"Efficient and accurate clock synchronization is a challenge for wireless sensor networks (WSNs). Unlike previous works on clock synchronization in WSNs that consider communication delay as the main cause of clock inaccuracy, we propose a new adaptive synchronization scheme, AdaSynch, which considers the principium of the clock. We aim to overcome the challenges posed by WSNs' resource constraints such as limited energy and bandwidth, low precision oscillators and random factors. By implementing some experiments on TelosB platform, we find that the clock system switches between multiple clock models. Motivated by experiment results, we establish a general clock model which describes the clock offset in terms of the oscillators. We then design two kinds of basic Kalman filter models to achieve clock synchronization. In order to execute Kalman filtering, we propose a recursion method based on the Expectation-Maximization (EM) algorithm to access the parameters of the Kalman filter model adaptively. To describe alternation in the clock model, we propose a Multimodel Kalman filter, and put forward an adaptive method based on hypothesis testing to describe these complexities in the clock model. We demonstrate the performance gains of our scheme through experiments using different Kalman filter models based on experiment data. 123 Q. Liu et al.","cites":"4","conferencePercentile":"85.18518519"},{"venue":"Wireless Personal Communications","id":"25d1047f038963ce73d647ad89ee361f477da649","venue_1":"Wireless Personal Communications","year":"2015","title":"Secure Personal Content Networking over Untrusted Devices","authors":"Uichin Lee, Joshua Joy, Youngtae Noh","author_ids":"1799283, 2111593, 1773189","abstract":"Securely sharing and managing personal content is a challenging task in multi-device environments. In this paper, we design and implement a new platform called Personal Content Networking (PCN). Our work is inspired by Content-Centric Networking (CCN) because we aim to enable access to personal content using its name instead of its location. The unique challenge of PCN is to support secure file operations such as replication, updates, and access control over distributed untrusted devices. The primary contribution of this work is the design and implementation of a secure content management platform that supports secure updates, replications, and fine-grained content-centric access control of files. Furthermore, we demonstrate its feasibility through a prototype implementation on the CCNx skeleton.","cites":"0","conferencePercentile":"31.57894737"},{"venue":"Wireless Personal Communications","id":"2e6bf579830135bf1e8f44720e59334b5565ff42","venue_1":"Wireless Personal Communications","year":"2010","title":"PIMac: Multicast Access Control Implementation in PIM-SM","authors":"Xin Li, Hongke Zhang, Jian-Ming Chang, Jiann-Liang Chen, Han-Chieh Chao","author_ids":"1705796, 7214199, 2514474, 1726475, 1742169","abstract":"In this paper, we present an access control scheme for PIM-SM multicast domain. In order to avoid the overhead of digital signature algorithm, the proposed solution makes use of the Rendezvous Point to collect keys and implement a distributed shared-key based multi-cast access control system. As it supplies efficient host access control in PIM-SM domain, we name this scheme PIMac. Compared with the existing multicast admission control solutions, PIMac has following advantages: (1) support both receiver and sender access control; (2) realize host exclusion based on expire time; (3) compatibility with current PIM-SM protocol; (4) lower join latency; (5) anti-replay and DoS robustness; last but not least, (6) PIMac architecture is divided into two separated domains: AAA domain and multicast routing domain, entities in each domain do not rely on PKI interoperability or common secret to authenticate 123 X. Li et al. each other. The experimental results show that PIMac achieves flexible manageability and improves the performance of multicast access control systems effectively.","cites":"0","conferencePercentile":"20.23809524"},{"venue":"Wireless Personal Communications","id":"9691fe6dd4ad12e534b6c13665e0c78d5fae6e43","venue_1":"Wireless Personal Communications","year":"2013","title":"Handover Trigger Based on Frame Retransmission Trend in Mobile IPv6","authors":"Joanne Mun-Yee Lim, Chee Onn Chow, Hiroshi Ishii","author_ids":"1896224, 3284688, 1749649","abstract":"The basic reason of handover is to stay connected to the Internet with the intention of reducing connection quality deterioration. In a ubiquitous network, mobile nodes often perform handovers to stay connected to the Internet. These mobile nodes sometimes suffer from performance degradation during handover due to radio interference and reduction of signal strength. Therefore, we identified two goals in our paper. The first goal of this paper is to prove that trend based handover triggering mechanisms are better indicators of link going down as compared to threshold based handover triggering mechanisms. The second goal of this paper is to propose our idea of using frame retransmission trend in triggering handovers in order to achieve improved communication quality performance. In our work, we compared signal strength and frame retransmission as the handover decision criterion by means of simulations. Finally we present the effectiveness of our proposed frame retransmission trend as the handover decision criterion to achieve improved communication quality.","cites":"1","conferencePercentile":"44"},{"venue":"Wireless Personal Communications","id":"357eb79972f1dcb0931284a5819e0b4eecc73779","venue_1":"Wireless Personal Communications","year":"2011","title":"A Practical Implementation Attack on Weak Pseudorandom Number Generator Designs for EPC Gen2 Tags","authors":"Joan Melià-Seguí, Joaquín García, Jordi Herrera-Joancomartí","author_ids":"3229598, 3232401, 1689823","abstract":"The Electronic Product Code Generation 2 (EPC Gen2) is an international standard that proposes the use of Radio Frequency Identification (RFID) in the supply chain. It is designed to balance cost and functionality. As a consequence, security on board of EPC Gen2 tags is often minimal. It is, indeed, mainly based on the use of on board pseudorandomness, used to obscure the communication between readers and tags; and to acknowledge the proper execution of password-protected operations. In this paper, we present a practical implementation attack on a weak pseudorandom number generator (PRNG) designed specifically for EPC Gen2 tags. We show that it is feasible to eavesdrop a small amount of pseudorandom values by using standard EPC commands and using them to determine the PRNG configuration that allows to predict the complete output sequence.","cites":"10","conferencePercentile":"91.66666667"},{"venue":"Wireless Personal Communications","id":"3f45771780373abffd1d6d8d42537452fd3c4aa6","venue_1":"Wireless Personal Communications","year":"2009","title":"QoS-Aware Network-supported Architecture to Distribute Application Flows over Multiple Network Interfaces for B3G Users","authors":"Qi Wang, Tobias Hof, Fethi Filali, Robert C. Atkinson, John Dunlop, Eric Robert, Leire Aginako","author_ids":"4849112, 2158423, 2428603, 1806391, 1760990, 2236101, 2178463","abstract":"Users in the Beyond-Third-Generation (B3G) wireless system expect to receive ubiquitous communication services with customised quality-of-service (QoS) commitments for different applications, preferably in a way as transparent as possible. Ideally, flows belonging to diverse applications can be automatically and optimally distributed (or handed off) among the most appropriate access networks for multihomed users. To contribute to realising this vision, we propose a novel architecture to achieve QoS-aware policy-based flow handoffs for multihomed users, especially those equipped with more than a single personal device. In this architecture, advanced network intelligence enables a personal gateway to handle flow distributions dynamically for all the devices behind it according to the applications' QoS requirements and the current available network resources. The essential procedures in this 123 114 Q. Wang et al. architecture are described. Following that, the flow handoff delay is analysed and numerical results are illustrated. To prove the proposed concepts, up-to-date implementations with experimental results are also presented.","cites":"8","conferencePercentile":"80.26315789"},{"venue":"Wireless Personal Communications","id":"1b89745bfa170d2fd31cda07ca6b25b930c72d42","venue_1":"Wireless Personal Communications","year":"2014","title":"Angle and Time of Arrival Statistics for a 3-D Pie-Cellular-Cut Scattering Channel Model","authors":"Hao Jiang, Jie Zhou, Hisakazu Kikuchi","author_ids":"4795925, 1743129, 1800582","abstract":"In this paper, investigated a 3-D pie-cellular-cut (PCC) scattering channel model for microcell environments, that idealizes the mobile station (MS) located inside of a 3-D scattering semispheroid and base station (BS) employing a directional antenna at the center of the semispheroid. The joint probability density functions (PDFs) and marginal PDFs of Angle of arrival (AOA) and Time of Arrival (TOA) seen at the BS and the MS in correspondence with azimuth and elevation angles are derived. The results show that the proposed 3D scattering channel model performs better compared with previously proposed 2D models for outdoor and indoor environments, which promotes the research of the statistical channel models.","cites":"0","conferencePercentile":"28.03030303"},{"venue":"Wireless Personal Communications","id":"1fe16d791b42bc28b2b3513de869b43d872a4a55","venue_1":"Wireless Personal Communications","year":"2010","title":"Editorial: Special Issue on \"Security and Multimodality in Pervasive Environments\"","authors":"Deok-Gyu Lee, Sajid Hussain, George Roussos, Yan Zhang","author_ids":"1726714, 1704376, 1735411, 1686606","abstract":"Pervasive computing environments present unique challenges related to specific aspects of security and multimodality (SMPE). In fact, the accessibility of such an environment can be certainly improved using natural interfaces and multimodal interaction systems, which offer users the freedom to select one of multiple modes of interaction with services. They also offer users the opportunity to break through barriers on human–computer interaction making communication intuitive and spontaneous. On the other hand, while extending and facilitating the ways of accessing the environment, security threads arise and the environment must be properly instrumented in order to protect itself from malicious attacks and/or from erroneous actions performed by non-expert users. We received eighteen manuscripts. After the pre-review process, fourteen manuscripts were selected for the first review. Eight manuscripts were finally selected for this Special Issue after the first, second, and third review processes. Each manuscript selected from the pre-review was blindly reviewed by at least three reviewers consisting of guest editors and external reviewers.","cites":"1","conferencePercentile":"48.80952381"},{"venue":"Wireless Personal Communications","id":"1fba2f7531ed351631b5b464bc911ab1e81d6162","venue_1":"Wireless Personal Communications","year":"2013","title":"LISP-MN: Mobile Networking Through LISP","authors":"Alberto Rodríguez-Natal, Loránd Jakab, Marc Portoles-Comeras, Vina Ermagan, Preethi Natarajan, Fabio Maino, David Meyer, Albert Cabellos-Aparicio","author_ids":"3390636, 1868598, 1783929, 1772066, 3102122, 3056189, 1682683, 1723108","abstract":"The current Internet architecture was not designed to easily accommodate mobility because IP addresses are used both to identify and locate hosts. The Locator/Identifier Separation Protocol (LISP) decouples them by considering two types of addresses: EIDs that identify hosts, and RLOCs that identify network attachment points and are used as routing locators. LISP, with such separation in place, can also offer native mobility. LISP-MN is a particular case of LISP which specifies mobility. In this paper we provide a comprehensive tutorial on LISP-MN, showing its main features and how it compares to existing mobility protocols.","cites":"4","conferencePercentile":"85.5"},{"venue":"Wireless Personal Communications","id":"5f3163b28c87f3ba5bb2e5e5bcaeb46fc5a02212","venue_1":"Wireless Personal Communications","year":"2013","title":"Random Network Coding Based Schemes for Perfect Wireless Packet Retransmission Problems in Multiple Channel Networks","authors":"Zhen-guo Gao, Klara Nahrstedt, Weidong Xiang, Huiqiang Wang, Yibing Li","author_ids":"2416901, 1688353, 1727587, 1992958, 1784403","abstract":"Solving WPRTPs (wireless packet retransmission problems) using NC (network coding) is increasingly attracting research efforts. However, no work on NC based schemes for WPRTPs in MCNs (multiple channel networks) has been found. In this paper, RNC (random network coding) based schemes for P-WPRTPs (perfect WPRTPs) in MCNs, denoted as MC-P-WPRTPs (multiple channel perfect WPRTPs), are studied by transforming MC-P-WPRTPs into ILP (integer linear programming) problems. The ILP problems corresponding to MC-P-WPRTPs with four typical configurations are derived. Then the corresponding packet retransmission schedule schemes for MC-P-WPRTPs are proposed based on the solutions to the ILP problems and random network coding. To solve the ILP problems efficiently, an algorithm named as progressively fixing algorithm is proposed which recur-sively reduce the size of the ILP problem by fixing some of the variables according to some criteria. The criteria are related to the solution to the LP problem obtained by relaxing the integral constraints on the variables in the original ILP problem. Simulation results show that the NC based schemes for MC-P-WPRTPs are effective in saving packet retransmissions. In some situations, NC based schemes can save about 50 % packet retransmissions. 123 1518 Z. Gao et al.","cites":"2","conferencePercentile":"64"},{"venue":"Wireless Personal Communications","id":"86d479f0e266bda7a84f15b0a905698cfcc078b6","venue_1":"Wireless Personal Communications","year":"2005","title":"Wireless Network Simulation - Your Window on Future Network Performance","authors":"Erik R. Fledderus","author_ids":"2537276","abstract":"The paper describes three relevant perspectives on current wireless simulation practices. In order to obtain the key challenges for future network simulations, the characteristics of \" beyond 3G \" networks are described, including their impact on simulation.","cites":"0","conferencePercentile":"20.68965517"},{"venue":"Wireless Personal Communications","id":"48a907e1e16c90289a2284aca76ed634beba604c","venue_1":"Wireless Personal Communications","year":"2015","title":"Enhanced Privacy and Authentication: An Efficient and Secure Anonymous Communication for Location Based Service Using Asymmetric Cryptography Scheme","authors":"Imran Memon, Ibrar Hussain, Rizwan Akhtar, Gencai Chen","author_ids":"2832738, 3047469, 2566790, 3025640","abstract":"Past few years, the mobile technology and location based services have experienced a great increment in number of its users. The privacy issues related to these services are becoming main concerns because of the leakage of users' private information and contents. To prevent revelation of private information, many researchers have proposed several secure and authentication schemes which apply various technologies to provide integral security properties, such as symmetric encryption, digital signature, timestamp, etc. Unfortunately, some of these schemes still exhibit security and efficiency issues. In this research paper, we proposed an efficient and secure anonymous communication for location based service using asymmetric cryptography scheme over the wireless system was attempted missing some system detail. We also proposed the prevent user private information and secure communication by asymmetric cryptography scheme. We solved the wireless communication problem in A3 algorithm such as eavesdropping and this problem solved by asymmetric cryptography scheme because of its robustness against this type of attack by providing mutual authentication make the system more secure. Finally, performance and cost analysis show our scheme is more suitable for low-power and resource limited wireless system and thus availability for real implementation. According to our security analysis and performance, we can prove that our proposed asymmetric cryptography scheme is able to improve wireless communication system security and enhance efficiency in comparison to previous schemes.","cites":"1","conferencePercentile":"72.36842105"},{"venue":"Wireless Personal Communications","id":"5151b4a595f100385a026dce1f792853052039c5","venue_1":"Wireless Personal Communications","year":"2012","title":"Network Coding Based Schemes for Imperfect Wireless Packet Retransmission Problems: A Divide and Conquer Approach","authors":"Zhen-guo Gao, Mei Yang, Jianping Wang, Klara Nahrstedt, Shaobin Cai, Xiang Li, Huiqiang Wang","author_ids":"2416901, 1761844, 2152524, 1688353, 1841407, 1737850, 1992958","abstract":"NC (Network Coding) provides a new approach to packet retransmission problems in wireless networks, which are named as WPRTPs (Wireless Packet Retransmission Problems) in this paper. Some research has been conducted on P-WPRTPs (Perfect WPRTPs) where, for one receiver, a packet is either being requested by or already known to it. However, very few efforts are focused on IP-WPRTPs (Imperfect WPRTPs) where, for one receiver, a packet can be neither requested by nor already known to it. In this paper, we focus on IP-WPRTPs. Firstly, a WPRTP reduction theorem for simplifying WPRTPs is proposed and 123 Z. Gao et al. proved. Then, the upper and lower bounds of the number of necessary packet transmissions in optimal NC-based solutions to IP-WPRTPs are analyzed. Next, a scheme named as IP-WPRTP-DC (Divide and Conquer based scheme for IP-WPRTPs) is proposed based on the WPRTP reduction theorem using a divide and conquer approach. Extensive simulations show that the IP-WPRTP-DC scheme is effective in saving the number of packet transmissions for solving IP-WPRTPs.","cites":"1","conferencePercentile":"54.62962963"},{"venue":"Wireless Personal Communications","id":"93a2efa41e3663f0a5c4f6e15b364ddd1e050bbd","venue_1":"Wireless Personal Communications","year":"2006","title":"MCIP: A 3G/IP Interworking System Supporting Inter-Cluster Soft Handoff","authors":"Xin Liu, Weihua Zhuang","author_ids":"1749705, 1708377","abstract":"In this paper, a novel 3-tier Mobile Cellular IP (MCIP) access network is proposed for interworking between a third generation (3G) wireless cellular system and a wireline Internet Protocol (IP) based network. An inter-cluster hard handoff scheme and an inter-cluster soft handoff scheme are proposed, based on the 3-tier MCIP system model, the core network protocol stacks, and the underlying MCIP routing algorithm. The core network protocol stack is presented to integrate the 3G radio interface and the IP-based core network, and to provide the access network with capability to support soft handoff macroscopic space diversity. The MCIP hard and soft handoff schemes are compared with the hard handoff schemes used in the Cellular IP and HAWAII access networks. The MCIP access network is more efficient in terms of signaling cost, but has the same scalability as Cellular IP and HAWAII. Both MCIP hard and soft handoff schemes enable IP packets to be delivered within the MCIP access network in-order without loss and duplication, a highly desired attribute for real-time multimedia applications. The advantages of supporting soft handoffs and quality-of-service (QoS) provisioning for real-time services are achieved at slightly increased system complexity.","cites":"2","conferencePercentile":"32.5"},{"venue":"Wireless Personal Communications","id":"043cdd65d1f954eb35524446ede40519a25a1d1b","venue_1":"Wireless Personal Communications","year":"2002","title":"XMIDDLE: A Data-Sharing Middleware for Mobile Computing","authors":"Cecilia Mascolo, Licia Capra, Stefanos Zachariadis, Wolfgang Emmerich","author_ids":"1733840, 1699832, 3197253, 1764805","abstract":"An increasing number of distributed applications will be written for mobile hosts, such as laptop computers, third generation mobile phones, personal digital assistants, watches and the like. Application engineers have to deal with a new set of problems caused by mobility, such as low bandwidth, context changes or loss of connectivity. During disconnection, users will typically update local replicas of shared data independently from each other. The resulting inconsistent replicas need to be reconciled upon re-connection. To support building mobile applications that use both replication and reconciliation over ad-hoc networks, we have designed XMIDDLE, a mobile computing middleware. In this paper we describe XMIDDLE and show how it uses reflection capabilities to allow application engineers to influence replication and reconciliation techniques. XMIDDLE enables the transparent sharing of XML documents across heterogeneous mobile hosts, allowing on-line and off-line access to data. We describe XMIDDLE using a collaborative e-shopping case study on mobile clients.","cites":"116","conferencePercentile":"100"},{"venue":"Wireless Personal Communications","id":"4298a97bcbe2c62b2468f3191d41ed71b828ff8c","venue_1":"Wireless Personal Communications","year":"2007","title":"Multicasting with selective delivery: a SafetyNet for vertical handoffs","authors":"Henrik Petander, Eranga Perera, Aruna Seneviratne","author_ids":"1939849, 2003809, 1678254","abstract":"In future mobility support will require handling roaming in heterogeneous access networks. In order to enable seamless roaming it is necessary to minimize the impact of the vertical handoffs. Localized mobility management schemes such as FMIPv6 and HMIPv6 do not provide sufficient handoff performance, since they have been designed for horizontal handoffs. In this paper, we propose the SafetyNet protocol, which allows a Mobile Node to perform seamless vertical handoffs. Further, we propose a handoff timing algorithm which allows a Mobile Node to delay or even completely avoid upward vertical handoffs. We implement the SafetyNet protocol and compare its performance with the Fast Handovers for Mobile IPv6 protocol in our wireless test bed and analyze the results. The experimental results indicate that the proposed SafetyNet protocol can provide an improvement of up to 95% for TCP performance in vertical handoffs, when compared with FMIPv6 and an improvement of 64% over FMIPv6 with bicasting. We use numerical analysis of the protocol to show that its signaling and data transmission overhead is comparable to Fast Mobile IPv6 and significantly smaller than that of FMIPv6 with bicasting.","cites":"3","conferencePercentile":"63.46153846"},{"venue":"Wireless Personal Communications","id":"67bf24c4aab7d75b7610fb36dad96f1dc3c336c2","venue_1":"Wireless Personal Communications","year":"2011","title":"A Relaying Incentive Scheme in Multihop Cellular Networks Based on Coalitional Game with Externalities","authors":"Cuilian Li, Zhen Yang, Feng Tian","author_ids":"2361375, 5215614, 1700872","abstract":"1 —Cooperative multihop communication can greatly increase network throughput, yet packet forwarding for other nodes involves opportunity and energy cost for relays. Thus one of the prerequisite problems in the successful implementation of multihop transmission is how to foster cooperation among selfish nodes. Existing researches mainly adopt monetary stimulating. In this manuscript, we propose instead a simple and self-enforcing forwarding incentive scheme free of indirect monetary remunerating for asymmetric (uplink multihop, downlink single-hop) cellar network based on coalitional game theory, which comprises double compensation, namely, Inter-BEA, global stimulating policy allotting resources among relaying coalitions according to group size, and Intra-BEA, local compensating and allocating rule within coalitions. Firstly, given the global allotting policy, we introduce a fair allocation estimating approach which includes remunerating for relaying cost using Myerson value for partition function game, to enlighten the design of local allocating rules. Secondly, given the inter-and intra-BEA relay fostering approach, we check stability of coalition structures in terms of internal and external stability as well as inductive core. Theoretic analysis and numerical simulation show that our measure can provide communication opportunities for outer ring nodes and enlarge system coverage, while at the same time provide enough motivation with respect to resource allocation and energy saving for nodes in inner and middle ring to relay for own profits.","cites":"0","conferencePercentile":"17.42424242"},{"venue":"Wireless Personal Communications","id":"01d57a7896f1eb678d7ffb5b0fe73bc6e381acc4","venue_1":"Wireless Personal Communications","year":"2010","title":"A Reservation Optimised Advance Resource Reservation Scheme for Deploying RSVP in Mobile Environments","authors":"Hao Wang, David I. Laurenson, Jane Hillston","author_ids":"1728073, 1703657, 1689666","abstract":"One of the major problems of deploying Resource ReSerVation Protocol (RSVP) in mobile environments is called the advance resource reservation (ARR) problem. Conventional solutions to this problem waste too many network resources and increase the new Quality of Service (QoS) session blocking probability. In this paper, we propose a reservation optimised ARR scheme which constrains the number of advance reservation paths in a subnet and only allows the most eligible mobile nodes to make advance reservations. Furthermore , to evaluate the performance of the schemes, we build Markovian models of different ARR schemes using a formal performance modelling formalism named Performance Evaluation Process Algebra (PEPA). Our results indicate that the proposed reservation optimised ARR scheme can effectively balance the active and passive reservation blocking probabilities and achieves a better utilisation of the network resources, especially when the traffic intensity is high.","cites":"0","conferencePercentile":"20.23809524"},{"venue":"Wireless Personal Communications","id":"913745812e3dce1142fa4afa6aee45cc20b3b8ca","venue_1":"Wireless Personal Communications","year":"1999","title":"A Channel Sharing Scheme for Cellular Mobile Communications","authors":"Xing Zhang, Weihua Zhuang","author_ids":"1743897, 1708377","abstract":"This paper presents a channel sharing scheme, Neighbor Cell Channel Sharing (NCCS), based on region partitioning of cell coverage for wireless cellular networks. Each cell is divided into an inner-cell region and an outer-cell region. Cochannel interference is suppressed by limiting the usage of sharing channels in the inner-cell region. The channel sharing scheme achieves a traffic-adaptive channel assignment and does not require any channel locking. Performance analysis shows that using the NCCS scheme leads to a lower call blocking probability and a better channel utilization as compared with other previously proposed channel assignment schemes.","cites":"1","conferencePercentile":"21.42857143"},{"venue":"Wireless Personal Communications","id":"c9333f9194bf280db4dee2d661d90d2c3c6459e7","venue_1":"Wireless Personal Communications","year":"2011","title":"Editorial: Special Issue on Intelligent RFID Network and Innovative Applications","authors":"Sy-Yen Kuo, Chang-Fa Yang, Shuo-Yan Chou, Jiann-Liang Chen","author_ids":"1682034, 2025657, 1730115, 1726475","abstract":"Recent developments in the field of radio frequency technologies have led to numerous challenges in providing comprehensive performance for the next generation wireless networks. Meanwhile RFID as the one of important core technology in toward this future approach, have been implemented extensively for different kind applications. Those applications direct to the obviousness that issues in electromagnetic, signal collusion, privacy and security have decreased RFID role in industry implementation. In designing RFID devices more challenges and difficulties are become significant due to the low-cost and low-source factors. This has encouraged researchers to think hard in developing more secure and accurate RFID tags. Therefore this edition present the papers that addressing the solution diverse issues in RFID system such as: tag antenna and propagation, communication protocol, security and privacy, system tools, RF-based localization, RFID system architecture, deployment issue, and also applications. implemented hybrid system integrating GPS and RFID technologies to address three important factors in providing detail and reliable end to end logistics managements. Their implementation focuses in multiple heterogeneous location system in approach to extend functionality in information delivering method.","cites":"0","conferencePercentile":"17.42424242"},{"venue":"Wireless Personal Communications","id":"9b56733f84f8ae4a90ba8537c3d5b6dcf197a9f1","venue_1":"Wireless Personal Communications","year":"2013","title":"Non-Data-Aided Timing Acquisition for Asynchronous IDMA Systems","authors":"Zhao Wang, Jianhao Hu, Xingzhong Xiong, Jie Song","author_ids":"7135414, 1706105, 2136660, 1719329","abstract":"Sample-timing error can cause significant performance degradation for the inter-leave-division multiple-access systems (Wang et al. 2009). In this paper, we propose a non-data-aided timing acquisition scheme to mitigate sample-timing error due to the asynchronous transmission of random allocated user ends (UEs) on the uplink. A closed-loop timing control scheme is constructed for the asynchronous IDMA system in this paper. We use the extrinsic information generated during the iterative detection algorithm with signal noise ratio evolution to estimate the timing offset for the asynchronous uplink in the base station (BS) receiver. The BS receiver returns the timing control bits, which is generated with estimated timing offsets, to the corresponding UE. And the UE uses the timing control bits to adjust local transmission time to guarantee the sampling performance at the BS receiver. The simulation results show that the proposed acquisition scheme based on feedback loop can provide high acquisition probability and low false alarm probability. The proposed scheme can overcome the bit-error-rate performance bottleneck, which is caused by the sample-timing error in BS receiver due to the asynchronous signals in the uplink. 123 Z. Wang et al.","cites":"0","conferencePercentile":"16.5"}]}