{"Wireless_Sensor_Network.csv":[{"venue":"Wireless Sensor Network","id":"792719faf952ca2356dabf161e6c4836eaf7e7a6","venue_1":"Wireless Sensor Network","year":"2010","title":"Data Discrimination in Fault-Prone Sensor Networks","authors":"Xiaoning Cui, Qing Li, Baohua Zhao","author_ids":"2698491, 6440058, 1729034","abstract":"While sensor networks have been used in various applications because of the automatic sensing capability and ad-hoc organization of sensor nodes, the fault-prone characteristic of sensor networks has challenged the event detection and the anomaly detection which, to some extent, have neglected the importance of discriminating events and errors. Considering data uncertainty, in this article, we present the problem of data discrimination in fault-prone sensor networks, analyze the similarities and the differences between events and errors, and design a multi-level systematic discrimination framework. In each step, the framework filters erroneous data from the raw data and marks potential event samples for the next-step processing. The raw data set D is finally partitioned into three subsets, D event , D error and D ordinary. Both the scenario-based simulations and the experiments on real-sensed data are carried out. The statistical results of various discrimination metrics demonstrate high distinction ratio as well as the robustness in different cases of the network.","cites":"2","conferencePercentile":"73.23232323"},{"venue":"Wireless Sensor Network","id":"289d04302d059ae461c70baea93b916692104a8e","venue_1":"Wireless Sensor Network","year":"2010","title":"A Real-Time Urban Traffic Detection Algorithm Based on Spatio-Temporal OD Matrix in Vehicular Sensor Network","authors":"Ke Zhang, Guangtao Xue","author_ids":"1697503, 1684808","abstract":"Currently, there are kinds of algorithms in order to detect real-time urban traffic condition. Most of these approaches consider speed of vehicles as a main metric to describe traffic situation. In this paper, we find out two important observations through several experiments. (1) In urban city, the speed of vehicles is influenced significantly by some factors such as traffic lights delay and road condition. The actual situation rarely satisfy hypothesis required for these solutions. Therefore, these traditional algorithms do not work well in practical environment. (2) Traffic volume on a road segment shows strong pattern and changes smoothly at adjacent time. This feature of traffic volume inspires us to define a metric: traffic-rate, which is used to detect traffic condition in real time. In our solution, we develop a novel traffic-detection algorithm based on original-destination (OD) matrix. We illustrate our approach and measure its performance in real environment. The performance evaluations confirm the effectiveness of our algorithm.","cites":"3","conferencePercentile":"82.82828283"},{"venue":"Wireless Sensor Network","id":"e9a3de71e6c439a00a8875e92cd80f4f1cde98c0","venue_1":"Wireless Sensor Network","year":"2009","title":"Blending Sensor Scheduling Strategy with Particle Filter to Track a Smart Target","authors":"Bin Liu, Chunlin Ji, Yangyang Zhang, Chengpeng Hao","author_ids":"1702756, 2950710, 7550675, 2982529","abstract":"We discuss blending sensor scheduling strategies with particle filtering (PF) methods to deal with the problem of tracking a 'smart' target, that is, a target being able to be aware it is being tracked and act in a manner that makes the future track more difficult. We concern here how to accurately track the target with a care on concealing the observer to a possible extent. We propose a PF method, which is tailored to mix a sensor scheduling technique, called covariance control, within its framework. A Rao-blackwellised unscented Kal-man filter (UKF) is used to produce proposal distributions for the PF method, making it more robust and computationally efficient. We show that the proposed method can balance the tracking filter performance with the observer's concealment.","cites":"3","conferencePercentile":"83.33333333"},{"venue":"Wireless Sensor Network","id":"27962bbcd8b86c2ccfb9e46d81d03127fb9f314d","venue_1":"Wireless Sensor Network","year":"2010","title":"Modelling and Analysis of TCP Performance in Wireless Multihop Networks","authors":"Hannan Xiao, Ying Zhang, James A. Malcolm, Bruce Christianson, Kee Chaing Chua","author_ids":"1741268, 1752812, 1768881, 1719594, 1769477","abstract":"Researchers have used extensive simulation and experimental studies to understand TCP performance in wireless multihop networks. In contrast, the objective of this paper is to theoretically analyze TCP performance in this environment. By examining the case of running one TCP session over a string topology, a system model for analyzing TCP performance in multihop wireless networks is proposed, which considers packet buffering, contention of nodes for access to the wireless channel, and spatial reuse of the wireless channel. Markov chain modelling is applied to analyze this system model. Analytical results show that when the number of hops that the TCP session crosses is fixed, the TCP throughput is independent of the TCP congestion window size. When the number of hops increases from one, the TCP throughput decreases first, and then stabilizes when the number of hops becomes large. The analysis is validated by comparing the numerical and simulation results.","cites":"0","conferencePercentile":"16.66666667"},{"venue":"Wireless Sensor Network","id":"4b40d0343c3697af78087c858763247307d1fbc6","venue_1":"Wireless Sensor Network","year":"2009","title":"Metrics and Algorithms for Scheduling of Data Dissemination in Mesh Units Assisted Vehicular Networks","authors":"Zhongyi Liu, Bin Liu, Wei Yan","author_ids":"2931194, 1702756, 6429239","abstract":"Data dissemination is an important application in vehicular networks. We observe that messages in vehicular networks are usually subject to both time and space constraints, and therefore should be disseminated during a specified duration and within a specific coverage. Since vehicles are moving in and out of a region, dissemination of a message should be repeated to achieve reliability. However, the reliable dissemination for some messages might be at the cost of unreliable or even no chance of dissemination for other messages, which raises tradeoffs between reliability and fairness. In this paper, we study the scheduling of data dissemination in vehicular networks with mesh infrastructure. Firstly, we propose performance metrics for both reliability and fairness. Factors on both the time and space dimensions are incorporated in the reliability metric and the fairness in both network-wide and Mesh Roadside Unit-wise (MRU-wise) senses are considered in the fairness metric. Secondly, we propose several scheduling algorithms: one reliability-oriented algorithm, one fairness-oriented algorithm and three hybrid schemes. Finally, we perform extensive evaluation work to quantitatively analyze different scheduling algorithms. Our evaluation results show that 1) hybrid schemes outperform reliability-oriented and fairness-oriented algorithms in the sense of overall efficiency and 2) different algorithms have quite different characteristics on reliability and fairness.","cites":"0","conferencePercentile":"23.14814815"},{"venue":"Wireless Sensor Network","id":"23130117585e33bae1290b628951bbeba1d3d92d","venue_1":"Wireless Sensor Network","year":"2009","title":"Group Target Tracking in WSN Based on Convex Hulls Merging","authors":"Quanlong Li, Zhijia Zhao, Xiaofei Xu, Tingting Zhou","author_ids":"2647654, 3275907, 6030324, 8305522","abstract":"When a mass of individual targets move closely, it is unpractical or unnecessary to localize and track every specific target in wireless sensor networks (WSN). However, they can be tracked as a whole by view of group target. In order to decrease the amount of energy spent on active sensing and communications, a flexible boundary detecting model for group target tracking in WSN is proposed, in which, the number of sensors involved in target tracking is adjustable. Unlike traditional one or multiple individual targets, the group target usually occupies a large area. To obtain global estimated position of group target, a divide-merge algorithm using convex hull is designed. In this algorithm, group target's boundary is divided into several small pieces, and each one is enclosed by a convex hull which is constructed by a cluster of boundary sensors. Then, the information of these small convex hulls is sent back to a sink. Finally, big convex hull merged from these small ones is considered as the group target's contour. According to our metric of precision evaluation, the simulation experiments confirm the efficiency and accuracy of this algorithm.","cites":"0","conferencePercentile":"23.14814815"},{"venue":"Wireless Sensor Network","id":"45e3c74a69147b42b3e59e1ff05b48682c2c6bf3","venue_1":"Wireless Sensor Network","year":"2009","title":"Modeling and Analysis of Random Periodic Spectrum Sensing for Cognitive Radio Networks","authors":"Caili Guo, Zhiming Zeng, Chunyan Feng, Qi Liu","author_ids":"1830026, 6164975, 1680473, 1728293","abstract":"A random periodic spectrum sensing scheme is proposed for cognitive radio networks. The sensing period, the transmission time for primary users and cognitive radios are extended to general forms as random variables. A generalized Markov analytical model for sensing period optimization is presented, and the applications of the proposed analytical model by using examples involving primary user systems with both voice and data traffic are illustrated. The analysis and numerical results show that sensing period does affect the maximum rewards of the channel, and the analytical model is justified by its flexibility since it uses general forms of the sensing period, the transmission time for primary users and cognitive radios. Hence the model can be easily adapted for the analysis of many different applications.","cites":"0","conferencePercentile":"23.14814815"},{"venue":"Wireless Sensor Network","id":"4eb54e2ab2fda1a0f2393771f07f2bba9cb74a22","venue_1":"Wireless Sensor Network","year":"2010","title":"Heuristic Spectrum Assignment Algorithm in Distributed Cognitive Networks","authors":"Li Yu, Cong Liu, Zuhao Liu, Wenyu Hu","author_ids":"1720783, 1744481, 2343772, 3269308","abstract":"Cognitive radio is an exciting emerging technology that has the potential of dealing with the urgent requirement and scarcity of the radio spectrum. Although having multiple radio interfaces and available spectrum bands can generally increase the effective throughput, a problem arises as to what the best strategy to dynamically assign available bands to secondary users for maximizing throughput by minimizing the interference , and what the best scheme to allocate the spectrum holes to unlicensed users to maximize the fairness. This paper presents a distributed and heuristic spectrum assignment algorithm for multi-radio wireless cogni-tive networks in a cognitive network environment. The proposed algorithm (Fairness Bargaining with Maximum throughput, FBMT) considers the problems including system throughput and the fairness. Extensive simulation studies in 802.11 based multi-radio cognitive networks have been performed. The results indicate that the proposed algorithm can facilitate a large increase in network throughput and acquire a good fairness performance in comparison with a common spectrum assignment mechanism that is used as a benchmark in the literature.","cites":"1","conferencePercentile":"49.49494949"},{"venue":"Wireless Sensor Network","id":"95bb580762fb8f56bac51c2c2e9b3d7790a99756","venue_1":"Wireless Sensor Network","year":"2009","title":"Policy Based Self-Adaptive Scheme in Pervasive Computing","authors":"Jian-quan Ouyang, Dian-xi Shi, Bo Ding, Jin Feng, Huaimin Wang","author_ids":"3337993, 7581953, 2278502, 4787168, 7643630","abstract":"Nowadays, application systems in pervasive computing have to be self-adaptive, which means adapting themselves to dynamic environments. Our aim is to enable systematic development of self-adaptive component based applications. The paper first introduces a novel policy based framework for self-adaptive scheme in pervasive computing. Then the proposed policy ontology and policy language are well expressive and easily extensible to support the design of policy which is based on the Separation of Concerns principle. Furthermore , the context-driven event channel decouples the communication between the suppliers and consumers for asynchronous communication. The proposed framework can provide both a domain-independent and a flexible self-adaptation solution.","cites":"0","conferencePercentile":"23.14814815"},{"venue":"Wireless Sensor Network","id":"7a278833712e1e2c2e08eccd1c36de9fdc780fab","venue_1":"Wireless Sensor Network","year":"2009","title":"Voronoi-Based Coverage Optimization for Directional Sensor Networks","authors":"Jing Li, Ruchuan Wang, Haiping Huang, Lijuan Sun","author_ids":"1742253, 8199283, 7192739, 1735966","abstract":"Sensing coverage is a fundamental problem in sensors networks. Different from traditional isotropic sensors with sensing disk, directional sensors may have a limited angle of sensing range due to special applications. In this paper, we study the coverage problem in directional sensor networks (DSNs) with the rotatable orientation for each sensor. We propose the optimal coverage in directional sensor networks (OCDSN) problem to cover maximal area while activating as few sensors as possible. Then we prove the OCDSN to be NP-complete and propose the Voronoi-based centralized approximation (VCA) algorithm and the Vo-ronoi-based distributed approximation (VDA) algorithm of the solution to the OCDSN problem. Finally, extensive simulation is executed to demonstrate the performance of the proposed algorithms.","cites":"6","conferencePercentile":"97.22222222"},{"venue":"Wireless Sensor Network","id":"cfc0d2bb590ed4d7d99efddc7dc2ad483794cd1c","venue_1":"Wireless Sensor Network","year":"2010","title":"Research on Application of ZigBee Technology in Flammable and Explosive Environment","authors":"Yang Li, Ke Zhang","author_ids":"1678662, 1697503","abstract":"Wireless Sensor Network based on ZigBee technology is a wireless network which is composed of many nodes of ZigBee RF chips, sensors and MCUs, especially suitable for application of the remote monitoring system in flammable and explosive environments. This paper presents the characteristics and advantages of ZigBee technology, also discusses the system for hardware and software design. This system effectively fulfills the remote monitoring in flammable and explosive environments and posses high practical values.","cites":"2","conferencePercentile":"73.23232323"},{"venue":"Wireless Sensor Network","id":"f1b57b573d0fa9b778a3a1f6a48de3a271d4d666","venue_1":"Wireless Sensor Network","year":"2010","title":"3-D Grid-Based Localization Technique in Mobile Sensor Networks","authors":"Jia Li, Lei Sun, Wai Yee Leong, Peter Han Joo Chong","author_ids":"1687366, 1693641, 7242759, 1722155","abstract":"Considering the environmental protection, forest fire becomes a more and more serious problem and requires more concerns. This paper provides an efficient method for fire monitoring and detection in forests using wireless sensor network technology. The proposed technique estimates the location of a sensor node based on the current set of hop-count values, which are collected through the anchor nodes' broadcast. Our algorithm incorporates two salient features; grid-based output and event-triggering mechanism, to improve the accuracy while reducing the power consumption. Through the computer simulation, the output region obtained from our algorithm can always cover the target node. In addition, the algorithm was implemented and tested with a set of Crossbow sensors. Experimental results demonstrated the high feasibility and worked well in real environment.","cites":"1","conferencePercentile":"49.49494949"}]}