{"Wireless_Sensor_Networks_and_Ap":[{"venue":"Wireless Sensor Networks and Applications","id":"b452ec44f25bf37ea05fa3cbd64c5037462e4fa1","venue_1":"Wireless Sensor Networks and Applications","year":"2003","title":"Proximity interactions between wireless sensors and their application","authors":"Waylon Brunette, Carl Hartung, Ben Nordstrom, Gaetano Borriello","author_ids":"2455863, 8729489, 1888943, 1735801","abstract":"Many applications in ubiquitous computing rely on knowing where people and objects are relative to each other. By placing small wireless sensors on people, at specific locations, and on or in a wide variety of everyday objects we can collect these proximate relationships and deduce much about a person's or an object's context. This paper investigates the practical issues of recording these proximity interactions using RF wireless sensors and explores the benefits of collecting/mining proximity data and how user context and usage habits can be inferred for use by proactive applications. We describe some of the issues we faced in collecting usable proximity data from RF wireless sensors. Specifically, we discuss some of the ranging experiments we conducted, our approach to utilizing the limited local data store, and how we implemented a low-overhead time synchronization scheme. We present initial results from one of the applications we are targeting: a proactive reminding system that informs users when they leave important items behind.","cites":"8","conferencePercentile":"12.5"},{"venue":"Wireless Sensor Networks and Applications","id":"712d7864e03f844d8f5ce668ae458bb7b80bfc97","venue_1":"Wireless Sensor Networks and Applications","year":"2003","title":"MANTIS: system support for multimodAl NeTworks of in-situ sensors","authors":"Hector Abrach, Shah Bhatti, James Carlson, Hui Dai, Jeff Rose, Anmol Sheth, Brian Shucker, Jing Deng, Richard Han","author_ids":"1718240, 1716632, 7819172, 1679734, 1716830, 1744850, 1696461, 1718107, 1719013","abstract":"The <i>MANTIS</i> <i>M</i>ultimod<i>A</i>l system for <i>N</i>e<i>T</i>works of In-situ wireless Sensors provides a new multithreaded embedded operating system integrated with a general-purpose single-board hardware platform to enable flexible and rapid prototyping of wireless sensor networks.","cites":"119","conferencePercentile":"81.25"}]}