{"Wireless_Health.csv":[{"venue":"Wireless Health","id":"2f6b6f26f02de390ece41e00eeb9c7d38d41b8dc","venue_1":"Wireless Health","year":"2012","title":"Confined intra-arm communication for medical applications","authors":"Trang Thai, Gerald DeJean, Ran Gilad-Bachrach","author_ids":"8502862, 2376694, 5719660","abstract":"Personal area networks are enablers for many new medical applications. In this work, we present an implementation of such a network through a guided wave on body communication channel. This method allows the creation of high bandwidth communication channels which are confined to the body and improve on previous technologies in terms of privacy and resilience to interference and bandwidth. The technology proposed can also be used for other applications such as tracking infections and especially Nosocomial infections. Nosocomial infections (hospital-acquired infections) are believed to be linked to the death of around 100,000 patients each year in the U.S. only. The technology proposed here allows the detection of a handshake between people and interaction with other objects, thus registering them for analysis of the root cause of an infection.","cites":"0","conferencePercentile":"18.42105263"},{"venue":"Wireless Health","id":"4e27a85f9ec747e4e2f4c39e7f1067afd5865ac0","venue_1":"Wireless Health","year":"2015","title":"SARRIMA: smart ADL recognizer and resident identifier in multi-resident accommodations","authors":"Ifat Afrin Emi, John A. Stankovic","author_ids":"2746533, 7230666","abstract":"Systems for measuring Activities of Daily Livings (ADL) play a significant role in home health-care. The ability of performing ADLs successfully is used as an important factor in deciding treatments and services for patients and elderly citizens. However, most of these systems are designed for single-resident homes. The presence of multiple people creates higher numbers of parallel and overlapping activities, and introduces additional complexities in defining and recognizing activity instances. We present SARRIMA, a system that recognizes activity instances and assigns those activities to a person in 2-resident homes using only passive sensors. We evaluate the efficiency of SARRIMA in two different public datasets (data from real homes) with multiple residents. On the average SARRIMA detects more than 97% of the activity instances. We also show how the person assignment accuracy varies as a function of the similarity of behavior of the 2 people living together and of the types of passive sensors installed.","cites":"1","conferencePercentile":"85.71428571"},{"venue":"Wireless Health","id":"591723ceea89846c9a47adad9ce8e3ee828364ec","venue_1":"Wireless Health","year":"2014","title":"Efficacy of a Smartphone System to Support Groups in Behavior Change Programs","authors":"Honglu Du, G. Michael Youngblood, Peter Pirolli","author_ids":"2694801, 2904199, 1687720","abstract":"Smartphone platforms provide an excellent opportunity for projecting existing or new behavior-change methods into everyday life at great economies of scale. In this paper we present an experimental test of a new behavior-change smartphone platform and application called Fittle, which delivers ecological momentary interventions and group support to help people progressively master healthy habits. An 8-week field study involving 19 participants demonstrated the engagement and efficacy of Fittle across three classes of behavior (diet, physical activity, and stress-reduction). Individual adherence to the behavior programs was found to be associated with group membership. Content analysis of intragroup interactions suggests that high performance groups were generally more social, more supporting of each other on program goals, and shared more.","cites":"3","conferencePercentile":"95.83333333"},{"venue":"Wireless Health","id":"e0407b7f3da367ea820e852882dca4b049540496","venue_1":"Wireless Health","year":"2016","title":"Behavior vs. introspection: refining prediction of clinical depression via smartphone sensing data","authors":"Asma Ahmad Farhan, Chaoqun Yue, Reynaldo Morillo, Shweta Ware, Jin Lu, Jinbo Bi, Jayesh Kamath, Alexander Russell, Athanasios Bamis, Bing Wang","author_ids":"2832604, 2556266, 7409771, 7517240, 2233660, 1683085, 4068388, 1703636, 3331666, 1718232","abstract":"— Depression is a serious health disorder. In this study, we investigate the feasibility of depression screening using sensor data collected from smartphones. We extract various behavioral features from smartphone sensing data and investigate the efficacy of various machine learning tools to predict clinical diagnoses and PHQ-9 scores (a quantitative tool for aiding depression screening in practice). A notable feature of our study is that we leverage a dataset that includes clinical ground truth. We find that behavioral data from smartphones can predict clinical depression with good accuracy. In addition, combining behavioral data and PHQ-9 scores can provide prediction accuracy significantly exceeding each in isolation, indicating that behavioral data captures relevant features that are not reflected by PHQ-9 scores. Finally, we develop multi-feature regression models for PHQ-9 scores that achieve significantly improved accuracy compared to direct regression models based on single features.","cites":"0","conferencePercentile":"50"},{"venue":"Wireless Health","id":"0c30a2821461a11984c6b71a24ad509d96ca4095","venue_1":"Wireless Health","year":"2011","title":"Continuous, non-invasive assessment of agitation in dementia using inertial body sensors","authors":"Azziza Bankole, Martha Anderson, Aubrey Knight, Kyunghui Oh, Tonya Smith-Jackson, Mark A. Hanson, Adam T. Barth, John Lach","author_ids":"2978640, 3644617, 7503429, 3228675, 8140403, 2154021, 3084873, 8377575","abstract":"Agitated behavior is one of the most frequent reasons that patients with dementia are placed in long-term care settings. These behaviors are indicators of distress and are associated with increased risk of injury to the patients and their caregivers. This study aims to explore the ability of a custom inertial wireless body sensor network (BSN) to objectively detect and quantify agitation, validating against currently accepted subjective clinical measures -- the Cohen-Mansfield Agitation Inventory (CMAI) and the Aggressive Behavior Scale (ABS) -- within the nursing home setting. The ultimate goal is to enable continuous, real-time monitoring of physical agitation in any location over an extended period. Continuous, longitudinal assessment facilitates timely response to agitation events in order to minimize patient distress and risk for injury, to more appropriately titrate pharmacotherapy, and to enable staff (or caregivers) to successfully intervene.\n Six patients identified as being at high risk for agitated behaviors were enrolled in this pilot study. Patients underwent a series of the above validated tests of memory and agitation. The BSN nodes were applied at three sites on body for three hours while behaviors were annotated simultaneously. This process was subsequently repeated twice for each enrolled subject. The BSN data was then processed using Teager energy analysis, which an earlier study suggested was a promising method for extracting jerky and repetitive movements from inertial data. Results based on construct validity testing for agitation (CMAI) and aggression (ABS) were promising and suggest that additional study with larger sample sizes is warranted.","cites":"2","conferencePercentile":"63.23529412"},{"venue":"Wireless Health","id":"6782a5f0c88a1c39c0ef75ec308faf9f795b415d","venue_1":"Wireless Health","year":"2011","title":"Grammar-based, posture- and context-cognitive detection for falls with different activity levels","authors":"Qiang Li, John A. Stankovic","author_ids":"1732461, 7230666","abstract":"Falls are dangerous for the aged population as they result in serious detrimental consequences. Therefore, many fall detection methods have been proposed. Most of these methods characterize falls by large accelerations and fast body orientation changes. However, certain activities like sitting down quickly, vigorous gaits, and jumping, also show these characteristics, and thus are hard to distinguish from real falls. Moreover, many falls in the elderly are slow falls which show lower activity levels. Existing work fails to detect slow falls effectively because they only identify falls with high activity levels.\n In this paper, we present a grammar-based fall detection framework which not only better distinguishes fall-like activities from real falls, but also emphasizes the detection of slow falls. We utilize posture information extracted from on-body sensors and context information collected from sensors deployed in the house to reduce false positives. A fall in our framework is detected as a sequence of sensor events. We provide a context-free grammar to define these sequences so that the framework can be easily extended to detect more kinds of falls. Our case study shows that our method can distinguish various fall-like activities from real falls and can also effectively detect both fast falls and slow falls. The integration evaluation shows that our method achieves both high sensitivity and high specificity.","cites":"7","conferencePercentile":"89.70588235"},{"venue":"Wireless Health","id":"7d144f8303ebdc077c01550984b10a502853fb24","venue_1":"Wireless Health","year":"2016","title":"MedRem: an interactive medication reminder and tracking system on wrist devices","authors":"Md. Abu Sayeed Mondol, Ifat Afrin Emi, John A. Stankovic","author_ids":"2196934, 2746533, 7230666","abstract":"— Medication adherence is pivotal for effective health outcomes. One of the main reasons behind poor medication adherence is forgetfulness, and reminder systems are often used in addressing the problem. This paper presents MedRem, a novel medication reminder and tracking system on wearable wrist devices. The system is handy and interactive, and it is enriched with several useful features. To address the limitations of the tiny display size of the wrist devices, MedRem incorporates speech recognition and text-to-speech features along with clever interface design. Users interact with the system using voice commands as well as using the display available on the device. A dictionary based training approach is used on top of the state of the art speech recognition systems to reduce the errors in recognizing the commands from the users. The system is evaluated for both native and non-native English speakers. The error rates for recognizing voice commands are 6.43% and 20.9% for the native and the non-native speakers, respectively, when a off-the-shelf speech recognition system is used. MedRem reduces the error to nearly zero for both types of users through a dictionary based training approach. On average, only 1.25 and 15 training commands are required to achieve this performance for the native and the non-native speakers, respectively.","cites":"0","conferencePercentile":"50"},{"venue":"Wireless Health","id":"279426b2171f882c690b707cd49a29d0961c432f","venue_1":"Wireless Health","year":"2011","title":"mConverse: inferring conversation episodes from respiratory measurements collected in the field","authors":"Md. Mahbubur Rahman, Amin Ahsan Ali, Kurt Plarre, Mustafa al'Absi, Emre Ertin, Santosh Kumar","author_ids":"7233371, 1782708, 1713905, 8296918, 1706573, 1736293","abstract":"Automated detection of social interactions in the natural environment has resulted in promising advances in organizational behavior, consumer behavior, and behavioral health. Progress, however, has been limited since the primary means of assessing social interactions today (i.e., audio recording) has several issues in field usage such as microphone occlusion, lack of speaker specificity, and high energy drain, in addition to significant privacy concerns.\n In this paper, we present <i>mConverse</i>, a new mobile-based system to infer conversation episodes from respiration measurements collected in the field from an unobtrusively wearable respiratory inductive plethysmograph (RIP) band worn around the user's chest. The measurements are wire-lessly transmitted to a mobile phone, where they are used in a novel machine learning model to determine whether the wearer is speaking, listening, or quiet. Our model incorporates several innovations to address issues that naturally arise in the noisy field environment such as confounding events, poor data quality due to sensor loosening and detachment, losses in the wireless channel, etc. Our basic model obtains 83% accuracy for the three class classification. We formulate a Hidden Markov Model to further improve the accuracy to 87%. Finally, we apply our model to data collected from 22 subjects who wore the sensor for 2 full days in the field to observe conversation behavior in daily life and find that people spend 25% of their day in conversations.","cites":"16","conferencePercentile":"97.05882353"},{"venue":"Wireless Health","id":"cc0df49ee5aff8ebba4d3671c8b776b2320a4050","venue_1":"Wireless Health","year":"2010","title":"Remote physiological monitoring of first responders with intermittent network connectivity","authors":"Jingyuan Li, Tejaswi Tamminedi, Guy Yosiphon, Anurag Ganguli, Lei Zhang, John A. Stankovic, Jacob Yadegar","author_ids":"2114509, 1769392, 1800319, 1773719, 1791798, 7230666, 2768457","abstract":"First responders have been observed to be at increased risk of cardio-vascular diseases compared to the general population. A high percentage of cardiac events have been found to occur during missions. Continuous physiological monitoring during missions can be effective in reducing the number of fatalities. Real-time physiological data such as ECG can be collected using body-worn sensors. This sensor data can be processed on the body itself or can be communicated over an ad hoc wireless network to the incident command center located nearby. First responder missions often take place inside building structures where network connectivity is intermittent. Intermittent connectivity can lead to loss of critical physiological data or delay in that information reaching the base station. Hence, some amount of local processing is needed in order to limit the amount of data that is communicated. In this paper, we introduce a novel Hidden Markov Model based classifier for myocardial infarction detection. The classifier fidelity can be adapted based on the processing power available. We present a peer-to-peer networking protocol for communication over disrupted networks. A low fidelity classifier is used to perform local processing and assign priorities to the data based on its criticality. It is complemented by a disruption-aware epidemic forwarding protocol for transferring first responder's physiological data to the base station. We show that with prioritized epidemic forwarding and buffer eviction policy, packet delivery ratio for abnormal data increases and the latency associated with abnormal packets reaching the destination decreases.","cites":"1","conferencePercentile":"43.24324324"},{"venue":"Wireless Health","id":"3240e598d340f83a403f1f2c2d8767a5c847b193","venue_1":"Wireless Health","year":"2010","title":"Monitoring body positions and movements during sleep using WISPs","authors":"Enamul Hoque, Robert F. Dickerson, John A. Stankovic","author_ids":"2939577, 2552270, 7230666","abstract":"Sleep monitoring is very important for elderly people as inadequate and irregular sleep are often related to serious diseases such as depression and diabetes. In many cases, it is necessary to monitor the body positions and movements made while sleeping because of their relationships to particular diseases (i.e., sleep apnea and restless legs syndrome). Analyzing movements during sleep also helps in determining sleep quality and irregular sleeping patterns. This paper presents a sleep monitoring system based on the WISP platform - active RFID-based sensors equipped with accelerometers. We show how our system accurately infers fine-grained body positions from accelerometer data collected from the WISPs attached to the bed mattress. Movements and their duration are also detected by the system. We present the results of our empirical study from 10 subjects on three different mattresses in controlled experiments to show the accuracy of our inference algorithms. Finally, we evaluate the accuracy of the movement detection and body position inference for six nights on one subject, and compare these results with two baseline systems: one that uses bed pressure sensors and the other is an iPhone application.","cites":"17","conferencePercentile":"94.59459459"},{"venue":"Wireless Health","id":"0cda7397cf5a43f5ce95502ec4557ca0d5adf7fd","venue_1":"Wireless Health","year":"2012","title":"CitiSense: improving geospatial environmental assessment of air quality using a wireless personal exposure monitoring system","authors":"Nima Nikzad, Nakul Verma, Celal Ziftci, Elizabeth Bales, Nichole Quick, Piero Zappi, Kevin Patrick, Sanjoy Dasgupta, Ingolf Krüger, Tajana Simunic, William G. Griswold","author_ids":"2612701, 2443274, 3016442, 1708415, 2967153, 1730919, 1697239, 2811836, 1685026, 3560620, 6980007","abstract":"Environmental exposures are a critical component in the development of chronic conditions such as asthma and cancer. Yet, medical and public health practitioners typically must depend on sparse regional measurements of the environment that provide macro-scale summaries. Recent projects have begun to measure an individual's exposure to these factors, often utilizing body-worn sensors and mobile phones to visualize the data. Such data, collected from many individuals and analyzed across an entire geographic region, holds the potential to revolutionize the practice of public health.\n We present CitiSense, a participatory air quality sensing system that bridges the gap between personal sensing and regional measurement to provide micro-level detail at a regional scale. In a user study of 16 commuters using CitiSense, measurements were found to vary significantly from those provided by official regional pollution monitoring stations. Moreover, applying geostatistical kriging techniques to our data allows CitiSense to infer a regional map that contains considerably greater detail than official regional summaries. These results suggest that the cumulative impact of many individuals using personal sensing devices may have an important role to play in the future of environmental measurement for public health.","cites":"15","conferencePercentile":"100"},{"venue":"Wireless Health","id":"a30014226cca168eb3bc259ebc29a897a31b0686","venue_1":"Wireless Health","year":"2011","title":"Motion artifact reduction in ambulatory ECG monitoring: an integrated system approach","authors":"Iñaki Romero, Torfinn Berset, Dilpreet Buxi, Lindsay Brown, Julien Penders, Sunyoung Kim, Nick Van Helleputte, Hyejung Kim, Chris Van Hoof, Refet Firat Yazicioglu","author_ids":"2112559, 1923308, 3222188, 7350784, 1834509, 1681534, 3333765, 2692747, 7858571, 3348229","abstract":"Recent advances in low-power micro-electronics are revolutionizing ECG monitoring. Wearable patches now allow comfortable monitoring over several days. Achieving reliable and high integrity recording however remains a challenge, especially under daily-life activities. In this paper we present a system approach to motion artifact reduction in ambulatory recordings. A custom ultra-low-power ECG analog front-end read-out for simultaneous measurement of ECG and electrode-tissue impedance, from the same electrode, is reported. Integrating this front-end, we describe a wireless patch for the monitoring of 3-lead ECG, electrode electrical artifact and 3D-acceleration. Beyond ECG monitoring, this wireless patch provides the additional necessary data to filter out motion artifact. Two algorithm methods are tested. The first method applies ICA for de-noising multi-lead ECG recordings. The second method is an adaptive filter that uses skin/electrode impedance as the measurement of noise. Algorithms, circuits and system provide a platform for reliable ECG monitoring <i>on-the-move</i>.","cites":"6","conferencePercentile":"85.29411765"},{"venue":"Wireless Health","id":"4185f6d2df20cd6ec0e154257ebb9ef624516917","venue_1":"Wireless Health","year":"2011","title":"An ECG patch combining a customized ultra-low-power ECG SoC with Bluetooth low energy for long term ambulatory monitoring","authors":"Marco Altini, Salvatore Polito, Julien Penders, Hyejung Kim, Nick Van Helleputte, Sunyoung Kim, Refet Firat Yazicioglu","author_ids":"2464080, 2989011, 1834509, 2692747, 3333765, 1681534, 3348229","abstract":"This paper presents the development of an ECG patch aiming at long term patient monitoring. The use of the recently standardized Bluetooth Low Energy (BLE) technology, together with a customized ultra-low-power ECG System on Chip (ECG SoC). including Digital Signal Processing (DSP) capabilities, enables the design of ultra low power systems able to continuously monitor patients, performing on board signal processing such as filtering, data compression, beat detection and motion artifact removal along with all the advantages provided by a standard radio technology such as Bluetooth. Early tests show how combining the ECG SoC and BLE leads to a total current consumption of only 500&mu;A at 3.7V, while computing beat detection and transmitting heart rate remotely via BLE. This allows up to one month lifetime with a 400mAh Li-Po battery.","cites":"5","conferencePercentile":"80.88235294"},{"venue":"Wireless Health","id":"65e5d7f4f51d0db3cddce8e68a105c2838cf2e1b","venue_1":"Wireless Health","year":"2014","title":"MOBI-COG: A Mobile Application for Instant Screening of Dementia Using the Mini-Cog Test","authors":"S. M. Shahriar Nirjon, Ifat Afrin Emi, Md. Abu Sayeed Mondol, Asif Salekin, John A. Stankovic","author_ids":"1913652, 2746533, 2196934, 1982818, 7230666","abstract":"In this paper, we present MOBI-COG which is an application that runs on a mobile device, such as a tablet or a smartphone, and provides an automated and instant dementia screening service. The MOBI-COG App is a complete automation of a widely used 3-minute dementia screening test called the Mini-Cog test, which is administered by primary caregivers for a quick screening of dementia in elderly. Besides asking the patient to remember and then recall a set of three words, the test involves a free-hand clock drawing test. The MOBI-COG App automates all these steps -- including the automatic assessment of the correctness of a clock drawn on the touch screen of a mobile device. We train the MOBI-COG App with over 1000 touch-drawn clocks and show that the system is capable of detecting and recognizing digits in less than 100 ms, in-situ (i.e. without the help of any back-end server), with 99.53% accuracy, and is robust to changes in people, sizes of the drawn digits, and screen sizes of the mobile devices. We perform a usability study of MOBI-COG involving eight healthy human subjects and show that the system is capable of performing all three steps of the test effectively. We also provide a summary of the users' comments on the application.","cites":"0","conferencePercentile":"33.33333333"},{"venue":"Wireless Health","id":"155177edfaf3bbaf885924a27459efc41a8e4604","venue_1":"Wireless Health","year":"2011","title":"Feature extractors for integration of cameras and sensors during end-user programming of assistive monitoring systems","authors":"Alex D. Edgcomb, Frank Vahid","author_ids":"3276409, 1688706","abstract":"Assistive monitoring systems increasingly include cameras along with sensors. End-users require the capability to program such systems to monitor user-specified events and provide customized notifications in response. We introduce feature extractors, which provide a means for integrating camera video with sensor data. A feature extractor takes a video stream as input, and outputs a stream of integer values corresponding to the amount of a particular sensor phenomenon such as motion, sound, or light, or of more advanced phenomena such as human motion, screams, or falls. Feature extractors provide an elegant means for end-users to integrate cameras into their monitoring programs. We introduce feature extractors, provide examples illustrating their effectiveness for various common assistive monitoring scenarios, and summarize usability trials with 51 lay users demonstrating 56%-96% correct utilization of feature extractors.","cites":"1","conferencePercentile":"44.11764706"},{"venue":"Wireless Health","id":"5537d6adbdc57424d7887d64fbb6b9be09d1ce24","venue_1":"Wireless Health","year":"2012","title":"BeWell+: multi-dimensional wellbeing monitoring with community-guided user feedback and energy optimization","authors":"Mu Lin, Nicholas D. Lane, Mashfiqui Mohammod, Xiaochao Yang, Hong Lu, Giuseppe Cardone, Shahid Ali, Afsaneh Doryab, Ethan Berke, Andrew T. Campbell, Tanzeem Choudhury","author_ids":"7827852, 2772904, 3341736, 1840450, 3655082, 2350626, 3153572, 2781152, 3202212, 1690035, 1729948","abstract":"Smartphone sensing and persuasive feedback design is enabling a new generation of wellbeing applications capable of automatically monitoring multiple aspects of physical and mental health. In this paper, we present <i>BeWell</i>+ the next generation of the BeWell smartphone health app, which continuously monitors user behavior along three distinct health dimensions, namely sleep, physical activity, and social interaction. BeWell promotes improved behavioral patterns via feedback rendered as an ambient display on the smartphone's wallpaper. With BeWell+, we introduce new wellbeing mechanisms to address challenges identified during the initial deployment of the BeWell app; specifically, (i) <i>community adaptive wellbeing feedback</i>, which automatically generalize to diverse user communities (e.g., elderly, young adults, children) by balancing the need to promote better behavior yet remains realistic to the user's goals; and, (ii) <i>wellbeing adaptive energy allocation</i>, which prioritizes monitoring fidelity and feedback responsiveness on specific health dimensions of wellbeing (e.g., social interaction) where the user needs most help. We evaluate the performance of these mechanisms as part of an initial deployment and user study that includes 27 people using BeWell+ over a 19 day field trial. Our findings show that not only can BeWell+ operate successfully on consumer-grade smartphones, but users understand feedback and respond by taking positive steps towards leading healthier lifestyles.","cites":"8","conferencePercentile":"76.31578947"},{"venue":"Wireless Health","id":"010263f86b787e4e83a47e3ced6193936042eb3d","venue_1":"Wireless Health","year":"2013","title":"Accurate energy expenditure estimation using smartphone sensors","authors":"Amit Pande, Yunze Zeng, Aveek K. Das, Prasant Mohapatra, Sheridan Miyamoto, Edmund Seto, Erik K. Henricson, Jay J. Han","author_ids":"7205991, 1950350, 1805726, 1697868, 1980994, 4576181, 2391522, 1920135","abstract":"Accurate and online Energy Expenditure Estimation (EEE) utilizing small wearable sensors is a difficult task with most existing schemes. In this work, we focus on accurate EEE for tracking ambulatory activities of a common smartphone user. We used existing smartphone sensors (accelerometer and barometer sensor), sampled at low frequency, to accurately detect EEE. Using Artificial Neural Networks, a machine learning technique, a generic regression model for EEE is built that yields upto 83% correlation with actual Energy Expenditure (EE). Using barometer data, in addition to accelerometry is found to significantly improve EEE performance (upto 10%). We compare our results against state-of-the-art Calorimetry Equations (CE) and consumer electronics devices (Fitbit and Nike+ Fuel Band).","cites":"3","conferencePercentile":"81.57894737"},{"venue":"Wireless Health","id":"7da375388c46d4f3eb6f8c4d5bebca9211e48b3c","venue_1":"Wireless Health","year":"2013","title":"Monitoring mobility disorders at home using 3D visual sensors and mobile sensors","authors":"Farnoush Banaei Kashani, Gérard G. Medioni, Khanh Nguyen, Luciano Nocera, Cyrus Shahabi, Ruizhe Wang, Cesar Blanco, Yi-An Chen, Yu-Chen Chung, Beth Fisher, Sara Mulroy, Phil Requejo, Carolee J. Winstein","author_ids":"3030273, 1704444, 1745517, 2614639, 1773086, 5783854, 2061705, 5456303, 1891260, 2830850, 2175441, 2397265, 7758571","abstract":"In this paper, we present <i>PoCM</i><sup><i>2</i></sup> (<i>Point-of-Care Mobility Monitoring</i>), a generic and extensible at-home mobility evaluation and monitoring system. PoCM<sup>2</sup> uses both 3D visual sensors (such as Microsoft Kinect) and mobile sensors (i.e., internal and external sensors embedded with/connected to a mobile device such as a smartphone) for complementary data acquisition, as well as a series of analytics that allow evaluation of both archived and real-time mobility data. We demonstrate the performance of PoCM<sup>2</sup> with a specific application developed for freeze detection and quantification from Parkinson's Disease mobility data, as an approach to estimate the medication level of the PD patients and potentially recommend adjustments.","cites":"1","conferencePercentile":"52.63157895"},{"venue":"Wireless Health","id":"009808eec29d22aad263f97cb60b5f262b32352f","venue_1":"Wireless Health","year":"2013","title":"Personalized physical activity monitoring on the move","authors":"Marco Altini, Julien Penders, Ruud J. M. Vullers, Oliver Amft","author_ids":"2464080, 1834509, 2288029, 3303427","abstract":"Accurate Energy Expenditure (EE) estimation is key in understanding how behavior and daily Physical Activity (PA) patterns affect health. Mobile phones and wearable sensors (e.g. accelerometers (ACC) and heart rate (HR) monitors) have been widely used to monitor PA. In this paper we present a real-time implementation of activity-specific EE estimation algorithms, using an Health Patch and an iPhone. Our approach to continuous monitoring of PA targets personalized behavior and health status assessment, by automatically accounting for a person's cardiorespiratory fitness level (CRF), which is the main cause of inter-individual variation in HR during moderate to vigorous activities. The proposed system opens new opportunities for personalized health assessment in daily life, using ubiquitous devices.","cites":"0","conferencePercentile":"18.42105263"},{"venue":"Wireless Health","id":"73794dcd4826b0d2970df85f1d5f71f04fd00b2b","venue_1":"Wireless Health","year":"2013","title":"Combining wearable accelerometer and physiological data for activity and energy expenditure estimation","authors":"Marco Altini, Julien Penders, Ruud J. M. Vullers, Oliver Amft","author_ids":"2464080, 1834509, 2288029, 3303427","abstract":"Physical Activity (PA) is one of the most important determinants of health. Wearable sensors have great potential for accurate assessment of PA (activity type and Energy Expenditure (EE)) in daily life. In this paper we investigate the benefit of multiple physiological signals (Heart Rate (HR), respiration rate, Galvanic Skin Response (GSR), skin humidity) as well as accelerometer (ACC) data from two locations (wrist - combining ACC, GSR and skin humidity - and chest - combining ACC and HR) on PA type and EE estimation. We implemented single regression, activity recognition and activity-specific EE models on data collected from 16 subjects, while performing a set of PAs, grouped into six clusters (<i>lying, sedentary, dynamic, walking, biking</i> and <i>running</i>). Our results show that combining ACC and physiological signals improves performance for activity recognition (by 2 and 8% for the chest and wrist) and EE (by 36 - chest - and 35% - wrist - for single regression models, and by 18 - chest - and 46% - wrist - for activity-specific models). Physiological signals other than HR showed a coarser relation with level of physical exertion, resulting in being better predictors of activity cluster type and separation between inactivity and activity than EE, due to the weak correlation to EE within an activity cluster.","cites":"3","conferencePercentile":"81.57894737"},{"venue":"Wireless Health","id":"563c942ef52f9187ff26526ffcc6616b6263baef","venue_1":"Wireless Health","year":"2012","title":"Energy expenditure estimation using wearable sensors: a new methodology for activity-specific models","authors":"Marco Altini, Julien Penders, Oliver Amft","author_ids":"2464080, 1834509, 3303427","abstract":"Accurate estimation of Energy Expenditure (EE) in ambulatory settings is a key element in determining the causal relation between aspects of human behavior related to physical activity and health. We present a new methodology for activity-specific EE algorithms. The proposed methodology models activity clusters using specific parameters that capture differences in EE within a cluster, and combines these models with Metabolic Equivalents (METs) derived from the compendium of physical activities. We designed a protocol consisting of a wide set of sedentary, household, lifestyle and gym activities, and developed a new activity-specific EE algorithm applying the proposed methodology. The algorithm uses accelerometer (ACC) and heart rate (HR) data acquired by a single monitoring device, together with anthropometric variables, to predict EE. Our model recognizes six clusters of activities independent of the subject in 52.6 hours of recordings from 19 participants. Increases in EE estimation accuracy ranged from 18 to 31% compared to state of the art single and multi-sensor activity-specific methods.","cites":"12","conferencePercentile":"94.73684211"},{"venue":"Wireless Health","id":"46a0531dac53167d3733c99f932279a584231d35","venue_1":"Wireless Health","year":"2015","title":"A hybrid solution for monitoring conversational skills of children with special needs","authors":"L. Tian, M. Chuah, E. Cappellini","author_ids":"6140426, 2848877, 8670598","abstract":"Children/Adolescents with Autism Spectrum Disorder (ASD) demonstrate communication skill deficits and often do not utilize appropriate turn-taking in conversations. Several intervention strategies have been designed to improve conversational skills, but assessing conversations and determining strategy effectiveness often prove to be complicated and time-consuming processes. In this paper, we present: (i) a lightweight smartphone-based conversational turn monitoring system which automatically measures turn-taking statistics of speakers involved in a conversation (thus significantly reducing the labor involved in determining intervention success); (ii) evaluations of the effectiveness of our proposed monitoring system using several collected conversational traces; (iii) a customizable Android application developed to teach students how to conduct conversations; and (iv) preliminary evaluations of the effectiveness of the Android application in improving the communication skills of adolescents with ASD/speech/language deficits using two unique communication skill rubrics designed by our speech therapist. Our preliminary evaluations show promising results of our proposed low-cost hybrid monitoring solution for tracking the conversational skills of students with communication skill deficits.","cites":"0","conferencePercentile":"38.0952381"},{"venue":"Wireless Health","id":"d645e1ee180b5ff640d1fc302e8a2bcb11a81e89","venue_1":"Wireless Health","year":"2014","title":"Design and Usage of an Ozone Mapping App","authors":"Ilyas Uyanik, Ashik Khatri, Panagiotis Tsiamyrtzis, Ioannis T. Pavlidis","author_ids":"3071804, 3018046, 2099144, 7829766","abstract":"With the proliferation of environmental sensor networks, real-time, quantitative, and localized pollutant information has become available for a few big cities. Several mobile apps have been developed to bring this information to the user 24/7. In contradistinction to conventional weather reporting systems that provide a qualitative and static description of pollutant levels for an entire metropolitan area, these new apps dynamically relay quantitative pollutant measurements at high spatial resolution. No design methodology has been rationalized for pollutant apps thus far. And, although such apps have potential impact to public health, their actual user base and usage have not been investigated. We have fielded an ozone mapping app for the Houston area. Ozone is a harmful environmental pollutant developing under certain conditions in major metropolitan centers. We use this as a case study to put forward a design philosophy for pollution apps in general. We also analyze the app's user portrait and her/his interaction patterns. The results of our study can inform the development and marketing of similar apps in this burgeoning field.","cites":"0","conferencePercentile":"33.33333333"},{"venue":"Wireless Health","id":"4bdfcf4c58c706154ff1060f5deff6a963b7c2da","venue_1":"Wireless Health","year":"2015","title":"Role model in human physical activity","authors":"Alisa Turchaninova, Ashik Khatri, Ilyas Uyanik, Ioannis T. Pavlidis","author_ids":"3123926, 3018046, 3071804, 7829766","abstract":"Physical activity is an area of life in which social influence plays a major role. Observing the activity of a sedentary person may cause the observer to exercise less; observing a persistently active person can serve as a motivating factor. The goal of this research is to determine how to optimally pair individuals in order to facilitate motivational relationships with respect to physical activity. This research performs an observational study of data collected from a mobile health and fitness application, iBurnCalorie, which allows users to follow each other in addition to tracking physical activity. Through this social feature, this study examines the influence of users on each other's activity patterns. Our preliminary results indicate that some users have chosen effective role models without any intervention. If this natural effect can be replicated, such a novel interventional networking feature could have a significant impact within iBurnCalorie and all similar applications.","cites":"0","conferencePercentile":"38.0952381"},{"venue":"Wireless Health","id":"40e328ead8e11f60e6c6018b319a58727b16529c","venue_1":"Wireless Health","year":"2015","title":"Videos influence behavior change measures for voice and speech in individuals with Parkinson's disease","authors":"Lisa M. Kopf, Simone Graetzer, Jina Huh","author_ids":"3304896, 2964108, 1801840","abstract":"The majority of individuals with Parkinson's disease (PD) experience voice and speech difficulties at some point over the course of the disease. Voice therapy has been found to help improve voice and speech in individuals with PD, but the majority of these individuals do not enroll in voice therapy. The purpose of this study was to determine whether watching short videos about voice symptoms and treatment in Parkinson's disease influences readiness to change, stages of change, and self-efficacy in individuals with PD. Eight individuals with PD participated in the study. Fifteen videos were chosen, three representing each of the five stages of change. We chose videos from YouTube that represented variety in speakers, content, and genre. We found that readiness to change significantly increased after watching videos, suggesting that watching videos helped these individuals move closer to actively improving their voice and speech. In addition, five of the eight participants showed forward movement in stages of change. Finally, self-efficacy demonstrated a positive trend following video watching. Overall, our results demonstrate that watching videos available on the internet can influence individuals with Parkinson's disease in changing vocal behavior. Implications for future wireless health applications are described.","cites":"0","conferencePercentile":"38.0952381"},{"venue":"Wireless Health","id":"7b4921c1246f360870351feb75d057039d5366cb","venue_1":"Wireless Health","year":"2013","title":"Wireless multi sensor bracelet with discreet feedback","authors":"Martin Ouwerkerk, Pierre Dandine, Dennis Bolio, Rafal Kocielnik, Johanna Mercurio, Henk Huijgen, Joyce H. D. M. Westerink","author_ids":"2516472, 2009773, 1844232, 3299344, 1953685, 3103965, 2649906","abstract":"A novel wireless multi sensor bracelet has been developed. The design choices of the bracelet - based on insights obtained with a predecessor sensor bracelet -, as well as the rationale for the choice of sensors, are presented. The hardware and software architecture are described. An example of obtained sensor data is shown. The limited battery life of the performance optimized product software fell short of the one week design target. A power optimization of the software has been made, which meets the battery life design target. It is based on current consumption measurements, and optimized sensor timing. The tradeoffs between high performance - short battery life, and low performance - long battery life are analyzed. The learnings from recent field studies on work-related stress and affective health are discussed.","cites":"3","conferencePercentile":"81.57894737"},{"venue":"Wireless Health","id":"6b593ac5f0522093e0ec909074cc5ba6ff981e2f","venue_1":"Wireless Health","year":"2010","title":"The Berkeley Tricorder: wireless health monitoring","authors":"Reza Naima, John F. Canny","author_ids":"2254242, 1729041","abstract":"The advancement of precision micropower amplifiers, microcontrollers, and MEMs devices have allowed for a paradigm shift from traditionally large and costly health monitoring equipment only found in hospitals or care centers to smaller, wireless, low powered portable devices that can provide continuous monitoring for a number of applications. Along these lines, we have developed a small wireless health monitoring device, named The Berkeley Tricorder, capable of monitoring a wide range of health-related signals, and have vetted it in a number of human trials. We will present a number of different real-time visualization tools that have been developed, and discuss some relevant applications for the Tricorder as a platform. Real time wireless telemetry from the device will be demonstrated.","cites":"0","conferencePercentile":"16.21621622"},{"venue":"Wireless Health","id":"b7b8220a08caaf92de5c3dffffd2a7b96b52a9ce","venue_1":"Wireless Health","year":"2010","title":"AndWellness: an open mobile system for activity and experience sampling","authors":"John Hicks, Nithya Ramanathan, Donnie H. Kim, Mohamad Monibi, Joshua Selsky, Mark H. Hansen, Deborah Estrin","author_ids":"5357700, 2616625, 2396921, 1787844, 2991184, 4128571, 1736486","abstract":"Advances in mobile phone technology have allowed phones to become a convenient platform for real-time assessment of a participants health and behavior. AndWellness, a personal data collection system, uses mobile phones to collect and analyze data from both active, triggered user experience samples and passive logging of onboard environmental sensors. The system includes an application that runs on Android based mobile phones, server software that manages deployments and acts as a central repository for data, and a dashboard front end for both participants and researchers to visualize incoming data in real-time. Our system has gone through testing by researchers in preparation for deployment with participants, and we describe an initial qualitative study plus several planned future studies to demonstrate how our system can be used to better understand a user's health related habits and observations.","cites":"33","conferencePercentile":"100"},{"venue":"Wireless Health","id":"1fd562ed80441e7bf689c83393ed01476bf5e4de","venue_1":"Wireless Health","year":"2011","title":"Rehabilitation exercise feedback on Android platform","authors":"Brian Caulfield, Jason Blood, Barry Smyth, Daniel Kelly","author_ids":"1680033, 3153519, 1701131, 5139326","abstract":"In this paper, we present an overview of the VITFIZ platform. VITFIZ is a mobile exercise system which we have developed for the provision of personalized feedback to patients performing rehabilitation exercise. VITFIZ has been developed in response to the need for novel solutions that will facilitate effective implementation and management of rehabilitation exercise for patients in the home setting between visits to the clinic. Increased availability of smart phones equipped with motion sensors means that the system can be deployed on a mobile platform. VITFIZ has been evaluated in the laboratory and clinical setting and initial results suggest that it is an effective tool for increasing accuracy of exercise technique and motivation to perform exercise. It has promise as a mobile health application for the rehabilitation sector","cites":"2","conferencePercentile":"63.23529412"},{"venue":"Wireless Health","id":"0220cdbbfec9aa65eb2599c2e0ed2d400852820c","venue_1":"Wireless Health","year":"2010","title":"Social sensing: obesity, unhealthy eating and exercise in face-to-face networks","authors":"Anmol Madan, Sai T. Moturu, David Lazer, Alex Pentland","author_ids":"1805059, 2754149, 5170261, 1682773","abstract":"What is the role of face-to-face interactions in the diffusion of health-related behaviors- diet choices, exercise habits, and long-term weight changes? We use co-location and communication sensors in mass-market mobile phones to model the diffusion of health-related behaviors via face-to-face interactions amongst the residents of an undergraduate residence hall during the academic year of 2008--09. The dataset used in this analysis includes bluetooth proximity scans, 802.11 WLAN AP scans, calling and SMS networks and self-reported diet, exercise and weight-related information collected periodically over a nine month period. We find that the health behaviors of participants are correlated with the behaviors of peers that they are exposed to over long durations. Such exposure can be estimated using automatically captured social interactions between individuals. To better understand this adoption mechanism, we contrast the role of exposure to different sub-behaviors, i.e., exposure to peers that are obese, are inactive, have unhealthy dietary habits and those that display similar weight changes in the observation period. These results suggest that it is possible to design self-feedback tools and real-time interventions in the future. In stark contrast to previous work, we find that self-reported friends and social acquaintances do not show similar predictive ability for these social health behaviors.","cites":"24","conferencePercentile":"97.2972973"},{"venue":"Wireless Health","id":"bd2b46c650d2f6e5e570635fba1dd83e60fea9ef","venue_1":"Wireless Health","year":"2014","title":"A Pilot Study of an Inspection Framework for Automated Usability Guideline Reviews of Mobile Health Applications","authors":"Jing Xu, Xiang Ding, Ke Huang, Guanling Chen","author_ids":"4129787, 1776564, 5071870, 3045450","abstract":"Usability is of significant importance for any interactive software. In the mobile domain, applications face more challenges to deliver good experiences to end users due to the characteristics and usage of mobile devices in ubiquitous computing contexts. The situation may be exacerbated for mobile health applications since the target population or domain may impose even stricter usability requirements.\n Heuristic Evaluation (HE) or guideline review has proven itself to be an effective approach among many usability evaluation methods. Organizing heuristic evaluation by usability professionals, however, can be costly and time consuming, particularly for frequent prototype updates generated by fast iterations. Manual inspection by human experts also suffers from scalability issues as mobile applications often need to run on a diverse set of hardware platforms.\n To help find potential usability problems at an early stage and reduce the workload of human usability experts, we propose an inspection framework to conduct automated guideline reviews of mobile health applications. The inspection framework is based on the Health Information Management Systems Society (HIMSS) usability guidelines for mHealth applications. First, we translate the high level descriptions of usability guidelines into operationalized metrics that can be measured by software. Second, we demonstrate the translation is meaningful by providing detailed analysis of suggested metrics and real-world case studies. We hope this framework can be used to enforce a minimum bar for the usability of mobile health applications and further adapted when new products in the field are developed.","cites":"3","conferencePercentile":"95.83333333"},{"venue":"Wireless Health","id":"525a50b52c53b3e05c27979fc890f4bab6a513bf","venue_1":"Wireless Health","year":"2010","title":"Wireless monitoring of a distributed environmental health intervention in Haiti","authors":"David Holstius, Joseph Kaye, Edmund Seto","author_ids":"2022496, 1725629, 4576181","abstract":"Each year, countless children die in underdeveloped countries as a result of water-borne illness. We present a prototype system, currently in pilot testing by a Haiti-based NGO, that supports increased transparency and scalability for data assimilation efforts in the context of a distributed water sanitation project. Wireless technologies such as Short Messaging System (SMS) and Near Field Communication (NFC) are integral to the system. Due to the use of low-cost, off-the-shelf mobile hardware and open-source software, and the selection of SMS for the network transport layer, the system is affordable yet reliable enough to be deployed where power and connectivity may be extremely intermittent. This includes regions such as rural Haiti, home to over half the country's population, as well as disaster areas, such as Port-au-Prince, the urban epicenter of a recent devastating earthquake---both locations where the system is currently being deployed.","cites":"1","conferencePercentile":"43.24324324"},{"venue":"Wireless Health","id":"5f4d2cc43492ffe506149c8b63c5446f9bcf6403","venue_1":"Wireless Health","year":"2010","title":"Dandelion: a framework for transparently programming phone-centered wireless body sensor applications for health","authors":"Felix Xiaozhu Lin, Ahmad Rahmati, Lin Zhong","author_ids":"1774176, 3132962, 5581056","abstract":"Many innovative mobile health applications can be enabled by augmenting wireless body sensors to mobile phones, e.g. monitoring personal fitness with on-body accelerometer and EKG sensors. However, it is difficult for the majority of smartphone developers to program wireless body sensors directly; current sensor nodes require developers to master node-level programming, implement the communication between the smartphone and sensors, and even learn new languages. The large gap between existing programming styles for smartphones and sensors prevents body sensors from being widely adopted by smartphone applications, despite the burgeoning Apple App Store and Android Market.\n To bridge this programming gap, we present <i>Dandelion</i><sup>1</sup>, a novel framework for developing wireless body sensor applications on smartphones. Dandelion provides three major benefits: 1) platform-agnostic programming abstraction for in-sensor data processing, called <i>senselet</i>, 2) transparent integration of senselets and the smartphone code, and 3) platform-independent development and distribution of senselets.\n We provide an implementation of Dandelion on the Maemo Linux smartphone platform and the Rice Orbit body sensor platform. We evaluate Dandelion by implementing real-world applications, and show that Dandelion effectively eliminates the programming gap and significantly reduces the development efforts. We further show that Dandelion incurs a very small overhead; in total less than 5% of the memory capacity and less than 3% of the processor time of a typical ultra low power sensor.","cites":"13","conferencePercentile":"91.89189189"},{"venue":"Wireless Health","id":"478c7ccac0df4a622584d2fdf0f15056fc38643d","venue_1":"Wireless Health","year":"2015","title":"Lessons learned from a yearlong deployment of customizable breast cancer tablet computers","authors":"Maia L. Jacobs, James Clawson, Elizabeth D. Mynatt","author_ids":"2241806, 7454378, 1752751","abstract":"Patient-centered technologies demonstrate great promise for users, however they often focus on solitary moments or singular tasks within a broader healthcare journey. We utilized a technology probe to investigate how patients managing long-term diseases use flexible health tools throughout their health journeys. Through a yearlong deployment, we provided 36 cancer patients with a suite of resources on customizable mobile tablets. The majority of our participants did engage with the technology throughout treatment and into survivorship. We analyzed participants' tablet adoption, usage patterns, and customization and describe how each of these influenced technology engagement and changes in use. Finally, we identified a set of lessons researchers can use to guide the design of future patient-centered technologies. Specifically, we discovered that customizable tools reveal insights into patients' goals and values, integrating health and non-health resources encourages participants to return to health resources when needed, and a need exists to expand our definition of health resources.","cites":"0","conferencePercentile":"38.0952381"},{"venue":"Wireless Health","id":"8fb5668075762e7aaa460a5278fabc6a05026d3d","venue_1":"Wireless Health","year":"2010","title":"Automated detection of sensor detachments for physiological sensing in the wild","authors":"Kurt Plarre, Andrew Raij, Santanu Guha, Mustafa al'Absi, Emre Ertin, Santosh Kumar","author_ids":"1713905, 3056335, 1698740, 8296918, 1706573, 1736293","abstract":"Body area sensor networks measure biomedical signals from subjects continuously, as they go about their daily lives. Signals measured in these conditions are affected by anomalies, such as artifacts and noise. Some anomalies can be corrected, if detected in real-time, for example, ECG electrode detachment. We present energy and computationally efficient algorithms for the detection of sensor detachment, developed for the AutoSense system.","cites":"3","conferencePercentile":"66.21621622"},{"venue":"Wireless Health","id":"3856b168e655219e769f132ac4643b3da53b5b80","venue_1":"Wireless Health","year":"2015","title":"Analyzing social media to characterize local HIV at-risk populations","authors":"Narendran Thangarajan, Nella Green, Amarnath Gupta, Susan Little, Nadir Weibel","author_ids":"3019690, 3260072, 1722619, 4231923, 1752711","abstract":"The number of new HIV infections per year in the U.S. has remained stable at 50,000 since the 1990's. To improve epidemic control, we need more public health tools that are aimed at decreasing HIV transmission. Online social networks and their real-time communication capabilities are emerging as novel platforms for conducting epidemiological studies and recent research has outlined the feasibility of using Twitter to study HIV epidemiology. We propose a new method for identifying HIV at-risk populations using publicly available data from Twitter as an indicator of HIV risk. In this paper we take existing approaches further by introducing a new infrastructure to collect, classify, query and visualize these data, and we show the feasibility of identifying and characterizing HIV at-risk populations in the San Diego area at a finer level of granularity.","cites":"0","conferencePercentile":"38.0952381"},{"venue":"Wireless Health","id":"4e785b012193e9d249e55b6d51120f556ff76d1f","venue_1":"Wireless Health","year":"2013","title":"A glanceable mobile avatar for behavior change","authors":"Tylar Murray, Luis G. Jaimes, Eric B. Hekler, Donna Spruijt-Metz, Andrew Raij","author_ids":"2137217, 1916029, 3062685, 2127362, 3056335","abstract":"We present a mobile avatar system designed to provide a constant user-avatar interface for health behavior change therapy. The presented Android application replaces the user's phone background with an animated avatar. The avatar's level of physical activity is made to match the physical activity level of the user. This activity level is inferred using a decision-tree-based frequency analysis of the built-in phone accelerometers. User physical activity data collected is also sent via a mobile analytics platform (Countly) to be stored in a server. Also included in our demo is a simple website which pulls information from this server and places a user's avatar among other people's avatars. In this display a user can see how their avatar's physical activity compares to others', and observe their real-life physical activity behavior directly impacting the performance of their avatar in the virtual world.","cites":"1","conferencePercentile":"52.63157895"},{"venue":"Wireless Health","id":"499a2a07f875bcbb53b9ff377fd2e05fea2c2c28","venue_1":"Wireless Health","year":"2010","title":"Detecting coughing episodes passively from acoustic signals in a home environment: demo abstract","authors":"Enamul Hoque, John A. Stankovic","author_ids":"2939577, 7230666","abstract":"We demonstrate a passive cough monitoring system for in-home environments using acoustic sensors. Our system does not need the users to wear any device. It also works under the presence of typical sounds that may be common in a home environment.","cites":"0","conferencePercentile":"16.21621622"},{"venue":"Wireless Health","id":"8e4daa9e8a4922842a9b48ef80cb2c492f84b47c","venue_1":"Wireless Health","year":"2011","title":"StressBar: a system for stress information collection","authors":"Dajun Lu, Guoxing Zhan, Shinan Wang, Weisong Shi, Clairy Wiholm, Bengt B. Arnetz","author_ids":"4021743, 1754809, 3227837, 1730254, 2126035, 2419151","abstract":"The causes of stress and how it affects our behaviors are generally not well understood. The stress research usually requires a large amount of data to analyze possible stress-related factors. The data collection process traditionally is time-consuming and cost-ineffective. To help medical researchers collect the stress information, we propose a tool named StressBar utilizing the powerful data collection capacity of smart phones. In this paper, we will show our design and implementation considerations of StressBar.","cites":"1","conferencePercentile":"44.11764706"},{"venue":"Wireless Health","id":"7ef15881ebe2e995fc1f44ecb462b2b9d08c10b6","venue_1":"Wireless Health","year":"2015","title":"An intelligent crowd-worker selection approach for reliable content labeling of food images","authors":"Mashfiqui Rabbi, Jean Marcel dos Reis Costa, Fabian Okeke, Max Schachere, Mi Zhang, Tanzeem Choudhury","author_ids":"1848732, 1688288, 1686657, 1704152, 1706594, 1729948","abstract":"Food journaling is an effective way to regulate excessive food intake. However manual food journaling is burdensome, and crowd-assisted food journaling has been explored to ease user burden. The crowd-assisted journaling uses a <i>label &#38; verify</i> approach where an end-user uploads his/her food image and paid crowd-workers label content of the image. Then another set of crowd-workers verify the labels for correctness. In this paper, we propose an alternative approach where we label food images with only high performing labelers. Since high performing labelers generally provide good quality labels, our approach achieves high accuracy without verifying the food labels for correctness. We also propose a machine learning algorithm to automatically identify high performing crowd-labelers from a dataset of 3925 images collected over 5 months. Such automated identification of high performing workers and elimination of needless verification reduce cost of food labeling. Specially for large scale deployments where large number of images need to be labeled, our approach can reduce overall expenses by half.","cites":"0","conferencePercentile":"38.0952381"},{"venue":"Wireless Health","id":"84af8a331fa3c75e4015e96c9c4640692a6ed8b5","venue_1":"Wireless Health","year":"2012","title":"Individual mobility patterns and real-time geo-spatial exposure to point-of-sale tobacco marketing","authors":"Thomas R. Kirchner, Jennifer Cantrell, Andrew Anesetti-Rothermel, Jennifer Pearson, Sarah Cha, Jennifer Kreslake, Ollie Ganz, Michael Tacelosky, David Abrams, Donna Vallone","author_ids":"2388696, 1847316, 1865471, 3268422, 2136775, 1996929, 2175129, 2226475, 2497559, 2093915","abstract":"Health-related behaviors occur as part of a broad socio-ecological context that unfolds dynamically over time. Yet systematic quantification of the way individuals come into contact with health-related features in their local environment remains a difficult challenge. Doing so requires a multi-tiered approach that integrates both individual geo-location data and comprehensive community-level information about health-related features in the local built environment.\n This report describes the implementation of a system for quantification of real-time exposure to point-of-sale tobacco marketing via mobile phone geo-location tracking. Individual mobility patterns from a longitudinal cohort of DC residents (N=486) were overlaid on an existing community-level point-of-sale surveillance geodatabase (N=1, 080 stores). Participants were DC residents who carried a geo-location tracking device over the first 8-weeks of a smoking cessation attempt. Tracking data were then used to produce a mobility \"signature,\" physically linking each person to their surrounding point-of-sale marketing environment in real-time.\n Results demonstrate the dynamic nature of an individuals' experience of the point-of-sale environment. We identify substantial between-person differences in tobacco product pricing exposure, and find that these correspond to clusters of individuals whose price exposures vary systematically over time of day. These data suggest that perceptions of the point-of-sale environment as relatively static fail to account for the mobility and preferences of individuals as they actively engage with their neighborhoods over time.","cites":"2","conferencePercentile":"57.89473684"},{"venue":"Wireless Health","id":"447658719c762128dda50cb6301fe0358860f8d0","venue_1":"Wireless Health","year":"2016","title":"AsthmaGuide: an asthma monitoring and advice ecosystem","authors":"Ho-Kyeong Ra, Asif Salekin, Hee-Jung Yoon, Jeremy Kim, S. M. Shahriar Nirjon, David J. Stone, Sujeong Kim, Jong-Myung Lee, Sang Hyuk Son, John A. Stankovic","author_ids":"3344982, 1982818, 7914446, 3315963, 1913652, 3531389, 3923077, 2988050, 1806873, 7230666","abstract":"— Recently, there has been an increased use of wireless sensor networks and embedded systems in the medical sector. Healthcare providers are now attempting to use these devices to monitor patients in a more accurate and automated way. This would permit healthcare providers to have up-to-date patient information without physical interaction, allowing for more accurate diagnoses and better treatment. One group of patients that can greatly benefit from this kind of daily monitoring is asthma patients. Healthcare providers need daily information in order to understand the current risk factors for asthma patients and to provide appropriate advice. It is not only important to monitor patients' lung health, but also to monitor other physiological parameters, environmental factors, medication, and subjective feelings. We develop a smartphone, sensor rich, and cloud based asthma system called AsthmaGuide, in which a smartphone is used as a hub for collecting comprehensive information. The data, including data over time, is then displayed in a cloud web application for both patients and healthcare providers to view. AsthmaGuide also provides an advice and alarm infrastructure based on the collected data and parameters set by healthcare providers. With these components, AsthmaGuide provides a comprehensive ecosystem that allows patients to be involved in their own health and also allows doctors to provide more effective day-today care. Using real asthma patient wheezing sounds, we also develop two different types of classification approaches and show that one is 96% accurate, the second is 98.6% accurate and both outperform the state of art which is 87% accurate at automatically detecting wheezing. AsthmaGuide has both English and Korean language implementations.","cites":"1","conferencePercentile":"100"},{"venue":"Wireless Health","id":"e8eb34103eddf8200e461bda3088f46c4ce40e50","venue_1":"Wireless Health","year":"2010","title":"Just-in-time sampling and pre-filtering for wearable physiological sensors: going from days to weeks of operation on a single charge","authors":"Nan Hua, Ashwin Lall, Justin K. Romberg, Jun Xu, Mustafa al'Absi, Emre Ertin, Santosh Kumar, Shikhar Suri","author_ids":"1701356, 2895047, 1735291, 1720016, 8296918, 1706573, 1736293, 2537575","abstract":"Continuous monitoring of human physiology and behavior in natural environments via unobtrusively wearable wireless sensors is witnessing rapid adoption in both consumer health-care and in scientific studies, since those portable and long-running devices can provide critical information for diagnosis and early prevention of disease, as well as invaluable data for scientific studies. Due to the requirement of continuous monitoring, these sensors, all operating on small wearable batteries, require frequent recharging. Lowering this recharging burden is essential for their widespread adoption.\n In this paper we explore mechanisms for significantly enhancing the lifetime of these wearable sensors at the cost of a small loss in their sensing accuracy. We propose two ideas that build upon our observation that collecting bursts of samples over short periods of time is sufficient to capture the most interesting and informative part of the signal. In the first part of this paper, we propose a general methodology for reconstructing bandlimited signals accurately from such short bursts of samples. While this reconstruction task is in nature an ill-conditioned problem, we show that the insertion of an analog \"modulated pre-filter\" hardware module before the ADC can almost surely alleviate this conditioning problem. In the second part of this paper, we describe <i>just-in-time sampling</i>, which by sampling in short bursts at the \"right\" times, can accurately track R-wave peaks in ECG signals. Using simulations on publicly available traces as well as self-collected data, we show the efficacy of this technique.","cites":"1","conferencePercentile":"43.24324324"},{"venue":"Wireless Health","id":"1eb5f75f421b458568f9d5da5c21a9dfb77e60cb","venue_1":"Wireless Health","year":"2011","title":"Empath: a continuous remote emotional health monitoring system for depressive illness","authors":"Robert F. Dickerson, Eugenia I. Gorlin, John A. Stankovic","author_ids":"2552270, 3040107, 7230666","abstract":"Depression is a major health issue affecting over 21 million American adults that often goes untreated, and even when undergoing treatment it is hard to monitor the effectiveness of the treatment. To address these issues, we have created a real-time depression monitoring system for the home. This system runs 24/7 and can potentially detect the early signs of a depression episode, as well track progress managing a depressive illness. A cohesive set of integrated wireless sensors, a touch screen station, mobile device, and associated software deliver the above capabilities. The data collected are multi-modal, spanning a number of different behavioral domains including sleep, weight, activities of daily living, and speech prosody. The reports generated by this aggregated data across multiple behavioral domains are aimed to provide caregivers with more accurate and thorough information about the client's current functioning, thus helping in their diagnostic assessment and therapeutic treatment planning as well for patients in the management and tracking of their symptoms. We present data of a case study showing the value of the system, deployed over a period of two weeks in a home during a depressive episode. Larger scale studies are planned for the future.","cites":"19","conferencePercentile":"100"},{"venue":"Wireless Health","id":"5c1de72ccd32c155d7b773d92d3d78a388dbfd03","venue_1":"Wireless Health","year":"2012","title":"Tracking influence of reflective exercise for persons with epilepsy","authors":"Robert F. Dickerson, Enamul Hoque, John A. Stankovic, David Gerdt, Joel G. Anderson, Ann G. Taylor","author_ids":"2552270, 2939577, 7230666, 2107738, 2591293, 7569763","abstract":"One of the most commonly identified precipitant of seizures for people with epilepsy is stress. We have developed a system for tracking objective measures in the subjects homes. An integrated system is used for data collection, uploading, and viewing the data. Our system is currently deployed and actively collecting data from people suffering from epilepsy and enrolled in a meditative relaxation course.","cites":"0","conferencePercentile":"18.42105263"},{"venue":"Wireless Health","id":"e98ea0c41755f06eca1016614898268c401ce562","venue_1":"Wireless Health","year":"2014","title":"Vocal-Diary: A Voice Command based Ground Truth Collection System for Activity Recognition","authors":"Enamul Hoque, Robert F. Dickerson, John A. Stankovic","author_ids":"2939577, 2552270, 7230666","abstract":"We present Vocal-Diary, a voice command based ground truth collection system that uses grammar based commands from residents to log start and end of activities. Vocal-Diary ensures robustness in the presence of sounds from different environmental noise and day-to-day conversation by using two-way acknowledgement and integrating speaker recognition in the pipeline. Vocal-Diary also utilizes the sensor data produced by the underlying activity recognition system to query residents periodically to check if they forgot to log any activity. Evaluation shows that Vocal-Diary increases precision by at least 40% and recall by at least 10% compared to a system that uses voice command recognition without any acknowledgement and speaker recognition.","cites":"1","conferencePercentile":"75"},{"venue":"Wireless Health","id":"4e50959a9e909af10e9320e708027565f1d6f413","venue_1":"Wireless Health","year":"2015","title":"Home wireless sensing system for monitoring nighttime agitation and incontinence in patients with Alzheimer's disease","authors":"Jiaqi Gong, Karen Moomaw Rose, Ifat Afrin Emi, Janet P. Specht, Enamul Hoque, Dawei Fan, Sriram Raju Dandu, Robert F. Dickerson, Yelena Perkhounkova, John Lach, John A. Stankovic","author_ids":"2197978, 2056475, 2746533, 2027493, 2939577, 1907433, 2817517, 2552270, 2813354, 8377575, 7230666","abstract":"Patients with Alzheimer's Disease (AD) often experience urinary incontinence and agitation during sleep. There is some evidence that these phenomena are related, but the relationships (and the subsequent opportunity for caregiver intervention) has never been formally studied. In this work, the relationships among the times of occurrence of nighttime agitation, sleep continuity and duration, and urinary incontinence are identified for persons with AD by using innovative, non-invasive technology. Deployments in 12 homes demonstrate both the utility of the technical monitoring system and the discovered correlations between agitation and incontinence for these 12 AD patients. Implications of possible interventions are discussed. Lessons learned for technical, non-technical and health care implications are presented.","cites":"1","conferencePercentile":"85.71428571"},{"venue":"Wireless Health","id":"8548db31c12209a96da4f86c30dec3b83dc444dd","venue_1":"Wireless Health","year":"2011","title":"Filters that remember: duty cycling analog circuits for long term medical monitoring","authors":"Zainul Charbiwala, Jonathan Friedman, Mani B. Srivastava, Benjamin Kuris","author_ids":"3347485, 2008236, 1702254, 2063917","abstract":"With recent improvements in the energy efficiency of digital microprocessors and radio transceivers, the relative contribution of the analog front end in the overall power consumption of a wireless health system has been steadily rising. A key reason for this is that sampling rates in most medical applications are extremely low, providing opportunities to aggressively duty cycle the power hungry processor and radio. Analog front ends have not traditionally been duty cycled because analog filters with large time constants dictate a prohibitively high wake up latency. In this paper, we show that this latency can be reduced to a large extent and duty cycling made feasible by making filters \"remember\" their state across power gating cycles. This is done using slight hardware modifications that can even be applied to existing boards. We illustrate our technique on a commercially available wireless electro-cardiography system. Using our methodology, we reduced the restart delay of the circuit by three orders of magnitude from 6s to 5ms. We employ our circuit design for energy efficient QRS complex detection and extraction, which results in a 3&#215; reduction in analog front end energy consumption.","cites":"1","conferencePercentile":"44.11764706"},{"venue":"Wireless Health","id":"91f1bcd20d907788884e44861bdc5bec29917f35","venue_1":"Wireless Health","year":"2011","title":"Demonstration of sleep monitoring and caregiver displays for depression monitoring","authors":"Robert F. Dickerson, Timothy W. Hnat, Enamul Hoque, John A. Stankovic","author_ids":"2552270, 3204515, 2939577, 7230666","abstract":"We demonstrate a subset of the components used in a real-time depression monitoring product for the home. This system runs 24/7 and can potentially detect the early signs of a depression episode, as well as track progress managing a depressive illness. In the complete system, a cohesive set of integrated wireless sensors, a touch screen station, and associated software deliver the above capabilities. The data collected are multi-modal, spanning a number of different behavioral domains including sleep, weight, activities of daily living, and speech prosody. The reports generated by this aggregated data across multiple behavioral domains are aimed to provide caregivers with more accurate and thorough information about the patient's current functioning, thus helping in their diagnostic assessment and therapeutic treatment planning as well as for patients in the management and tracking of their symptoms. We show how the sleep monitoring module can collect bed movements to infer sleeping times and periods of restlessness, and we also present the caregiver display with its series of reports of patient emotional health.","cites":"0","conferencePercentile":"17.64705882"},{"venue":"Wireless Health","id":"52e49f31a9f8f55e6bfd473d47750f6a0bb35d14","venue_1":"Wireless Health","year":"2010","title":"A context-management framework for telemedicine: an emergency medicine case study","authors":"Rita H. Wouhaybi, Mark D. Yarvis, Philip Muse, Chieh-Yih Wan, Sangita Sharma, Sai Prasad, Lenitra Durham, Ritu Sahni, Robert Norton, Merlin Curry, Holly Brügge Jimison, Richard Harper, Robert A. Lowe","author_ids":"2755830, 2355769, 3281539, 1809428, 2267607, 2360555, 2624105, 2332052, 2122139, 2799623, 3046414, 3276208, 3246242","abstract":"Patient care can be intense and stressful, especially in emergency care situations. Emergency care has two parts, field care by a paramedic and in-hospital care. Paramedics often consult with physicians before the patient reaches the hospital. To do this effectively, they must convey the patient's condition rapidly and effectively. Upon hospital arrival they must also transfer as much patient data as possible to ensure continuation of care. In this paper, we present a context-management framework for telemedicine that is designed to capture sensor data for transfer to a remote location. We further describe an application developed on top of the framework for emergency medicine. We examine design considerations for the application based on collaboration with medical personnel. Finally, we present technical results obtained from use of the technology in simulated emergency scenarios.","cites":"3","conferencePercentile":"66.21621622"}]}