{"Wireless_Networks.csv":[{"venue":"Wireless Networks","id":"07002705f42dd3246f47fd6982f25cd5b5cf8656","venue_1":"Wireless Networks","year":"2009","title":"Evaluating MAPSec by marking attack graphs","authors":"Kameswari Kotapati, Peng Liu, Thomas F. La Porta","author_ids":"1845033, 1712572, 3267394","abstract":"MAPSec has recently been introduced as a security protocol for mobile telecommunication networks in the midst of numerous threats and vulnerabilities. Our initial study reveals that MAPSec can only provide protection coverage to a minor portion of the total network vulnera-bilities. Motivated by this discovery, we have devised a toolkit—Cellular Network Vulnerability Assessment Tool-kit for Evaluation (eCAT) to identify: (1) Exact protection coverage of MAPSec, in terms of percentage of attacks prevented; (2) Other kinds of security protocols required in addition to MAPSec; and (3) The most vulnerable network areas. We use the results from eCAT in Coverage Measurement Formulas (CMF) to identify other vulnerabilities. Results from eCAT are dually useful in that they not only reveal MAPSec's limited effectiveness but also provide insights into overall network vulnerabilities.","cites":"1","conferencePercentile":"17.94871795"},{"venue":"Wireless Networks","id":"6fa78636c34f61c700df3982690365f34a6e7305","venue_1":"Wireless Networks","year":"1998","title":"Adaptive filters in multiuser (MU) CDMA detection","authors":"Teng Joon Lim, Sumit Roy","author_ids":"2822615, 1689296","abstract":"The primary purpose of this work is to provide a perspective on adaptive code-division multiple-access (CDMA) MU receivers that have been proposed for future digital wireless systems. Adaptive receivers can potentially adapt to unknown and time-varying environmental parameters such as the number of users, their received powers, spreading codes and time-delays. Two adaptive receiver architectures are primarily considered { one in which the sampled received signal is ltered, and can be used in both the uplink (i.e., at the base station) and downlink (i.e. at the mobile handset) applications; and another in which the spreading codes of users are ltered (assuming knowledge of users' codes and its timing at the receiver) for use in the uplink. Relevant issues such as training-based and blind implementations of the adaptive receiver are discussed, as well as (transient) convergence rates and estimation noise in steady-state.","cites":"9","conferencePercentile":"36.95652174"},{"venue":"Wireless Networks","id":"16f2de7c0bb6832e696cadb9e9d81b3abfefd98b","venue_1":"Wireless Networks","year":"2001","title":"Quality of Service and Mobility for the Wireless Internet","authors":"J. Antonio García-Macías, Franck Rousseau, Gilles Berger-Sabbatel, Leyla Toumi, Andrzej Duda","author_ids":"1683356, 1723840, 1782097, 3072642, 1830838","abstract":"Our paper explores the issue of how to provide appropriate qualityof Service mechanisms closely integrated with flexible mobilitymanagement in wireless local area networks. We consider them asaccess networks of choice for the high performance Wireless MobileInternet. We present a hierarchical QoS architecture that extends<i>Differentiated Services (DiffServ)</i> to mobile hosts in awireless environment. Our approach is based on controlling severalparameters of a wiireless LAN cell: the limited geographicaL spanto ensure the same high bit rate for all hosts, the constrainedrate of traffic sources to limit the use of the channel in functionof the required QoS and the limited number of active hosts to keepthe load sufficiently low. The QoS management is coupled withmobility management at the IP level. We use a micro-mobility schemeimplemented in the IPv6 layer with fast hand-offs between adjacentcells. Micro-mobility avoids address translation, traffictunnelling, and enables fast hand-offs. We give some details ofexperiments to show the quality of service diffferentiation overthe 802.11b network.","cites":"40","conferencePercentile":"72.22222222"},{"venue":"Wireless Networks","id":"9e265ce89f8c31ff07d6a69df5a28b0644665c91","venue_1":"Wireless Networks","year":"2004","title":"BGP-S: A Protocol for Terrestrial and Satellite Network Integration in Network Layer","authors":"Eylem Ekici, Chao Chen","author_ids":"1733684, 2067320","abstract":"To accomplish network layer integration of terrestrial and satellite IP networks, special exterior gateway protocols are needed. In this work, a new exterior gateway protocol called Border Gateway Protocol – Satellite version (BGP-S) is introduced that enables automated discovery of paths that go through the satellite network. This protocol is designed to work in only one terrestrial gateway in every Autonomous System and enables the forwarding of discovered paths in the Internet using the BGP-4 protocol. The performance of BGP-S is investigated through simulations.","cites":"0","conferencePercentile":"4.166666667"},{"venue":"Wireless Networks","id":"f876144ef2d485c3fce257ba509582524c7e78bb","venue_1":"Wireless Networks","year":"2010","title":"FastScan: a handoff scheme for voice over IEEE 802.11 WLANs","authors":"Ilango Purushothaman, Sumit Roy","author_ids":"2413192, 1689296","abstract":"IEEE 802.11 Wireless LANs are increasingly being used in enterprise environments for broad-band access. Such large scale IEEE 802.11 WLAN deployments implies the need for client mobility support; a mobile station has to be \" handed off \" from one Access Point to another. Seamless handoff is possible for data traffic, which is not affected much by the handoff delay. However, voice traffic has stringent QoS requirements and cannot tolerate more than 50ms net handoff delay. The basic IEEE 802.11 handoff scheme (implemented in Layers 1 & 2) only achieves a handoff delay of 300ms at best, leading to disrupted con-nectivity and call dropping. The delay incurred in scanning for APs across channels contributes to 90% of the total handoff delay. In this paper, the FastScan scheme is proposed which reduces the scanning delay by using a client-based database. The net handoff delay is reduced to as low as 20ms for IEEE 802.11b networks. We next suggest \" Enhanced FastScan \" that uses the direction and relative position of the client with respect to the current AP to satisfy the latency constraint in IEEE 802.11a scenarios, which have significantly higher scanning delays due to the larger number of channels. The proposed schemes do not need any changes in the infrastructure (access points) and require only a single radio and a small cache memory at the client side.","cites":"6","conferencePercentile":"74.19354839"},{"venue":"Wireless Networks","id":"e8c585125aba0289dffc72442961a9fd08661b88","venue_1":"Wireless Networks","year":"2011","title":"Public-key based access control in sensornet","authors":"Haodong Wang, Bo Sheng, Chiu Chiang Tan, Qun Li","author_ids":"2758920, 2226840, 1724352, 1686663","abstract":"Symmetric cryptography has been mostly used in security schemes in sensor networks due to the concern that public key cryptography (PKC) is too expensive for sensor devices. While these schemes are efficient in processing time, they generally require complicated key management, which may introduce high memory and communication overhead. On the contrary, PKC-based schemes have simple and clean key management, but cost more computational time. The recent progress in PKC implementation, specially elliptic curve cryptography (ECC), on sensors motivates us to design a PKC-based security scheme and compare its performance with the symmetric-key counterparts. This paper proposes a practical PKC-based access control for sensor networks, which consists of pairwise key establishment, local access control , and remote access control. We have implemented both cryptographic primitives on commercial off-the-shelf sensor devices. Building the user access control as a case study, we show that PKC-based protocol is more advantageous than those built on symmetric cryptography in terms of the memory usage, message complexity, and security resilience. Meanwhile, our work also provides insights in integrating and designing PKC-based security protocols for sensor networks.","cites":"0","conferencePercentile":"9.756097561"},{"venue":"Wireless Networks","id":"ddaf42fcdf8e4c879dd148ed8660bc54b4de5ddf","venue_1":"Wireless Networks","year":"2002","title":"Wireless Internet Access Using IS-2000 Third Generation System: A Performance and Capacity Study","authors":"Zbigniew Dziong, Farooq Khan, Kamesh Medepalli, Sanjiv Nanda","author_ids":"3055563, 1904807, 2560088, 1966109","abstract":"The Internet has been growing tremendously in the recent years and applications like web browsing are becoming increasingly popular. In a collective effort to provide seamless access to the Internet, wireless equipment manufacturers and service providers are developing 3G wireless systems that efficiently support current and future Internet applications. In this paper, we evaluate the performance and capacity of a 3G wireless data system based on IS-2000 standard. We consider web browsing as the common application for all users and evaluate the system performance for single and parallel web browsing sessions. We perform this study through a detailed simulation of web traffic model described by distributions of number of objects per page, object size, page request size and page reading time. The simulation includes HTTP and TCP/IP protocols, link level recovery, radio resource management, mobility, channel model and, delays in the Internet and the radio access network. We quantify important system attributes like average page download times and system throughput (Kb/s per carrier per sector). We also evaluate normalized object download time, normalized page download time, penalty in performance due to link errors, link layer buffer sizes needed, channel holding time, average power used and distribution of the power used in the system.","cites":"2","conferencePercentile":"13.46153846"},{"venue":"Wireless Networks","id":"5a459e764726c4ffceba51c76baa7f511ee5b1b8","venue_1":"Wireless Networks","year":"1997","title":"Cyberguide: A mobile context-aware tour guide","authors":"Gregory D. Abowd, Christopher G. Atkeson, Jason I. Hong, Sue Long, Rob Kooper, Mike Pinkerton","author_ids":"1732524, 8483722, 1689960, 2665825, 2270272, 2938064","abstract":"Future computing environments will free the user from the constraints of the desktop. Applications for a mobile environment should take advantage of contextual information, such as position, to offer greater services to the user. In this paper, we present the Cyberguide project, in which we are building prototypes of a mobile context-aware tour guide. Knowledge of the user's current location, as well as a history of past locations, are used to provide more of the kind of services that we come to expect from a real tour guide. We describe the architecture and features of a variety of Cyberguide prototypes developed for indoor and outdoor use on a number of different hand-held platforms. We also discuss the general research issues that have emerged in our context-aware applications development in a mobile environment.","cites":"794","conferencePercentile":"100"},{"venue":"Wireless Networks","id":"0c5bed26159fa53c7349ea67c64e0db4098dfb1c","venue_1":"Wireless Networks","year":"2002","title":"Robotics-Based Location Sensing Using Wireless Ethernet","authors":"Andrew M. Ladd, Kostas E. Bekris, Algis Rudys, Lydia E. Kavraki, Dan S. Wallach","author_ids":"2867688, 1739036, 2308886, 1780248, 1798983","abstract":"A key subproblem in the construction of location-aware systems is the determination of the position of a mobile device. This paper describes the design, implementation and analysis of a system for determining position inside a building from measured RF signal strengths of packets on an IEEE 802.11b wireless Ethernet network. Previous approaches to location awareness with RF signals have been severely hampered by non-linearity, noise and complex correlations due to multi-path effects, interference and absorption. The design of our system begins with the observation that determining position from complex, noisy and non-linear signals is a well-studied problem in the field of robotics. Using only off-the-shelf hardware, we achieve robust position estimation to within a meter in our experimental context and after adequate training of our system. We can also coarsely determine our orientation and can track our position as we move. By applying recent advances in probabilistic inference of position and sensor fusion from noisy signals, we show that the RF emissions from base stations as measured by off-the-shelf wireless Ethernet cards are sufficiently rich in information to permit a mobile device to reliably track its location.","cites":"286","conferencePercentile":"96.15384615"},{"venue":"Wireless Networks","id":"1f7a48de894776e75c4fc3767740ecd68a28b135","venue_1":"Wireless Networks","year":"2003","title":"Stochastic Modeling of TCP in Networks with Abrupt Delay Variations","authors":"Alhussein A. Abouzeid, Sumit Roy","author_ids":"1704556, 1689296","abstract":"An analytical model of TCP (Transport Control Protocol) over an end-to-end path with random abrupt round-trip time (RTT) changes is presented. Modeling the RTT as a stochastic process, we analytically quantify and compare between the degree of degradation of the steady-state average throughput and window size due to spurious retransmissions for the different versions of TCP (Reno/NewReno versus Tahoe). The modeling methodology in this paper is used for evaluating different design alternatives for TCP for highly dynamic networks.","cites":"12","conferencePercentile":"48.27586207"},{"venue":"Wireless Networks","id":"094337bc6f60922f76f5a6c8f4be0a678aefc077","venue_1":"Wireless Networks","year":"2005","title":"Energy-Efficient Broadcasting in All-Wireless Networks","authors":"Mario Cagalj, Jean-Pierre Hubaux, Christian C. Enz","author_ids":"3332186, 1757221, 2684752","abstract":"In all-wireless networks, minimizing energy consumption is crucial as in most cases the nodes are battery-operated. We focus on the problem of power-optimal broadcast, for which it is well known that the broadcast nature of radio transmissions can be exploited to optimize energy consumption. This problem appears to be difficult to solve [30]. We provide a formal proof of NP-completeness for the general case and give an NP-completeness result for the geometric case; in the former, the network topology is represented by a generic graph with arbitrary weights, whereas in the latter a Euclidean distance is considered. For the general case, we show that it cannot be approximated better than O(log N), where N is the total number of nodes. We then describe an approximation algorithm that achieves the O(log N) approximation ratio. We also describe a new heuristic, Embedded Wireless Multicast Advantage. We show that it compares well with other proposals and we explain how it can be distributed.","cites":"27","conferencePercentile":"75"},{"venue":"Wireless Networks","id":"65c48640c1b0b1a924233df8854fe9ff2d96471c","venue_1":"Wireless Networks","year":"2007","title":"A hierarchical approach to position-based multicast for mobile ad-hoc networks","authors":"Matthias Transier, Holger Füßler, Jörg Widmer, Martin Mauve, Wolfgang Effelsberg","author_ids":"2941659, 2124894, 1712634, 1751862, 1750165","abstract":"In this paper we present Scalable Position-Based Multicast (SPBM), a multicast routing protocol for ad-hoc networks. SPBM uses the geographic position of nodes to provide a highly scalable group membership scheme and to forward data packets in a way that is very robust to changes in the topology of the network. SPBM bases the forwarding decision on whether or not there are group members located in a given direction, allowing a hierarchical aggregation of membership information. The farther away a region is from an intermediate node, the higher the level of aggregation for this region should be. Because of aggregation, the overhead for group membership management scales logarithmically with the number of nodes and is independent of the number of multicast senders for a given multicast group. Furthermore, we show that group management overhead is bounded by a constant if the frequency of membership updates is scaled down with the aggregation level. This scaling of the update frequency is reasonable since the higher the level of aggregation is, the lower the number of membership changes for the aggregate will be. The performance of SPBM is investigated by means of simulation, including a comparison with ODMRP, and through mathematical analysis. We also describe an open source kernel implementation of SPBM that has been successfully deployed on hand-held computers.","cites":"19","conferencePercentile":"60"},{"venue":"Wireless Networks","id":"d661578bd9795976df73da30a89ea76da1f84077","venue_1":"Wireless Networks","year":"2011","title":"A software framework for alleviating the effects of MAC-aware jamming attacks in wireless access networks","authors":"Ioannis Broustis, Konstantinos Pelechrinis, Dimitris Syrivelis, Srikanth V. Krishnamurthy, Leandros Tassiulas","author_ids":"2919362, 2096978, 3272371, 1791108, 1705536","abstract":"The IEEE 802.11 protocol inherently provides the same long-term through-put to all the clients associated with a given access point (AP). In this paper, we first identify a clever, low-power jamming attack that can take advantage of this behavioral trait: the placement of a low-power jammer in a way that it affects a single legitimate client can cause starvation to all the other clients. In other words, the total throughput provided by the corresponding AP is drastically degraded. To fight against this attack, we design FIJI, a cross-layer anti-jamming system that detects such intelligent jammers and mitigates their impact on network performance. FIJI looks for anomalies in the AP load distribution to efficiently perform jammer detection. It then makes decisions with regards to optimally shaping the traffic such that: (a) the clients that are not explicitly jammed are shielded from experiencing starvation and, (b) the jammed clients receive the maximum possible throughput under the given conditions. We implement FIJI in real hardware; we evaluate its efficacy through experiments on two wireless testbeds, under different traffic scenarios, network densities and jammer locations. We perform experiments both indoors and outdoors, and we consider both WLAN and mesh deployments. Our measurements suggest that FIJI detects such jammers in real-time and alleviates their impact by allocating the available bandwidth in a fair and efficient way.","cites":"2","conferencePercentile":"43.90243902"},{"venue":"Wireless Networks","id":"1b91ce6913648080d4301e20ec1a5de781586927","venue_1":"Wireless Networks","year":"2010","title":"UVOC-MAC: a MAC protocol for outdoor ultraviolet networks","authors":"Yiyang Li, Jianxia Ning, Zhengyuan Xu, Srikanth V. Krishnamurthy, Gang Chen","author_ids":"6661872, 3267237, 7814634, 1791108, 2269280","abstract":"—As an alternative to radio-frequency (RF) communications , optical wireless communications (OWC) can support high data rates and low power operations while providing good jamming resistance. Our focus in this paper is on deep ultraviolet (UV) outdoor communications (UVOC) where solar blind and non-line-of-sight operations are attractive. Light beams from UV LED arrays serve as information carriers. In an abstract sense, this is similar to directional transmissions in RF; however, the PHY layer characteristics significantly differ due to atmospheric scattering. First, we perform extensive experiments on a UV testbed towards understanding signal propagation and the impact of the PHY on medium access. We find that UV propagation supports (a) fully duplex communications and (b) multiple data rate transmissions. Next, we propose a novel contention-based media access control (UVOC-MAC) protocol that inherently accounts for the UV PHY layer and fully exploits multi-fold spatial reuse opportunities. Evaluations via both simulations and analysis show that UVOC-MAC effectively mitigates collisions and achieves high throughput. In particular, up to a 4-fold increase in throughput and 50% reduction in collision are possible compared to a MAC protocol agnostic to the UV PHY properties.","cites":"2","conferencePercentile":"29.83870968"},{"venue":"Wireless Networks","id":"03d181dff5a61b6e91ff36770b0fda380132cb49","venue_1":"Wireless Networks","year":"2008","title":"A framework for self-healing and optimizing routing techniques for mobile ad hoc networks","authors":"Chao Gui, Prasant Mohapatra","author_ids":"7919150, 1697868","abstract":"On demand routing protocols provide scalable and cost-effective solutions for packet routing in mobile wireless ad hoc networks. The paths generated by these protocols may deviate far from the optimal because of the lack of knowledge about the global topology and the mobility of nodes. Routing optimality affects network performance and energy consumption, especially when the load is high. In this paper, we define routing optimality using different metrics such as path length, energy consumption along the path, and energy aware load balancing among the nodes. We then propose a framework of Self-Healing and Optimizing Routing Techniques (SHORT) for mobile ad hoc networks. While using SHORT, all the neighboring nodes monitor the route and try to optimize it if and when a better local subpath is available. Thus SHORT enhances performance in terms of bandwidth and latency without incurring any significant additional cost. In addition, SHORT can be also used to determine paths that result in low energy consumption or to optimize the residual battery power. Thus, we have detailed two broad classes of SHORT algorithms: Path-Aware SHORT and Energy-Aware SHORT. Finally, we evaluate SHORT using the ns-2 simula-tor. The results demonstrate that the performance of existing routing schemes can be significantly improved using the proposed SHORT algorithms. generous gift from the Hewlett Packard Corporation. A preliminary version of this paper appeared in the proceedings of the ACM MobiHoc 2003. Keywords Ad hoc networks. Routing protocol. Self-healing and optimizing routing techniques .","cites":"4","conferencePercentile":"48.07692308"},{"venue":"Wireless Networks","id":"9b986b1f3cdf70e5ab745b91a69326ea4f5ed6e7","venue_1":"Wireless Networks","year":"2011","title":"Behavior-based mobility prediction for seamless handoffs in mobile wireless networks","authors":"Weetit Wanalertlak, Ben Lee, Chansu Yu, Myungchul Kim, Seung-Min Park, Won-Tae Kim","author_ids":"1822778, 1708098, 1733655, 1806505, 7882869, 6818450","abstract":"The field of wireless networking has received unprecedented attention from the research community during the last decade due to its great potential to create new horizons for communicating beyond the Internet. Wireless LANs (WLANs) based on the IEEE 802.11 standard have become prevalent in public as well as residential areas, and their importance as an enabling technology will continue to grow for future pervasive computing applications. However, as their scale and complexity continue to grow, reducing handoff latency is particularly important. This paper presents the Behavior-based Mobility Prediction scheme to eliminate the scanning overhead incurred in IEEE 802.11 networks. This is achieved by considering not only location information but also group, time-of-day, and duration characteristics of mobile users. This captures short-term and periodic behavior of mobile users to provide accurate next-cell predictions. Our simulation study of a campus network and a municipal wireless network shows that the proposed method improves the next-cell prediction accuracy by 23*43% compared to location-only based schemes and reduces the average handoff delay down to 24*25 ms.","cites":"14","conferencePercentile":"95.12195122"},{"venue":"Wireless Networks","id":"3752d07f4900471fa067788bd02258c1f14832c5","venue_1":"Wireless Networks","year":"2002","title":"An Architecture for Secure Wide-Area Service Discovery","authors":"Todd D. Hodes, Steven E. Czerwinski, Ben Y. Zhao, Anthony D. Joseph, Randy H. Katz","author_ids":"2978404, 2329876, 1972108, 1687701, 1739792","abstract":"The widespread deployment of inexpensive communications technology, computational resources in the networking infrastructure , and network-enabled end devices poses an interesting problem for end users: how to locate a particular network service or device out of hundreds of thousands of accessible services and devices. This paper presents the architecture and implementation of a secure wide-area Service Discovery Service (SDS). Service providers use the SDS to advertise descriptions of available or already running services, while clients use the SDS to compose complex queries for locating these services. Service descriptions and queries use the eXtensible Markup Language (XML) to encode such factors as cost, performance, location, and device-or service-specific capabilities. The SDS provides a fault-tolerant, incrementally scalable service for locating services in the wide-area. Security is a core component of the SDS: communications are both encrypted and authenticated where necessary, and the system uses a hybrid access control list and capability system to control access to service information. Wide-area query routing is also a core component of the SDS: all information in the system is potentially reachable by all clients.","cites":"55","conferencePercentile":"65.38461538"},{"venue":"Wireless Networks","id":"d38440a554bfe2a2e9fabccd474850a5c4b0f48a","venue_1":"Wireless Networks","year":"2014","title":"Network coding over connected dominating set: energy minimal broadcasting in wireless ad hoc networks","authors":"Shuai Wang, Chonggang Wang, Kai Peng, Guang Tan, Hongbo Jiang, Yan Dong","author_ids":"3804894, 1804119, 3102925, 1728087, 1792087, 1770035","abstract":"Energy efficient broadcast is indispensable for many applications in wireless ad hoc networks. It has been proved that network coding has great potential to improve performance in terms of energy consumption in wireless ad hoc networks. However, the power of network coding depends on the availability of coding opportunities, which in turns depends on how routing paths are established. It is thus beneficial to establish paths in such a way that more coding opportunities are created. By combining network coding and connected dominating set (CDS), we explore energy minimal broadcast protocols in wireless ad hoc networks. The rationale behind this combination is that CDS provides better chances for data flows to intersect, which means more coding opportunities. We design a scheme, named NCDS, that uses network coding over connected dominating set, to reduce energy consumption. Analysis and experimental results show that NCDS out-performs broadcast algorithms that use CDS or network coding alone.","cites":"1","conferencePercentile":"52.85714286"},{"venue":"Wireless Networks","id":"08bd90394c2273c434fa74af2a71e6711ef25753","venue_1":"Wireless Networks","year":"2010","title":"Achieving robust message authentication in sensor networks: a public-key based approach","authors":"Haodong Wang, Qun Li","author_ids":"2758920, 1686663","abstract":"Given the extremely limited hardware resources on sensor nodes and the inclement deploying environment, the adversary Denial-of-Service (DoS) attack becomes a serious security threat toward wireless sensor networks. Without adequate defense mechanism, the adversary can simply inundate the network by flooding the bogus data packets, and paralyze the partial or whole sensor network by depleting node battery power. Prior work on false packet filtering in sensor networks are mostly based on symmetric key schemes, with the concern that the public key operations are too expensive for the resource constrained sensors. Recent progress in public key implementations on sensors, however, has shown that public key is already feasible for sensors. In this paper, we present PDF, a Public-key based false Data Filtering scheme that leverages Shamir's threshold cryptography and Elliptic Curve Cryptography (ECC), and effectively rejects 100% of false data packets. We evaluate PDF by real world implementation on MICAz motes. Our experiment results support the conclusion that PDF is practical for real world sensor deployment.","cites":"5","conferencePercentile":"66.12903226"},{"venue":"Wireless Networks","id":"e1a3d4b2c2cbbc5e06fc571589a4400b655bff58","venue_1":"Wireless Networks","year":"2005","title":"A Video Streaming System for Mobile Phones: Practice and Experience","authors":"Hojung Cha, Jongmin Lee, Jongho Nang, Sungyong Park, Jin-Hwan Jeong, Chuck Yoo, Jin-Young Choi","author_ids":"1694711, 2681268, 2135810, 1875514, 1950955, 2277951, 2751160","abstract":"This paper presents a case of video streaming system for mobile phone which has actually been implemented and deployed for commercial services in CDMA2000 1X cellular phone networks. As the computing environment and the network connection of cellular phones are significantly different from the wired desktop environment, the traditional desktop streaming method is not applicable. Therefore, a new architecture is required to suit the successfully streaming in the mobile phone environment. We have developed a very lightweight video player for use in mobile phone and the related authoring tool for the player. The streaming server has carefully been designed to provide high efficiency, reliability and scalability. Based on a specifically-designed suite of streaming protocol, the server employs an adaptive rate control mechanism which transmits the media packets appropriately into the network according to the change in network bandwidth.","cites":"3","conferencePercentile":"22.22222222"},{"venue":"Wireless Networks","id":"ca22830e1827b6559865c7dd4fa9733dcabcde88","venue_1":"Wireless Networks","year":"2015","title":"Throughput-fairness optimization in energy-limited user-relay wireless networks","authors":"Dan Xu, Xin Liu","author_ids":"1751941, 1749705","abstract":"—Throughput and fairness are conflicting objectives in many networking scenarios. To address this issue, relays have been considered/used to improve the overall throughput without sacrificing fairness. However, we observe that in a relay-based wireless network, throughput-based fairness significantly limits the performance of the relay users when they are energy limited. To overcome this issue, we propose the notion of max-min energy efficiency throughput fairness, by which relay users with a higher energy consumption can reap a higher throughput. We further propose an efficient data rate allocation algorithm to achieve the fairness objective in a multi-hop relay wireless network. Simulation results show the advantages of the proposed fairness policy compared to other fairness objectives.","cites":"1","conferencePercentile":"85"},{"venue":"Wireless Networks","id":"9c0e54c6b4e1e8f3bc5b7577cb201542569aa5c0","venue_1":"Wireless Networks","year":"2003","title":"Node-Level Energy Management for Sensor Networks in the Presence of Multiple Applications","authors":"Athanassios Boulis, Mani B. Srivastava","author_ids":"1807813, 1702254","abstract":"Energy related research in wireless ad hoc sensor networks (WASNs) is focusing on energy saving techniques in the application-, protocol-, service-, or hardware-level. Little has been done to manage the finite amount of energy for a given (possibly optimally-designed) set of applications, protocols and hardware. Given multiple candidate applications (i.e., distributed algorithms in a WASN) of different energy costs and different user rewards, how does one manage a finite energy amount? Where does one provide energy, so as to maximize the useful work done (i.e. maximize user rewards)? We formulate the problem at the node-level, by having system-level \"hints\" from the applications. In order to tackle the central problem we first identify the energy consumption patterns of applications in WASNs, we propose ways for real-time measurements of the energy consumption by individual applications, and we solve the problem of estimating the extra energy consumption that a new application brings to a set of executing applications. Having these tools at our disposal, and by properly abstracting the problem we present an optimal admission control policy and a post-admission policing mechanism at the node-level. The admission policy can achieve up to 48% increase in user rewards compared to the absence of energy management, for a variety of application mixes.","cites":"20","conferencePercentile":"62.06896552"},{"venue":"Wireless Networks","id":"411a38868305d56eacfb5b5892818743e0c70176","venue_1":"Wireless Networks","year":"2003","title":"PARO: Supporting Dynamic Power Controlled Routing in Wireless Ad Hoc Networks","authors":"Javier Gomez, Andrew T. Campbell, Mahmoud Naghshineh, Chatschik Bisdikian","author_ids":"1683661, 1690035, 1766452, 1717717","abstract":"This paper introduces PARO, a dynamic power controlled routing scheme that helps to minimize the transmission power needed to forward packets between wireless devices in ad hoc networks. Using PARO, one or more intermediate nodes called \" redirectors \" elects to forward packets on behalf of source–destination pairs thus reducing the aggregate transmission power consumed by wireless devices. PARO is applicable to a number of networking environments including wireless sensor networks, home networks and mobile ad hoc networks. In this paper, we present the detailed design of PARO and evaluate the protocol using simulation and experimentation. We show through simulation that PARO is capable of outperforming traditional broadcast-based routing protocols (e.g., MANET routing protocols) due to its energy conserving point-to-point on-demand design. We discuss our experiences from an implementation of the protocol in an experimental wireless testbed using off-the-shelf radio technology. We also evaluate the impact of dynamic power controlled routing on traditional network performance metrics such as end-to-end delay and throughput.","cites":"77","conferencePercentile":"89.65517241"},{"venue":"Wireless Networks","id":"dc3b3e8fe8f9f5de86c89d7e7f3de45a27defaf2","venue_1":"Wireless Networks","year":"2007","title":"Real-time traffic support in heterogeneous mobile networks","authors":"Yuan Sun, Elizabeth M. Belding-Royer, Xia Gao, James Kempf","author_ids":"7137515, 2377614, 8246061, 2951397","abstract":"Multi-hop mobile wireless networks have been proposed for a variety of applications where support for real-time multi-media services will be necessary. Support for these applications requires that the network is able to offer quality of service (QoS) appropriate for the latency and jitter bounds of the real-time application constraints. In this paper, we analyze the primary challenges of realizing QoS in mobile wireless networks with heterogeneous devices and propose a QoS framework for real-time traffic support. We address the problem in three ways: estimate the path quality for real-time flows, mitigate the impact of node heterogeneity on service performance, and reduce the impact of interfering non-real-time traffic. Specifically , our proposed QoS framework first utilizes a call setup protocol at the IP layer to discover paths for real-time flows, as well as to perform admission control by accurate service quality prediction. The underlying routing protocol also enables transparent path selection among heterogeneous nodes to provide stable paths for real-time traffic delivery. We then use a prioritized MAC protocol to provide priority access for flows with real-time constraints to reduce interference from unregu-lated non-real-time traffic. We foresee the utility of our proposed solution in heterogeneous mobile networks, such as campus or community-wide wireless networks. In these environments, resource-rich or fixed wireless routers may be leveraged to achieve better service quality when heterogeneity of node capability and movement is significant. Through experimental results, we demonstrate the utility and efficiency of our approach.","cites":"4","conferencePercentile":"20"},{"venue":"Wireless Networks","id":"b8b54e58e96dc91919b8e6c14906472b2dbda16b","venue_1":"Wireless Networks","year":"2003","title":"Multi-Level Hierarchies for Scalable Ad hoc Routing","authors":"Elizabeth M. Belding-Royer","author_ids":"2377614","abstract":"Ad hoc networks have the notable capability of enabling spontaneous networks. These networks are self-initializing, self-configuring, and self-maintaining, even though the underlying topology is often continually changing. Because research has only begun to scratch the surface of the potential applications of this technology, it is important to prepare for the widespread use of these networks. In anticipation of their ubiquity, the protocols designed for these networks must be scalable. This includes scaling to both networks with many nodes, and networks with rapidly changing topologies. This paper presents two hierarchical clustering protocols that improve the scalability of ad hoc routing protocols. The Adaptive Routing using Clusters (ARC) protocol creates a one-level clustered hierarchy across an ad hoc network, while the Adaptive Routing using Clustered Hierarchies (ARCH) protocol creates a multi-level hierarchy which is able to dynamically adjust the depth of the hierarchy in response to the changing network topology. It is experimentally shown that these protocols, when coupled with an ad hoc routing protocol, produce throughput improvements of up to 80% over the ad hoc routing protocol alone.","cites":"44","conferencePercentile":"72.4137931"},{"venue":"Wireless Networks","id":"95abf9e20c5bc0829157e49963f6d3f3b1192638","venue_1":"Wireless Networks","year":"2000","title":"Design and analysis of low-power access protocols for wireless and mobile ATM networks","authors":"Krishna M. Sivalingam, Jyh-Cheng Chen, Prathima Agrawal, Mani B. Srivastava","author_ids":"5640460, 1706719, 1741062, 1702254","abstract":"This paper describes the design and analysis of a low-power medium access control (MAC) protocol for wireless/mobile ATM networks. The protocol – denoted EC-MAC (energy conserving medium access control) – is designed to support different traffic types with quality-of-service (QoS) provisions. The network is based on the infrastructure model where a base station (BS) serves all the mobiles currently in its cell. A reservation-based approach is proposed, with appropriate scheduling of the requests from the mobiles. This strategy is utilized to accomplish the dual goals of reduced energy consumption and quality of service provision over wireless links. A priority round robin with dynamic reservation update and error compensation scheduling algorithm is used to schedule the transmission requests of the mobiles. Discrete-event simulation has been used to study the performance of the protocol. A comparison of energy consumption of the EC-MAC to a number of other protocols is provided. This comparison indicates the EC-MAC has, in general, better energy consumption characteristics. Performance analysis of the proposed protocol with respect to different quality-of-service parameters using video, audio and data traffic models is provided.","cites":"48","conferencePercentile":"89.47368421"},{"venue":"Wireless Networks","id":"515f1228c2bf8245ee32abfe815af67fc37e12a7","venue_1":"Wireless Networks","year":"1999","title":"Adaptive link layer strategies for energy efficient wireless networking","authors":"Paul Lettieri, Curt Schurgers, Mani B. Srivastava","author_ids":"1819748, 1697660, 1702254","abstract":"Low power consumption is a key design metric for portable wireless network devices where battery energy is a limited resource. The resultant energy efficient design problem can be addressed at various levels of system design, and indeed much research has been done for hardware power optimization and power management within a wireless device. However, with the increasing trend towards thin client type wireless devices that rely more and more on network based services, a high fraction of power consumption is being accounted for by the transport of packet data over wireless links [28]. This offers an opportunity to optimize for low power in higher layer network protocols responsible for data communication among multiple wireless devices. Consider the data link protocols that transport bits across the wireless link. While traditionally designed around the conventional metrics of throughput and latency, a proper design offers many opportunities for optimizing the metric most relevant to battery operated devices: the amount of battery energy consumed per useful user level bit transmitted across the wireless link. This includes energy spent in the physical radio transmission process, as well as in computation such as signal processing and error coding. This paper describes how energy efficiency in the wireless data link can be enhanced via adaptive frame length control in concert with adaptive error control based on hybrid FEC (forward error correction) and ARQ (automatic repeat request). Key to this approach is a high degree of adaptivity. The length and error coding of the atomic data unit (frame) going over the air, and the retransmission protocol are (a) selected for each application stream (ATM virtual circuit or IP/RSVP flow) based on quality of service (QoS) requirements, and (b) continually adapted as a function of varying radio channel conditions due to fading and other impairments. We present analysis and simulation results on the battery energy efficiency achieved for user traffic of different QoS requirements, and describe hardware and software implementations.","cites":"34","conferencePercentile":"56.66666667"},{"venue":"Wireless Networks","id":"3dc89fae01e32c83b3793534e4cfe0a0fd4e1906","venue_1":"Wireless Networks","year":"2007","title":"A cross layer scheme for adaptive antenna array based wireless ad hoc networks in multipath environments","authors":"J. C. Mundarath, Parameswaran Ramanathan, Barry D. Van Veen","author_ids":"2827367, 4175169, 1727308","abstract":"A medium access control (MAC) protocol (NULLHOC) for ad hoc networks of nodes with antenna arrays is presented. The antenna array is used for transmit and receive beamforming with the purpose of increasing spatial reuse by directing nulls at active transmitters and receivers in the neighborhood. In contrast to previous work with directional antennas, our approach is applicable to multipath channels, such as occur indoors or in other rich scattering environments. The MAC protocol is designed to support the control information exchange needed to direct nulls toward other users involved in existing communication sessions. Knowledge of the channel coefficients between a transmitter or receiver and its neighbors is used to design transmit or receive beamformer weights that implement the requisite nulling. Simulations are used to demonstrate the improvements in throughput and transmit powers that are obtained in this approach relative to the IEEE 802.11 MAC protocol. We also analyze the effects of channel estimation errors on our protocol and propose a simple modification of the basic NULLHOC protocol to minimize their impact. Any opinions, findings and conclusions or recommendations expressed in this publication are those of the author(s) and do not necessarily reflect the views of the funding agencies.","cites":"12","conferencePercentile":"52"},{"venue":"Wireless Networks","id":"1fad15979530fe4814837fa99705a937639ca833","venue_1":"Wireless Networks","year":"2004","title":"SOLONet: Sub-optimal location-aided overlay network for MANETs","authors":"Abhishek P. Patil, Yunhao Liu, Li Xiao, Abdol-Hossein Esfahanian, Lionel M. Ni","author_ids":"2312640, 1723433, 6619548, 1731738, 1726587","abstract":"Overlay networks have made it easy to implement multicast functionality in MANETs. Their flexibility to adapt to different environments has helped in their steady growth. Overlay multicast trees that are built using location information account for node mobility and have a low latency. However, the performance gains of such trees are offset by the overhead involved in distributing and maintaining precise location information. As the degree of (location) accuracy increases , the performance improves but the overhead required to store and broadcast this information also increases. In this paper, we present SOLONet, a design to build a sub-optimal location aided overlay multicast tree, where location updates of each member node are event based. Unlike several other approaches, SOLONet doesn't require every packet to carry location information or each node maintain location information of every other node or carrying out expensive location broadcast for each node. Our simulation results indicate that SOLONet is scalable and its sub-optimal tree performs very similar to an overlay tree built by using precise location information. SOLONet strikes a good balance between the advantages of using location information (for building efficient overlay multicast trees) versus the cost of maintaining and distributing location information of every member nodes.","cites":"5","conferencePercentile":"30.55555556"},{"venue":"Wireless Networks","id":"af9591814a0d7bbc1e81fda81c2eb6c7f7e0da52","venue_1":"Wireless Networks","year":"2003","title":"A Cost-Efficient Scheduling Algorithm of On-Demand Broadcasts","authors":"Weiwei Sun, Weibin Shi, Baile Shi, Yijun Yu","author_ids":"8397572, 2494289, 1705042, 1718749","abstract":"In mobile wireless systems data on air can be accessed by a large number of mobile users. Many of these applications including wireless internets and traffic information systems are pull-based, that is, they respond to on-demand user requests. In this paper, we study the scheduling problems of on-demand broadcast environments. Traditionally, the response time of the requests has been used as a performance measure. In this paper we consider the performance as the average cost of request composed of three kinds of costs – access time cost, tuning time cost, and cost of handling failure request. Our main contribution is a self-adaptive scheduling algorithm named LDFC, which computes the delay cost of data item as the priority of broadcast. It costs less compared with some previous algorithms in this context, and shows good adaptability as well even in pure push-based broadcasts.","cites":"11","conferencePercentile":"43.10344828"},{"venue":"Wireless Networks","id":"20af75bf37b6ad2c0a8f819178167903c06cb2fa","venue_1":"Wireless Networks","year":"2001","title":"A Markov-Based Channel Model Algorithm for Wireless Networks","authors":"Almudena Konrad, Ben Y. Zhao, Anthony D. Joseph, Reiner Ludwig","author_ids":"2130365, 1972108, 1687701, 2595546","abstract":"Techniques for modeling and simulating channel conditions play an essential role in understanding network protocol and application behavior. In [11], we demonstrated that inaccurate modeling using a traditional analytical model yielded significant errors in error control protocol parameters choices. In this paper, we demonstrate that time-varying effects on wireless channels result in wireless traces which exhibit non-stationary behavior over small window sizes. We then present an algorithm that divides traces into stationary components in order to provide analytical channel models that, relative to traditional approaches, more accurately represent characteristics such as burstiness, statistical distribution of errors, and packet loss processes. Our algorithm also generates artificial traces with the same statistical characteristics as actual collected network traces. For validation, we develop a channel model for the circuit-switched data service in GSM and show that it: (1) more closely approximates GSM channel characteristics than a traditional Gilbert model and (2) generates artificial traces that closely match collected traces' statistics. Using these traces in a simulator environment enables future protocol and application testing under different controlled and repeatable conditions.","cites":"142","conferencePercentile":"94.44444444"},{"venue":"Wireless Networks","id":"5be6dc8adbf0eee38587a59c74da3ec29a0949aa","venue_1":"Wireless Networks","year":"2005","title":"A Routing Protocol for Hierarchical LEO/MEO Satellite IP Networks","authors":"Chao Chen, Eylem Ekici","author_ids":"2067320, 1733684","abstract":"The rapid growth of Internet-based applications pushes broadband satellite networks to carry on IP traffic. In previously proposed connectionless routing schemes in satellite networks, the metrics used to calculate the paths do not reflect the total delay a packet may experience. In this paper, a new Satellite Grouping and Routing Protocol (SGRP) is developed. In each snapshot period, SGRP divides Low Earth Orbit (LEO) satellites into groups according to the footprint area of the Medium Earth Orbit (MEO) satellites. Based on the delay reports sent by LEO satellites, MEO satellite managers compute the minimum-delay paths for their LEO members. Since the signaling traffic is physically separated from the data traffic, link congestion does not affect the responsiveness of delay reporting and routing table calculation. The snapshot and group formation methods as well as fast reacting mechanisms to address link congestion and satellite failures are described in detail. The performance of SGRP is evaluated through simulations and analysis.","cites":"16","conferencePercentile":"55.55555556"},{"venue":"Wireless Networks","id":"d163af69f67cdf3efc3a6f2e3bc0a2aae3a203be","venue_1":"Wireless Networks","year":"2011","title":"Seeker: A bandwidth-based association control framework for wireless mesh networks","authors":"Dhruv Gupta, Prasant Mohapatra, Chen-Nee Chuah","author_ids":"2560723, 1697868, 1768348","abstract":"The rapid deployment of wireless mesh networks across universities and enterprises, and the perva-siveness of mobile devices equipped with Wi-Fi connectivity, has resulted in a scenario wherein end users have the option to choose from a multitude of access points at any given location. Moreover, with the increasing availability of rich online content, there has been a steady increase in mobile Internet traffic. Since the choice of access point that a user associates with will directly impact his performance, it is imperative that there exist an efficient association control mechanism, in order to enhance the end user's experience. As part of this work, we propose Seeker, a novel framework for association control in wireless networks that utilizes ''available bandwidth'' as the design metric. The goal of Seeker is to assist the mesh network in making an intelligent decision regarding which access point a client should associate with. As part of our scheme, we implement and evaluate a passive tool to estimate available bandwidth in wireless networks. We then describe how we use this tool to implement our association control scheme, and evaluate it via extensive experiments on an outdoor testbed. Seeker takes into consideration the performance of the mesh backhaul, in addition to the client-to-AP link quality, thereby achieving significant advantages over traditional association control schemes for wireless-LANs.","cites":"5","conferencePercentile":"76.82926829"},{"venue":"Wireless Networks","id":"a06bf09aa5f2c70bd30a64bccb0f0ad0dff931e1","venue_1":"Wireless Networks","year":"2001","title":"A Utility-Based Approach for Quantitative Adaptation in Wireless Packet Networks","authors":"Raymond R.-F. Liao, Andrew T. Campbell","author_ids":"2091786, 1690035","abstract":"This paper assesses the state-of-the-art in Quality-of-Service (QoS) adaptive wireless networks and proposes new adaptation techniques that better suit application specific needs. The contribution of the paper is as follows: we propose an adaptive service comprising (i) bandwidth utility functions, which capture the adaptive nature of mobile applications in terms of the range of bandwidth over which they prefer to operate; and (ii) adaptation scripts, which enable adaptive mobile applications to program the per-flow adaptation time scale and bandwidth granularity realizing application-specific adaptive services. To maintain adaptive services in wireless packet access networks, we propose a split level adaptation control framework that operates at the network and application levels. Network level control employs a periodic probing mechanism between mobile devices and network gateways in support of utility based max–min fair resource allocation. Application level control is managed by a set of distributed adaptation handlers that operate at mobile devices realizing application-specific adaptation strategies.","cites":"45","conferencePercentile":"75"},{"venue":"Wireless Networks","id":"fda6731938f8ea1e358d5e1d570f5e2859c9f11d","venue_1":"Wireless Networks","year":"2005","title":"A New Call Admission Control Scheme Based on Mobile Position Estimation in DS-CDMA Systems","authors":"Tuna Tugcu, Cem Ersoy","author_ids":"1959792, 1767459","abstract":"Call dropping is considered more annoying than call blocking in wireless cellular networks. The cost of the classical method of employing guard channels to decrease the call dropping rate is the increase in call blocking rate. Since subscriber mobility changes in time, the number of handoff attempts in each cell is subject to fluctuations, making static assignments (or periodical update) of a given number of guard channels inefficient. In this paper, we propose an adaptive scheme that employs reservations, instead of static assignments, to adaptively adjust the number of guard channels in each cell according to the current requirements. Thus, unnecessary allocation of guard channels is avoided resulting in a lower cost in terms of call dropping. The reservation requests are made according to the recent mobility pattern of the subscriber. A likelihood value is associated with each reservation request so that fewer channels are reserved by benefiting from the statistical accumulation of the requests. The channels are reserved by considering the interference that would be created once they are in use. The proposed scheme is evaluated against the classical guard channel scheme with a realistic mobility model.","cites":"2","conferencePercentile":"13.88888889"},{"venue":"Wireless Networks","id":"0cc3348c05c25772356e3ec64289056ffb10ea04","venue_1":"Wireless Networks","year":"2005","title":"Localized Construction of Low Weighted Structure and Its Applications in Wireless Ad Hoc Networks","authors":"Xiang-Yang Li","author_ids":"1744005","abstract":"— We consider a wireless network composed of a set of n wireless nodes distributed in a two dimensional plane. The signal sent by every node can be received by all nodes within its transmission range, which is uniform and normalized to one unit. We present the first distributed method to construct a bounded degree planar connected structure LRNG, whose total link length is within a constant factor of the minimum spanning tree 1 using total O(n) messages under the broadcast communication model. Moreover , in our method, every node only uses its two-hop information to construct such structure, i.e., it is localized method. We show that some two-hop information is necessary to construct any low-weighted structure. We also study the application of this structure in efficient broadcasting in wireless ad hoc networks. We prove that, for broadcasting, the relative neighborhood graph (RNG), which is the previously best-known sparse structure that can be constructed locally, could use energy O(n) times the total energy used by our structure LRNG. Our simulations show that the broadcasting based on LRNG consumes energy about 36% more than that by MST, and broadcasting based on RNG consumes energy about 64% more than that by MST. We also show that no localized method can construct a structure for broadcasting with total power consumption asymptotically better than LRNG.","cites":"6","conferencePercentile":"37.5"},{"venue":"Wireless Networks","id":"333ad8caeba7836a2b48f6ab20a1dbc76cd2edca","venue_1":"Wireless Networks","year":"2011","title":"Impact of deployment size on the asymptotic capacity for wireless ad hoc networks under Gaussian channel model","authors":"Shaojie Tang, Xiang-Yang Li, XuFei Mao, Cheng Wang","author_ids":"1682309, 1744005, 1751552, 3879731","abstract":"—We study the throughput capacity and transport capacity for both random and arbitrary wireless networks under Gaussian Channel model when all wireless nodes have the same constant transmission power P and the transmission rate is determined by Signal to Interference plus Noise Ratio (SINR). We consider networks with n wireless nodes {v1, v2, · · · , vn} (randomly or arbitrarily) distributed in a square region Ba with a side-length a. We randomly choose ns node as the source nodes of ns multicast sessions. For each source node vi, we randomly select k points and the closest k nodes to these points as destination nodes of this multicast session. We derive achievable lower bounds and some upper bounds on both throughput capacity and transport capacity for both unicast sessions and multicast sessions. We found that the asymptotic capacity depends on the size a of the deployment region, and it often has three regimes.","cites":"1","conferencePercentile":"28.04878049"},{"venue":"Wireless Networks","id":"0ae341b0c312dd0e090a1898d1d7c9de6d8d6a97","venue_1":"Wireless Networks","year":"2002","title":"Minimum-Energy Broadcasting in Static Ad Hoc Wireless Networks","authors":"Peng-Jun Wan, Gruia Calinescu, Xiang-Yang Li, Ophir Frieder","author_ids":"1787340, 1746764, 1744005, 1741208","abstract":"Energy conservation is a critical issue in ad hoc wireless networks f o r n o d e a n d n e t work life since the nodes are powered by batteries only. One major approach for energy conservation is to route a communication session along the route which requires the lowest total energy consumption. This optimization problem is referred to as Minimum-Energy Routing. While the minimum-energy unicast routing problem can be solved in polynomial time by shortest-path algorithms, it remains open whether the minimum-energy broadcast routing problem can be solved in polynomial time despite the NP-hardness of its general graph version. Recently three greedy heuristics were proposed in 8]: MST (minimum spanning tree), SPT (shortest-path tree), and BIP (broadcasting incremental power). They evaluated their approaches through simulations 8], but lit-t l e i s k n o wn about their analytical performance. The main contribution of this paper is a quantitative characterization of their performances in terms of approximation ratios. By exploring geometric structures of Eu-clidean MSTs, we w ere able to prove that the approximation ratio of MST is between 6 and 12, and the approximation ratio of BIP is between 13 3 and 12. On the other hand, we s h o w that the approximation ratio of SPT is at least n 2 , where n is the number of receiving nodes. To the best of our knowledge, these are the rst analytical results for the minimum-energy broadcasting problem.","cites":"49","conferencePercentile":"57.69230769"},{"venue":"Wireless Networks","id":"0cd8abbe5ebbdf2fe8e5a0fe8c3449adda0040a2","venue_1":"Wireless Networks","year":"2002","title":"Distributed Long-Lived List Colouring: How to Dynamically Allocate Frequencies in Cellular Networks","authors":"Naveen Garg, Marina Papatriantafilou, Philippas Tsigas","author_ids":"2192352, 1752071, 1701362","abstract":"To avoid signal interference in mobile communication it is necessary that the frequencies used for communication within each cells are allocated so that no signal interference occurs with neighbouring cells. We model this channel allocation problem as a generalised list colouring problem and we show how to analytically measure and provide worst-case guarantees regarding request satissability. To the best of our knowledge, this has not been done before and gives a new perspective to the problem, as well as a clear direction for further investigation. We propose distributed approaches for solving the problem, which are able to adapt fast to temporal variations in channel demands in diierent cells, as well as to cope with crash failures, by limiting the failure-locality | the size of the network that can be aaected by a faulty station, in terms of the distance from that station. Our rst approach is inspired by a relatively recent theorem relating graph colourings and orientations; it achieves the equivalent of the best known sequentially achievable upper bound for request satissability, implied by the theorem. It also employs a powerful synchronisation mechanism to achieve worst-case response time that depends only on |the degree of the signal interference graph| and failure locality 4. Our second proposal is a rst approach towards exploring what bound in request satissability is achievable without the use of extra synchronisation; by employing ran-domisation in frequency choices, in only one round of communication, a base station can expect to pick f=(44) frequencies where f is the size of the list at the node; the failure locality of this solution is only 1.","cites":"4","conferencePercentile":"19.23076923"},{"venue":"Wireless Networks","id":"4586aac6e430049666a6ebebcde60b1aba785a57","venue_1":"Wireless Networks","year":"2009","title":"An optimal resource control scheme under fidelity and energy constraints in sensor networks","authors":"JaeWon Kang, Yanyong Zhang, B. R. Badrinath","author_ids":"2941013, 1813845, 1704649","abstract":"— To control congestion, either the traffic from sources should be \" reduced \" (traffic controlling) or the available resources should be \" increased \" (resource controlling). Compared to the wired and other wireless counterparts, wireless sensor networks usually have elastic resource availability, and the applications require a certain level of throughput called fidelity. As a result, resource control strategies can not only alleviate congestion but also ensure the required fidelity level during congestion by accommodating higher incoming traffic. In this paper, we first attempt to formally define the resource control framework that adjusts the resource provisioning at the hotspot nodes during congestion. In an effort to find the optimal resource control under the fidelity and energy constraints, we present a resource increase and decrease algorithm called Early Increase/Early Decrease (EIED) that tries to adjust the effective channel capacity quickly to suit the incoming traffic volume in an energy-efficient manner, thereby increasing the fidelity level observed by the application. Under the energy-constrained optimization, we prove this algorithm incurs the lowest overhead of energy consumption for the given fidelity level that is required by the application. We also prove that the EIED algorithm performed in a distributed manner also lowers the energy consumption per packet at an end-to-end level. The effectiveness of the EIED algorithm is verified by simulations based on realistic sensor network configurations.","cites":"1","conferencePercentile":"17.94871795"},{"venue":"Wireless Networks","id":"2f66c5bfaa384e9ae453b903b93a0756fc8f9dc8","venue_1":"Wireless Networks","year":"2008","title":"Minimum flow maximum residual routing in LEO satellite networks using routing set","authors":"Roy Kucukates, Cem Ersoy","author_ids":"3011979, 1767459","abstract":"Satellite networks are used as backup networks to the terrestrial communication systems. In this work, we tried to find a routing strategy over dynamic satellite systems to better utilize the capacity of the network. The satellite networks are not affected by natural disasters, therefore they can be used widely during and after disasters. The Minimum Flow Maximum Residual (MFMR) routing algorithm over the Routing Set boundaries is proposed in order to better utilize the capacity of the system by distributing the load over the shortest path alternatives of the system. We assumed the satellite network as having finite states and formulated the problem by using Finite State Automation concept along with earth-fixed cell strategy by using a virtual satellite network model. The routing problem in satellite networks is previously studied in the literature and it is conjectured that the problem is NP-Hard. The online and offline problems are stated and the MFMR algorithm is described in detail. The algorithm is compared with alternatives by simulating the network on Opnet Modeler. Finally, the performance analysis of different scenarios is given in this work.","cites":"1","conferencePercentile":"21.15384615"},{"venue":"Wireless Networks","id":"5b02544e5ba06068a4a42b867e6a1d7813aabc68","venue_1":"Wireless Networks","year":"2010","title":"Modelling and planning fixed wireless networks","authors":"Stephen Hurley, Stuart M. Allen, Desmond Ryan, Richard K. Taplin","author_ids":"2970100, 3290930, 2635609, 1940828","abstract":"This paper describes a mathematical model for the automated design of fixed wireless access networks (FWA) through the automatic selection and configuration of base station sites. An optimisation algorithm is presented which generates the fixed wireless access network infrastructure design, and results are presented to illustrate the use of the model and its implementation. Economic measures based on the net present value (NPV) are defined to assess the financial viability of potential network designs. The NPV is used within the mathematical optimization framework to produce cost-effective deployments that maximize economic performance while maintaining technical constraints on the network. The model takes into account time-varying input parameters on CapEx, OpEx, revenues and subscriber requirements to model the dynamic nature of the market. Technical radio constraints taken into account include downlink area coverage, interference, capacity and availability. The model and optimisation framework are illustrated by considering the deployment and configuration of infrastructure for three scenarios representing urban, suburban and rural regions. Experiments illustrating the staged deployment of infrastructure over a number of time periods are also presented.","cites":"6","conferencePercentile":"74.19354839"},{"venue":"Wireless Networks","id":"188ec71585ff9543738fb2ea09127ffb2dbdfb1c","venue_1":"Wireless Networks","year":"1995","title":"Multicast security and its extension to a mobile environment","authors":"Li Gong, Nachum Shacham","author_ids":"1703194, 1686191","abstract":"Multicast is rapidly becoming an important mode of communication and a good platform for building group-oriented services. To be used for trusted communication , however, current multicast schemes must be supplemented by mechanisms for protecting traac, controlling participation, and restricting access of unauthorized users to data exchanged by the participants. In this paper, we consider fundamental security issues in building a trusted multicast facility. We discuss techniques for group-based data encryption, authentication of participants, and preventing unauthorized transmissions and receptions. We also describe the application of these principles and techniques in designing an architecture for secure multicast in a mobile environment. A multitude of presently emerging technologies will enable real-time information exchange among multiple participants. Low-cost, high-performance desktop video and audio processing equipment, such as cameras, coders, frame grabbers, and mixers, will make it economical to add real-time generation and display to general-purpose personal workstations. High-speed transmission and switching, now being deployed across the country, will enable instant dissemination of broad-band streams over a wide area. Powerful and exible multicast protocols, for dissemination of information to many recipients, will provide the glue that ties the broadband information generation and processing elements with the underlying broadband networks. A new generation of distributed applications will take advantage of these technologies and provide a quantum leap in network-based services. Multimedia tele-conferencing, computer-supported collaborative work, remote consultation and","cites":"28","conferencePercentile":"53.33333333"},{"venue":"Wireless Networks","id":"323fee7dc1a212d70fed9ae598e375e4fe291ae0","venue_1":"Wireless Networks","year":"2006","title":"Energy Efficiency and Capacity for TCP Traffic in Multi-Hop Wireless Networks","authors":"Sorav Bansal, Rajeev Shorey, Rajeev Gupta, Archan Misra","author_ids":"3306144, 2463580, 1938192, 1721672","abstract":"We study the performance metrics associated with TCP-regulated traffic in multi-hop, wireless networks that use a common physical channel (e.g., IEEE 802.11). In contrast to earlier analyses, we focus simultaneously on two key operating metrics—the energy efficiency and the transport-layer (TCP) throughput. Using analysis and simulations, we show how these metrics are strongly influenced by the radio transmission range of individual nodes. Due to tradeoffs between the individual packet transmission energy and the likelihood of retransmissions, the total energy consumption is a convex function of the number of hops (and hence, of the transmission range). On the other hand, the throughput of a single TCP session decreases with a decrease in the transmission range. The overall achievable TCP throughput in an ad-hoc network thus involves a tradeoff between the reduced throughput of an individual flow and the greater degree of spatial reuse possible. As a consequence of this tradeoff, the overall network capacity turns out to be a concave function of the transmission range. We analyze how parameters such as the node density and the radio transmission range affect the overall network capacity under different operating conditions. Our analysis shows that capacity metrics at the TCP layer behave quite differently from the capacity results previously presented in literature. We then extend the work and examine the sensitivity of the TCP-layer capacity to the speed of the nodes and the number of TCP connections in an ad hoc network. By incorporating the notion of a minimal acceptable QoS metric (loss) for an individual session, we show why the QoS-compliant capacity is a more accurate metric for studying the capacity of TCP traffic in an ad hoc network. Finally, we study the dependence of capacity on the source application (Telnet or FTP traffic) and on the choice of the ad hoc routing protocol (AODV, DSR or DSDV).","cites":"4","conferencePercentile":"46.2962963"},{"venue":"Wireless Networks","id":"67b39849d3810d2dbcef7af4c7f16a9d747250d1","venue_1":"Wireless Networks","year":"2003","title":"Smart Identification Frameworks for Ubiquitous Computing Applications","authors":"Kay Römer, Thomas Schoch, Friedemann Mattern, Thomas Dübendorfer","author_ids":"1790951, 1922063, 1712978, 1760876","abstract":"We present our results in the conceptual design and the implementation of ubiquitous computing applications using smart identification technologies. First, we describe such technologies and their potential application areas, followed by an overview of some applications we have developed. Based on the experiences we gained from the development of these systems, we point out design concepts that we find useful for structuring and implementing such applications. Building upon these concepts, we have created two frameworks based on Jini (i.e., distributed Java objects) and Web Services to support the development of ubiquitous computing applications that make use of smart identification technology. We describe our prototype frameworks, discuss the underlying concepts and present some lessons learned.","cites":"88","conferencePercentile":"93.10344828"},{"venue":"Wireless Networks","id":"555a882d92dd6fe661e73262c9b7deb90841aaa1","venue_1":"Wireless Networks","year":"2001","title":"Multi-Tier Cellular Network Dimensioning","authors":"Eylem Ekici, Cem Ersoy","author_ids":"1733684, 1767459","abstract":"Wireless communications systems enable the end users to be mobile. The majority of the wireless communications networks are cellular networks. Several methods are developed to increase the performance of the cellular networks, which depends on the correct determination of the design parameters as well as the architecture of the system and the traffic requirements. In this study, we introduce a Simulated Annealing (SA) based method to determine the design parameters of a multi-tier cellular network, for which the implementation cost is minimized. The cellular system employs guard channels and allows calls to overflow to upper tiers. We conducted experiments with the SA-based technique on different example problems in two-tier cellular networks and obtained promising results.","cites":"14","conferencePercentile":"47.22222222"},{"venue":"Wireless Networks","id":"e10442649299e003069b087a9523c6bbbd0f6cae","venue_1":"Wireless Networks","year":"2003","title":"Network Layer Access Control for Context-Aware IPv6 Applications","authors":"Adrian Friday, Maomao Wu, Joe Finney, Stefan Schmid, Keith Cheverst, Nigel Davies","author_ids":"8133498, 1767716, 1788484, 1789173, 1744905, 1789887","abstract":"As part of the Lancaster GUIDE II project, we have developed a novel wireless access point protocol designed to support the development of next generation mobile context-aware applications in our local environs. Once deployed, this architecture will allow ordinary citizens secure, accountable and convenient access to a set of tailored applications including location, multimedia and context based services, and the public Internet. Our architecture utilises packet marking and network level packet filtering techniques within a modified Mobile IPv6 protocol stack to perform access control over a range of wireless network technologies. In this paper, we describe the rationale for, and components of, our architecture and contrast our approach with other state-of-the-art systems. The paper also contains details of our current implementation work, including preliminary performance measurements. 1. Motivation The recent proliferation of wireless networking technologies and highly portable 'personal' computing devices has led to the development of a number of 'context-aware' mobile systems. One important class of context-aware application has been the 'electronic tour guide' [5,8,11,21]. Such systems deliver relevant information to their users, such as reminders, notes or guidance information, as the systems' perception of the situation in which it finds itself dictates. For example, a user with a specific set of interests may be guided to a location containing an exhibit the system determines is relevant [9]. Moreover, such contexts may be tagged with the annotations of friends, fellow game players, or other members of the community (comprising users of the system) [4,12]. At Lancaster we have been investigating this application domain since 1997 through the development and continued refinement of a context-aware tour guide system called GUIDE [9]. The development of the GUIDE system is the result of a number of contributory activities including: situated requirements gathering and analysis; deployment of a dedicated cellular wireless LAN in the local city; modelling of the local city and its associated attractions; and the iterative development and evaluation of the GUIDE application with real end-users (visitors to Lancaster). In the current GUIDE system (see figure 1) visitors to Lan-caster can equip themselves with a bespoke 'Guide unit' from the local tourist information centre. Upon first use, the Guide unit asks the user to tailor their personal profile to best reflect their interests, dietary requirements and a number of other preferences. This profile is used by the system, together with dynamic information concerning the user's context (including the current location or …","cites":"5","conferencePercentile":"20.68965517"},{"venue":"Wireless Networks","id":"28e28e5676ef5fe57d722cb3298b1088b16b1594","venue_1":"Wireless Networks","year":"2015","title":"A jamming approach to enhance enterprise Wi-Fi secrecy through spatial access control","authors":"Yu Seung Kim, Patrick Tague, Heejo Lee, Hyogon Kim","author_ids":"2136427, 2331637, 1678348, 1687027","abstract":"Prevalent Wi-Fi networks have adopted various protections to prevent eavesdropping caused by the intrinsic shared nature of wireless medium. However, many of them are based on pre-shared secret incurring key management costs, and are still vulnerable from practical countermeasures. In this study, we investigate the feasibility of using defensive jamming technique to protect enterprise Wi-Fi networks from potential eavesdroppers. This non-cryptographic approach requires neither any pre-shared key or high deployment costs. Defensive jammers geographically confine the wireless coverage of Wi-Fi access point (AP), and thus block the message reception outside an arbitrary boundary at a physical layer. We provide a theoretical model fine tuning the jamming parameters for jammer placement. We then discuss practical considerations including optimized jammer arrangement algorithms, interference countermeasures to legitimate communications, and countermeasures against advanced attackers.","cites":"4","conferencePercentile":"100"},{"venue":"Wireless Networks","id":"414d35d1c0300218ed484d006595c18b9b8e2359","venue_1":"Wireless Networks","year":"2011","title":"Flow admission control for multi-channel multi-radio wireless networks","authors":"XuFei Mao, Xiang-Yang Li, Guojun Dai","author_ids":"1751552, 1744005, 1737253","abstract":"Providing Quality of Service (QoS) is a major challenge in wireless networks. In this paper we propose a distributed call admission control protocol (DCAC) to do both bandwidth and delay guaranteed call admission for multihop wireless mesh backbone networks, by exploiting the multi-channel multi-radio (mc-mr) feature. We propose a novel routing metric for route setup, and present an efficient distributed algorithm for link reservation that satisfies the required bandwidth and reduces the delay by a local scheduling that minimizes one hop delay. To the best of our knowledge, this is the first distributed protocol that embeds mc-mr feature in Time Division Medium Access (TDMA) to do QoS call admission in wireless backbone networks. Extensive simulation studies show that our protocol significantly improves network performance on supporting QoS sessions compared with some widely used protocols.","cites":"1","conferencePercentile":"28.04878049"},{"venue":"Wireless Networks","id":"3fd20004bc52b853938ee8d3956621d680955761","venue_1":"Wireless Networks","year":"2005","title":"Efficient Topology Control for Ad-Hoc Wireless Networks with Non-Uniform Transmission Ranges","authors":"Xiang-Yang Li, Wen-Zhan Song, Yu Wang","author_ids":"1744005, 1768849, 1687514","abstract":"Wireless network topology control has drawn considerable attentions recently. However, priori arts assumed that the wireless ad hoc networks are modeled by unit disk graphs (UDG), i.e., two mobile hosts can communicate as long as their Euclidean distance is no more than a threshold. However, practically, the networks are never so perfect as unit disk graphs: the transmission ranges may vary due to various reasons such as the device differences, the network control necessity, and the perturbation even the transmission radii are set as the same. Thus, we assume that each mobile host has its own transmission range. The networks are modeled by mutual inclusion graphs (MG), where two nodes are connected iff they are within the transmission range of each other. Previously, no method is known for topology control when the networks are modeled as mutual inclusion graphs. The paper proposes the first distributed mechanism to build a sparse power efficient network topology for non-uniform ad hoc wireless networks. The method also works for networks with directional antennas. We first extend the Yao structure to build a spanner with a constant length and power stretch factor for mutual inclusion graph. We then propose two efficient localized algorithms to construct connected sparse network topologies. The first structure, called extended Yao-Yao, has node degree at most O(log γ), where γ = max u max uv∈M G r u r v. The second structure, called extended Yao and Sink, has node degree bounded by O(log γ), and is a length and power spanner. The methods are based on a novel partition strategy of the space surrounded each mobile host. Both algorithms have communication cost O(n), where each message has O(log n) bits.","cites":"23","conferencePercentile":"69.44444444"},{"venue":"Wireless Networks","id":"d9044b107b2b13a0a669d34dccf7620eab45ed87","venue_1":"Wireless Networks","year":"2005","title":"Protecting File Systems with Transient Authentication","authors":"Mark D. Corner, Brian D. Noble","author_ids":"2664272, 2055822","abstract":"Laptops are vulnerable to theft, greatly increasing the likelihood of exposing sensitive files. Unfortunately, storing data in a cryptographic file system does not fully address this problem. Such systems ask the user to imbue them with long-term authority for decryption, but that authority can be used by anyone who physically possesses the machine. Forcing the user to frequently reestablish his identity is intrusive, encouraging him to disable encryption. This tension between usability and security is eliminated through Transient Authentication, in which a small hardware token continuously authenticates the user's presence to the laptop over a short-range, wireless link. Whenever the laptop needs decryption authority, it acquires it from the token; authority is retained only as long as necessary. With careful key management, ZIA imposes an overhead of less than 7% for representative workloads, though some infrequent operations suffer greater overheads. The largest file cache on our hardware can be re-encrypted within five seconds of the user's departure, and restored in just over six seconds after detecting the user's return. This secures the machine before an attacker can gain physical access, but recovers full performance before a returning user resumes work. Key granularity plays an important role in determining performance; assigning encryption keys on a per-directory basis limits the cost of an exposed key while maintaining acceptable overhead.","cites":"5","conferencePercentile":"33.33333333"},{"venue":"Wireless Networks","id":"5e810298068327c0ca60d4815783839e44e43941","venue_1":"Wireless Networks","year":"2011","title":"Capacity of data collection in randomly-deployed wireless sensor networks","authors":"Siyuan Chen, Yu Wang, Xiang-Yang Li, Xinghua Shi","author_ids":"1749178, 1687514, 1744005, 5383081","abstract":"Data collection is one of the most important functions provided by wireless sensor networks. In this paper, we study theoretical limitations of data collection and data aggregation in terms of delay and capacity for a wireless sensor network where n sensors are randomly deployed. We consider different communication scenarios such as with single sink or multiple sinks, regularly-deployed or randomly-deployed sinks, with or without aggregation. For each scenario, we not only propose a data collection/aggregation method and analyze its performance in terms of delay and capacity, but also theoretically prove whether our method can achieve the optimal order (i.e., its performance is within a constant factor of the optimal). Particularly, with a single sink, the capacity of data collection is in order of HðWÞ where W is the fixed data-rate on individual links. With k regularly deployed sinks, the capacity of data collection is increased to HðkWÞ when","cites":"3","conferencePercentile":"59.75609756"},{"venue":"Wireless Networks","id":"8974c78e8db62f156edc0b329a622163a2cd243e","venue_1":"Wireless Networks","year":"2011","title":"Report on an Arctic summer DTN trial","authors":"Stephen Farrell, Alex McMahon, Eoin Meehan, Stefan Weber, Kerry Hartnett","author_ids":"1773767, 3103258, 3161071, 1737393, 2839805","abstract":"—Delay-and Disruption-Tolerant Networking (DTN) is an emerging area of networking research that will benefit from real-world trials and testbeds. We describe a week long DTN trial carried out during the summer of 2009 in the Laponia area of Northern Sweden that involved the provision of basic email and web services to users who were 57km distant from any power or networking infrastructure. The trial validated our design and successfully demonstrated the use of email via helicopter-transported data mules. With the aim of making it easier for others to replicate this kind of trial, the hardware and software used are described in detail, as are the results of the trial. We also describe plans for an extended trial in summer 2010 in the same area.","cites":"1","conferencePercentile":"28.04878049"},{"venue":"Wireless Networks","id":"a74af57e546290d745decf82df6ca7810e6901b0","venue_1":"Wireless Networks","year":"2004","title":"Optimal Sequential Paging in Cellular Wireless Networks","authors":"Bhaskar Krishnamachari, Rung-Hung Gau, Stephen B. Wicker, Zygmunt J. Haas","author_ids":"7686628, 2342909, 1690846, 1699630","abstract":"In a high-capacity cellular network with limited spectral resources, it is desirable to minimize the radio bandwidth costs associated with paging when locating mobile users. Sequential paging, in which cells in the coverage area are partitioned into groups and paged in a non-increasing order of user location probabilities, permits a reduction in the average radio costs of paging at the expense of greater delay in locating the users. We present a polynomial time algorithm for minimizing paging cost under the average delay constraint, a problem that has previously been considered intractable. We show the conditions under which cluster paging, a simple heuristic technique proposed for use with dynamic location update schemes, is optimal. We also present analytical results on the average delay and paging cost obtained with sequential paging, including tight bounds.","cites":"13","conferencePercentile":"58.33333333"},{"venue":"Wireless Networks","id":"3bdd89ffe712d3a091353976bb7c431cb7a7f4c9","venue_1":"Wireless Networks","year":"1997","title":"Scheduling techniques for reducing processor energy use in MacOS","authors":"Jacob R. Lorch, Alan Jay Smith","author_ids":"2030436, 1726592","abstract":"The CPU is one of the major power consumers in a portable computer, and considerable power can be saved by turning off the CPU when it is not doing useful work. In Ap-ple's MacOS, however, idle time is often converted to busy waiting, and generally it is very hard to tell when no useful computation is occurring. In this paper, we suggest several heuristic techniques for identifying this condition, and for temporarily putting the CPU in a low-power state. These techniques include turning off the processor when all processes are blocked, turning off the processor when processes appear to be busy waiting, and extending real time process sleep periods. We use trace-driven simulation, using processor run interval traces, to evaluate the potential energy savings and performance impact. We find that these techniques save considerable amounts of processor energy (as much as 66%), while having very little performance impact (less than 2% increase in run time). Implementing the proposed strategies should increase battery lifetime by approximately 20% relative to Apple's current CPU power management strategy, since the CPU and associated logic are responsible for about 32% of power use; similar techniques should be applicable to operating systems with similar behavior.","cites":"40","conferencePercentile":"83.33333333"},{"venue":"Wireless Networks","id":"213107c1afa62aa1ebfa638863a07ac15a8b49b4","venue_1":"Wireless Networks","year":"2003","title":"Integrating Distributed Channel Allocation and Adaptive Handoff Management for QoS-Sensitive Cellular Networks","authors":"Guohong Cao","author_ids":"1740564","abstract":"Next generation high-speed cellular networks are expected to support multimedia applications, which require QoS provisions. Since frequency spectrum is the most expensive resource in wireless networks, it is a challenge to support QoS using limited frequency spectrum. In the literature, two orthogonal approaches are used to address the bandwidth utilization issue and the QoS provision issue; that is, channel allocation schemes have been proposed to improve bandwidth efficiency, whereas handoff management schemes, based on bandwidth reservation, have been proposed to guarantee a low connection dropping rate. However, little effort has been taken to address both issues together. In this paper, we integrate distributed channel allocation and adaptive handoff management to provide QoS guarantees and efficiently utilize the bandwidth. First, we present a complete distributed distributed channel allocation algorithm and propose techniques to reduce its message complexity and intra-handoff overhead. Second, we integrate the proposed distributed channel allocation algorithm with an adaptive handoff management scheme to provide QoS guarantees and efficiently utilize the bandwidth. Detailed simulation experiments are carried out to evaluate the proposed methodology. Compared to previous schemes, our scheme can significantly reduce the message complexity and intra-handoff overhead. Moreover, the proposed scheme can improve the bandwidth utilization while providing QoS guarantees.","cites":"10","conferencePercentile":"34.48275862"},{"venue":"Wireless Networks","id":"1c59e8bc20cc08bc5d9d28fb500e13efface36cc","venue_1":"Wireless Networks","year":"2003","title":"Havana: Supporting Application and Channel Dependent QoS in Wireless Packet Networks","authors":"Javier Gomez, Andrew T. Campbell","author_ids":"1683661, 1690035","abstract":"For wireless channels, interference mitigation techniques are typically applied at the packet transmission level. In this paper, we present the Havana framework which supports integrated adaptive-QoS in wireless packet networks by responding to impairments over multiple time scales that are present at the flow/session level. The Havana framework is based on three different control mechanisms that operate over distinct adaptation time scales. At the packet transmission time scale, a packet-based channel predictor determines whether to transmit a packet or not depending on the state of the wireless channel. At the packet scheduling time scale, a compensator credits and compensates flows that experience bad link quality. Over even longer time scales an adaptor regulates flows taking into account the ability of wireless applications to adapt to changes in the available bandwidth and channel conditions. We present the design and implementation of our framework and evaluate each of the proposed control mechanisms using the ns-2 simulator.","cites":"4","conferencePercentile":"15.51724138"},{"venue":"Wireless Networks","id":"264995aa8e72d045ebafd7020dad746d4ca2f395","venue_1":"Wireless Networks","year":"2015","title":"NCOM: network coding based overlay multicast in wireless networks","authors":"Tan Le, Xing Chen, Yong Liu","author_ids":"2478108, 1691262, 7135550","abstract":"The capacity of wireless networks are increasingly challenged by the traffic stresses generated by data-intensive applications. Multicast is a bandwidth-efficient solution to simultaneously disseminate data to multiple receivers. In this paper, we present NCOM, a network coding based overlay multicast design, that integrates Network Coding (NC), Opportunistic Routing (OR), and cross-layer link scheduling to achieve high efficiency and reliability multi-hop wireless multicast. In NCOM, the source and receivers are connected by an overlay Steiner tree optimized for the minimum OR distance between nodes. With NC, coded packets are opportunistically transmitted along overlay links. The transmissions of adjacent nodes in the overlay multicast are coordinated by a novel multicast acknowledgement and cross-layer MAC scheduling. We implement NCOM in OPNET by customizing the IEEE 802.11b modules. Through OPNET simulations, we demonstrate that NCOM can achieve a higher throughput and lower source transmission redundancy than the existing NC and OR based wireless multicast designs. We also analyze the advantages of NCOM over Pacifier in difference case study. NCOM can be easily deployed for efficient and reliable multicast in multi-hop wireless networks.","cites":"0","conferencePercentile":"40"},{"venue":"Wireless Networks","id":"c1150dbd6653bd5810a4727c3434e507f07335f7","venue_1":"Wireless Networks","year":"1998","title":"An Efficient Scheme to Reduce Handoff Dropping in LEO Satellite Systems","authors":"Suresh Kalyanasundaram, Edwin K. P. Chong, Ness B. Shroff","author_ids":"2770906, 1744311, 1750487","abstract":"The problem of handoffs in cellular networks is compounded in a low earth orbit (LEO) satellite-based cellular network due to the relative motion of the satellites with respect to a stationary observer on earth. Typically, the velocity of motion of mobiles can be ignored when compared to the very high velocity of the footprints of satellites. We exploit this property of LEO satellite systems and propose a handoff scheme based on a channel sharing approach that results in a substantial decrease in handoff dropping. For the same handoff dropping performance, our scheme has significantly lower new call blocking probability than the conventional reservation scheme. We also present an analytical approximation that is in very good accord with simulation results.","cites":"14","conferencePercentile":"58.69565217"},{"venue":"Wireless Networks","id":"2a5215e2418793d355de089c9f40a82a7c525e0d","venue_1":"Wireless Networks","year":"2004","title":"Dynamic proxy tree-based data dissemination schemes for wireless sensor networks","authors":"Wensheng Zhang, Guohong Cao, Thomas F. La Porta","author_ids":"1710059, 1740564, 3267394","abstract":"In wireless sensor networks, efficiently disseminating data from a dynamic source to multiple mobile sinks is important for applications such as mobile target detection and tracking. The tree-based multicasting scheme can be used. However, due to the short communication range of each sensor node and the frequent movement of sources and sinks, a sink may fail to receive data due to broken paths, and the tree should be frequently reconfigured to reconnect sources and sinks. To address the problem, we propose a dynamic proxy tree-based framework in this paper. A big challenge in implementing the framework is how to efficiently reconfigure the proxy tree as sources and sinks change. We model the problem as on-line constructing a minimum Steiner tree in an Euclidean plane, and propose centralized schemes to solve it. Considering the strict energy constraints in wireless sensor networks, we further propose two distributed on-line schemes, a shortest path-based (SP) scheme and a spanning range-based (SR) scheme. Extensive simulations are conducted to evaluate the schemes. The results show that the distributed schemes have similar performance as the centralized ones, and among the distributed schemes, SR outperforms SP.","cites":"20","conferencePercentile":"69.44444444"},{"venue":"Wireless Networks","id":"2686c63ecc712b5816b30f07a768a01df6a6ccfe","venue_1":"Wireless Networks","year":"2011","title":"Compromise-resilient anti-jamming communication in wireless sensor networks","authors":"Xuan Jiang, Wenhui Hu, Sencun Zhu, Guohong Cao","author_ids":"7325419, 1731466, 1712616, 1740564","abstract":"Jamming is a kind of Denial-of-Service attack in which an adversary purposefully emits radio frequency signals to corrupt the wireless transmissions among normal nodes. Although some research has been conducted on countering jamming attacks, few works consider jamming attacks launched by insiders, where an attacker first compromises some legitimate sensor nodes to acquire the common cryptographic information of the sensor network and then jams the network through those compromised nodes. In this paper, we address the insider jamming problem in wireless sensor networks. In our proposed solutions, the physical communication channel of a sensor network is determined by the group key shared by all the sensor nodes. When insider jamming happens, the network will generate a new group key to be shared only by the non-compromised nodes. After that, the insider jammers are revoked and will not be able to predict the future communication channels used by the non-compromised nodes. Specifically, we propose two compromise-resilient anti-jamming schemes: the split-pairing scheme which deals with a single insider jammer, and the key-tree-based scheme which copes with multiple colluding insider jam-mers. We implement and evaluate the proposed solutions using Mica2 Motes. Experimental results show that our solutions have low recovery latency and low communication overhead, and hence they are suitable for resource constrained sensor networks.","cites":"2","conferencePercentile":"43.90243902"},{"venue":"Wireless Networks","id":"66295779abd749e7e50604fb4b935b3b4df185d4","venue_1":"Wireless Networks","year":"1999","title":"Channel Sharing Scheme for Packet-Switched Cellular Networks","authors":"Suresh Kalyanasundaram, Junyi Li, Edwin K. P. Chong, Ness B. Shroff","author_ids":"2770906, 2018027, 1744311, 1750487","abstract":"— In this paper, we study an approach for sharing channels to improve network utilization in packet-switched cellular networks. Our scheme exploits unused resources in neighboring cells without the need for global coordination. We formulate a minimax approach to optimizing the allocation of channels in this sharing scheme. We develop a distributed algorithm to achieve this objective and study its convergence. We illustrate, via simulation results, that the distributed channel sharing scheme performs better than the fixed channel scheme over a wide variety of traffic conditions.","cites":"2","conferencePercentile":"11.66666667"},{"venue":"Wireless Networks","id":"fc1df9af4a819c50a14a65ef7478ee4d4f2a6c2b","venue_1":"Wireless Networks","year":"2003","title":"A Query Scope Agent for Flood Search Routing Protocols","authors":"John Sucec, Ivan Marsic","author_ids":"2079526, 1707841","abstract":"Flood-search on-demand routing has received considerable interest for its application to mobile ad hoc networks. To alleviate the effects of flooding the network with control packets to discover a route, the concept of an expanding ring search (ERS) has been proposed elsewhere for reducing the packet transmission overhead of the route discovery process. Essentially, ERS consists of incrementally increasing the allowable hop radius of the flood search until a route to the target node is returned. However, ERS incurs additional latency to successfully complete the route discovery procedure. This paper presents a query scope agent (QSA) that assists in the selection of an appropriate ERS. The QSA accepts as input, from the user or network application, a maximum allowable value for route discovery delay. The QSA then estimates network parameter values to determine an ERS approach that satisfies the delay requirement while reducing expected packet transmission overhead. Simulation results show that it successfully achieves this objective. Further, the QSA incurs little communication and computation overhead, and operates in a distributed and asynchronous fashion.","cites":"2","conferencePercentile":"10.34482759"},{"venue":"Wireless Networks","id":"f555f284140a6a0f97a461f6da2c50dfc78552f7","venue_1":"Wireless Networks","year":"2014","title":"Weak state versus strong state: an analysis of a probabilistic state mechanism for dynamic networks","authors":"Utku Günay Acer, Shivkumar Kalyanaraman, Alhussein A. Abouzeid","author_ids":"3338636, 1694760, 1704556","abstract":"Network protocols coordinate their decision making using information about entities in remote locations. Such information is provided by state entries. To remain valid, the state information needs to be refreshed via control messages. When it refers to a dynamic entity, the state has to be refreshed at a high rate to prevent it from becoming stale. In capacity constrained networks, this may deteriorate the overall performance of the network. The concept of weak state has been proposed as a remedy to this problem in the context of routing in mobile ad-hoc networks. Weak state is characterized by probabilistic semantics and local refreshes as opposed to strong state that is interpreted as absolute truth. A measure of the probability that the state remains valid, i.e. confidence, accompanies the state. The confidence is decayed in time to adapt to dynamism and to capture the uncertainty in the state information. This way, weak state remains valid without explicit state refresh messages. We evaluate the consistency of weak state and strong state using two notions of distortion. Pure distortion measures the average difference between the actual value of the entity and the value that is provided by the remote state. Informed distortion captures both this difference and the effect of confidence value on state consistency. Using a mathematical analysis and simulations, we show that weak state reduces the distortion values when it provides information about highly dynamic entities and/or it is utilized for protocols that is required to incur a low amount of overhead.","cites":"0","conferencePercentile":"21.42857143"},{"venue":"Wireless Networks","id":"5882c77c005c040b8fa5d940e29d940e66216629","venue_1":"Wireless Networks","year":"2000","title":"Scheduling of real-time traffic in IEEE 802.11 wireless LANs","authors":"Constantine Coutras, Sanjay Gupta, Ness B. Shroff","author_ids":"3339291, 8409188, 1750487","abstract":"The desire to provide universal connectivity for mobile computers and communication devices is fueling a growing interest in wireless packet networks. To satisfy the needs of wireless data networking, study group 802.11 was formed under IEEE project 802 to recommend an international standard for Wireless Local Area Networks (WLANs). A key part of the standard are the Medium Access Control (MAC) protocols. Given the growing popularity of real-time services and multimedia based applications it is critical that the 802.11 MAC protocols be tailored to meet their requirements. The 802.11 MAC layer protocol provides asynchronous, time-bounded, and contention free access control on a variety of physical layers. In this paper we examine the ability of the point coordination function to support time bounded services. We present our proposal to support real-time services within the framework of the point coordination function and discuss the specifics of the connection establishment procedure. We conduct performance evaluation and present numerical results to help understand the issues involved.","cites":"47","conferencePercentile":"84.21052632"},{"venue":"Wireless Networks","id":"50f816541c9a1ab0179bffa9921c1787ed626998","venue_1":"Wireless Networks","year":"2012","title":"Achieving robust wireless localization resilient to signal strength attacks","authors":"Xiaoyan Li, Yingying Chen, Jie Yang, Xiuyuan Zheng","author_ids":"6801439, 1711604, 1688599, 5167704","abstract":"Received signal strength (RSS) based algorithms have been very attractive for localization since they allow the reuse of existing communication infrastructure and are applicable to many commodity radio technologies. Such algorithms, however, are sensitive to a set of non-cryptographic attacks, where the physical measurement process itself can be corrupted by adversaries. For example , the attacker can perform signal strength attacks by placing an absorbing or reflecting material around a wireless device to modify its RSS readings. In this work, we first formulate the all-around signal strength attacks, where similar attacks are launched towards all landmarks, and experimentally show the feasibility of launching such attacks. We then propose a general principle for designing RSS-based algorithms so that they are robust to all-around signal strength attacks. To evaluate our approach, we adapt a set of representative RSS-based localization algorithms according to our principle. We experiment with both simulated attacks and two sets of real attack scenarios. All the experiments show that our design principle can be applied to a wide spectrum of algorithms to achieve comparable performance with much better robustness.","cites":"8","conferencePercentile":"95"},{"venue":"Wireless Networks","id":"a5366d1e0ab2ff7877a110fc30a2909269412061","venue_1":"Wireless Networks","year":"2004","title":"Characteristics of WAP Traffic","authors":"Irene C. Y. Ma, James Irvine","author_ids":"2228934, 6296431","abstract":"Strathprints is designed to allow users to access the research output of the University of Strathclyde. Copyright © and Moral Rights for the papers on this site are retained by the individual authors and/or other copyright owners. Users may download and/or print one copy of any article(s) in Strathprints to facilitate their private study or for non-commercial research. You may not engage in further distribution of the material or use it for any profitmaking activities or any commercial gain. You may freely distribute the url ABSTRACT This paper considers the characteristics of WAP traffic. We start by constructing a model of WAP traffic based on a number of user scenarios. One traffic characteristic which is of particular interest in network dimensioning is the degree of self-similarity, so the paper looks at the characteristics of aggregated traffic with WAP, web and packet speech components to estimate its self-similarity. The results indicated that, while WAP traffic alone does not exhibit a significant degree of self-similarity, a combined load from various traffic sources retains almost the same degree of self-similarity as the most self-similar individual source. 1. INTRODUCTION Wireless Application Protocol (WAP) [1] is a protocol for the transmission of web like content to mobile phones and other (usually wireless) devices with low-bandwidth links. Although commercial take-up has been slower than originally hoped, WAP is still offers considerable promise as more content tailored to small devices becomes available. The standard WAP configuration is to have a WAP terminal communicating with a WAP gateway, which is then connected to the web. The terminal sends its request to the gateway, which then requests the content from the web server. The web server replies to the request with WML (Wireless Markup Language) files which the gateway can then optimise for transmission over the low bandwidth link to the terminal. A modified approach which allows the browsing of standard web pages is to use an HTML filter to convert the HTML pages to WML, but on devices with small displays this is unlikely to be successful, with content having to be tailored to the device. Proposals for WAP 2.0 allow selection of information depending on the capabilities of the device, but this paper deals with the current WAP specification (1.2). There is little in the literature on the modelling of WAP traffic. One approach to modelling WAP traffic would be to modify an existing web traffic model, …","cites":"9","conferencePercentile":"44.44444444"},{"venue":"Wireless Networks","id":"3c53b82a5a3d9b1a01133b898c1ba16744027567","venue_1":"Wireless Networks","year":"2004","title":"LANDMARC: Indoor Location Sensing Using Active RFID","authors":"Lionel M. Ni, Yunhao Liu, Yiu Cho Lau, Abhishek P. Patil","author_ids":"1726587, 1723433, 3265416, 2312640","abstract":"— Growing convergence among mobile computing devices and embedded technology sparks the development and deployment of \" context-aware \" applications, where location is the most essential context. In this paper we present LANDMARC, a location sensing prototype system that uses Radio Frequency Identification (RFID) technology for locating objects inside buildings. The major advantage of LANDMARC is that it improves the overall accuracy of locating objects by utilizing the concept of reference tags. Based on experimental analysis, we demonstrate that active RFID is a viable and cost-effective candidate for indoor location sensing. Although RFID is not designed for indoor location sensing, we point out three major features that should be added to make RFID technologies competitive in this new and growing market.","cites":"607","conferencePercentile":"100"},{"venue":"Wireless Networks","id":"45330fb807e60baa342a0df4e3289a76b72f3f0c","venue_1":"Wireless Networks","year":"2013","title":"Quantifying relationship between relative position error of localization algorithms and object identification","authors":"Noboru Kiyama, Akira Uchiyama, Hirozumi Yamaguchi, Teruo Higashino","author_ids":"2201623, 2610505, 1740195, 1692953","abstract":"Positioning of things, devices and people is the fundamental technology in ubiquitous computing. However, few literature has discussed the impact of positioning errors due to localization algorithm properties such as ranging noise and deployment of anchors on people's identification of objects. Since several factors such as relative distance, relative angles and grouping of objects are intricately related with each other in such identification, it is not an easy task to investigate its characteristics. In this paper, we propose criteria to assess the \" accuracy \" of the estimated positions in identifying the objects. The criteria are helpful to design , develop and evaluate localization algorithms that are used to tell people the location of objects. Augmented reality is a typical example that needs such lo-calization algorithms. To model the criteria without ambiguity, we prove that the Delaunay triangulation well-captures natural human behavior of finding similarity between estimated and true positions. We have examined different localization algorithms to observe how the proposed model quantifies the properties of those algorithms. Subjective testing has also been conducted using questionnaires to justify our quantification sufficiently renders human intuition.","cites":"0","conferencePercentile":"19.35483871"},{"venue":"Wireless Networks","id":"7aefe2797f5ca425cc37296562f34c64c6d7428b","venue_1":"Wireless Networks","year":"2013","title":"Mitigating jamming attacks in wireless broadcast systems","authors":"Qi Dong, Donggang Liu, Matthew K. Wright","author_ids":"2639573, 2274551, 1718648","abstract":"Wireless communications are vulnerable to signal jamming attacks that can block mission-critical messages from being received. Spread spectrum techniques mitigate these attacks by spreading normal narrowband signals over a much wider band of frequencies and forcing jammers who do not know the spreading pattern to expend much more effort to launch the attack. In broadcast systems, however, jammers can easily find out the spread pattern by compromising just a single receiver. Several group-based approaches have been proposed to deal with insider jammers who compromise receivers in broadcast systems; they can tolerate up to t malicious receivers as long as the system can afford 2t additional copies for each broadcast message. In this paper, we introduce a novel jamming-resistant broadcast system that organizes receivers into multiple channel-sharing broadcast groups and isolates malicious receivers using adaptive regrouping. By letting receivers in different groups partially share their channels, this scheme reduces the extra communication cost from 2t to (2 − ρ)t copies, where ρ is the channel sharing factor (0<ρ<1); this is much closer to optimal given the previously proven lower bound of t additional copies. In addition, we propose two extensions to the scheme to further improve the system performance: a sequential test-based scheme that saves communication costs without reducing security and an unpredictable channel assignment scheme that removes the requirement of operating on multiple channels at the same time, greatly reducing the required hardware complexity. We evaluate our schemes with analysis and simulation.","cites":"1","conferencePercentile":"46.77419355"},{"venue":"Wireless Networks","id":"f85b0d0ae96a11a026a5b8bc6e276b7cdb9ca2d9","venue_1":"Wireless Networks","year":"2000","title":"A comparative study of bandwidth reservation and admission control schemes in QoS-sensitive cellular networks","authors":"Sunghyun Choi, Kang G. Shin","author_ids":"1720284, 1730051","abstract":"This paper compares five different schemes – called CHOI, NAG, AG, BHARG, and NCBF – for reserving bandwidths for handoffs and admission control for new connection requests in QoS-sensitive cellular networks. CHOI and NAG are to keep the handoff dropping probability below a target value, AG is to guarantee no handoff drops through per-connection bandwidth reservation, and BHARG and NCBF use another type of per-connection bandwidth reservation. CHOI predicts the bandwidth required to handle handoffs by estimating possible handoffs from adjacent cells, then performs admission control for each newly-requested connection. On the other hand, NAG predicts the total required bandwidth in the current cell by estimating both incoming and outgoing handoffs at each cell. AG requires the set of cells to be traversed by the mobile with a newly-requested connection, and reserves bandwidth for each connection in each of these cells. The last two schemes reserve bandwidth for each connection in the predicted next cell of a mobile where the two schemes use different admission control policies. We adopt the history-based mobility estimation for the first two schemes. Using extensive simulations, the five schemes are compared quantitatively in terms of (1) handoff dropping probability, connection-blocking probability, and bandwidth utilization; (2) dependence on the design parameters; (3) dependence on the accuracy of mobility estimation; and (4) complexity. The simulation results indicate that CHOI is the most desirable in that it achieves good performance while requiring much less memory and computation than the other four schemes.","cites":"30","conferencePercentile":"73.68421053"},{"venue":"Wireless Networks","id":"03298cb0fe0259764cfbb9978e19f48521c363f6","venue_1":"Wireless Networks","year":"2011","title":"Metadata-guided evaluation of resource-constrained queries in content caching based wireless networks","authors":"Ruilin Liu, Xiuyuan Zheng, Hongbo Liu, Wendy Hui Wang, Yingying Chen","author_ids":"2934278, 5167704, 6171819, 1771616, 3467781","abstract":"Recent years have witnessed the emergence of data-centric storage that provides energy-efficient data dissemination and organization in mobile wireless environments. However, limited resources of wireless devices bring unique challenges to data access and information sharing. To address these challenges, we introduce the concept of content caching networks, in which the collected data will be stored by its contents in a distributed manner, while the data in the network is cached for a certain period of time before it is sent to a centralized storage space for backup. Furthermore, we propose a metadata-guided query evaluation approach to achieve query efficiency in content caching networks. By this approach, each cache node will maintain the metadata that summarizes the data content on itself. Queries will be evaluated first on the metadata before on the cached data. By ensuring that queries will only be evaluated on relevant nodes, the metadata-guided query evaluation approach can dramatically improve the performance of query evaluation. We design efficient algorithms to construct metadata for both numerical and categorical data types. Our theoretical and empirical results both show that our metadata-guided approach can accelerate query evaluation significantly, while achieving the memory requirements on wireless devices.","cites":"0","conferencePercentile":"9.756097561"},{"venue":"Wireless Networks","id":"eddcec2bcb9360ef201539dbd406c22759753343","venue_1":"Wireless Networks","year":"2007","title":"Enabling SIP-based sessions in ad hoc networks","authors":"Nilanjan Banerjee, Arup Acharya, Sajal K. Das","author_ids":"1698909, 1706881, 1734537","abstract":"The deployment of infrastructure-less ad hoc networks is suffering from the lack of applications in spite of active research over a decade. This problem can be solved to a certain extent by porting successful legacy Internet applications and protocols to the ad hoc network § Corresponding Author; 2 domain. Session Initiation Protocol (SIP) is designed to provide the signaling support for multimedia applications such as Internet telephony, Instant Messaging, Presence etc. SIP relies on the infrastructure of the Internet and an overlay of centralized SIP servers to enable the SIP endpoints discover each other and establish a session by exchanging SIP messages. However, such an infrastructure is unavailable in ad hoc networks. In this paper, we propose two approaches to solve this problem and enable SIP-based session setup in ad hoc networks (i) a loosely coupled approach, where the SIP endpoint discovery is decoupled from the routing procedure and (ii) a tightly coupled approach, which integrates the endpoint discovery with a fully distributed cluster based routing protocol that builds a virtual topology for efficient routing. Simulation experiments show that the tightly coupled approach performs better for (relatively) static multihop wireless networks than the loosely coupled approach in terms of the latency in SIP session setup. The loosely coupled approach, on the other hand, generally performs better in networks with random node mobility. The tightly coupled approach, however, has lower control overhead in both the cases.","cites":"4","conferencePercentile":"20"},{"venue":"Wireless Networks","id":"26b616e5697748d7095267738a3217e2375424a0","venue_1":"Wireless Networks","year":"2004","title":"On k-coverage in a mostly sleeping sensor network","authors":"Santosh Kumar, Ten-Hwang Lai, József Balogh","author_ids":"1736293, 1801989, 1679007","abstract":"Sensor networks are often desired to last many times longer than the active lifetime of individual sensors. This is usually achieved by putting sensors to sleep for most of their lifetime. On the other hand, surveillance kind of applications require guaranteed k-coverage of the protected region at all times. As a result, determining the appropriate number of sensors to deploy that achieves both goals simultaneously becomes a challenging problem. In this paper, we consider three kinds of deployments for a sensor network on a unit square - a &#8730;n x &#8730;n grid, random uniform (for all n points), and Poisson (with density n). In all three deployments, each sensor is active with probability p, independently from the others. Then, we claim that the critical value of the function np&#960;r<sup>2</sup>/log(np) is 1 for the event of k-coverage of every point. We also provide an upper bound on the window of this phase transition. Although the conditions for the three deployments are similar, we obtain sharper bounds for the random deployments than the grid deployment, which occurs due to the boundary condition. In this paper, we also provide corrections to previously published results for the grid deployment model. Finally, we use simulation to show the usefulness of our analysis in real deployment scenarios.","cites":"295","conferencePercentile":"94.44444444"},{"venue":"Wireless Networks","id":"1d8e61744a3c40089517754bf80769a71d87248d","venue_1":"Wireless Networks","year":"2003","title":"Resource-aware Speculative Prefetching in Wireless Networks","authors":"Nor Jaidi Tuah, Mohan Kumar, Svetha Venkatesh","author_ids":"8399324, 4467104, 1679520","abstract":"Mobile users connected to wireless networks expect performance comparable to those on wired networks for interactive multime-dia applications. Satisfying Quality of Service (QoS) requirements for such applications in wireless networks is a challenging problem due to limitations of low bandwidth, high error rate and frequent disconnections of wireless channels. In addition, wireless networks suffer from varying bandwidth. In this paper we investigate object prefetching during times of connectedness and bandwidth availability to enhance user perceived connectedness. This paper presents an access model that is suitable for multimedia access in wireless networks. Access modelling for the purpose of predicting future accesses in the context of speculative prefetching has received much attention in the literature. The model recognizes that a web page, instead of just a single file, is typically a compound of several files. When it comes to making prefetch decisions, most previous studies in speculative prefetching resort to simple heuristics, such as prefetching an item with access probabilities larger than a manually tuned threshold. This paper takes a different approach. Specifically, it models the performance of the prefetcher, taking into account access predictions and resource parameters, and develops a prefetch policy based on a theoretical analysis of the model. Since the analysis considers cache as one of the resource parameters, the resulting policy integrates prefetch and cache replacement decisions. The paper investigates the effect of prefetching on network load. In order to make effective use of available resources and maximize access improvement, it is beneficial to prefetch all items with access probabilities exceeding certain threshold.","cites":"15","conferencePercentile":"58.62068966"},{"venue":"Wireless Networks","id":"e4ef5c22c4406fb4864fd94342f952e23ffb26e5","venue_1":"Wireless Networks","year":"2003","title":"QoS Provisioning in Wireless/Mobile Multimedia Networks Using an Adaptive Framework","authors":"Ted Taekyoung Kwon, Yanghee Choi, Chatschik Bisdikian, Mahmoud Naghshineh","author_ids":"2035642, 1729048, 1717717, 1766452","abstract":"Recently there is a growing interest in the adaptive multimedia networking where the bandwidth of an ongoing multimedia call can be dynamically adjusted. In the wireless/mobile multimedia networks using the adaptive framework, the existing QoS provisioning focused on the call blocking probability and the forced termination probability should be modified. We, therefore, redefine a QoS parameter – the cell overload probability – from the viewpoint of the adaptive multimedia networking. Then, we propose a distributed call admission control (CAC) algorithm that guarantees the upper bound of the cell overload probability. Also, a bandwidth adaptation algorithm which seeks to minimize the cell overload probability is also presented. Simulation experiments are carried out to verify the performance of the proposed CAC algorithm. Furthermore, the performance of the adaptive wireless/mobile network is compared to that of the existing non-adaptive wireless/mobile networks. As a further step in QoS provisioning, we propose another QoS parameter, the degradation period ratio, and discuss analytically how the CAC algorithm guarantees the upper bound of the degradation period ratio.","cites":"28","conferencePercentile":"67.24137931"},{"venue":"Wireless Networks","id":"327cdcba374b192f0946a8bf890f9f7842c70959","venue_1":"Wireless Networks","year":"2005","title":"Barrier coverage with wireless sensors","authors":"Santosh Kumar, Ten-Hwang Lai, Anish Arora","author_ids":"1736293, 1801989, 1693812","abstract":"In old times, castles were surrounded by moats (deep trenches filled with water, and even alligators) to thwart or discourage intrusion attempts. One can now replace such barriers with stealthy and wireless sensors. In this paper, we develop theoretical foundations for laying barriers of wireless sensors. We define the notion of <i>k</i>-barrier coverage of a belt region using wireless sensors. We propose efficient algorithms using which one can quickly determine, after deploying the sensors, whether a region is <i>k</i>-barrier covered. Next, we establish the optimal deployment pattern to achieve <i>k</i>-barrier coverage when deploying sensors deterministically. Finally, we consider barrier coverage with high probability when sensors are deployed randomly. We introduce two notions of probabilistic barrier coverage in a belt region -- weak and strong barrier coverage. While weak barrier-coverage with high probability guarantees the detection of intruders as they cross a barrier of <i>stealthy</i> sensors, a sensor network providing strong barrier-coverage with high probability (at the expense of more sensors) guarantees the detection of all intruders crossing a barrier of sensors, even when the sensors are <i>not</i> stealthy. Both types of barrier coverage require significantly less number of sensors than full-coverage, where every point in the region needs to be covered. We derive critical conditions for weak <i>k</i>-barrier coverage, using which one can compute the minimum number of sensors needed to provide weak <i>k</i>-barrier coverage with high probability in a given belt region. Deriving critical conditions for strong <i>k</i>-barrier coverage for a belt region is still an open problem.","cites":"219","conferencePercentile":"94.44444444"},{"venue":"Wireless Networks","id":"15ce91f66caae8ff2e3f94dec484c5f162d68cd8","venue_1":"Wireless Networks","year":"2014","title":"Path diversified multi-QoS optimization in multi-channel wireless mesh networks","authors":"Xiaoyuan Guo, Feng Wang, Jiangchuan Liu, Yong Cui","author_ids":"4264413, 1745827, 1681457, 4382073","abstract":"Wireless mesh networks (WMNs) have become a promising solution for quick and low-cost spreading of Internet accesses and other network services. Given the mesh topology, multiple paths are often available between node pairs, which thus naturally endorse path-diversified transmission. Unfortunately, like in wired networks, discovering completely disjoint paths in a WMN remains an intractable problem. It indeed becomes more challenging given the interferences across wireless channels in a WMN, not to mention that applications may demand heterogeneous QoS optimizations across different paths. The availability of multiple channels in advanced WMNs however sheds new lights into this problem. In this paper, we show that, as long as the best channels with different QoS metrics are not overlapped between neighboring node pairs, complete disjoint paths with heterogeneous QoS targets are available in a multi-channel WMN. We present efficient solutions to discover such paths, particularly for bandwidth-and delay-optimization. We also develop novel algorithms for accurately estimating path bandwidth and delay in the multi-channel environment. These lead to the design of a practical protocol that extends the classical Ad hoc On-demand Multi-path Distance Vector (AOMDV). Through extensive simulations, we show that our protocol yields significant improvement over state-of-the-art multi-path protocols in terms of both end-to-end throughput and delay.","cites":"0","conferencePercentile":"21.42857143"},{"venue":"Wireless Networks","id":"2cbed75e7a830c33c13ab2b965379248f12dba6a","venue_1":"Wireless Networks","year":"2007","title":"Context-aware platform for mobile data management","authors":"Moira C. Norrie, Beat Signer, Michael Grossniklaus, Rudi Belotti, Corsin Decurtins, Nadir Weibel","author_ids":"1685670, 1725701, 1786155, 2453643, 1895420, 1752711","abstract":"Interaction design is a major issue for mobile information systems in terms of not only the choice of in-put/output channels and presentation of information, but also the application of context-awareness. To support experimentation with these factors, we have developed platforms to support the rapid prototyping of multi-channel, multi-modal, context-aware applications. The Java-based platform presented here is based on an integration of a cross-media link server and an object-oriented framework for advanced content publishing, along with a Client Controller and Context Engine. We also describe how this platform was used to develop a mobile tourist information system for an international arts festival where interaction was based on a combination of interactive paper and speech output.","cites":"9","conferencePercentile":"36"},{"venue":"Wireless Networks","id":"6fd1beb4fe21241d543dafb8c3db88d986fd3f7b","venue_1":"Wireless Networks","year":"2002","title":"TCP Westwood: End-to-End Congestion Control for Wired/Wireless Networks","authors":"Claudio Casetti, Mario Gerla, Saverio Mascolo, M. Y. Sanadidi, Ren Wang","author_ids":"1748225, 8467438, 1694855, 1708056, 1694745","abstract":"TCP Westwood (TCPW) is a sender-side modification of the TCP congestion window algorithm that improves upon the performance of TCP Reno in wired as well as wireless networks. The improvement is most significant in wireless networks with lossy links. In fact, TCPW performance is not very sensitive to random errors, while TCP Reno is equally sensitive to random loss and congestion loss and cannot discriminate between them. Hence, the tendency of TCP Reno to overreact to errors. An important distinguishing feature of TCP Westwood with respect to previous wireless TCP \" extensions \" is that it does not require inspection and/or interception of TCP packets at intermediate (proxy) nodes. Rather, TCPW fully complies with the end-to-end TCP design principle. The key innovative idea is to continuously measure at the TCP sender side the bandwidth used by the connection via monitoring the rate of returning ACKs. The estimate is then used to compute congestion window and slow start threshold after a congestion episode, that is, after three duplicate acknowledgments or after a timeout. The rationale of this strategy is simple: in contrast with TCP Reno which \" blindly \" halves the congestion window after three duplicate ACKs, TCP Westwood attempts to select a slow start threshold and a congestion window which are consistent with the effective bandwidth used at the time congestion is experienced. We call this mechanism faster recovery. The proposed mechanism is particularly effective over wireless links where sporadic losses due to radio channel problems are often misinterpreted as a symptom of congestion by current TCP schemes and thus lead to an unnecessary window reduction. Experimental studies reveal improvements in throughput performance , as well as in fairness. In addition, friendliness with TCP Reno was observed in a set of experiments showing that TCP Reno connections are not starved by TCPW connections. Most importantly, TCPW is extremely effective in mixed wired and wireless networks where throughput improvements of up to 550% are observed. Finally, TCPW performs almost as well as localized link layer approaches such as the popular Snoop scheme, without incurring the overhead of a specialized link layer protocol.","cites":"120","conferencePercentile":"84.61538462"},{"venue":"Wireless Networks","id":"5a3ca8d14e2897a291682541b2993431503401ff","venue_1":"Wireless Networks","year":"2013","title":"A framework for inter-domain routing in virtual coordinate based mobile networks","authors":"Falko Dressler, Mario Gerla","author_ids":"1725013, 8467438","abstract":"for personal use only and shall not be self-archived in electronic repositories. If you wish to self-archive your article, please use the accepted manuscript version for posting on your own website. You may further deposit the accepted manuscript version in any repository, provided it is only made publicly available 12 months after official publication or later and provided acknowledgement is given to the original source of publication and a link is inserted to the published article on Springer's website. The link must be accompanied by the following text: \"The final publication is available at link.springer.com \". Abstract Routing is considered to be one the most challenging problems in mobile ad hoc networks. It has been shown that the use of virtual coordinates or identifiers for efficient routing and data management has several advantages compared to classical topology control techniques based on pre-defined addresses or geographical coordinates. However, these advantages only hold for single domain networks with limited mobility. In a previous paper, we discussed the challenges arising from using virtual coordinates for routing (to a particular destination ID or to indexed data or resources) in mobile networks in multi-domain network scenarios. We developed a solution by managing data with a distributed hash table scheme. Based on our virtual cord protocol, we then implemented inter-domain routing using appropriate indirections. That approach, however, was still limited in finding efficient routes over multiple transit networks. In this paper, we extend that work by defining a framework for optimized inter-domain routing. In particular, we investigate the use of ant colony optimization for optimizing routes between multiple network domains. We show how distributed routing tables can be created and maintained and we outline a heuristic for finding candidate routes. Simulation experiments confirm the efficiency of the selected routes both on a intra and on a inter-domain level.","cites":"2","conferencePercentile":"66.12903226"},{"venue":"Wireless Networks","id":"e76d19acc01f5b7afe3e0e27ba276f6136a2f8e7","venue_1":"Wireless Networks","year":"2012","title":"Application-aware dynamic spectrum access","authors":"Ashwini Kumar, Kang G. Shin","author_ids":"2400099, 1730051","abstract":"Dynamic Spectrum Access (DSA) allows unlicensed wireless devices to opportunistically access unoccupied licensed spectrum bands. DSA yields efficient spectrum utilization which can greatly improve wireless networking performance. In this paper, we advocate application-awareness to effectively manage the side-effects of DSA that can offset its benefits by adversely impacting application QoS. Simple application hints are found to be able to serve as key inputs in evaluating current spectrum conditions relative to application needs, leading to an informed DSA mechanism that minimizes the impact of undesirable DSA side-effects. Towards this goal, we propose a wireless service architecture called Context-Aware Spectrum Agility (CASA). The key elements of CASA are: (a) semantic dependency equations that provide the relationship between application-layer QoS state and lower-layer DSA parameters, (b) CASA Algorithm that adapts DSA parameters and activities to better suit application needs, and, (c) a low overhead interface to provide application context to DSA. CASA has been explicitly designed with the goals of practical deployment, low overhead operation, and is compatible with any DSA protocol. Compared to state-of-art DSA, the deployment of CASA along with DSA protocols is shown to improve QoS metrics, such as delay and jitter, by an average of 30 and 64%, respectively. CASA is also found to match the application QoS demands for more than 90% of the duration of a communication session—a 300?% improvement over conventional application-agnostic DSA.","cites":"1","conferencePercentile":"37.5"},{"venue":"Wireless Networks","id":"007c8d65d36196040c7523ace2f3d9214dbcbab7","venue_1":"Wireless Networks","year":"2008","title":"A power controlled interference aware routing protocol for dense multi-hop wireless networks","authors":"Liran Ma, Qian Zhang, Xiuzhen Cheng","author_ids":"2341371, 1737486, 1749642","abstract":"A key issue impacting the performance of multi-hop wireless networks is the interference among neighboring nodes. In this paper, we propose a novel and practical interference aware metric, termed as Network Allocation Vector Count (NAVC), to estimate the effects of the interference on the average delay and the available bandwidth. This metric can be easily applied to routing protocols designed for 802.11 based multi-hop networks with no modification to the current 802.11 protocol. The design of NAVC as a metric for the AODV [32] routing protocol, as well as a metric for transmit power control, are described in detail. Our simulation results reveal that the NAVC-driven AODV can greatly improve its performance compared to those protocols based on hop-count. For scenarios of densely deployed nodes, the throughput improvement is often a factor near two, indicating that NAVC is more useful as networks grow denser. Moreover , the network lifetime can be notably prolonged when the NAVC is employed to conduct transmit power control. Our approach is essential for emerging applications such as wireless sensor networks where the interference is heavy and the energy is severely constrained. Keywords Multi-hop wireless networks. Interference aware routing. Medium access control (MAC). Power control","cites":"5","conferencePercentile":"53.84615385"},{"venue":"Wireless Networks","id":"f666c488a4b484ce251aac3c93beda5cab84509c","venue_1":"Wireless Networks","year":"2010","title":"The delay-constrained information coverage problem in mobile sensor networks: single hop case","authors":"Gabriel Yik Keung, Qian Zhang, Bo Li","author_ids":"1854204, 1737486, 1716576","abstract":"In this paper, we study the delay-constrained information coverage problem in mobile sensor networks. Motivated by real application needs, our formulation takes advantage of the sensor mobility for sensing information collection, which takes place when a sensor moves into the proximity (single hop) of stationary sink nodes. To the best of our knowledge, we present the first formulation for the delay-constrained information coverage problem, which targets at optimal sink nodes placement with the objective of maximizing sensing information collection within a constrained time. We prove that this problem is NP-hard even under finite search space approximation and we develop theoretical analysis to derive its upper and lower performance bounds. We then develop approximation techniques and use simulations to verify their effectiveness. List of symbols A A vast 2-D geographic area M The number of mobile sensors @ The set of sink nodes N The number of sink nodes, and N C 1, and @ S h The coverage region of stationary sink node h, and S h [ A, 1 B h B N R The coverage range of a sink node T A time interval for the information coverage D(A, t 0) The sensor position distribution across the area A at the initial time instant t 0 h The moving direction of mobile sensors, [0, 2 p) v The speed of mobile sensors r v The travel distance of mobile sensors at each 4t. It depends on the mobile platform of sensors and r v (A 4t The discrete time interval in which each sensor movement occurs P(r, h, t) The probability of a mobile sensor lays at distance r and angle h from its initial position at time t d The radius of circular probability distribution for a single mobile sensor at the initial time instant t 0 (The radius of disk distribution)","cites":"3","conferencePercentile":"42.74193548"},{"venue":"Wireless Networks","id":"c13ef7f2042ae76982df6aff8a3144de1ebf32d5","venue_1":"Wireless Networks","year":"2009","title":"AdHoc Probe: end-to-end capacity probing in wireless ad hoc networks","authors":"Ling-Jyh Chen, Tony Sun, Guang Yang, M. Y. Sanadidi, Mario Gerla","author_ids":"1759187, 1797568, 1773554, 1708056, 8467438","abstract":"Knowledge of end-to-end path capacity is useful for video/audio stream adaptation, network management and overlay design. Capacity estimation in wired and last-hop wireless networks has been extensively investigated, but a thorough and systematic study in ad hoc, multihop wireless networks is still lacking. Yet the rate of a wireless link can change dynamically (and rapidly) due to changes in interference, distance or energy optimization policy. Timely knowledge of path capacity is key to efficient routing, traffic management and application deployment. In this paper, we present AdHoc Probe, a packet-pair based technique, to estimate end-to-end path capacity in ad hoc wireless networks. We apply AdHoc Probe to path capacity estimation in auto rate wireless networks with variable displacement and interference; and, in remote wireless networks across the Internet. Using analysis, simulation and testbed experiments, we show AdHoc Probe can withstand mobility and is able to trace the rate adaptation of wireless networks timely and correctly. AdHoc Probe is simpler, faster and much less intrusive than current schemes.","cites":"5","conferencePercentile":"53.84615385"},{"venue":"Wireless Networks","id":"591d15744a2129cba99126e9d2349979de31f7c7","venue_1":"Wireless Networks","year":"2005","title":"TCP Unfairness in Ad Hoc Wireless Networks and a Neighborhood RED Solution","authors":"Kaixin Xu, Mario Gerla, Lantao Qi, Yantai Shu","author_ids":"3025155, 8467438, 2707546, 1681117","abstract":"Significant TCP unfairness in ad hoc wireless networks has been reported during the past several years. This unfair-ness results from the nature of the shared wireless medium and location dependency. If we view a node and its interfering nodes to form a \" neighborhood \" , the aggregate of local queues at these nodes represents the distributed queue for this neighborhood. However, this queue is not a FIFO queue. Flows sharing the queue have different, dynamically changing priorities determined by the topology and traffic patterns. Thus, they get different feedback in terms of packet loss rate and packet delay when congestion occurs. In wired networks, the Randomly Early Detection (RED) scheme was found to improve TCP fairness. In this paper, we show that the RED scheme does not work when running on individual queues in wireless nodes. We then propose a Neighborhood RED (NRED) scheme, which extends the RED concept to the distributed neighborhood queue. Simulation studies confirm that the NRED scheme can improve TCP unfairness substantially in ad hoc networks. Moreover , the NRED scheme acts at the network level, without MAC protocol modifications. This considerably simplifies its deployment.","cites":"32","conferencePercentile":"79.16666667"},{"venue":"Wireless Networks","id":"1348cc8a255af7944eae62692a18e0ae229ab411","venue_1":"Wireless Networks","year":"1995","title":"Multicluster, mobile, multimedia radio network","authors":"Mario Gerla, Jack Tzu-Chieh Tsai","author_ids":"8467438, 2181948","abstract":"A multi-cluster, multi-hop packet radio network architecture for wireless adaptive mobile information systems is presented. The proposed network supports multimedia traffic and relies on both time division and code division access schemes. This radio network is not supported by a wired infrastructure as conventional cellular systems are. Thus, it can be instantly deployed in areas with no infrastructure at all. By using a distributed clustering algorithm, nodes are organized into clusters. The clusterheads act as local coordinators to resolve channel scheduling, perform power measurement/control, maintain time division frame synchronization, and enhance the spatial reuse of time slots and codes. Moreover, to guarantee bandwidth for real time traffic, the architecture supports virtual circuits and allocates bandwidth to circuits at call setup time. The network is scalable to large numbers of nodes, and can handle mobility. Simulation experiments evaluate the performance of the proposed scheme in static and mobile environments.","cites":"600","conferencePercentile":"100"},{"venue":"Wireless Networks","id":"9318c06b4f7eb11d3895f19324e02876dd27d9fe","venue_1":"Wireless Networks","year":"2014","title":"Dynamic Data-Centric Storage for long-term storage in Wireless Sensor and Actor Networks","authors":"Ángel Cuevas, Manuel Urueña, Gustavo de Veciana, Rubén Cuevas Rumín, Noël Crespi","author_ids":"1704744, 1807453, 1757522, 6140312, 1737867","abstract":"Data-Centric Storage (DCS) appears as a novel information storage and delivery mechanism for Wireless Sensor and Actor Networks in which a rendezvous node (home node) is selected to store and serve all the information of a particular application. However, DCS was not designed to provide long-term data availability. In this paper we present a Dynamic DCS solution to enable a long-term storage system. Dynamic DCS proposes to periodically change home nodes over the time based on periods of fixed duration called epochs. This makes it possible to perform temporal queries to previous home nodes in order to retrieve information from the past. We evaluate our proposal using extensive simulations, and reveal that Dynamic DCS makes sensor events available at least 85 % of the maximum lifetime provided by an optimal (but non practical) solution. Finally, we show that Dynamic DCS could easily adapt its storage performance to the requirements of an application by just tuning the epoch duration.","cites":"2","conferencePercentile":"71.42857143"},{"venue":"Wireless Networks","id":"a8997344e457e7b839d27920b114b6ea3c1fda65","venue_1":"Wireless Networks","year":"1999","title":"Real-time support in multihop wireless networks","authors":"Chun-Hung Richard Lin, Mario Gerla","author_ids":"2177963, 8467438","abstract":"Personal communications and mobile computing will require a wireless network infrastructure which is fast deployable, possibly multihop, and capable of multimedia service support. The first infrastructure of this type was the Packet Radio Network (PRNET), developed in the 70's to address the battlefield and disaster recovery communication requirements. PRNET was totally asynchronous and was based on a completely distributed architecture. It handled datagram traffic reasonably well, but did not offer efficient multimedia support. Recently, under the WAMIS (Wireless Adaptive Mobile Information Systems) and Glomo ARPA programs several mobile, multimedia, multihop (M 3) wireless network architectures have been developed, which assume some form of synchronous, time division infrastructure. The synchronous time frame leads to efficient multimedia support implementations. However, it introduces more complexity and is less robust in the face of mobility and channel fading. In this paper, we examine the impact of synchronization on wireless M 3 network performance. First, we introduce MACA/PR, an asynchronous network based on the collision avoidance MAC scheme employed in the IEEE 802.11 standard. Then, we evaluate and compare several wireless packet networks ranging from the totally asynchronous PRNET to the synchronized cluster TDMA network. We examine the tradeoffs between time synchronization and performance in various traffic and mobility environments.","cites":"38","conferencePercentile":"63.33333333"},{"venue":"Wireless Networks","id":"820fec5731923cb859baad25b9eb71053e18223c","venue_1":"Wireless Networks","year":"2011","title":"Determining the position of a jammer using a virtual-force iterative approach","authors":"Hongbo Liu, Zhenhua Liu, Yingying Chen, Wenyuan Xu","author_ids":"6171819, 6299530, 3467781, 1737805","abstract":"Wireless communication is susceptible to radio interference and jamming attacks, which prevent the reception of communications. Most existing anti-jamming work does not consider the location information of radio interferers and jammers. However, this information can provide important insights for networks to manage its resource in different layers and to defend against radio interference. In this paper, we investigate issues associated with localizing jammers in wireless networks. In particular, we formulate the jamming effects using two jamming models: region-based and signal-to-noise-ratio(SNR)-based; and we categorize network nodes into three states based on the level of disturbance caused by the jammer. By exploiting the states of nodes, we propose to localize jammers in wireless networks using a virtual-force iterative approach. The virtual-force iterative localization scheme is a range-free position estimation method that estimates the position of a jammer iteratively by utilizing the network topology. We have conducted experiments to validate our SNR-based jamming model and performed extensive simulation to evaluate our approach. Our simulation results have showed that the virtual-force iterative approach is highly effective in localizing a jammer in various network conditions when comparing to existing centroid-based localization approaches.","cites":"8","conferencePercentile":"85.36585366"},{"venue":"Wireless Networks","id":"57522c401fd715a2c740622107cc611930c510a7","venue_1":"Wireless Networks","year":"2013","title":"Neighborhood prediction based decentralized key management for mobile wireless networks","authors":"Xiuyuan Zheng, Yingying Chen, Wendy Hui Wang, Hongbo Liu, Ruilin Liu","author_ids":"5167704, 3467781, 1771616, 6171819, 2934278","abstract":"The wireless data collected in mobile environments provides tremendous opportunities to build new applications in various domains such as Vehicular Ad Hoc Networks and mobile social networks. Storing the data decentralized in wireless devices brings major advantages over centralized ones. In this work, to facilitate effective access control of the wireless data in the distributed data storage, we propose a fully decentralized key management framework by utilizing a cryptography-based secret sharing method. The secret sharing method splits the keys into multiple shares and distributes them to multiple nodes. However, due to node mobility, these key shares may not be available in the neighborhood when they are needed for key reconstruction. To address this challenge, we propose the Transitive Prediction (TRAP) protocol that distributes key shares among devices that are traveling together. We develop three key distribution schemes that utilize the correlation relationship embedded among devices that are traveling together. Our key distribution schemes maximize the chance of successful key reconstruction and minimize the communication overhead. We provide theoretical analysis of the robustness and security of TRAP. Our simulation results, by using the generated data from city environment and NS-2 simulator, demonstrate the efficiency and effectiveness of our key distribution schemes.","cites":"0","conferencePercentile":"19.35483871"},{"venue":"Wireless Networks","id":"7079f49530cb9c68a1319a5f7559daf64e62b2b4","venue_1":"Wireless Networks","year":"2015","title":"Optimum design of a banked memory with power management for wireless sensor networks","authors":"Leonardo Steinfeld, Marcus Ritt, Fernando Silveira, Luigi Carro","author_ids":"1974508, 1719753, 3111969, 8695340","abstract":"—The ever-increasing complexity of applications of wireless sensor networks (WSNs) demands for increasing memory size and larger memory size increases the power drain. It is well known that SRAM memory consumption can be reduced by employing a banked structure, where unused banks are switched into the low leakage retention mode. In this work, we propose a detailed model for the energy saving for equally sized banks with two power management schemes: a best-oracle policy and a simple greedy policy. The model gives valuable insight into the particular factors (coming from the application, the technology and design decisions) critical for reaching the maximum achievable energy saving. Thanks to our modeling, at design time the optimum number of banks can be estimated to reach more aggressive energy savings. The memory content allocation and the power management problem were solved by an integer linear program formulation for a real wireless sensor network application. Experimental results show an energy reduction of 79.2% for a partition overhead of 1%.","cites":"0","conferencePercentile":"40"},{"venue":"Wireless Networks","id":"82e92a1c18290b46e7ea4ddbee45428c0c00177e","venue_1":"Wireless Networks","year":"2010","title":"Secure encrypted-data aggregation for wireless sensor networks","authors":"Shih-I Huang, Shiuh-Pyng Shieh, J. Doug Tygar","author_ids":"2486651, 1720730, 1787610","abstract":"This paper proposes a secure encrypted-data aggregation scheme for wireless sensor networks. Our design for data aggregation eliminates redundant sensor readings without using encryption and maintains data secrecy and privacy during transmission. Conventional aggregation functions operate when readings are received in plaintext. If readings are encrypted, aggregation requires decryption creating extra overhead and key management issues. In contrast to conventional schemes, our proposed scheme provides security and privacy, and duplicate instances of original readings will be aggregated into a single packet. Our scheme is resilient to known-plaintext attacks, chosen-plaintext attacks, ciphertext-only attacks and man-in-the-middle attacks. Our experiments show that our proposed aggregation method significantly reduces communication overhead and can be practically implemented in on-the-shelf sensor platforms.","cites":"19","conferencePercentile":"91.12903226"},{"venue":"Wireless Networks","id":"1846cbef53eca7b7bd05801ebe714d4b0d727114","venue_1":"Wireless Networks","year":"2004","title":"On Semantic Caching and Query Scheduling for Mobile Nearest-Neighbor Search","authors":"Baihua Zheng, Wang-Chien Lee, Dik Lun Lee","author_ids":"1757894, 1686360, 1807210","abstract":"Location-based services have received increasing attention in recent y ears. In this paper, we address the performance issues of mobile nearest-neighbor search, in which the mobile user issues a query to retrieve stationary service objects nearest to him/her. An index based on Voronoi Diagram is used in the server to support such a search, while a semantic cache is proposed to enhance the access eeciency of the service. Cache replacement policies tailored for the proposed semantic cache are examined. Moreover, several query scheduling policies are proposed to address the inter-cell roaming issues in multi-cell environments. Simulations are conducted to evaluate the proposed methods. The result shows that the system performance, in terms of cache hit ratio, query response time, cell-cross number and cell-recross number, is improved signiicantly.","cites":"10","conferencePercentile":"47.22222222"},{"venue":"Wireless Networks","id":"49e25a404558ad74009d1ab49a79ee5c804c351a","venue_1":"Wireless Networks","year":"2004","title":"Spatial Queries in Wireless Broadcast Systems","authors":"Baihua Zheng, Wang-Chien Lee, Dik Lun Lee","author_ids":"1757894, 1686360, 1807210","abstract":"Owing to the advent of wireless networking and personal digital devices, information systems in the era of mobile computing are expected to be able to handle a tremendous amount of traffic and service requests from the users. Wireless data broadcast, thanks to its high scalability, is particularly suitable for meeting such a challenge. Indexing techniques have been developed for wireless data broadcast systems in order to conserve the scarce power resources in mobile clients. However, most of the previous studies do not take into account the impact of location information of users. In this paper, we address the issues of supporting spatial queries (including window queries and kNN queries) of location-dependent information via wireless data broadcast. A linear index structure based on the Hilbert curve and corresponding search algorithms are proposed to answer spatial queries on air. Experiments are conducted to evaluate the performance of the proposed indexing technique. Results show that the proposed index and its enhancement outperform existing algorithms significantly.","cites":"32","conferencePercentile":"73.61111111"}]}