{"Wireless_Mobile_Internet.csv":[{"venue":"Wireless Mobile Internet","id":"485fba3a7da30194bb25e0cc0b115831e0409dae","venue_1":"Wireless Mobile Internet","year":"2001","title":"Multimedia support over bluetooth Piconets","authors":"Rohit Kapoor, Manthos Kazantzidis, Mario Gerla, Per Johansson","author_ids":"8145474, 2212173, 8467438, 4063954","abstract":"In this paper we explore the ability to support multimedia trafficin indoor, wireless ad hoc PANs (Personal Area Networks) using theBluetooth technology. We first define the representative ad hocnetworking applications such as wireless access to the Internet,document distribution, videoconferencing, webcasting, interactionwith sensors and actuators, etc. For such applications, we definethe performance requirements placed on the PAN. There are twotechnologies now competing for the PAN market: the IEEE802.11&#8220;legacy&#8221; technology, and the newly introduced Bluetoothtechnology. By IEEE802.11, we refer to the operation of 802.11 inthe DCF mode, which is the mode implemented in the commercialWaveLAN cards. In the rest of the paper, we will use WaveLAN torefer to 802.11 in its DCF mode. We will attempt to answer thequestions: how effective is the Bluetooth technology in supportingcollaborative, &#8220;virtual ad hoc networking&#8221; applicationsand how does it compare with WaveLAN? To answer these questions, wehave developed an NS-2 model of Bluetooth. We have also developedmodels of adaptive applications such as voice and video. ForWaveLAN, we have used the existing NS-2 models. The results showthat Bluetooth provides better support for real-time applicationsas compared to WaveLAN. It does not exhibit the&#8220;capture&#8221; behavior observed, for example, in WaveLAN.Also, with the addition of nodes to the &#8220;indoor&#8221; space,it adds to the total &#8220;system&#8221; capacity and gives abetter overall throughput.","cites":"10","conferencePercentile":"77.77777778"},{"venue":"Wireless Mobile Internet","id":"57ea4d6c242f2744ab8b9d47de7de8148abb1a6d","venue_1":"Wireless Mobile Internet","year":"2001","title":"A wireless public access infrastructure for supporting mobile context-aware IPv6 applications","authors":"Adrian Friday, Maomao Wu, Stefan Schmid, Joe Finney, Keith Cheverst, Nigel Davies","author_ids":"8133498, 1767716, 1789173, 1788484, 1744905, 1789887","abstract":"This paper presents a novel wireless access point architecturedesigned to support the development of next generation mobilecontext-aware applications over metropolitan scale areas. Inaddition, once deployed, this network will allow ordinary citizenssecure, accountable and convenient access to the Internet fromtheir local city and campus environments.\nThe proposed architecture is based on an approach utilising amodified Mobile IPv6 protocol stack that uses packet marking andnetwork level packet filtering at the edge of the wired network toachieve this objective. The paper describes this architecture indetail and contrasts it with existing systems to highlight the keybenefits of our approach.","cites":"1","conferencePercentile":"44.44444444"},{"venue":"Wireless Mobile Internet","id":"2fdf53f11b257e48aceda385a8cf7ad7f8121a78","venue_1":"Wireless Mobile Internet","year":"2001","title":"iMobile: a proxy-based platform for mobile services","authors":"Herman Chung-Hwa Rao, Di-Fa Chang, Yih-Farn Robin Chen, Ming-Feng Chen","author_ids":"1911878, 2107485, 2231574, 8408716","abstract":"iMobile is a proxy-based platform that addresses the researchissues in building mobile services. iMobile acts as a massagegateway that allows mobile devices using various protocols ondifferent access networks to relay messages to each other. It alsoallows these clients to access internet services, corporatedatabases, and to control various networked devices. iMobileimplements three key abstractions: <i>devlet</i>, <i>infolet</i>,and <i>applet</i>. A devlet is a driver attached to the proxy thatreceives and sends messages through a particular protocol formobile devices. An infolet hosted on iMobile uses an access methodto provide an abstract view of an information space. An appletimplements service or application logic by processing informationfrom various infolets. The Core of iMobile, the <i>let engine</i>,implements the basic framework for maintaining applets, devlets andinfolets, supports user and device profiles for personalization andtranscoding, and invokes proper applets and infolets to answerrequests from a devlet. The iMobile architecture allows new accessdevices and protocols to be added to its framework without changesin the service logic. iMobile effectively provides a personal agenton the network that enables a user to have mobile access to thevast information and services available on the various wireless andwireline networks, without being limited by where the user is orwhat device or communication or protocol is available.","cites":"26","conferencePercentile":"100"}]}