{"Wireless_Communications_and_Mob":[{"venue":"Wireless Communications and Mobile Computing","id":"c5a6171050d36cfa18ec003a1d8d5b3d97a678a3","venue_1":"Wireless Communications and Mobile Computing","year":"2003","title":"Three power-aware routing algorithms for sensor networks","authors":"Javed A. Aslam, Qun Li, Daniela Rus","author_ids":"1737902, 1686663, 8698444","abstract":"This paper discusses online power-aware routing in large wireless ad-hoc networks (especially sensor networks) for applications where the message sequence is not known. We seek to optimize the lifetime of the network. We show that online power-aware routing does not have a constant competitive ratio to the off-line optimal algorithm. We develop an approximation algorithm called max-min zP min that has a good empirical competitive ratio. To ensure scalability, we introduce a second online algorithm for power-aware routing. This hierarchical algorithm is called zone-based routing. Our experiments show that its performance is quite good. Finally, we describe a distributed version of this algorithm that does not depend on any centralization.","cites":"50","conferencePercentile":"80.76923077"},{"venue":"Wireless Communications and Mobile Computing","id":"00e84f1cfdca196ad162192efac3b5145fb76f73","venue_1":"Wireless Communications and Mobile Computing","year":"2007","title":"Adaptive motion estimation schemes using maximum mutual information criterion","authors":"Jing Zhao, Dapeng Wu, Deniz Erdogmus, Yuguang Fang, Zhihai He","author_ids":"5349795, 1728475, 1774876, 1721221, 1700714","abstract":"We consider the motion estimation problem in video coding. In our previous work [10], we proposed a new motion estimation method where motion estimation is formulated as an optimization problem and an adaptive system under the minimum error entropy criterion is used for motion estimation. In this paper, we develop an adaptive system under the criterion of maximum mutual information to address the motion estimation problem. Our proposed motion estimation algorithms have very low encoding complexity and hence are ideally suited for wireless video sensor networks where limited bandwidth, restricted computational capability, and limited battery power supply impose stringent constraints on the video encoding system.","cites":"1","conferencePercentile":"22.22222222"},{"venue":"Wireless Communications and Mobile Computing","id":"ff7cf8c2338c4f3fb7baa092145c326ffdee09b0","venue_1":"Wireless Communications and Mobile Computing","year":"2006","title":"A new binary conflict resolution-based MAC protocol for impulse-based UWB ad hoc networks","authors":"Ioannis Broustis, Mart Molle, Srikanth V. Krishnamurthy, Michalis Faloutsos, Jeffrey R. Foerster","author_ids":"2919362, 2355411, 1791108, 2771914, 1713772","abstract":"Ultra wide band (UWB) technology offers a promising high capacity solution for short-range wireless ad hoc networks, as in home networks or in wearable ad hoc networks. In this paper, we propose a novel multi-band MAC protocol for use in small ad hoc networks that deploy an underlying UWB based physical layer. In our approach, we divide the available UWB bandwidth into multiple simultaneously usable bands. In the absence of a sophisticated equalizer, the size of a slot for transmitting a UWB pulse is typically dictated by the delay spread of the channel. Therefore, using a wider frequency band to shorten the transmission time for each pulse does not increase the data rate in proportion to the available bandwidth. A multi-band approach that uses a plurality of bands that adhere to FCC specifications, with slightly elongated pulse durations, provides a solution that can effectively utilize the UWB spectrum. Our approach is based on the idea of conflict resolution using binary 'something'/'nothing'feedback, which has not been widely studied in wireless and specifically in UWB networks. Our protocol unites binary conflict resolution and multi-band utilization to effectively utilize the available bandwidth. To ensure that our proposed approach is tightly knit with the underlying physical layer, we discuss physical–layer dependencies and the conformance to FCC-imposed emission limits. We evaluate our approach via extensive simulations. Our simulation results demonstrate the significant advantages of our approach over single-band solutions: the throughput increases significantly, and the number of collisions decreases considerably.","cites":"3","conferencePercentile":"36.58536585"},{"venue":"Wireless Communications and Mobile Computing","id":"ddebed14067812c3e0073d1ea011cdc3df3cee65","venue_1":"Wireless Communications and Mobile Computing","year":"2011","title":"A security framework for wireless mesh networks","authors":"Parag S. Mogre, Kalman Graffi, Matthias Hollick, Ralf Steinmetz","author_ids":"3011274, 1713399, 1734492, 1725298","abstract":"The class of Wireless Mesh Networks (WMN) supports an ample set of applications including wireless community networks, radio access networks in rural or metropolitan areas, or wireless backbones for factory/process automation. Guaranteeing security is crucial for within these application scenarios. While contemporary wireless technologies such as the IEEE 802.16 or the IEEE 802.11s standard provide the basic protocol mechanisms for mesh networking, they lack in comprehensive security mechanisms. Additionally, novel security features of the above standards such as per-link encryption break existing security solutions that rely on overhearing of the wireless channel. We close this gap by developing a holistic approach towards securing WMNs with particular focus on the network layer. We perform a threat analysis and then develop solutions (1) guaranteeing the integrity and authenticity of routing messages, (2) to locally and globally detect misbehavior of nodes in forwarding data or routing messages even for settings that do not allow for overhearing the channel, and (3) to dynamically manage reputation of nodes throughout the network. The combination of these building blocks enables to provide for secure, self-organizing WMNs. As a proof-of-concept, we tailor and implement our solutions for the setting of a realistic IEEE 802.16 mesh network; we discuss the protection achieved and assess selected performance trade-offs for the developed mechanisms.","cites":"4","conferencePercentile":"66.30434783"},{"venue":"Wireless Communications and Mobile Computing","id":"90c4f44777f3dd3f07b0e75669ff789b2448c100","venue_1":"Wireless Communications and Mobile Computing","year":"2007","title":"A survey on congestion control for mobile ad hoc networks","authors":"Christian Lochert, Björn Scheuermann, Martin Mauve","author_ids":"2662695, 1776439, 1751862","abstract":"Congestion control is a key problem in mobile ad-hoc networks. The standard TCP congestion control mechanism is not able to handle the special properties of a shared wireless multihop channel well. In particular the frequent changes of the network topology and the shared nature of the wireless channel pose significant challenges. Many approaches have been proposed to overcome these difficulties. In this paper, we give an overview over existing proposals, explain their key ideas and show their interrelations.","cites":"49","conferencePercentile":"100"},{"venue":"Wireless Communications and Mobile Computing","id":"9afed0a60aac99ffc199d19068d2e467edce9a72","venue_1":"Wireless Communications and Mobile Computing","year":"2005","title":"U-MAC: a proactive and adaptive UWB medium access control protocol","authors":"Raja Jurdak, Pierre Baldi, Cristina V. Lopes","author_ids":"1770270, 1688887, 8265496","abstract":"Ultra wide band (UWB) technology has received increasing recognition in recent years for its potential applications beyond radar technology to communication networks. UWB is a spread spectrum technology that requires careful coordination among communicating nodes to jointly control link power and transmission rates. Here, we present ultra wide band MAC (U-MAC), an adaptive medium access control (MAC) protocol for UWB in which nodes periodically declare their current state, so that neighbors can proactively assign power and rate values for new links locally in order to optimize global network performance. Simulations comparing U-MAC to the reactive approach confirm that U-MAC lowers link setup latency and control overhead, doubles the throughput and adapts better to high network loads. Simulations also reveal that the basic form of U-MAC favors nodes that are closer to the receiver. As a result, we also introduce novel mechanisms that control the radius around a receiver within which nodes can have fair access to it. We show through simulations the effect of the mechanisms on the tradeoff between network throughput and fair access.","cites":"12","conferencePercentile":"64"},{"venue":"Wireless Communications and Mobile Computing","id":"33a21b87d48a5594ccb965082226d0bbbb0ebfb6","venue_1":"Wireless Communications and Mobile Computing","year":"2011","title":"CoRoute: a new cognitive anypath vehicular routing protocol","authors":"Wooseong Kim, Mario Gerla, Soon-Young Oh, Kevin C. Lee, Andreas Kassler","author_ids":"5732050, 8467438, 1713739, 8035942, 1753559","abstract":"—Vehicular communications promise to bring us safer driving and better traffic control. Dedicated Short Range Communications (DSRC) and IEEE 802.11p are now well established standards for the inter-vehicle and vehicle-to-road side unit (RSU) communication. These channels, however, are of limited capacity and are not sufficient to support the broad range of services envisioned in VANETs. Thus, vehicles will utilize WiFi (802.11 a/b/g) and unlicensed ISM band to acquire more capacity. Unfortunately, the WiFi channels in urban area are already heavily subscribed by residential customers. In this paper, we propose CoVanet, a cognitive vehicular ad hoc network architecture that allows vehicles opportunistic access to WiFi channels. CoVanet is the first approach to use cognitive radios in a VANET. It differs from conventional cognitive radio strategies in that it uses unlicensed band and operates in an ad hoc, multihop mode. In CoVanet, network topology and channel environment change frequently due to high node mobility. The main contribution of this work is a Cognitive Ad hoc Vehicular Routing Protocol (CoRoute) that utilizes geographical location and sensed channel information. Simulation results demonstrate CoRoute efficiency and robustness to mobility and external interference.","cites":"9","conferencePercentile":"85.86956522"},{"venue":"Wireless Communications and Mobile Computing","id":"1b3bb73e5519285087d97be01ae8372c185e3727","venue_1":"Wireless Communications and Mobile Computing","year":"2012","title":"Providing and finding k-road-coverage efficiently in wireless sensor networks","authors":"XuFei Mao, XiaoHua Xu, Shaojie Tang, Xiang-Yang Li","author_ids":"1751552, 1745553, 1682309, 1744005","abstract":"In this paper, we study k-road-coverage problems in wireless sensor networks (WSNs). Assume there is a 2-dimensional area with a given road map R = (V, E) where E contains all road segments and V consists of all intersection points on. The first question we study is about 'sensor deployment', i.e., how to deploy a minimum number of sensor nodes on such that each path (each road segment) on R is k-covered when all sensor nodes have the same sensing range. When sensors can only be deployed in a set of discrete locations, we propose an efficient method with the approximation ratio 6 + for the special case where k = 1 and O(k) generally. If sensors can be deployed in arbitrary locations, we propose an efficient method with the approximation ratio 24 + when k = 1 and O(k) generally. The second question we study is about 'path query', i.e., how to find the k-covered path or k-support path connecting any given source/destination pair of points on the road map R. Basically, given any source/destination pair of points S and D, we present two algorithms which can efficiently find a k-covered path connecting S and D and a k-supported path connecting S and D, respectively.","cites":"0","conferencePercentile":"15.38461538"},{"venue":"Wireless Communications and Mobile Computing","id":"080ecc6aa86d5974843034bc812aa659e76803ed","venue_1":"Wireless Communications and Mobile Computing","year":"2012","title":"Cross-layer design for topology control and routing in MANETs","authors":"Khoriba Ghada, Jie Li, Yusheng Ji","author_ids":"1718373, 1684133, 7753600","abstract":"A mobile ad hoc network (MANET) is a self-organized and adaptive wireless network formed by dynamically gathering mobile nodes. Since the topology of the network is constantly changing, the issue of routing packets and energy conservation become challenging tasks. In this paper, we propose a cross-layer design that jointly considers routing and topology control taking mobility and interference into account for MANETs. We called the proposed protocol as Mobility-aware Routing and Interference-aware Topology control (MRIT) protocol. The main objective of the proposed protocol is to increase the network lifetime, reduce energy consumption, and find stable end-to-end routes for MANETs. We evaluate the performance of the proposed protocol by comprehensively simulating a set of random MANET environments. The results show that the proposed protocol reduces energy consumption rate, end-to-end delay, interference while preserving throughput and network connectivity.","cites":"2","conferencePercentile":"52.56410256"},{"venue":"Wireless Communications and Mobile Computing","id":"a1afb6c4f311101a54f4515afd92ede7046ca127","venue_1":"Wireless Communications and Mobile Computing","year":"2016","title":"On the performance of interference cancelation in D2D-enabled cellular networks","authors":"Chuan Ma, Weijie Wu, Ying Cui, Xinbing Wang","author_ids":"7437055, 1716692, 6102734, 1715597","abstract":"—Device-to-device (D2D) communication underlaying cellular networks is a promising technology to improve network resource utilization. In D2D-enabled cellular networks, the interference among spectrum-sharing links is more severer than that in traditional cellular networks, which motivates the adoption of interference cancellation (IC) techniques at the receivers. However, to date, how IC can affect the performance of D2D-enabled cellular networks is still unknown. In this paper, we present an analytical framework for studying the performance of two IC methods, unconditional interference cancellation (UIC) and successive interference cancellation (SIC), in large-scale D2D-enabled cellular networks using the tools from stochastic geometry. To facilitate the interference analysis, we propose the approach of stochastic equivalence of the interference, which converts the two-tier interference (interference from the cellular tier and D2D tier) to an equivalent single-tier interference. Based on the proposed stochastic equivalence models, we derive the general expressions for the successful transmission probabilities of both cellular uplinks and D2D links in the networks where UIC and SIC are respectively applied. We demonstrate how these IC methods affect the network performance by both analytical and numerical results.","cites":"0","conferencePercentile":"50"},{"venue":"Wireless Communications and Mobile Computing","id":"6316f73f493b7b4b47b72efea1af6f0452747b1b","venue_1":"Wireless Communications and Mobile Computing","year":"2013","title":"Path planning using a mobile anchor node based on trilateration in wireless sensor networks","authors":"Guangjie Han, Huihui Xu, Jinfang Jiang, Lei Shu, Takahiro Hara, Shojiro Nishio","author_ids":"1740233, 3044364, 2241914, 3621967, 1697569, 1717916","abstract":"In wireless sensor networks (WSNs), many applications require sensor nodes to obtain their locations. Now, the main idea in most existing localization algorithms has been that a mobile anchor node (e.g., global positioning system-equipped nodes) broadcasts its coordinates to help other unknown nodes to localize themselves while moving according to a specified trajectory. This method not only reduces the cost of WSNs but also gets high localization accuracy. In this case, a basic problem is that the path planning of the mobile anchor node should move along the trajectory to minimize the localization error and to localize the unknown nodes. In this paper, we propose a Localization algorithm with a Mobile Anchor node based on Trilateration (LMAT) in WSNs. LMAT algorithm uses a mobile anchor node to move according to trilateration trajectory in deployment area and broadcasts its current position periodically. Simulation results show that the performance of our LMAT algorithm is better than that of other similar algorithms.","cites":"13","conferencePercentile":"100"},{"venue":"Wireless Communications and Mobile Computing","id":"afaa3c7d2db073ed9e6a26be6607bc53a23cca4d","venue_1":"Wireless Communications and Mobile Computing","year":"2014","title":"A survey on communication and data management issues in mobile sensor networks","authors":"Chunsheng Zhu, Lei Shu, Takahiro Hara, Lei Wang, Shojiro Nishio, Laurence T. Yang","author_ids":"7883554, 3621967, 1697569, 1783369, 1717916, 1724152","abstract":"Wireless sensor networks (WSNs) which is proposed in the late 1990s have received unprecedented attention, because of their exciting potential applications in military, industrial, and civilian areas (e.g., environmental and habitat monitoring). Although WSNs have become more and more prospective in human life with the development of hardware and communication technologies, there are some natural limitations of WSNs (e.g., network connectivity, network lifetime) due to the static network style in WSNs. Moreover, more and more application scenarios require the sensors in WSNs to be mobile rather than static so as to make traditional applications in WSNs become smarter and enable some new applications. All this induce the mobile wireless sensor networks (MWSNs) which can greatly promote the development and application of WSNs. However, to the best of our knowledge, there is not a comprehensive survey about the communication and data management issues in MWSNs. In this paper, focusing on researching the communication issues and data management issues in MWSNs, we discuss different research methods regarding communication and data management in MWSNs and propose some further open research areas in MWSNs.","cites":"13","conferencePercentile":"100"},{"venue":"Wireless Communications and Mobile Computing","id":"1103320c18e09fda2f9c5b6300d0b190e0e90468","venue_1":"Wireless Communications and Mobile Computing","year":"2014","title":"An evolutionary spectrum approach to modeling non-stationary fading channels","authors":"Qing Wang, Dapeng Wu, Pingyi Fan","author_ids":"7135234, 1728475, 1734858","abstract":"To evaluate mobile communication systems, it is important to develop accurate and concise fading channel models. However, fading encountered in mobile communication is usually non-stationary, and the existing methods can only model quasi-stationary or piecewise-stationary fading instead of general non-stationary fading. To address this, this paper proposes an evolutionary-spectrum (ES) based approach to modeling non-stationary fading channels. Our ES approach is more general than the existing piecewise-stationary models, and is capable of characterizing a general non-stationary fading channel that has an arbitrary evolutionary spectrum (or time-varying power spectral density); our ES approach is parsimonious, and is also able to generate stationary fading processes. As an example, we show how to apply our ES approach to generating stationary and non-stationary correlated Nakagami-m fading channel processes. Simulation results show that the evolutionary spectrum of the channel gain process produced by our ES-based channel model agrees well with the user-specified evolutionary spectrum, indicating the accuracy of our ES-based channel model.","cites":"0","conferencePercentile":"25.86206897"},{"venue":"Wireless Communications and Mobile Computing","id":"a5e4bcbbd5bb5b1db8c0366872fe5f48e4536f0e","venue_1":"Wireless Communications and Mobile Computing","year":"2006","title":"Geo-LANMAR: a scalable routing protocol for ad hoc networks with group motion","authors":"Biao Zhou, Yeng-Zhong Lee, Mario Gerla, Floriano De Rango","author_ids":"1791395, 2675759, 8467438, 1721408","abstract":"1 Summary Network scalability is one of the critical challenges and requirements in routing protocols for ad hoc networks. This paper presents a novel scalable routing protocol called Geo-LANMAR. The proposed protocol inherits the group motion support of Landmark Routing (LANMAR) and applies the geo-routing concept to deliver packets efficiently. In this framework, the integration between geo-coordinates and table-driven IP addressing is introduced. There is also an integration of group management with geo-forwarding and IP group management. Geo-LANMAR uses link-state propagation over a virtual topology built on landmarks, and a Fisheye like scheme makes this propagation very efficient. The virtual topology helps recover from voids. For extra efficiency, a novel metric called Effective Traveled Distance (ETD) allows us to predict voids or obstacles. With respect to LANMAR, Geo-LANMAR reduces advertisement update overhead and features robust forwarding. Consequently, Geo-LANMAR is more scalable to large ad hoc networks with group motion. The performance evaluation of Geo-LANMAR shows that Geo-LANMAR gives high scalability for large networks in terms of control overhead, end-to-end delay, and packet delivery ratio as compared with other routing protocols such as AODV, LANMAR and GPSR.","cites":"8","conferencePercentile":"59.75609756"},{"venue":"Wireless Communications and Mobile Computing","id":"0dce122c4a7a0b65029fdb51e194ce01534c152d","venue_1":"Wireless Communications and Mobile Computing","year":"2006","title":"Mobility changes anonymity: new passive threats in mobile ad hoc networks","authors":"Xiaoyan Hong, Jiejun Kong, Mario Gerla","author_ids":"1696277, 1779807, 8467438","abstract":"— Privacy in mobile ad hoc networks has new semantics in addition to the conventional notions for infrastructure networks. Mobility enabled by wireless communication has significantly changed privacy issues and anonymity research in many ways. In particular, mobility requires ad hoc routing schemes to transmit messages frequently in an open wireless medium. The routing traffic facilitates adversaries in conducting various attacks threatening the network security and privacy. In this work, we focus on passive routing attacks. We present an extensive study on new anonymity threats and classify the corresponding security demands into three new categories: (1) venue anonymity, (2) privacy of ad hoc network topology, and (3) privacy of motion pattern. These new aspects are all introduced by mobility and left unaddressed in fixed infrastructure. This leads us to investigate new design principles. Our study suggests that on-demand routing, identity-free routing and neighborhood traffic mixing are better design choices to defend against the new anonymity threats in mobile networks. The paper also demonstrates through examples on the visualization of the mobile anonymity attacks and on the quantification of the effectiveness of the attacks.","cites":"16","conferencePercentile":"84.14634146"},{"venue":"Wireless Communications and Mobile Computing","id":"5ce639d73adce7dec93dbc70b49254d4b4d7b167","venue_1":"Wireless Communications and Mobile Computing","year":"2016","title":"Code pruning in opportunistic routing through bidirectional coding traffic comparison","authors":"Weiping Wang, Xiaozhuan Chen, Mingming Lu, Jianxin Wang, Xi Zhang, Jie Wu","author_ids":"1960757, 3373266, 2057267, 8653176, 1744517, 1717209","abstract":"Opportunistic routing (OR) significantly improves transmission reliability and network throughput in wireless mesh networks (WMNs) by utilizing the broadcast nature of the wireless medium. Through the integration of network coding (NC), the complicated coordination to select the best forwarding node in OR can be bypassed. However, the introduction of NC exacerbates the redundant-packet-transmission problem. To mitigate this issue , existing coded OR protocols either adopt the loss-rate-based approach, employ orthogonal vectors as coded feedback, or pursue the stream-based coded OR model. However, these three solutions suffer inaccuracy and obsolescence of the loss-rate measurement, false-positive/false-negative problem , and unavailability of hop-by-hop stream-based OR, respectively. To address the above problems, we propose a simple but practical coded feedback scheme, Cumulative Coding Coefficient ACKnowledgement (C 3 ACK), based on the relevance between forward (coded packets received from upstream nodes) and backward coding traffic (coded packets overheard from downstream nodes), and apply C 3 ACK to both batch-based and stream-based coded OR models in order to prune redundant forward and backward coding traffic. Both testbed evaluation and simulation study show that our code-pruning schemes can outperform existing approaches in terms of expected throughput and transmission count. Send or not to send? Figure 1: The illustration of the collective-space problem.","cites":"0","conferencePercentile":"50"},{"venue":"Wireless Communications and Mobile Computing","id":"b6dc01a33ac63de918dc92c0954590773f1b31d6","venue_1":"Wireless Communications and Mobile Computing","year":"2002","title":"Adaptive security for multilevel ad hoc networks","authors":"Jiejun Kong, Haiyun Luo, Kaixin Xu, Daniel Lihui Gu, Mario Gerla, Songwu Lu","author_ids":"1779807, 1770816, 3025155, 3266556, 8467438, 1743854","abstract":"Secure communication is critical in military environments in which the network infrastructure is vulnerable to various attacks and compromises. A conventional centralized solution breaks down when the security servers are destroyed by the enemies. In this paper we design and evaluate a security framework for multilevel ad hoc wireless networks with unmanned aerial vehicles (UAVs). In battlefields, the framework adapts to the contingent damages on the network infrastructure. Depending on the availability of the network infrastructure, our design is composed of two modes. In infrastructure mode, security services, specifically the authentication services, are implemented on UAVs that feature low overhead and flexible managements. When the UAVs fail or are destroyed, our system seamlessly switches to infrastructureless mode, a backup mechanism that maintains comparable security services among the surviving units. In the infrastructureless mode, the security services are localized to each node's vicinity to comply with the ad hoc communication mechanism in the scenario. We study the instantiation of these two modes and the transitions between them. Our implementation and simulation measurements confirm the effectiveness of our design. KEY WORDS wireless security adaptive security ad hoc network heterogeneous wireless network distributed certification authority (CA) threshold secret sharing partial CA","cites":"14","conferencePercentile":"59.09090909"},{"venue":"Wireless Communications and Mobile Computing","id":"ba35940f150021abba125fa82278ed56f90118ea","venue_1":"Wireless Communications and Mobile Computing","year":"2012","title":"Effective capacity of a correlated Nakagami-m fading channel","authors":"Qing Wang, Dapeng Wu, Pingyi Fan","author_ids":"7135234, 1728475, 1734858","abstract":"The grail of next-generation wireless networks is providing real-time services for delay-sensitive applications, which require that the wireless networks provide QoS guarantees. The effective capacity (EC) proposed by Wu and Negi provides a powerful tool for design of QoS provisioning mechanisms. In this paper, we intend to generalize their formula for the effective capacity of a correlated Rayleigh fading channel; specifically, we derive a closed form approximate EC formula for a special correlated Nakagami-m fading channel, for which the inverse of the correlation coefficient matrix is tridiagonal. To verify its accuracy via simulation, we develop a Green-matrix based approach, which allows us to analytically obtain the effective capacity (given the joint probability density function of a correlated Nakagami-m fading channel) while being able to simulate the corresponding channel gain process. Simulation results show that our EC formula is accurate. Furthermore, to facilitate the application of the EC theory to the design of practical QoS provisioning mechanisms, we propose a simple algorithm for estimating the EC of an arbitrary correlated Nakagami-m fading channel, given channel measurements; simulation results demonstrate the accuracy of our proposed EC estimation algorithm, showing its suitability in practice.","cites":"6","conferencePercentile":"91.02564103"},{"venue":"Wireless Communications and Mobile Computing","id":"6961a2c6d70e5d13ba49d83abd7392e165f7640b","venue_1":"Wireless Communications and Mobile Computing","year":"2011","title":"Effective capacity of a correlated Rayleigh fading channel","authors":"Qing Wang, Dapeng Wu, Pingyi Fan","author_ids":"7135234, 1728475, 1734858","abstract":"The next generation wireless networks call for quality of service (QoS) support. The effective capacity (EC) proposed by Wu and Negi provides a powerful tool for the design of QoS provisioning mechanisms. In their previous work, Wu and Negi derived a formula for effective capacity of a Rayleigh fading channel with arbitrary Doppler spectrum. However, their paper did not provide simulation results to verify the accuracy of the EC formula derived in their paper. This is due to difficulty in simulating a Rayleigh fading channel with a Doppler spectrum of continuous frequency, required by the EC formula. To address this difficulty, we develop a verification methodology based on a new discrete-frequency EC formula; different from the EC formula developed by Wu and Negi, our new discrete-frequency EC formula can be used in practice. Through simulation, we verify that the EC formula developed by Wu and Negi is accurate. Furthermore, to facilitate the application of the EC theory to the design of practical QoS provisioning mechanisms in wireless networks, we propose a spectral-estimation-based algorithm to estimate the EC function, given channel measurements; we also analyze the effect of spectral estimation error on the accuracy of EC estimation. Simulation results show that our proposed spectral-estimation-based EC estimation algorithm is accurate, indicating the excellent practicality of our algorithm.","cites":"9","conferencePercentile":"85.86956522"},{"venue":"Wireless Communications and Mobile Computing","id":"f2b3c51d6cd34f1bd834c337e3a44c8c68b8ea2f","venue_1":"Wireless Communications and Mobile Computing","year":"2011","title":"Medium access control in vehicular ad hoc networks","authors":"Supeng Leng, Huirong Fu, Qing Wang, Yan Zhang","author_ids":"1760778, 1705582, 7135234, 3397732","abstract":"Cooperative intelligent transport systems (C-ITS), where vehicles cooperate by exchanging messages wirelessly to avoid, for example, hazardous road traffic situations, receive a great deal of attention throughout the world currently. Many C-ITS applications will utilize the wireless communication technology IEEE 802.11p, which offers the ability of direct communication between vehicles, i.e., ad hoc communication, for up to 1000 meters. In this thesis, medium access control (MAC) protocols for vehicular ad hoc networks (VANET) are scrutinized and evaluated. The MAC protocol decides when a station has the right to access the shared communication channel and schedules transmissions to minimize the interference at receiving stations. A VANET is a challenging network for the MAC protocol because the number of stations in is unknown a priori and cannot be bounded. Therefore, the scalability of the MAC method has a major influence on the performance of C-ITS applications. Two different MAC protocols are studied: carrier sense multiple access (CSMA) of 802.11p and self-organizing time division multiple access (STDMA). These two MAC methods are examined with respect to the communication requirements and protocol settings arising from C-ITS standardization. Based on these constraints, suitable performance measures are derived such as MAC-to-MAC delay and detection distance, where the former catches both the delay and reliability. In STDMA, the channel access delay is upper-bounded and therefore known before transmission, since regardless of the number of stations within radio range, all stations are always guaranteed timely channel access. In CSMA, the channel access delay is not upper-bounded and it is unknown until transmission commences, as it is based on the instantaneous channel load and stations can experience a random delay when in backoff. The evaluation of CSMA and STDMA is performed through extensive computer simulations, modelling a 10 km highway with six lanes in each direction. Vehicles travel along the highway and broadcast position messages periodically with different update rates. Two different channel models have been used during the evaluations, one distinguishing between a receiver being in line-of-sight (LOS) or obstructed LOS (OLOS) from the transceiver, while the other does not consider this. The simulation results, for both channel models, show that CSMA has on average a smaller channel access delay than STDMA. However, the results also reveal that STDMA always achieves a better reliability than CSMA, especially for distances of 100-500 meters between transmitter and receiver. The distance, at which approaching stations receive the first messages from each …","cites":"4","conferencePercentile":"66.30434783"},{"venue":"Wireless Communications and Mobile Computing","id":"2aa22d6ea03c16fac2c8c89d8f3a7d1cf67f7bd3","venue_1":"Wireless Communications and Mobile Computing","year":"2009","title":"A software-defined radio based cognitive radio demonstration over FM band","authors":"Ruolin Zhou, Omer Mian, Xue Li, Bin Wang, Zhiqiang Wu","author_ids":"2707870, 3293711, 6990205, 1726439, 1691833","abstract":"In this paper, we present a software defined radio (SDR) based cognitive radio implementation and demonstration. Using GNU Radio and USRP SDR boards, we implement and demonstrate a cognitive radio that detects spectrum holes in the FM band and exploits the available spectrum holes to transmit digital and analog data without interfering the existing FM transmission. Moreover, we demonstrate that when a primary user's transmission starts over the original spectrum holes, the cognitive radio automatically adapts its transmission to avoid interference to the newly coming primary user. Additionally, we have implemented and demonstrated a frequency hopping over multiple spectrum holes to support multiple secondary users with minimum interference to each other.","cites":"4","conferencePercentile":"50"},{"venue":"Wireless Communications and Mobile Computing","id":"5a35df79d720d6d7a4db440b9785de50f7738165","venue_1":"Wireless Communications and Mobile Computing","year":"2010","title":"Throughput Improvement and Its Tradeoff with The Queuing Delay in the Diamond Relay Networks","authors":"Qing Wang, Pingyi Fan, Khaled Ben Letaief","author_ids":"7135234, 1734858, 1731974","abstract":"Diamond relay channel model, as a basic transmission model, has recently been attracting considerable attention in wireless Ad Hoc networks. Node cooperation and opportunistic scheduling scheme are two important techniques to improve the performance in wireless scenarios. In the paper we consider such a problem how to efficiently combine opportunistic scheduling and cooperative modes in the Rayleigh fading scenarios. To do so, we first compare the throughput of SRP (Spatial Reused Pattern) and AFP (Amplify Forwarding Pattern) in the half-duplex case with the assumption that channel side information is known to all and then come up with a new scheduling scheme. It will that that only switching between SRP and AFP simply does little help to obtain an expected improvement because SRP is always superior to AFP on average due to its efficient spatial reuse. To improve the throughput further, we put forward a new processing strategy in which buffers are employed at both relays in SRP mode. By efficiently utilizing the links with relatively higher gains, the throughput can be greatly improved at a cost of queuing delay. Furthermore, we shall quantitatively evaluate the queuing delay and the tradeoff between the throughput and the additional queuing delay. Finally, to realize our developed strategy and make sure it always run at stable status, we present two criteria and an algorithm on the selection and adjustment of the switching thresholds .","cites":"0","conferencePercentile":"17.5"},{"venue":"Wireless Communications and Mobile Computing","id":"5122784528caefe04e425382a2833bc5419d93d3","venue_1":"Wireless Communications and Mobile Computing","year":"2001","title":"Resource management in power-controlled cellular wireless systems","authors":"Mingbo Xiao, Ness B. Shroff, Edwin K. P. Chong","author_ids":"2054353, 1750487, 1744311","abstract":"The efficient management of wireless resource is essential to the success of wireless systems. While power control is traditionally considered as a means to counteract the detrimental effects of channel fading, it is also a flexible mechanism to provide Quality of Service to individual users, and can be used as a platform for radio resource management. In this paper, we review the developments of distributed power control and related resource management problems in cellular wireless systems. We highlight the feasibility issue in a power-controlled system, which enables us to push the system toward high efficiency, and prevent the system from collapsing at the same time. Considering the unique features of multimedia traffic to be supported in future wireless systems, we also review power and rate control schemes proposed for wireless data, and present a framework for utility-based power control as a possible candidate for distributed power control of multimedia wireless systems. KEY WORDS power control admission control channel allocation rate control signal-to-interference ratio cellular system wireless resource management","cites":"9","conferencePercentile":"42.85714286"},{"venue":"Wireless Communications and Mobile Computing","id":"1b592c44078d32f9ac666e13ed4b18ce8505f92a","venue_1":"Wireless Communications and Mobile Computing","year":"2003","title":"Energy efficient routing protocols for mobile ad hoc networks","authors":"Chansu Yu, Ben Lee, Hee Yong Youn","author_ids":"1733655, 1708098, 1718666","abstract":"Although establishing correct and efficient routes is an important design issue in mobile ad hoc networks (MANETs), a more challenging goal is to provide energy efficient routes because mobile nodes' operation time is the most critical limiting factor. This article surveys and classifies the energy-aware routing protocols proposed for MANETs. They minimize either the active communication energy required to transmit or receive packets or the inactive energy consumed when a mobile node stays idle but listens to the wireless medium for any possible communication requests from other nodes. Transmission power control approach and load distribution approach belong to the former category, and sleep/power-down mode approach belongs to the latter category. While it is not clear whether any particular algorithm or a class of algorithms is the best for all scenarios, each protocol has definite advantages/disadvantages and is well suited for certain situations. The purpose of this paper is to facilitate the research efforts in combining the existing solutions to offer a more energy efficient routing mechanism.","cites":"63","conferencePercentile":"88.46153846"},{"venue":"Wireless Communications and Mobile Computing","id":"9ebe16f3ecc5517ca39da0a21a2c35fde7d06611","venue_1":"Wireless Communications and Mobile Computing","year":"2004","title":"How a new realistic mobility model can affect the relative performance of a mobile networking scheme","authors":"Tuna Tugcu, Cem Ersoy","author_ids":"1959792, 1767459","abstract":"The validity of the mobility model used to evaluate a cellular network determines the validity of the evaluation. In the literature, unrealistic assumptions on mobility are exercised for the sake of simplicity. In this paper, we present a novel mobility model which is realistic in the sense that it captures the moving-in-groups, conscious traveling and inertial behaviours of the subscribers while respecting the non-pass-through feature of structures like households and preserving the autonomy of the subscribers. The mobility and call patterns of the subscribers are determined according to the locus of the subscriber over a real map. Thus, our model allows the subscribers to leave home or arrive home, walk or drive in the streets, get on the highways at specific entry points together with numerous hot and blind spots in the terrain, like city centers and lakes. The call pattern of a subscriber is affected by the type of structure he is in. The model can work on real maps to simulate the mobility patterns in real life. We have evaluated the proposed model against the well-known way point mobility model. We also analyzed the effect of the mobility model on systems with and without guard channels.","cites":"6","conferencePercentile":"48.27586207"},{"venue":"Wireless Communications and Mobile Computing","id":"de8f20043dd55f1b66ec0853a3d4768c84f63391","venue_1":"Wireless Communications and Mobile Computing","year":"2009","title":"QoS-aware target coverage in wireless sensor networks","authors":"Yu Gu, Yusheng Ji, Jie Li, Baohua Zhao","author_ids":"1790377, 7753600, 1684133, 1729034","abstract":"Wireless sensor networks have emerged recently as an effective way of monitoring remote or inhospitable physical targets, which usually have different Quality of Service (QoS) constraints, i.e., different targets may need different sensing quality in terms of the number of transducers, sampling rate, etc. In this paper, we address the problem of optimizing network lifetime while capturing those diversified QoS coverage constraints in such surveillance sensor networks. We show that this problem belongs to NP-complete class. We define a subset of sensors meeting QoS requirements as a coverage pattern, and if the full set of coverage patterns is given, we can mathematically formulate the problem. Directly solving this formulation however is difficult since number of coverage patterns may be exponential to number of sensors and targets. Hence, a column generation (CG) based approach is proposed to decompose the original formulation into two sub problems and solve them iteratively. Here a column corresponds to a feasible coverage pattern, and the idea is to find a column with steepest ascent in lifetime, based on which we iteratively search for the maximum lifetime solution. An initial feasible set of patterns is generated through a novel random selection algorithm, in order to launch our approach. Experimental data demonstrate that the proposed CG-based approach is an efficient solution, even in a harsh environment. Simulation results also reveal the impact of different network parameters on network lifetime, giving certain guidance on designing and maintaining such surveillance sensor networks.","cites":"7","conferencePercentile":"70.58823529"},{"venue":"Wireless Communications and Mobile Computing","id":"3fc79431878ceecfb7110d1b14459926d72d7b5b","venue_1":"Wireless Communications and Mobile Computing","year":"2009","title":"Stability-aware multi-metric clustering in mobile ad hoc networks with group mobility","authors":"Hui Cheng, Jiannong Cao, Xingwei Wang, Sajal K. Das, Shengxiang Yang","author_ids":"3921304, 7468291, 1692648, 1734537, 7388617","abstract":"Clustering can help aggregate the topology information and reduce the size of routing tables in a mobile ad hoc network (MANET). The maintenance of the cluster structure should be as stable as possible to reduce overhead and make the network topology less dynamic. Hence, stability measures the goodness of clustering. However, for a complex system like MANET, one clustering metric is far from reflecting the network dynamics. Some prior works have considered multiple metrics by combining them into one weighted sum, which suffers from intrinsic drawbacks as a scalar objective function to provide solution for multi-objective optimization. In this paper, we propose a stability-aware multi-metric clustering algorithm, which can (1) achieve stable cluster structure by exploiting group mobility and (2) optimize multiple metrics with the help of a multi-objective evolutionary algorithm (MOEA). Performance evaluation shows that our algorithm can generate a stable clustered topology and also achieve optimal solutions in small-scale networks. For large-scale networks, it outperforms the well-known weighted clustering algorithm (WCA) that uses a weighted sum of multiple metrics.","cites":"7","conferencePercentile":"70.58823529"},{"venue":"Wireless Communications and Mobile Computing","id":"4f74a046f1d8537f472a75e391625a668eaf7481","venue_1":"Wireless Communications and Mobile Computing","year":"2006","title":"Mobility control for throughput maximization in ad hoc networks","authors":"Tamer Nadeem, Srinivasan Parthasarathy","author_ids":"2459493, 1773508","abstract":"Physical topology of an ad hoc wireless network imposes fundamental limits on its throughput capacity. In this work, we present a network design algorithm for configuring node locations in an 802.11 ad hoc network with the goal of improving the throughput capacity of the network. Given a network configuration (i.e., a mapping of network nodes to physical locations), we establish an inverse proportional relationship between the interference degree of the network and the guaranteed link-throughput. Motivated by this observation, we present an algorithm which progressively guides the network towards better configurations with lower interference degrees, which in turn increases the network's throughput capacity. Packet level simulations using the ns-2 simulator shows that the reconfigured topologies obtained by our algorithm consistently outperform the original network topologies for throughput and delay-related metrics. In particular, for many cases, we observed over 100% increase in the total network throughput and the minimum guaranteed throughput, over 60% increase in throughput fairness and over 50% reduction in the mean-service delay of packets. Our algorithm admits a simple distributed implementation and can be viewed as a distributed mobility control primitive for improving the throughput performance of mobile ad hoc networks. Alternately, our techniques can also be employed by a centralized designer during network creation time to obtain a network configuration with a high throughput capacity. To the best of our knowledge, ours is the first work which explores the use of guided network configuration strategies for improving the throughput capacity in ad hoc wireless networks.","cites":"8","conferencePercentile":"59.75609756"},{"venue":"Wireless Communications and Mobile Computing","id":"07ecdf06d61c235b7ed61ac6152d90cdcb70ebc0","venue_1":"Wireless Communications and Mobile Computing","year":"2013","title":"Cooperative communications with relay selection for wireless networks: design issues and applications","authors":"Xuedong Liang, Min Chen, Ilangko Balasingham, Victor C. M. Leung","author_ids":"1754312, 1711628, 1710030, 3598400","abstract":"Relay selection schemes for cooperative communications to achieve full cooperative diversity gains while maintaining spectral and energy efficiency have been extensively studied in recent research. These schemes select only the best relay from multiple relaying candidates to cooperate with a communication link. In this paper, we review recently proposed cooperative communication protocols which integrate with relay selection mechanisms. The key design issues for relay selection mechanisms, e.g., relaying candidate selection, optimal relay assignment, and cooperative transmission, are identified. We further discuss the challenges of optimal relay assignment in multi-hop wireless sensor networks, and present the potential applications of cooperative communications with relay selection in such networks. Future research directions are outlined, e.g., the issues of service differentiation and system fairness in cooperative communication systems, and the joint use of game theory and machine learning techniques in relaying candidate selection and optimal relay assignment mechanisms for efficient allocation of network resources.","cites":"3","conferencePercentile":"70.58823529"},{"venue":"Wireless Communications and Mobile Computing","id":"2ed2c8bcbeab77a631b58e8d60e924497e2914aa","venue_1":"Wireless Communications and Mobile Computing","year":"2008","title":"Fixed channel assignment algorithm for multi-radio multi-channel MESH networks","authors":"Hamed M. K. Alazemi, Arindam Das, Rajiv Vijayakumar, Sumit Roy","author_ids":"2218491, 2400714, 1955196, 1689296","abstract":"Recently, multi-radio mesh technology in wireless networks has been under extensive research. This is because of its potential of overcoming the inherent wireless multi-hop throughput, scalability and latency problems caused by the half-duplex nature of the IEEE 802.11. The concept of deploying multiple radios in wireless network access points (APs) has shown a promising way to enhance the channel selection and the route formation while the MESH topology allows more fine-grained interference management and topology control. Within this realm, given a set of end-to-end objectives, there are multiple issues that need to be identified when we consider the optimization problem for fixed multi-channel multi-hop wireless networks with multiple radios. This paper addresses the static channel assignment problem for multichannel multi-radio static wireless mesh networks. We first discuss its similarities and differences with the channel assignment problem in cellular networks (WMN). Next, we present four metrics based on which mesh channel assignments can be obtained. Three of these metrics attempt to maximize simultaneous transmissions in a mesh network, either directly or indirectly. The fourth metric quantifies the 'diversity' of a particular assignment and can be used as a secondary criterion to the other three metrics. Related optimization models have also been developed.","cites":"8","conferencePercentile":"82.14285714"},{"venue":"Wireless Communications and Mobile Computing","id":"a848739fac82ef935ba87c900a9209a0b986c759","venue_1":"Wireless Communications and Mobile Computing","year":"2004","title":"Adapting physical carrier sensing to maximize spatial reuse in 802.11 mesh networks","authors":"Jing Zhu, Xingang Guo, L. Lily Yang, W. Steven Conner, Sumit Roy, Mousumi Mitra Hazra","author_ids":"4076668, 2525708, 1822091, 3213815, 1689296, 2200119","abstract":"Spatial reuse in a mesh network can allow multiple communications to proceed simultaneously, hence proportionally improve the overall network throughput. To maximize spatial reuse, the MAC protocol must enable simultaneous transmitters to maintain the minimal separation distance that is sufficient to avoid interference. This paper demonstrates that physical carrier sensing enhanced with a tunable sensing threshold is effective at avoiding interference in 802.11 mesh networks without requiring the use of virtual carrier sensing. We present an analytical model for deriving the optimal sensing threshold given network topology, reception power, and data rate. A distributed adaptive scheme is also presented to dynamically adjust the physical carrier sensing threshold based on periodic estimation of channel conditions in the network. Simulation results are shown for large-scale 802.11b and 802.11a networks to validate both the analytical model and the adaptation scheme. It is demonstrated that the enhanced physical carrier sensing mechanism effectively improves network throughput by maximizing the potential of spatial reuse. With dynamically tuned physical carrier sensing, the end to end throughput approaches 90% of the predicted theoretical upper-bound assuming a perfect MAC protocol, for a regular chain topology of 90 nodes.","cites":"74","conferencePercentile":"96.55172414"},{"venue":"Wireless Communications and Mobile Computing","id":"e126ecb5e935fdf48567dd0a6995d48f37b2e2b2","venue_1":"Wireless Communications and Mobile Computing","year":"2002","title":"Hierarchical routing in ad hoc mobile networks","authors":"Elizabeth M. Belding-Royer","author_ids":"2377614","abstract":"Clustering is a method by which nodes are hierarchically organized on the basis of their relative proximity to one another. Routes can be recorded hierarchically, across clusters, to increase routing flexibility. Hierarchical routing greatly increases the scalability of routing in ad hoc networks by increasing the robustness of routes. This paper presents the Adaptive Routing using Clusters (ARC) protocol, a protocol that creates a cluster hierarchy composed of cluster leaders and gateway nodes to interconnect clusters. ARC introduces a new algorithm for cluster leader revocation that eliminates the ripple effect caused by leadership changes. Further, ARC utilizes a limited broadcast algorithm for reducing the impact of network floods. The performance of ARC is evaluated by comparing it both with other clustering schemes and with an on-demand ad hoc routing protocol. It is shown that the cluster topology created by ARC is more stable than that created by other clustering algorithms and that the use of ARC can result in throughput increases of over 100%.","cites":"32","conferencePercentile":"81.81818182"},{"venue":"Wireless Communications and Mobile Computing","id":"f8b0bb825e675198f35280d309de6fd3d14decbb","venue_1":"Wireless Communications and Mobile Computing","year":"2013","title":"HUBCODE: hub-based forwarding using network coding in delay tolerant networks","authors":"Shabbir Ahmed, Salil S. Kanhere","author_ids":"1793431, 1733096","abstract":"Most people-centric delay tolerant networks have been shown to exhibit power-law behavior. Analysis of the temporal con-nectivity graph of such networks reveals the existence of hubs, a fraction of the nodes, which are collectively connected to the rest of the nodes. In this paper, we propose a novel forwarding strategy called HubCode, which seeks to use the hubs as message relays. The hubs employ random linear network coding to encode multiple messages addressed to the same destination, thus reducing the forwarding overheads. Further, the use of the hubs as relays ensures that most messages are delivered to the destinations. Two versions of HubCode are presented, with each scheme exhibiting contrasting behavior in terms of the computational costs and routing overheads. We formulate a mathematical model for message delivery delay and present a closed-form expression for the same. We validate our model and demonstrate the efficacy of our solutions in comparison with other forwarding schemes by simulating a large-scale vehicular delay tolerant network using empirically collected movement traces of a city-wide public transport network. Under pragmatic assumptions, which account for short contact durations between nodes, our schemes outperform comparable strategies by more than 20%.","cites":"6","conferencePercentile":"94.11764706"},{"venue":"Wireless Communications and Mobile Computing","id":"fa50b26f9b6472d1240faa19b132823aeb21c72d","venue_1":"Wireless Communications and Mobile Computing","year":"2009","title":"MeshMon: a multi-tiered framework for wireless mesh network monitoring","authors":"Ramya Raghavendra, Prashanth Aravinda Kumar Acharya, Elizabeth M. Belding-Royer, Kevin C. Almeroth","author_ids":"1787509, 2567345, 2377614, 3131174","abstract":"Monitoring and troubleshooting a large wireless mesh network presents several challenges. Diagnosis of problems related to wireless access in these networks requires a comprehensive set of metrics and network monitoring data. Collection and offloading of a large amount of data is infeasible in a bandwidth constrained mesh network. Additionally, the processing required to analyze data from the entire network restricts the scalability of the system and impacts the ability to perform real-time fault diagnosis. To this end, we propose MeshMon, a network monitoring framework that includes a multi-tiered method of data collection. MeshMon dynamically controls the granularity of data collection based on observed events in the network, thereby achieving significant bandwidth savings and enabling real-time automated management. Our evaluation of MeshMon on a real testbed shows that we can diagnose a majority (87%) of network faults with a 66% savings in bandwidth required for network monitoring.","cites":"5","conferencePercentile":"58.82352941"},{"venue":"Wireless Communications and Mobile Computing","id":"fbb566d9bfed77167fcc4b2a509e69956e13aabe","venue_1":"Wireless Communications and Mobile Computing","year":"2014","title":"Estimating distances via connectivity in wireless sensor networks","authors":"Baoqi Huang, Changbin Yu, Brian D. O. Anderson, Guoqiang Mao","author_ids":"2906578, 2822746, 1695714, 1681606","abstract":"Distance estimation is vital for localization and many other applications in wireless sensor networks. In this paper, we develop a method that employs a maximum-likelihood estimator (MLE) to estimate distances between a pair of neighboring nodes in static wireless sensor networks using their local connectivity information, namely the numbers of their common and non-common one-hop neighbors. We present the distance estimation method under a generic channel model, including the unit disk (communication) model and the more realistic log-normal (shadowing) model as special cases. Under the log-normal model, we numerically study the bias and standard deviation associated with our method and show that for long distances our method outperforms the method based on received signal strength (RSS); we investigate the impact of the log-normal model uncertainty; we provide a Cramér-Rao lower bound (CRLB) analysis for the problem of estimating distances via connectivity and derive helpful guidelines for implementing our method. Finally, on applying the proposed method based on realistic measurement data and also in connectivity-based sensor localization, the superiority of the proposed method is confirmed.","cites":"0","conferencePercentile":"25.86206897"},{"venue":"Wireless Communications and Mobile Computing","id":"5120aa249fc8f4d85e36802531cc64ec2d46b0fd","venue_1":"Wireless Communications and Mobile Computing","year":"2010","title":"Towards utility-optimal random access without message passing","authors":"Jiaping Liu, Yung Yi, Alexandre Proutière, Mung Chiang, H. Vincent Poor","author_ids":"3322290, 1699465, 2265816, 1683977, 1717259","abstract":"It has been recently suggested by Jiang and Walrand that adaptive carrier sense multiple access (CSMA) can achieve optimal utility without any message passing in wireless networks. In this paper, after a survey of recent work on random access, a generalization of this algorithm is considered. In the continuous-time model, a proof is presented of the convergence of these adaptive CSMA algorithms to be arbitrarily close to utility optimality, without assuming that the network dynamics converge to an equilibrium in between consecutive CSMA parameter updates. In the more realistic, slotted-time model, the impact of collisions on the utility achieved is characterized, and the tradeoff between optimality and short-term fairness is quantified.","cites":"46","conferencePercentile":"100"},{"venue":"Wireless Communications and Mobile Computing","id":"f808725a917be7e84db6f55ca8461acd8fed88b5","venue_1":"Wireless Communications and Mobile Computing","year":"2012","title":"Energy equilibrium based on corona structure for wireless sensor networks","authors":"Kai Lin, Min Chen","author_ids":"1818304, 1711628","abstract":"Although multi-hop routing can reduce communication consumption and extend network scale, energy hole is unavoidable to appear because of the relay nodes being overloaded due to take more tasks. In this paper, we formulate the energy equilibrium problem as an optimal corona division, where data fusion and data slice are both considered in data gathering process. For a circular multi-hop sensor network with uniform node distribution and constant data reporting, we demonstrate that the energy equilibrium of the whole network is unable to be realized no matter whether data fusion and data slice are adopted. However, the maximum energy equilibrium for a given circular area can be achieved only if the area increases in geometric progression from the outer corona to the neighbor inner corona except for the outermost one. Moreover, we use a zone-based allocation scheme to guarantee energy equilibrium of intra-corona. The approach for computing the optimal parameters is presented in terms of maximizing network lifetime. Based on the mathematical model, we propose an energy equilibrium routing based on corona structure (EERCS). Simulating results validate that EERCS can effectively achieve energy equilibrium and prolong the lifetime of network.","cites":"0","conferencePercentile":"15.38461538"},{"venue":"Wireless Communications and Mobile Computing","id":"d6e2832311ce61ae06329cc5dd3be10a6fd5a5e7","venue_1":"Wireless Communications and Mobile Computing","year":"2011","title":"A pragmatic approach to area coverage in hybrid wireless sensor networks","authors":"Nadeem Ahmed, Salil S. Kanhere, Sanjay Jha","author_ids":"2805204, 1733096, 1679439","abstract":"Success of Wireless Sensor Networks (WSN) largely depends on whether the deployed network can provide desired area coverage with acceptable network lifetime. This paper seeks to address the problem of determining the current coverage achieved by the non-deterministic deployment of static sensor nodes and subsequently enhancing the coverage using mobile sensors. We identify three key elements that are critical for ensuring effective area coverage in Hybrid WSN: (i) determining the boundary of the target region and evaluating the area coverage (ii) locating coverage holes and maneuvering mobile nodes to fill these voids, and (iii) maintaining the desired coverage over the entire operational lifetime of the network. We propose a comprehensive solution that addresses all of the aforementioned aspects of the area coverage, called MAPC (mobility assisted probabilistic coverage). MAPC is a distributed protocol that operates in three distinct phases. The first phase identifies the boundary nodes using the geometric right-hand rule. Next, the static nodes calculate the area coverage and identify coverage holes using a novel probabilistic coverage algorithm (PCA). PCA incorporates realistic sensing coverage model for range-based sensors. The second phase of MAPC is responsible for navigating the mobile nodes to plug the coverage holes. We propose a set of coverage and energy-aware variants of the basic virtual force algorithm (VFA). Finally, the third phase addresses the problem of coverage loss due to faulty and energy depleted nodes. We formulate this problem as an Integer Linear Program (ILP) and propose practical heuristic solutions that achieve similar performance as that of the optimal ILP solution. A guiding principle in our design process has been to ensure that the MAPC can be readily implemented in real-world applications. We implemented the boundary detection and PCA algorithm (i.e., Phase I) of the MAPC protocol on off-the-shelf sensor nodes and results show that the MAPC can successfully identify boundary nodes and accurately determine the area coverage in the presence of real radio irregularities observed during the experiments. Extensive simulations were carried out to evaluate the complete MAPC protocol and the results demonstrate that MAPC can enhance and maintain the area coverage, while reducing the total energy consumption by up to 70% as compared with the basic VFA.","cites":"3","conferencePercentile":"55.43478261"},{"venue":"Wireless Communications and Mobile Computing","id":"9665bc6f94218ef225f2e24ec3ff54d97819f5d2","venue_1":"Wireless Communications and Mobile Computing","year":"2014","title":"The capacity of multi-channel multi-interface wireless networks with multi-packet reception and directional antenna","authors":"Jian Liu, Fangmin Li, Xinhua Liu, Hao Wang","author_ids":"2106964, 2801400, 8015728, 1728073","abstract":"The capacity of wireless networks can be improved by the use of multi-channel multi-interface (MCMI), multi-packet reception (MPR), and directional antenna (DA). MCMI can provide the concurrent transmission in different channels for each node with multiple interfaces; MPR offers an increased number of concurrent transmissions on the same channel; DA can be more effective than omni-DA by reducing interference and increasing spatial reuse. This paper explores the capacity of wireless networks that integrate MCMI, MPR, and DA technologies. Unlike some previous research, which only employed one or two of the aforementioned technologies to improve the capacity of networks, this research captures the capacity bound of the networks with all the aforementioned technologies in arbitrary and random wireless networks. The research shows that such three-technology networks can achieve at most 22 Â p k capacity gain in arbitrary networks and 22 Â Á 2 k capacity gain in random networks compared with MCMI wireless networks without DA and MPR. The paper also explored and analyzed the impact on the network capacity gain with different c m , Â , and k-MPR ability.","cites":"0","conferencePercentile":"25.86206897"},{"venue":"Wireless Communications and Mobile Computing","id":"3924a2d9601dead94f5dfa57976498922a357596","venue_1":"Wireless Communications and Mobile Computing","year":"2001","title":"Energy-efficient wireless networking for multimedia applications","authors":"Paul J. M. Havinga, Gerard J. M. Smit","author_ids":"1679046, 1742628","abstract":"– In this paper we identify the most prominent problems of wireless multimedia networking and present several state-of-the-art solutions with a focus on energy efficiency. Three key problems in networked wireless multimedia systems are 1) the need to maintain a minimum quality of service over time-varying channels, 2) to operate with limited energy resources, and 3) to operate in a heterogeneous environment. We identify two main principles to solve these problems. The first principle is that energy efficiency should involve all layers of the system. Second, Quality of Service is an essential mechanism for mobile multimedia systems not only to give users an adequate level of service, but also as a tool to achieve an energy-efficient system. Due to the dynamic wireless environment, adaptability of the system will be a key issue in achieving this.","cites":"43","conferencePercentile":"85.71428571"},{"venue":"Wireless Communications and Mobile Computing","id":"617fbd03d5b7689822fb44c0351b53b818fd1f01","venue_1":"Wireless Communications and Mobile Computing","year":"2009","title":"Receiver-oriented load-balancing and reliable routing in wireless sensor networks","authors":"Min Chen, Victor C. M. Leung, Shiwen Mao, Ted Taekyoung Kwon","author_ids":"1711628, 3598400, 1733510, 2035642","abstract":"Routing protocols in wireless sensor networks (WSNs) typically employ a transmitter-oriented approach in which the next hop node is selected based on neighbor or network information. This approach incurs a large overhead when the accurate neighbor information is needed for efficient and reliable routing. In this paper, a novel receiver-oriented load-balancing and reliable routing (RLRR) protocol is proposed. In RLRR, an intermediate node solicits next hop candidates, each of which is to respond with its own backoff time dubbed a temporal gradient (TG). In this way, the next hop is selected without any central coordination on a packet-by-packet basis. Thus, each node needs not maintain any neighbor information. The remaining energy level used to determine the TG is always accurate and up-to-date. Furthermore, neighbor nodes whose hop count is less than the soliciting node participate in the next-hop selection process with loop-free operation guarantee. Comprehensive simulations are carried out to show that RLRR achieves relatively longer network lifetime and higher reliability than other existing schemes. Copyright","cites":"14","conferencePercentile":"91.17647059"},{"venue":"Wireless Communications and Mobile Computing","id":"9257fdb52f1392de0521c512cbde4284b534c340","venue_1":"Wireless Communications and Mobile Computing","year":"2011","title":"Architecture and protocol design for a pervasive robot swarm communication networks","authors":"Ming Li, John Harris, Min Chen, Shiwen Mao, Yang Xiao, Walter Read, B. Prabhakaran","author_ids":"1760553, 4087164, 1711628, 1733510, 1699747, 3094369, 1748167","abstract":"There has been increasing interest in deploying a team of robots, or robot swarms, to fulfill certain complicate tasks such as surveillance. Since robot swarms may move to areas of far distance, it is important to have a pervasive networking environment for communications among robots, administrators, and mobile users. In this paper, we first propose a pervasive architecture to integrate wireless mesh networks and robot swarm networks to build a robot swarm communication network within the areas of special interest. Under the proposed architecture, one or more robots can get connected with a nearby mesh router and access the remote server, while a self-organizing mobile ad hoc network is formed within each swarm for communications among the robots. We then address and analyze many important issues and challenges. Finally, we describe our work to enable this architecture through a scalable algorithm for autonomous swarm deployment and ROBOTRAK, a socket-based-swarm monitoring and control toolkit. Extensive simulation results and demonstrations are presented to show the desirable features of the proposed algorithm and toolkit.","cites":"1","conferencePercentile":"30.43478261"},{"venue":"Wireless Communications and Mobile Computing","id":"c877fb71f3c899ede5a8c3452ba0242f049bca71","venue_1":"Wireless Communications and Mobile Computing","year":"2011","title":"A game-theoretic approach for relay assignment over distributed wireless networks","authors":"Xuedong Liang, Min Chen, Victor C. M. Leung","author_ids":"1754312, 1711628, 3598400","abstract":"To achieve full cooperative diversity gains while still maintaining spectral and energy efficiency, relay assignment schemes for cooperative communications have been extensively studied in recent research. These schemes select only the best relay from multiple relaying candidates to cooperate with a communication link. However, it is challenging to find the optimal relay in distributed wireless networks due to the dynamic nature of such networks. In this paper, we first formulate the problem of relay assignment as a non-cooperative, mixed strategy, repeated game, where relaying candidates are modeled as rational players. We then propose a Game Theory based Relay Assignment scheme GTRA, in which each player plays against all the other players, and determines whether to cooperate with a communication link on a packet-by-packet basis in a distributed manner. To adapt to dynamic environments, an adaptive learning algorithm, i.e., modified-regret-matching algorithm, is utilized by players to learn optimal strategies of relay assignment, as well as orienting the game to converge to a set of correlated equilibriums, which is often more system efficient than a Nash equilibrium. To evaluate the performance of GTRA, we compare it with BR, a fictitious two player game based approach. Simulation results have shown that GTRA outperforms BR in terms of network throughput, especially in environments where the channel fading becomes severe. It is also shown that GTRA can converge to a correlated equilibrium in a short period that enables the GTRA to work well in dynamic environments.","cites":"1","conferencePercentile":"30.43478261"},{"venue":"Wireless Communications and Mobile Computing","id":"516d8841c2d7f08f155a15b64191a14db661e0bf","venue_1":"Wireless Communications and Mobile Computing","year":"2009","title":"Switching cost minimization in the IEEE 802.16e mobile WiMAX sleep mode operation","authors":"Gary K. W. Wong, Qian Zhang, Danny H. K. Tsang","author_ids":"8693885, 1737486, 1719756","abstract":"To prolong the battery lifetime, it is important to continue designing a better energy efficient mechanism for different mobile technologies. Most of the existing works on the IEEE 802.16e sleep mode operation focus on the decision making before a mobile station switching to sleep mode state. The correlation of the decision is mainly on <i>when</i> and <i>how</i> to sleep based on the traffic demands. After the mobile station is switched to sleep mode, the deactivation of it mainly depends on new incoming traffic regardless of the actual amount. Truly, frequent switching can increase the energy cost on the mobile station, which can significantly reduce the battery lifetime. To minimize the switching frequency, we propose a novel approach to resolve this issue by making a heuristic decision during the listening interval. With this aim, we propose a real-time heuristic algorithm, <i>WAKSLP_DECISION</i>, to accommodate our target. Three main decision criteria are analyzed and designed, namely the probability of buffer overflow, expected delay violation, and battery lifetime expiry, to achieve our goal. We verify the energy consumption performance with simulation experiments to validate our proposed scheme. The result shows that our scheme performs 25% to 30% better compared with the original standard in terms of energy consumption. We believe this algorithm is practical and implementable without changing the original standard, which can contribute both in the research community and industrial development.","cites":"5","conferencePercentile":"58.82352941"},{"venue":"Wireless Communications and Mobile Computing","id":"0f200012913d3d63850a50e81ff78cd283d7989a","venue_1":"Wireless Communications and Mobile Computing","year":"2006","title":"Traffic-aware routing for real-time communications in wireless multi-hop networks","authors":"Shouyi Yin, Yongqiang Xiong, Qian Zhang, Xiaokang Lin","author_ids":"1700767, 2142901, 1737486, 1729794","abstract":"In this paper, we propose a novel traffic-aware routing metric for Real Time Communications (RTC) in wireless multi-hop networks. Our routing metric, Path Predicted Transmission Time (PPTT), is designed to choose a high-quality path for RTC flow between a source and a destination. PPTT can serve as both single-radio and multi-radio routing metric for RTC flow. Real Time Communications has critical quality of service (QoS) requirements in terms of delay, bandwidth and so on. Traditional measurement-based routing schemes ignore the interference from the coming RTC flow itself (i.e. self-traffic), so they may choose the inefficient path to serve the coming RTC flow due to the inaccurate quality estimation of the transmission path. PPTT takes explicit consideration of both self-traffic and neighboring traffic interfering with the RTC flow, and thus offers an accurate estimation of path transmission delay. Through differentiating the links by the wireless channel/radio they are using, PPTT has the capability to choose a high-quality path for the coming RTC flow in both single-radio and multi-radio networks. To evaluate the performance, we implement PPTT scheme and study its performance in a wireless multi-hop testbed consisting of 32 nodes equipped with two IEEE 802.11 a/b/g combo cards, and we also conduct extensive simulations with different random topologies in network simulator NS2 for a more comprehensive comparison. The results of simulation and experiment show that this routing metric outperforms other non traffic-aware one such as ETX (Expected Transmission Count) and WCETT (Weighted Cumulative Expected Transmission Time) in terms of delay and goodput in both single radio and multi-radio wireless networks.","cites":"8","conferencePercentile":"59.75609756"},{"venue":"Wireless Communications and Mobile Computing","id":"5ed5ad9046888f1e301ca7d217e743e8ba8ae460","venue_1":"Wireless Communications and Mobile Computing","year":"2009","title":"Towards unified radio power management for wireless sensor networks","authors":"Guoliang Xing, Mo Sha, Gregory Hackmann, Kevin Klues, Octav Chipara, Chenyang Lu","author_ids":"7242000, 2891259, 2391730, 2312791, 1699207, 1699384","abstract":"Many wireless sensor networks must sustain long lifetimes on limited energy resources. Two major approaches, transmission power control and sleep scheduling, have been proposed to reduce the radio power consumption in the transmission state and the idle state, respectively. In this paper, we first review existing transmission power control and sleep scheduling approaches and then describe a Unified Radio Power Management framework for the design and implementation of holistic radio power management solutions in wireless sensor networks. It has two key components: (1) a novel optimization approach called Minimum Power Configuration that minimizes the aggregate radio power consumption of all ratio states and (2) a Unified Power Management Architecture (UPMA) that aims to support the flexible cross-layer integration of different power management strategies. A novel feature of UPMA is that it enables cross-layer coordination and joint optimization of different power management strategies that exist at multiple network layers.","cites":"6","conferencePercentile":"64.70588235"},{"venue":"Wireless Communications and Mobile Computing","id":"ccfdd36168a4b44461388f8c821e09b49a2c20a4","venue_1":"Wireless Communications and Mobile Computing","year":"2013","title":"Joint collision resolution and transmit-power adjustment for Aloha-type random access","authors":"Young-June Choi, Kang G. Shin","author_ids":"7452390, 1730051","abstract":"We consider uplink random access for which slotted Aloha has usually been employed with unknown channel conditions. Upon failure of a transmission attempt, a user cannot tell whether the failure was caused by collision with other simultaneously transmitting users or by his use of insufficient transmit power. If a transmission attempt failed due to collision which could have been resolved by retransmission, increasing transmit power would just waste power and, moreover, reduce the other users' chance of successful access. To handle this lack of information on the cause of failure, we propose a novel Cause-of-Failure resolution, where the transmit power is increased after a given number of consecutive unsuccessful access attempts when the probability that a given failure is caused by collision becomes sufficiently low. To exploit the thus-obtained transmit power for the next random access attempt, we also determine the Cause-of-Success based on the number of consecutive successful attempts, i.e., whether to (probabilistically) decrease or maintain the current transmit power. This way, users can adjust their transmit power for random access, which we call Auto Power Fallback (APF), considered as an advanced version of the power ramping algorithm. We evaluate APF by modeling analysis and numerical computation based on the slotted Aloha, showing that APF determines a suitable transmit power for uplink random accesses while achieving good performance.","cites":"0","conferencePercentile":"16.17647059"},{"venue":"Wireless Communications and Mobile Computing","id":"0bd4f39987b6c64517a3894ff421037d8cd20731","venue_1":"Wireless Communications and Mobile Computing","year":"2007","title":"Investigation of multicast-based mobility support in all-IP cellular networks","authors":"Andreas Festag, Holger Karl, Adam Wolisz","author_ids":"3193926, 2742843, 1778337","abstract":"— To solve the IP mobility problem, the use of mul-ticast has been proposed in a number of different approaches, applying multicast in different characteristic ways. We provide a systematic discussion of fundamental options for multicast-based mobility support and the definition and experimental performance evaluation of selected schemes. The discussion is based on an analysis of the architectural, performance-related, and functional requirements. By using these requirements and selecting options regarding network architecture and multicast protocols, we identify promising combinations and derive four case studies for multicast-based mobility in IP-based cellular networks. These case studies include both the standard any-source IP multicast model as well as non-standard multicast models, which optimally utilize the underlying multicast. We describe network architecture and protocols as well as a flexible software environment that allows to easily implement these and other classes of mobility-supporting multicast protocols. Multicast schemes enable a high degree of flexibility for mobility mechanisms in order to meet the service quality required by the applications with minimal protocol overhead. We evaluate this overhead using our software environment by implementing prototypes and quantifying handoff-specific metrics, namely, handoff and paging latency, packet loss and duplication rates, as well as TCP goodput. The measurement results show that these multicast-based schemes improve handoff performance for high mobility in comparison to the reference cases: basic and hierarchical Mobile IP. Comparing the multicast-schemes among each other the performance for the evaluated metrics is very similar. As a result of the conceptual framework classification and our performance evaluations, we justify specific protocol mechanisms that utilize specific features of the multicast. Based on this justification we advocate the usage of a source-specific multicast service model for multicast-based mobility support that adverts the weaknesses of the classical Internet any-source multicast service model.","cites":"7","conferencePercentile":"59.72222222"},{"venue":"Wireless Communications and Mobile Computing","id":"eee3e01a5bd79f899cd2f4bf2889edc6ed7b3e11","venue_1":"Wireless Communications and Mobile Computing","year":"2015","title":"LTPPM: a location and trajectory privacy protection mechanism in participatory sensing","authors":"Sheng Gao, Jianfeng Ma, Weisong Shi, Guoxing Zhan","author_ids":"1726675, 1698458, 1730254, 1754809","abstract":"The ubiquity of mobile devices has facilitated the prevalence of participatory sensing, whereby ordinary citizens use their private mobile devices to collect regional information and to share with participators. However, such applications may endanger the users' privacy by revealing their locations and trajectories information. Most of existing solutions, which hide a user's location information with a coarse region, are under k-anonymity model. Yet, they may not be applicable in some participatory sensing applications that require precise location information. The goals are seemingly contradictory: to protect a user's location privacy while simultaneously providing precise location information for a high quality of service. In this paper, we propose a method to meet both goals. Through selecting a certain number of a user's partners, it can protect the user's location privacy while providing precise location information. The user's trajectory privacy can be protected by constructing several trajectories that are similar to the user's trajectory in an interval time T. Finally, we utilize a new metric, called slope ratio, to evaluate the partners' selection algorithm that we proposed. Then, we measure the privacy level that the location and trajectory privacy protection mechanism (LTPPM) can achieve. The analysis and simulation results show that LTPPM can protect the user's location and trajectory privacy effectively and also provide a high quality of service in participatory sensing.","cites":"2","conferencePercentile":"80"},{"venue":"Wireless Communications and Mobile Computing","id":"1f765d89cf93e3457b6ed2ff2658d9642f6950f8","venue_1":"Wireless Communications and Mobile Computing","year":"2004","title":"A unified bandwidth reservation and admission control mechanism for QoS provisioning in cellular networks","authors":"Sunho Lim, Guohong Cao, Chita R. Das","author_ids":"1941761, 1740564, 1697036","abstract":"We propose a unified framework consisting of a differential bandwidth reservation (DBR) algorithm and a Quality of Service (QoS)-aware admission control scheme to provide QoS guarantees to ongoing connections in cellular networks. The differential bandwidth reservation policy uses a sector of cells in making the bandwidth reservation for accepting a new call. Based on the distance of the target cells in the sectors, two different bandwidth reservation policies are applied to optimize the connection dropping rate (CDR), while maintaining a competitive connection blocking rate (CBR). In addition, two possible mobile terminal (MT) movements are analyzed using the DBR mechanism. In the first case, no knowledge of an MT's moving path is assumed to be known, while in the second case, prior knowledge of an user profile is used in bandwidth reservation, and it is called user profile-based DBR (UPDBR) algorithm. Using the DBR scheme, we propose an admission control algorithm that uses varying number of cells in a sector to meet admission decisions. Extensive simulation is performed to evaluate our methodology. Comparison of the proposed scheme with two prior schemes shows that our approach is not only capable of providing better QoS guarantees, but is also flexible in terms of using varying number of cells in satisfying the high-level QoS requirements.","cites":"4","conferencePercentile":"34.48275862"},{"venue":"Wireless Communications and Mobile Computing","id":"bf8c323c882f8e930d5fe1bd5d5f1e8bb5be420e","venue_1":"Wireless Communications and Mobile Computing","year":"2004","title":"A study of dynamic addressing techniques in mobile ad hoc networks","authors":"Yuan Sun, Elizabeth M. Belding-Royer","author_ids":"7137515, 2377614","abstract":"—Dynamic address assignment enables nodes in mobile ad hoc networks to obtain a routable address without the need for any explicit configuration. It provides a means for nodes to communicate without any centralized infrastructure, and provides a mechanism for dynamic network membership. Recently, a considerable number of dynamic addressing protocols have been proposed. While these approaches bear some similarities to each other, they also differ in some important characteristics. To understand the benefits of these different approaches, it is necessary to test the protocols in a wide range of network conditions so that their performance and suitability can be predicted. This paper studies existing solutions by categorizing and qualitatively analyzing the scalability and other performance properties of the approaches. We also introduce a new addressing approach the provides both quick and efficient unique address assignment. We then compare selected protocols through quantitative analysis based on extensive simulations. Based on the simulation results, we point out the applicability of the protocols and offer suggestions to improve protocol performance.","cites":"23","conferencePercentile":"82.75862069"},{"venue":"Wireless Communications and Mobile Computing","id":"962ad886410b7937995a600006914622b3637728","venue_1":"Wireless Communications and Mobile Computing","year":"2007","title":"Spectrum sharing through distributed coordination in dynamic spectrum access networks","authors":"Jun Zhao, Haitao Zheng, Guang-Hua Yang","author_ids":"1760149, 5053008, 2025427","abstract":"— Spectrum sharing in open spectrum systems is a challenging problem, particularly since users experience dynamic spectrum availabilities that vary over time and location. In the absence of any centralize infrastructure, users coordinate their spectrum usage to support fair access of spectrum and avoid interference. One critical challenge is to construct an efficient signalling path in the presence of spectrum dynamics, where users exchange control and negotiation information reliably. In this paper we propose a distributed coordination protocol (HD-MAC) to construct an in-band control path without relying on the existence of a pre-assigned out-of-band control channel. In particular, we propose a distributed group formation to construct coordination path using local common channels, and a heterogeneity-aware ranking scheme to select channels for data transmissions. Extensive experimental results demonstrate the efficiency and reliability of the proposed approach.","cites":"19","conferencePercentile":"88.88888889"},{"venue":"Wireless Communications and Mobile Computing","id":"bcbd45a1dea0c6044a7c3ed866e1155bc94959f0","venue_1":"Wireless Communications and Mobile Computing","year":"2009","title":"Lifetime-maximized cluster association in two-tiered wireless sensor networks","authors":"Wen-Zhan Song, Weizhao Wang, Kousha Moaveninejad, Xiang-Yang Li","author_ids":"1768849, 2639808, 2838006, 1744005","abstract":"In this paper, we study the two-tiered wireless sensor network (WSN) architecture and propose the optimal cluster association algorithm for it to maximize the overall network lifetime. A two-tiered WSN is formed by number of small sensor nodes (SNs), powerful application nodes (ANs), and base-stations (BSs, or gateways). SNs capture, encode, and transmit relevant information to ANs, which then send the combined information to BSs. Assuming the locations of the SNs, ANs, and BSs are fixed, we consider how to associate the SNs to ANs such that the network lifetime is maximized while every node meets its bandwidth requirement. When the SNs are homogeneous (e.g., same bandwidth requirement), we give optimal algorithms to maximize the lifetime of the WSNs; when the SNs are heterogeneous, we give a 2-approximation algorithm that produces a network whose lifetime is within 1/2 of the optimum. We also present algorithms to dynamically update the cluster association when the network topology changes. Numerical results are given to demonstrate the efficiency and optimality of the proposed approaches. In simulation study, comparing network lifetime, our algorithm outperforms other heuristics almost twice. Copyright","cites":"1","conferencePercentile":"26.47058824"},{"venue":"Wireless Communications and Mobile Computing","id":"09363459bad216a708d5925872d7b86d34fe2315","venue_1":"Wireless Communications and Mobile Computing","year":"2010","title":"Simulation study of IEEE 802.15.4 LR-WPAN for industrial applications","authors":"Feng Chen, Nan Wang, Reinhard German, Falko Dressler","author_ids":"1692998, 1715792, 1758569, 1725013","abstract":"The IEEE 802.15.4 protocol has become the primary solution for many Low-Rate Wireless Personal Area Network (LR-WPAN) applications. This is especially the case for industrial sensor network applications such as automation control. We contribute to the better understanding of the protocol behavior by presenting a set of results of simulation experiments. Our results outline the capabilities of this protocol in the selected scenarios but also the limitations. In particular, we investigated the dependency of the protocol on protocol-inherent parameters such as the beacon order and the superframe order but also to different traffic load. Our results can be used for planning and deploying IEEE 802.15.4 based sensor networks with specific performance demands. We put a special focus on application scenarios in industrial sensor network applications. The primary requirements are reduced end-to-end latency and energy consumption. Our studies are based on our new implementation of IEEE 802.15.4 developed for the simulation framework OMNeT++.","cites":"22","conferencePercentile":"97.5"},{"venue":"Wireless Communications and Mobile Computing","id":"3d8bf01e9fc662df5ae55f72d0e539da913e8f66","venue_1":"Wireless Communications and Mobile Computing","year":"2004","title":"Fault tolerant deployment and topology control in wireless ad hoc networks","authors":"Xiang-Yang Li, Peng-Jun Wan, Yu Wang, Chih-Wei Yi","author_ids":"1744005, 1787340, 1687514, 1687645","abstract":"We consider a large-scale of wireless ad hoc networks whose nodes are distributed randomly in a two-dimensional region ª (more specifically, a unit square). Given Ò wireless nodes Î , each with transmission range ÖÒ, the wireless networks are often modeled by graph´ÎÎÖ Òµ in which two nodes are connected if and only if their Euclidean distance is no more than ÖÒ. We first consider how to relate the transmission range with the number of nodes in a fixed area such that the resulted network can sustain fault nodes in its neighborhood with high probability when all nodes have the same transmission range. We show that, for a unit-area square region ª, the probability that the network´ÎÎÖ Òµ is-connected is at least « when the transmission radius ÖÒ satisfies ÒÒÖ ¾ Ò ÐÒ Ò · ´ ¾ ¿µ ÐÒ ÐÒ Ò ¾ Ð Ò ´ ½µµ · ¾« for ½ and Ò sufficiently large. This result also applies to mobile networks when the moving of wireless nodes always generates randomly distributed positions. We also conduct extensive simulations to study the practical transmission range to achieve certain probability the network being-connectivity when the number of nodes Ò is not large enough. The relation between the minimum node degree and the connectivity of graph´ÎÎÖ µ is also studied. Setting the transmission range of all nodes to ÖÒ guarantees the-connectivity with high probability, but some nodes may have excessive number of neighbors in the graph´ÎÎÖ Òµ. We then present a localized method to construct a subgraph of the network topology´ÎÎÖ Òµ such that the resulting subgraph is still-connected but with much fewer communication links maintained. We show that the constructed topology has only Ç´¡ Òµ links and is a length spanner. Here a graph À is spanner for graph , if for any two nodes, the length of the shortest path connecting them in À is no more than a small constant factor of the length of the shortest path connecting them in. Finally, we conduct some simulations to study the practical transmission range to achieve certain probability of-connected when Ò is not large enough.","cites":"15","conferencePercentile":"75.86206897"},{"venue":"Wireless Communications and Mobile Computing","id":"aa94ad865202acea6aff1f4c7ac8fffbb8827418","venue_1":"Wireless Communications and Mobile Computing","year":"2012","title":"A network selection scheme for multicast applications in wireless network convergence","authors":"Jaecheol Kim, Ji Hoon Lee, Hojin Lee, Ted Taekyoung Kwon, Yanghee Choi","author_ids":"2119362, 8153728, 4881091, 2035642, 1729048","abstract":"In wireless network convergence, each mobile host is expected to have multiple kinds of wireless interfaces. Multicast-based applications are expected to be widely deployed. In this paper, a new network selection scheme is proposed for a mobile host to select the most appropriate wireless access network to maximize user satisfaction and ISP's profit, simultaneously. We have devised a metric to measure a user's satisfaction and we also developed a 'normalized network resource' metric for system profit measure. We have compared our scheme with three other reference schemes, through simulations. Depending on the network deployment situations, our scheme exhibits one-fifth service disruption time of other reference schemes, while the resource consumption of our scheme is comparable to that of the minimum resource scheme. Overall, the gain of our scheme becomes higher as users move faster and/or the population density increases.","cites":"0","conferencePercentile":"15.38461538"},{"venue":"Wireless Communications and Mobile Computing","id":"0a841a981622e36ebf1c74c3a34ff050ce9c03a1","venue_1":"Wireless Communications and Mobile Computing","year":"2006","title":"Channel-relay price pair: towards arbitrating incentives in wireless ad hoc networks","authors":"Yuan Xue, Baochun Li, Klara Nahrstedt","author_ids":"1713594, 1707361, 1688353","abstract":"— Cooperation in wireless ad hoc networks has twofold implications. First, each wireless node does not excessively and greedily inject traffic to the shared wireless channel. Second, intermediate nodes voluntarily relay traffic for upstream nodes towards the destination at the cost of its own private resource. Such an assumption supports almost all existing research when it comes to protocol design in ad hoc networks. We believe that without appropriate incentive mechanisms, the nodes are inherently selfish (unwilling to contribute its private resource to relay traffic) and greedy (unfairly sharing the wireless channel). In this paper, we present a price pair mechanism to arbitrate resource allocation and to provide incentives simultaneously such that cooperation is promoted and the desired global optimal network operating point is reached by convergence with a fully decentralized self-optimizing algorithm. Such desired network-wide global optimum is characterized with the concept of Nash bargaining solution, which not only provides the Pareto optimal point for the network, but is also consistent with the fairness axioms of game theory. We simulate the price pair mechanism and report encouraging results to support and validate our theoretical claims.","cites":"8","conferencePercentile":"59.75609756"},{"venue":"Wireless Communications and Mobile Computing","id":"5f8666fae2eccc8f304bcc72e5e33747717d2446","venue_1":"Wireless Communications and Mobile Computing","year":"2004","title":"Achieving proportional delay differentiation in wireless LAN via cross-layer scheduling","authors":"Yuan Xue, Kai Chen, Klara Nahrstedt","author_ids":"1713594, 2262178, 1688353","abstract":"Providing service differentiation in wireless networks has attracted much attention in recent research. Existing studies so far have focused on the design of differentiated media access algorithms. Some quality of service (QoS) metrics, such as queueing delay cannot be completely addressed by these approaches. Moreover, without a formalized service differentiation goal that quantifies the outcome of differentiation, the performance of most of the approaches fluctuates, especially in short timescales. This paper addresses above problems by introducing the concept of proportional service differentiation, to the domain of wireless network and focuses on providing proportional delay differentiation in wireless LANs. Due to the unique characteristic of distributed medium sharing, the scheduling algorithm employed in wireline networks can not be applied directly to the context of wireless LANs. We argue that delay differentiation in wireless LAN can only be achieved through a joint packet scheduling at the network layer and distributed coordination at the media access control (MAC) layer. Therefore, we present a cross-layer waiting time priority (CWTP) scheduling algorithm. CWTP consists of two tiers: an intra-node waiting time priority (WTP) scheduler at the network layer and an inter-node distributed coordination function at the MAC layer. These two tiers coordinate via a mapping function, which maps the normalized waiting time at the network layer to the backoff time at the MAC layer. Two mapping schemes, namely linear mapping and piecewise linear mapping, are presented and evaluated in this paper. Extensive simulation results show that the CWTP algorithm can effectively achieve proportional delay differentiation in wireless LANs.","cites":"11","conferencePercentile":"62.06896552"},{"venue":"Wireless Communications and Mobile Computing","id":"04c0a77be2ad4c179722642d127ec408587ca014","venue_1":"Wireless Communications and Mobile Computing","year":"2001","title":"Application-centric analysis of IP-based mobility management techniques","authors":"Archan Misra, Subir Das, Prathima Agrawal","author_ids":"1721672, 6629884, 1741062","abstract":"— This paper considers three applications-VoIP, mobile Web access and mobile server-based data transfers-and evaluates the applicability of various IP-based mobility management mechanisms. We first survey the features and characteristics of various IP mobility protocols, such then evaluate their utility on an application-specific basis. The diversity in the mobility-related requirements ensures that no single mobility solution is universally applicable. We recommend a hierarchical mobility architecture. The framework uses our Dynamic Mobility Agent (DMA) architecture for managing intra-domain mobility and multiple application-based binding protocols for supporting inter-domain mobility. Thus, we recommend SIP as the global binding protocol for VoIP applications and MIPv4/MIPv6 as the global binding mechanism for the mobile server scenario .","cites":"5","conferencePercentile":"28.57142857"}]}