{"Wireless_Sensor_Network_Technol":[{"venue":"Wireless Sensor Network Technologies for the Information Explosion Era","id":"6bc5b6c083fc1711e0a8e162f50f13dd3be7ee7b","venue_1":"Wireless Sensor Network Technologies for the Information Explosion Era","year":"2010","title":"Toward Construction of Wearable Sensing Environments","authors":"Kazuya Murao, Tsutomu Terada, Shojiro Nishio","author_ids":"3330303, 1694397, 1717916","abstract":"The downsizing of computers has led to wearable computing devices that have attracted a great deal of attention. A wearable computer in wearable computing environments runs various applications with various sensors (wearable sensors). The beginning of this chapter describes the present situation with wearable sensing by giving examples of several applications using state-of-the-art technologies, and outlines underlying problems with wearable sensing. Even though low-power consumption is an important issue since the sensors are connected wirelessly and their batteries should be small due to restrictions with size and weight in a wearable sensing environments, conventional wearable systems did not flexibly control power supply and consumed excess power resources for unused sensors. Additionally, sensors frequently become unstable by several reasons such as breakdown of sensors. As a solution to these, we introduce a wearable sensor management device CLAD that has various functions for power management and sensed data management. The latter half of this chapter describes its application with taking power-reduction in context-aware systems as an example. Even though various systems using ac-celerometers have been proposed to recognize very minute motions and states in the area of context awareness, the energy consumption is not taken into consideration. In actual life, the granularity of contexts that the users require differs according to their situations. Therefore, the proposed system changes the granularity of cog-nitive contexts on their situations and supplies power on the basis of the optimal sensor combinations with higher degree of accuracy and fewer number of sensors. In addition, the number of sensors is reduced within the tolerances for accuracy in proportion to the rest of the power resources. Moreover, the accuracy is improved by taking context transitions into consideration. Even if the number of sensors changes, since the data for cut off sensors are complemented with our proposed algorithm, no extra classifiers and training data are required. Power consumption can be reduced without large losses in accuracy by using our system.","cites":"2","conferencePercentile":"100"}]}