{"Wireless_and_Optical_Communicat":[{"venue":"Wireless and Optical Communications","id":"fdd6725847a839d1177f801ce4b36bf2be599e12","venue_1":"Wireless and Optical Communications","year":"2006","title":"On Pricing Strategies for Stochastic Capacity Networks","authors":"Carey L. Williamson, Hongxia Sun","author_ids":"3152750, 4595547","abstract":"This paper studies pricing strategies for networks with stochastic capacity variation. Call-level simulation is used to compare the profit generated with four different pricing models, and with different policies for the management of call dropping episodes in the network. Both user-oriented and network-oriented performance metrics are considered. The simulation results show that the choice of an optimal pricing strategy depends on the call dropping control policy used in the network, and vice versa. The NewestArrival call dropping policy provides surprisingly robust performance for the pricing strategies considered.","cites":"0","conferencePercentile":"20"},{"venue":"Wireless and Optical Communications","id":"c47067c40db8aa07c2a158fe9f9a52c0032194d4","venue_1":"Wireless and Optical Communications","year":"2006","title":"Reduction of Crosstalk in WDM Networks with Optional FEC Coding","authors":"Yvan Pointurier, Maïté Brandt-Pearce, Bo Xu","author_ids":"1760572, 1714228, 1749224","abstract":"In all-optical WDM networks, signals propagate over very long physical lightpaths without regeneration. Signals are subject to well-known physical impairments which are sensitive not only to the network topology, such as amplifier noise, but also to new impairments which vary with the network utilization. These impairments are interchannel crosstalk due to nonlinear signals combinations within the fiber links, and node crosstalk due to optical leaks inside the network nodes. As a result, calls in all-optical networks may be rejected because they do not meet a minimal QoS constraint which has to be enforced to ensure nearly error-free network operation. Recently, Routing and Wavelength Assignment (RWA) algorithms that account for network physical impairments have been developed. Some of them use FEC coding to trade, when needed, bandwidth utilization against higher QoS. RWA with optional FEC coding has been studied only for noise-limited networks. We show how RWA algorithms with optional FEC coding can be employed to reduce both static and dynamic physical impairments. We show that RWA algorithms with optional FEC coding are efficient to decrease call blocking probabilities, and also improve resource allocation fairness, in the context of a realistic continental-sized network.","cites":"2","conferencePercentile":"53.33333333"}]}