{"WIRI.csv":[{"venue":"WIRI","id":"d5507a98565a167edcbc20e15f3b8c68f68b572e","venue_1":"WIRI","year":"2005","title":"A Lightweight Approach to Semantic Web Service Synthesis","authors":"Jianguo Lu, Yijun Yu, John Mylopoulos","author_ids":"8553140, 1718749, 1750566","abstract":"Web service technologies are becoming a new paradigm for distributed computing. With increasing number of web services available on the internet, there is an urgent need for information brokers that can autonomously integrate web services on behalf of a user. To this end, we propose web service specification, which defines what the service is but not how the service is implemented, and service synthesizer, which can dynamically synthesize the implementation of the specification from existing web services over the web.","cites":"7","conferencePercentile":"64.28571429"},{"venue":"WIRI","id":"1462e233d4a17a9b789ad0f880a8e293c64fa19f","venue_1":"WIRI","year":"2005","title":"Insights from Viewing Ranked Retrieval as Rank Aggregation","authors":"Hannah Bast, Ingmar Weber","author_ids":"1936883, 1684687","abstract":"We view a variety of established methods for ranked retrieval from a common angle, namely as a process of combining query-independent rankings that were precomputed for certain attributes. Apart from a general insight into what effectively distinguishes various schemes from each other, we obtain three specific results concerned with concept-based retrieval. First, we prove that latent semantic indexing (LSI) can be implemented to answer queries in time proportional to the number of words in the query, which improves over the standard implementation by an order of magnitude; a similar result is established for LSI's proba-bilistic sibling PLSI. Second, we give a simple and precise characterization of the extent, to which latent semantic indexing (LSI) can deal with polysems, and when it fails to do so. Third, we demonstrate that the recombination of the intricate , yet relatively cheap mechanism of PLSI for mapping queries to attributes, with a simplistic, easy-to-compute set of document rankings gives a retrieval performance which is at least as good as that of the most sophisticated concept-based retrieval schemes.","cites":"5","conferencePercentile":"35.71428571"}]}