{"Wirtschaftsinformatik.csv":[{"venue":"Wirtschaftsinformatik","id":"07898e2a2acb485a26280b5128ff8a90118d5ade","venue_1":"Wirtschaftsinformatik","year":"2007","title":"Infrastrukturen zur Aneignungsunterstützung - Ein Konzept zur Integration von produkt- und prozessorientierter Flexibilisierung","authors":"Gunnar Stevens, Volker Wulf, Volkmar Pipek","author_ids":"2043094, 1722564, 1700253","abstract":"Die Aneignung und Einbettung von Computersystemen in den Nutzungskontext stellt einen zentralen, nichtsdestotrotz von der bisherigen Forschung ungenügend adressierten Aspekt der Softwarenutzung dar. Es muss dabei klar sein, dass Aneignung ein kollektiver und kreativer Prozess gesehen werden muss. In diesem Beitrag stellen wir das Konzept der Aneignungsinfrastruktur vor. Dabei handelt es sich um eine sozio-technische Methode, die auf die Kombination hoch anpassbaren Softwaredesigns mit der Nutzung einer Kommunikations-und Kooperations-Infrastruktur innerhalb der Nutzercommunity sowie zwischen Benutzern und Entwicklern aufbaut. Die Kommunikations-und Kooperationsinfrastruktur ermöglicht es, nicht antizipierte Anforderungen des Nutzungskontexts zu fassen und in einen agilen Entwicklungsprozess einfließen zu lassen. Die dadurch möglich gemachte technische Flexibilität unterstützt den Umgang mit differenzierten und dynamisch wechselnden Anforderungen. Anhand des BSCWeasel-Projektes zeigen wir, wie eine entsprechende Aneignungsinfrastruktur realisiert werden kann.","cites":"1","conferencePercentile":"48.4375"},{"venue":"Wirtschaftsinformatik","id":"d42c780aaad8dbd343b260cb570dabc96ab98653","venue_1":"Wirtschaftsinformatik","year":"2005","title":"iManual - Mobile Endgeräte als kontextsensitive integrierte Bedien- und Hilfesysteme","authors":"Markus Klann, Daniel Humberg, Volker Wulf","author_ids":"1895424, 1858147, 1722564","abstract":"weiterführenden Arbeiten. iManual – Mobile Devices as context-aware integrated control and help-systems Abstract This article describes the iManual-concept developed at Fraunhofer FIT which deals with the use of mobile devices as context-aware integrated control and help systems for in principal arbitrary wirelessly connected consumer or industrial products. Following the premise of designing the interface of various IT-based products in a way that facilitates learning and respects user expectations, we explore the design space that is created by combining control and help functions by way of mobile devices. On the way, we discuss various potentials of this approach to enhance the corresponding products and services. Based on a review of the state of the art on intelligent help systems and mobile interfaces, we describe the iManual concept and a prototypical implementation for a PDA-based control and help system for the navigation system of the BMW 7. We conclude with a discussion of limitations and opportunities for extension of the approach and corresponding further work. Management Summary The iManual concept describes the use of mobile devices as integrated control and help systems for in principal arbitrary wirelessly connected consumer or industrial products. The concept shows advantages for customer satisfaction, customer loyalty, product quality, service and productivity: • for customer satisfaction because users can use control and help function over a single familiar interface that makes these functions available in a demand-driven and integrated manner, thus allowing for a better and faster comprehension of usage and faster resolution of usage problems. • for customer loyalty because the iManual provides customers with a channel towards the manufacturer to articulate problems and requirements, as well as to receive closely fitted support and added-value services. • for product quality because very detailed feedback information from the users can be gathered to enhance the products. Additionally because the use of mobile devices allows for relatively powerful control and help systems even for simple devices. • for service because users can be provided with much more detailed and current information all the while reducing substantially the effort for users to locate this information. Moreover, users can be provided with added-value services at the exact moment that a corresponding need arises. Finally, contact can be established between users in a demand-driven way in order to e. g. exchange usage tips following the idea of customer self-care. • for productivity because timely and demand-driven provisioning with control and help functions …","cites":"6","conferencePercentile":"68.51851852"},{"venue":"Wirtschaftsinformatik","id":"a89c43a4ca8be6a17189234c99864d5c4f49dcf7","venue_1":"Wirtschaftsinformatik","year":"2009","title":"A Model-driven Approach to enable Access Control for Ontologies","authors":"Willy Chen, Heiner Stuckenschmidt","author_ids":"3126072, 1698459","abstract":"Industrial applications of semantic technologies-in particular ontologies-include the integration of heterogeneous information sources and the management of information resources and services. Currently, the adoption of these technologies in large-scaled applications within enterprises is slowed down by their failure to meet some basic requirements of commercial applications. One of those is the support of sophisticated security policies for protecting the knowledge contained in ontologies and their instances from unauthorized use. In this paper, we propose a model-driven approach to enable access control for lightweight ontologies based on a role-based security model and well-known standard technologies. Semantic technologies originally developed for knowledge representation and reasoning on the web are gaining attention from industry as an adequate means for solving complex information management tasks. A constantly growing number of companies that offer professional services or tools in this area reflect this trend [4]. Typical applications of ontologies include knowledge and skill management [19] as well as web service and business process management [8]. Successful projects [20] emphasize the relevance of these technologies in the area of product lifecycle management (PLM), in particular in the automotive sector. Their application in large-scaled industrial use cases (e.g., [2]) quickly shows that theoretical issues like expressiveness and decidability are less a limiting factor for their uptake in industry than non-functional aspects. In commercial scenarios we are particularly faced with ever changing domains that need to be reflected within a knowledge base, restricted resources for its development and maintenance, and the uncertain perspicuity and acceptance of such an information source by the actual users [10]. Another important requirement of many industrial applications is the need to protect knowledge against unauthorized access. This need is particularly evident in many potential application areas of ontologies such as the area of data and application integration. The integrated data sources often","cites":"5","conferencePercentile":"90"},{"venue":"Wirtschaftsinformatik","id":"cf54a169a0f2c1453800fe47f9c620bb9090f0dc","venue_1":"Wirtschaftsinformatik","year":"2007","title":"Decentralised Control of Complex Systems","authors":"Nicholas R. Jennings","author_ids":"1786650","abstract":"Many modern computing systems have to operate in environments that are highly interconnected, highly unpredictable, are in a constant state of flux, in which there is no centralized point of control, and in which the constituent components are owned by a variety of stakeholders that each have their own aims and objectives. Relevant exemplars include the Web, Grid Computing, Peer-to-Peer systems, Pervasive Computing and many eCommerce applications. Now, I believe that all of these systems operate under the same conceptual model: (i) entities offer a variety of services in some form of institutional setting; (ii) other entities connect to these services (covering issues such as service discovery, service composition and service procurement); and (iii) entities enact services in a flexible and context sensitive manner. Moreover, I believe agent-based computing is an appropriate model computational for such systems (Jennings, 2000; Jennings 2001). In particular, autonomous agents are a natural way of viewing flexible service providers and consumers and the interactions between these autonomous components are naturally modeled as some form of economic trading process that, if successful, results in a service contract (or service level agreement) between the agents involved. In this talk, the focus will be on the design of the agents and their interactions. Specifically, I will consider the design and implementation of various computational service economies for a number of real-world applications including: virtual organizations (Norman et al., 2004), sensor 31","cites":"1","conferencePercentile":"48.4375"},{"venue":"Wirtschaftsinformatik","id":"aee9dc5eb53c2f26ff79f59221839d69012984fe","venue_1":"Wirtschaftsinformatik","year":"2015","title":"Emotions in Information Systems Research - A Five Component View","authors":"Kilian Vornewald, Andreas Eckhardt, Julia Krönung","author_ids":"2668197, 1720885, 3128570","abstract":"Many scientific viewpoints and research streams occurred over the last decades with the objective to create structure and common understanding on a more abstract level how emotions affect human behavior (e.g. constructiv-ist or appraisal theories). As a consequence, Information Systems (IS) researchers have adopted diverse mixed up theoretical foundations about emotions. This brings the need for a more structured way to study emotions in the IS field. Thus, within this research a five component view on emotions is developed, based on appraisal theories of emotions and the 3-emotions´nomological network by Gregor et al. (2014). The new view provides better guidance for IS researchers studying the occurrence or effect of human emotions in terms of a better understanding of the emotion concept and an easier transfer of theoretical considerations from psychology to the IS field, especially the adaptation of emotional constructs and their subjective and objective measurement. 1 Introduction As Kahneman already pointed out in his Nobel Prize speech, it is an unrealistic assumption to understand human behavior solely through rational models [1], as a substantial proportion of human thinking and action is determined by emotions. There are several studies showing how strongly emotions affect cognition [2]. Further, emotions impact memory and information processing, the perception of risk [3] and economic decision making [4]. Emotions have also raised significant attention in IS research. For more than two decades, emotional constructs, such as computer anxiety [5, 6] or perceived enjoyment [7] have been regarded in IS research. Nevertheless cognitive constructs are still more common in the theoretical considerations about IS usage behavior. Although emotions have sometimes be regarded as complement to these cognitive constructs, recent research indicates that constructs, once understood as purely cognitive, such as perceived usefulness, can be detected at the neuronal level in brain areas that are known for emotional activity to date [8, 9].","cites":"0","conferencePercentile":"39.20454545"},{"venue":"Wirtschaftsinformatik","id":"6fb71d522d49395d066052b098e8021471e578c6","venue_1":"Wirtschaftsinformatik","year":"2007","title":"Audio vs. Chat bei Aufgaben mit Unsicherheit: Die Produktivität folgt anderen Regeln als bei mehrdeutigen Aufgaben","authors":"Andreas Löber, Gerhard Schwabe","author_ids":"3052830, 1691246","abstract":"Audio vs. Chat bei Aufgaben mit Unsicherheit: Die Produktivität folgt anderen Regeln als bei mehrdeutigen Aufgaben\" (2007). identifiziert.","cites":"1","conferencePercentile":"48.4375"},{"venue":"Wirtschaftsinformatik","id":"091896e1418d9de3000255e7065420526e78b27c","venue_1":"Wirtschaftsinformatik","year":"1992","title":"Evaluation von Benutzerschnittstellen","authors":"Reinhard Oppermann, Harald Reiterer","author_ids":"2902551, 1696202","abstract":"Evaluation of user interfaces Abstract: The evaluation of user interfaces becomes more and more important. The reasons are the increasing national and international standardization activities in the area of ergonomic requirements for visual display terminals (VDTs). These standards are often an integral part of the requirement specification for software. So the software developers have to consider the dialogue principles of the standards. On the other hand the buyers of software need evaluation methods to test the conformance with the standards. So there is an increasing need of practicable evaluation methods. 284 This article first shows some critical aspects of the evaluation of dialogue principles. Then the areas which have to be considered with the evaluation of user interfaces are described. A classification of known evaluation methods follows. Additionally the evaluation procedure EVADIS II which was developed by the authors is described in detail. EV ADIS overcomes some typical deficits of known evaluation methods. Especially it considers the organizational context and provides computer support for the use of the evaluation procedure.","cites":"1","conferencePercentile":"100"},{"venue":"Wirtschaftsinformatik","id":"9d528c42b2add683f1b826a1d718e47280ef494a","venue_1":"Wirtschaftsinformatik","year":"2002","title":"Ein UML-basiertes Framework zur Modellierung ubiquitärer Web-Anwendungen","authors":"Martin Hitz, Gerti Kappel, Werner Retschitzegger, Wieland Schwinger","author_ids":"1737056, 1734745, 2498719, 2705345","abstract":"Ein Rü ckblick auf die kurze Geschichte des World Wide Web zeigt, dass drei Gene-rationen von Web-Anwendungen unter-schieden werden kö nnen, die sich vor allem durch die verwendete Technologie und die zur Verfü gung gestellten Dienste aus-zeichnen [Cona99]. Die erste Generation von Web-Anwendungen ist charakterisiert durch reine Informationsgewinnung (read-only applications), wobei diese Web-An","cites":"2","conferencePercentile":"100"},{"venue":"Wirtschaftsinformatik","id":"2ca797b419a707e023c3e2a7b84a43f854f5524b","venue_1":"Wirtschaftsinformatik","year":"2001","title":"Intelligent Brokering of Environmental Information with the BUSTER System","authors":"Heiner Stuckenschmidt, Thomas J. Vögele, Ubbo Visser, Ryco Meyer","author_ids":"1698459, 2043443, 1765935, 2248201","abstract":"In this paper we discuss the general problems which arise when information sources have to be found and integrated into a system and present a solution by introducing the BUSTER 2 system. We give an overview of our ontology-based approach with logical reasoning on metadata for retrieving information sources and semantic translation into the desired format. Many application areas of information systems share the need to store and process large amounts of diverse data which are often geographically distributed. This implies that making new data available to the system requires the data to be transferred into the system's specific data format. This is a process which is very time-consuming and tedious. Data acquisition, automatically or semi-automatically, often makes large-scale investment in technical infrastructure and/or manpower inevitable. These obstacles are some of the reasons behind the concept of intelligent brokering of information. Our approach can be applied because existing information can be accessed by remote systems in order to supplement their own data basis. The advantages of successful brokering are thus obvious for many reasons: • Quality improvement of data owing to the availability of large and complete data. • Improvement of existing analyses and application of the new analyses by the use of more relevant data sources. • Cost reduction resulting from multiple use of the existing information sources.","cites":"15","conferencePercentile":"90"},{"venue":"Wirtschaftsinformatik","id":"7ac64841c94c516ff9e49c7489a5ff1471a69253","venue_1":"Wirtschaftsinformatik","year":"2000","title":"Zugriffskontrolle in Groupware - Ein nutzerorientierter Ansatz","authors":"Oliver Stiemerling, Markus Won, Volker Wulf","author_ids":"1688778, 2804092, 1722564","abstract":"Basis der thinking-aloud-Methode diskutiert. (mandatory access control).","cites":"5","conferencePercentile":"50"},{"venue":"Wirtschaftsinformatik","id":"c4152ec971525a0b707f59cc8f01aa6782f0254e","venue_1":"Wirtschaftsinformatik","year":"2015","title":"Thinking Styles and Privacy Decisions: Need for Cognition, Faith into Intuition, and the Privacy Calculus","authors":"Flavius Kehr, Tobias Kowatsch, Daniel Wentzel, Elgar Fleisch","author_ids":"3035002, 1793743, 1960406, 2801545","abstract":"Investigating cognitive processes that underlie privacy-related decisions , prior research has primarily adopted a \" privacy calculus \" view, indicating privacy-related decisions to constitute rational anticipations of risks and benefits connected to data disclosure. Referring to psychological limitations and heuristic thinking, however, recent research has discussed notions of bounded rationality in this context. Adopting this view, the current research argues that privacy decisions are guided by thinking styles, i.e. individual preferences to decide in an either rational or intuitive way. Results of a survey indicated that individuals high in rational thinking, as reflected by a high need for cognition, anticipated and weighed risk and benefits more thoroughly. In contrast, individuals relying on experiential thinking (as reflected by a high faith into intuition) overleaped rational considerations and relied on their hunches rather than a privacy calculus when assessing intentions to disclose information. Theoretical and practical implications of these findings are discussed. 1 Introduction Providing the shipping address to an e-commerce website [1], disclosing the own position to a location-based mobile service [2], or informing a health monitoring service about one's well-being [3]: When using technology, individuals are steadily confronted with the decision to disclose, or not disclose, private information. Investigating the cognitive processes that underlie such decisions, researchers have often applied a \" privacy calculus \" perspective [2, 4-6], arguing that individuals anticipate and trade-off negative and positive outcomes of data disclosure, and decide to disclose personal information only if the (perceived) benefits outweigh the (perceived) risks [2]. Applying this perspective, prior studies have identified numerous factors enhancing or mitigating risk and benefit perceptions, including personalization [7, 8], privacy seals [9], or information sensitivity [10, 11]. Also, scholars have discussed notions of bounded rationality in this context, arguing individual decision-making to be impacted by psychological limitations, such as","cites":"0","conferencePercentile":"39.20454545"},{"venue":"Wirtschaftsinformatik","id":"530b441da9cde1c0a63bc838bcc08e5622a95f32","venue_1":"Wirtschaftsinformatik","year":"2005","title":"RFID: Verbraucherängste und verbraucherschutz","authors":"Oliver Berthold, Oliver Günther, Sarah Spiekermann","author_ids":"1722093, 1680584, 1681853","abstract":"Stichworte: English Abstract RFID: Consumer Fears and Consumer Protection RFID introduction is a hotly debated public policy issue. The technology enables physical environments to become more interactive and supportive by tagging each item with a chip that wirelessly communicates with a service-enriched backend infrastructure. Based on a number of user studies at Humboldt-Universität and at the Auto-ID Center, this article presents the major fears associated with RFID introduction. We show to what extent these fears are justified and derive a number of system requirements for giving users more control over an RFID-enabled IT infrastructure. After presenting several recent technical proposals for privacy protection, we focus on the question of controlled access to RFID tags. We conclude with a proposal for an easy-to-use private password model. Der Beitrag gibt einen Überblick über Verbraucherängste im Zusammenhang mit der RFID-Technologie und technische Möglichkeiten, diese zu adressieren. Er diskutiert die wesentlichen bis dato präsentierten technischen Schutzansätze und propagiert ein passwortbasiertes Schutzverfahren.","cites":"2","conferencePercentile":"46.2962963"},{"venue":"Wirtschaftsinformatik","id":"526e9e987a2b598a5437b43751bdf0b1a15d5391","venue_1":"Wirtschaftsinformatik","year":"2015","title":"Peer Influence, Family Dysfunction or Conditioning? - An Empirical Analysis of Facebook Addiction Predispositions","authors":"Yana Kisyovska, Julia Krönung, Andreas Eckhardt","author_ids":"1923014, 3128570, 1720885","abstract":"The high increase of usage rates of Social Networking Sites (SNS) such as Facebook are a worldwide phenomenon as are people spending hours in Facebook especially among young adolescents. However, beside their useful and enjoyable features, SNS like Facebook have also proven to have undesired outcomes in terms of technostress, social overload, or even addiction. Addiction as a variable in adoption models has been introduced into the IS community by Turel and Serenko (2011) who operationalized online-auction addiction and assessed its impact on adoption determinants as perceived usefulness. By means of an empirical study of 125 young adults, the present research shifts the focus to the causes of addiction using the example of Facebook. We thereby focus on three groups of addiction predispositions (Family dysfunction, peer influence and behavioral conditioning) and empirically investigate their impact on Face-book addiction. 1 Introduction People staring on their smartphones are a usual sight in public means of transport, but also in restaurants or malls where people used to talk to one another without electronic mediation. Technologically-induced change of communication has long taken hold in many societies, and the exponential increase of new communication platforms mostly subsumed under the label 'Social Media' have become an ever-increasing part of individuals' daily lives and routines [4]. Beside the high usefulness and enjoyment parameters of these platforms, and the various possibilities they offer in terms of communicating, documenting, information processing or gaming, the increase and occasionally excessive use can-alike related phenomena as Technostress or IT-induced social overload [6], [35] – cause immense health related problems for its","cites":"0","conferencePercentile":"39.20454545"},{"venue":"Wirtschaftsinformatik","id":"e4ebcc2e7bf4ef540376cb82716871d4ba75eb88","venue_1":"Wirtschaftsinformatik","year":"2005","title":"Key Factors for a Better Understanding of Mobile Java Games Customers","authors":"Mitra Arami, David Meyer, Antje Sester","author_ids":"2716310, 1682683, 3108790","abstract":"This paper presents first results of a research project conducted at the Vienna University of Economics and Business Administration. The focus of the project is to analyze customer perceptions towards Mobile Java Games and to identify gaps in Mobile Java Games research. A major finding is that transaction data typically collected by Mobile Service Providers can deliver only limited explanations on customer behavior. Thus, the existing information should be enriched by additional data such as consumer surveys and market research. This would enable firms to improve their market strategies.","cites":"0","conferencePercentile":"9.259259259"},{"venue":"Wirtschaftsinformatik","id":"893dbcd3a3b0ff42b430bb0a45b2b152e97b4840","venue_1":"Wirtschaftsinformatik","year":"2007","title":"Zum Einsatz von RFID in der Filiallogistik eines Einzelhändlers: Ergebnisse einer Simulationsstudie","authors":"Frédéric Thiesse, Elgar Fleisch","author_ids":"1705769, 2801545","abstract":"Vor dem Hintergrund des bis heute bestehenden Problems der unzureichenden Regalverfügbar-keit im Handel eröffnet RFID durch eine automatische Erfassung von Warenbewegungen in der Filiale die Möglichkeit, den Prozess der Regalnachbefüllung neu zu gestalten. Dieser Beitrag vergleicht im Rahmen einer Simulationsstudie den herkömmlichen Prozess der Nachbefüllung mit manueller Bestandskontrolle mit einem RFID-gestützten Prozess und analysiert den Ein-fluss einzelner Kostenfaktoren auf das Gesamtergebnis. Dabei zeigt sich, dass der neue Prozess in Abhängigkeit von Leserate und Hardwarekosten in der Lage ist, die Leistungsfähigkeit des bisherigen Prozesses bezüglich Kosteneffizienz und Warenverfügbarkeit zu übertreffen.","cites":"7","conferencePercentile":"92.1875"},{"venue":"Wirtschaftsinformatik","id":"02e1de2c9c311f9d9cea510193d860dcfb582aa0","venue_1":"Wirtschaftsinformatik","year":"2011","title":"Kundentypen und Nutzungsabsicht von mobilen Versicherungsdiensten: Eine empirische Analyse","authors":"Stephan von Watzdorf, Frédéric Thiesse, Tobias Ippisch, Elgar Fleisch","author_ids":"2649593, 1705769, 2145680, 2801545","abstract":"Schlüsselwörter Mobile Dienste; Versicherung; Nutzungsbereitschaft; Umfrage.","cites":"1","conferencePercentile":"45.65217391"},{"venue":"Wirtschaftsinformatik","id":"821de734ce4d833a85c804076978ba7d45eec950","venue_1":"Wirtschaftsinformatik","year":"2011","title":"User Acceptance of 'Smart Products': An Empirical Investigation","authors":"Peter Mayer, Dirk Volland, Frédéric Thiesse, Elgar Fleisch","author_ids":"1777260, 1781800, 1705769, 2801545","abstract":"Smart Products pose a new class of IT artifacts based on sensors, ID-tags, haptic user interfaces, and other technologies usually subsumed under the notion of 'ubiquitous computing'. Such devices differ in many ways from traditional computers, e.g., with regard to their physical shape, computing power, and interaction paradigms. While a substantial body of literature already exists on underlying technological design challenges, only few researchers have attempted to quantitatively explore factors influencing user acceptance of Smart Products. Against this background, the present study is concerned with the use of Smart Products in a kitchen environment. Based on the Unified Theory of Acceptance and Use of Technology (UTAUT), we develop and empirically test a structural model of technology acceptance including five moderating factors. Our results indicate high overall acceptance of the proposed scenarios, corroborate the applicability of the UTAUT model for smart home environments, and confirm significant effects for two moderators.","cites":"1","conferencePercentile":"45.65217391"},{"venue":"Wirtschaftsinformatik","id":"8d5699f935cbe7f39d38a34a448b080276d1d3a8","venue_1":"Wirtschaftsinformatik","year":"2015","title":"A Theoretical Perspective on Meaningfulness of Work and the Success of Business Process Standardization Initiatives","authors":"Janina Kettenbohrer, Andreas Eckhardt, Daniel Beimborn","author_ids":"1939627, 1720885, 1680587","abstract":"Business Process Standardization (BPS) leads to organizational changes, which are often faced with employee resistance. To make BPS initiatives successful, the 'human resource' has to be taken into consideration and with it, the job process fulfilled by them, their needs, and their work environment. The objective of this research is to analyze the role of employees affected by BPS initiatives and their perceptions of their work they are doing as part of the processes to be standardized. Based on job characteristics theory and the work-role fit concept, we develop a research model theorizing the role of these concepts for the acceptance of BPS initiatives. As main theoretical contribution, this research explains how employees' job-related attitudes toward their own work and the collaborations with others determine their (non-)openness towards BPS initiatives, while it will also guide managers in incorporating the 'right' people into a BPS project. 1 Introduction During the last decades, firms and other organizations have moved from a functional view towards a business process oriented organization structure [1] and business process management (BPM) has become an elemental instrument. One important element of BPM is business process standardization (BPS), which means to make \" process activities transparent and achieve uniformity of process activities across the value chain and across firm boundaries \" [2, p.213]. Often, BPM, in general, and BPS, in particular, focus merely on process modeling, implementation of workflow management systems [3], identifying critical organiza","cites":"1","conferencePercentile":"86.36363636"},{"venue":"Wirtschaftsinformatik","id":"5cde9119563a228dd8cdf6411640dbb178f65255","venue_1":"Wirtschaftsinformatik","year":"2011","title":"Focusing on Values in Information Systems Development: A Critical Review of Three Methodological Frameworks","authors":"Fahri Yetim","author_ids":"3020070","abstract":"Values play a significant role in Information Systems Development (ISD). This paper presents a critical analysis of three methodological frameworks which aim at systematically considering values in the development of systems. The analysis focuses on their main goals, value concepts, and activities. In addition, this paper discusses some challenges and controversial issues with respect to the design for values and suggests an agenda for future research.","cites":"1","conferencePercentile":"45.65217391"},{"venue":"Wirtschaftsinformatik","id":"03d310ede88ed91896620ab2c2a20df3863316ec","venue_1":"Wirtschaftsinformatik","year":"2007","title":"Native Code Security for Grid Services","authors":"Thomas Friese, Matthew Smith, Bernd Freisleben","author_ids":"1764735, 1767286, 1685922","abstract":"In modern on demand grid computing scenarios, services from different organisations will potentially run on the same web service engine of a grid node. Secure isolation of data and code of different service instances is a vital requirement in such an environment, since mutual trust cannot be assumed between all involved parties. For Java based Grid applications the Java virtual machine offers sandboxing vacilities, however the common occurrence of native code (e.g. C/C++, Fortran) in business and scientific Grid applications leads to a number of security issues which are not handled by the basic Java security mechanisms. In this paper, we analyze the threat scenarios that emanate from native code in a service-oriented Grid scenario. A novel security architecture is presented, which enables a fine grained confinement of native components of Grid applications into a secure environment for protecting the hosting system as well as other service instances. Although our work focuses on Grid services, it is also relevant for any hosting scenario in which multiple web services using native code components are deployed in the same service container.","cites":"1","conferencePercentile":"48.4375"},{"venue":"Wirtschaftsinformatik","id":"5d6de8715f269a64cc8ece7cdf23bc6ad4b3fdac","venue_1":"Wirtschaftsinformatik","year":"2007","title":"Automated Selection of Configurable Web Services","authors":"Steffen Lamparter, Anupriya Ankolekar","author_ids":"1748185, 1769712","abstract":"To bring service-oriented architectures to their full potential, automatic service discovery and selection mechanisms are required. In this paper, a service selection component is presented that supports offers providing multiple configurations of a service. The selection algorithm ranks the offered services and their configurations according to the requester's preferences and thus facilitates personalized selection strategies. In addition, the approach leverages existing Web standards to provide a maximal degree of interoperability between service providers and their customers leading to significant efficiency gains. The approach is implemented prototypically and the performance is evaluated by means of a simulation.","cites":"10","conferencePercentile":"95.3125"},{"venue":"Wirtschaftsinformatik","id":"62bad046b31e29deb895106131ce8b7f9877c9ae","venue_1":"Wirtschaftsinformatik","year":"2013","title":"Risikomodellierung in strategischen Liefernetzwerken für hybride Wertschöpfung","authors":"Holger Schrödl, Laura Geier, Matthias Geier, Paulina Simkin","author_ids":"1728587, 2383536, 2800719, 1821792","abstract":"entwickelten Prototypen simuliert. 1 Einführung Als hybrides Produkt wird ein Leistungsbündel bezeichnet, welches aus aufeinander abgestimmten Produkten und Dienstleistungen besteht und als besonderes Kennzei-chen die Integration der Teilleistungen aufweist, um ein Kundenproblem zu lösen [1]. Dadurch kann der Wert hybrider Produkte die Summe der Werte der einzelnen Teil-leistungen übersteigen [2]. Mit einem solchen integrierten Portfolio ist es Unterneh-men möglich, sich aus dem Markt hervor zu heben [2], höhere Margen zu generieren [3] und den Aufbau von längerfristigen und intensiveren Kundenbindungen zu för-dern [4]. Außerdem kann die Leistungsfähigkeit des Produktes durch die individuelle Anpassung an die Kundenbedürfnisse gesteigert [5] und eine höhere Wertschöpfung","cites":"0","conferencePercentile":"24.24242424"},{"venue":"Wirtschaftsinformatik","id":"1d3580d75e497ca2b6c32ad6cbdde1d2d81c7b01","venue_1":"Wirtschaftsinformatik","year":"2013","title":"IT-basierte Unterstützung virtueller und realer Selbsthilfegemeinschaften in Katastrophenlagen","authors":"Oliver Heger, Christian Reuter","author_ids":"2335542, 2752185","abstract":"phenmanagement diskutiert. Katastrophen zu verfolgen, deren Organisation aber noch nicht institutionalisiert wur-de [1]. Gemäß der Krisen-Kommunikationsmatrix [2] stellt dies die Kommunikation unter Akteuren der allgemeinen Öffentlichkeit, also den (betroffenen) Bürgern dar. Für die Entstehung solcher Gemeinschaften sind laut Quarantelli [3] fünf Faktoren entscheidend: (a) ein übergemeinschaftliches Umfeld, das die SHG legitimiert; (b) ein entscheidendes Ereignis, das als Gefahr erkannt wird; (c) ein unterstützendes soziales Klima mit positiven Werten, Normen und Überzeugungen hinsichtlich der Notwen-digkeit gemeinschaftlichen Handelns; (d) ein bestehendes soziales Netzwerk, sodass","cites":"8","conferencePercentile":"95.45454545"},{"venue":"Wirtschaftsinformatik","id":"c9f442633e2b864fe01df7c6489573e876f0a473","venue_1":"Wirtschaftsinformatik","year":"2015","title":"Konzept und Evaluation einer Facebook-Applikation zur crossmedialen Selbstorganisation freiwilliger Helfer","authors":"Marc-André Kaufhold, Christian Reuter","author_ids":"2555887, 2752185","abstract":"Das mitteleuropäische Hochwasser 2013 sorgte für große Schäden in weiten Teilen Deutschlands. Währenddessen und in der anschließenden Wie-derherstellungsphase koordinierten betroffene und nicht betroffene Bürger ihre Hilfsaktivitäten nicht nur vor Ort, sondern auch in sozialen Medien wie Twitter, Facebook und mit Tools wie Google Maps. Basierend auf einer Vorstudie zu den Aktivitäten in Twitter und Facebook sowie Interviews mit \" Digital Volunteers \" (hier: Gründer und Moderatoren von Facebook-Gruppen zum Hochwas-ser) stellt dieser Beitrag eine als Facebook-App realisierte crossmediale Appli-kation zur gruppen-und plattformübergreifenden Informationsbeschaffung und-Veröffentlichung vor, die der (Selbst-)Koordination ungebundener Helfer die-nen soll. Diese wurde mit 20 Nutzern qualitativ evaluiert und zeigt Implikatio-nen für die technische Unterstützung der Partizipation Freiwilliger in Katastro-phenlagen auf.","cites":"0","conferencePercentile":"39.20454545"},{"venue":"Wirtschaftsinformatik","id":"b4fb1ecee8d0c9f5d90770a7ebafab675c705226","venue_1":"Wirtschaftsinformatik","year":"2014","title":"User, Use & Utility Research - Die Gestaltungsperspektive der Wirtschaftsinformatik auf den digitalen Nutzer","authors":"Walter Brenner, Dimitris Karagiannis, Lutz Kolbe, Jens Krüger, Larry Leifer, Hermann-Josef Lamberti, Jan Marco Leimeister, Hubert Österle, Charles J. Petrie, Hasso Plattner, Gerhard Schwabe, Falk Uebernickel, Robert Winter, Rüdiger Zarnekow","author_ids":"1712051, 7539020, 1723311, 2996492, 7242868, 1690928, 1737216, 1680450, 1743248, 1810943, 1691246, 1748033, 1706088, 1683149","abstract":"Die Wirtschaftsinformatik steht heute am Wendepunkt: die zunehmende Durchdringung aller Lebensbereiche mit Informations-und Telekommunikationstechnologie (ITK) führt zu einer Veränderung der gesamten ITK-Landschaft, die den Menschen in der digitalen Welt – den so genannten digitalen Nutzer – in den Mittelpunkt stellt. Das Ineinanderfließen von Mensch und Maschine macht eine neue Betrachtung von Wertschöpfungsketten, Prozessen, Methoden und Strukturen in der Wirtschaftsinformatik unerlässlich. Im vorliegenden Beitrag wird dieses komplexe soziotechnische Phänomen diskutiert und das neue Forschungsfeld \" User, Use & Utility Research \" anhand von drei ausgewählten Themenschwerpunkten vorgestellt.","cites":"0","conferencePercentile":"100"},{"venue":"Wirtschaftsinformatik","id":"f036a5a0b5939062eac62da2b03fa71d8372f879","venue_1":"Wirtschaftsinformatik","year":"2007","title":"Perceived Usefulness of RFID-enabled Information Services - A Systematic Approach","authors":"Hanna Krasnova, Matthias Rothensee, Sarah Spiekermann","author_ids":"1991522, 3235976, 1681853","abstract":"Even though RFID technology is currently gaining importance mainly in logistics, usage areas, such as shopping or after-sales enhancements beyond the supply chain are envisioned. Yet, while RFID hits the street it is questioned if it may undermine one's privacy while providing few customer benefits. Meeting this criticism this paper investigates RFID-enabled information services and the drivers of their usefulness for consumers. The article claims that the more risk one associates with a product the more benefit from RFID-enabled information services is perceived. We show empirically that the nature of product risk provides a useful framework to decide on the types of RFID information services a marketer should offer to create RFID usefulness perceptions and increase technology acceptance.","cites":"2","conferencePercentile":"68.75"},{"venue":"Wirtschaftsinformatik","id":"14756e47ff04d007fb7a8fee3e50910746121293","venue_1":"Wirtschaftsinformatik","year":"2009","title":"The Value of Visibility and RFID in Transshipment Operations - A Simulation Study","authors":"Christoph Goebel, Oliver Günther","author_ids":"1709208, 1680584","abstract":"Shrinkage can lead to inventory record inaccuracy which in turn may negatively affect the performance of supply chain control policies. In this paper the impact of shrinkage on the efficiency of transshipment operations is demonstrated using stochastic simulation. In particular, the value of full inventory visibility which could be achieved using RFID is approximated. This value is shown to be relatively low given the assumed properties of the transshipment policy. Our preliminary results suggest waiting for further tangible benefits of RFID before building its business case in transshipment environments.","cites":"1","conferencePercentile":"42.22222222"},{"venue":"Wirtschaftsinformatik","id":"68d1222345c8cad227ca870f7e90b2eaa0503f7a","venue_1":"Wirtschaftsinformatik","year":"2009","title":"Vertical Integration and Information Sharing - An Empirical Investigation in the German Apparel Industry","authors":"Christoph Goebel, Hanna Krasnova, Henning Syllwasschy, Oliver Günther","author_ids":"1709208, 1991522, 3129464, 1680584","abstract":"Despite the astounding success of the fast fashion retailers, the management practices leading to these results have not been subject to extensive research so far. Given this background, we analyze the impact of information sharing and vertical integration on the performance of 51 German apparel companies. We find that the positive impact of vertical integration is mediated by information sharing, i.e. that the ability to improve the information flow is a key success factor of vertically integrated apparel supply chains. Thus, the success of an expansion strategy based on vertical integration critically depends on effective ways to share logistical information.","cites":"4","conferencePercentile":"81.11111111"},{"venue":"Wirtschaftsinformatik","id":"cc254de28b9150ddb5d026268dce3ca233c61b5d","venue_1":"Wirtschaftsinformatik","year":"1998","title":"The Dawn of the E-Lance Economy","authors":"Thomas W. Malone, Rob Laubacher","author_ids":"2235848, 3277384","abstract":"Will the large industrial corporation dominate the twenty-first century as it did the twentieth? Maybe not. Drawing on their research at MIT's Initiative on Inventing the Organizations of the 21st Century, Thomas Malone and Robert Laubacher postulate a world in which business is not controlled through a stable chain of management in a large, permanent company. Rather, it is carried out autonomously by independent contractors connected through personal computers and electronic networks. These electronically connected free-lancers-e-lancers-would join together into fluid and temporary networks to produce and sell goods and services. When the job is done--after a day, a month, a year--the network would dissolve and its members would again become independent agents. Far from being a wild hypothesis, the e-lance economy is, in many ways, already upon us. We see it in the rise of outsourcing and telecommuting, in the increasing importance within corporations of ad-hoc project teams, and in the evolution of the Internet. Most of the necessary building blocks of this type of business organization--efficient networks, data interchange standards, groupware, electronic currency, venture capital micromarkets--are either in place or under development. What is lagging behind is our imagination. But, the authors contend, it is important to consider sooner rather than later the profound implications of how such an e-lance economy might work. They examine the opportunities, and the problems, that may arise and anticipate how the role of managers may change fundamentally--or possibly even disappear altogether.","cites":"126","conferencePercentile":"100"},{"venue":"Wirtschaftsinformatik","id":"b695dada1376fc79679a61ed7a9f401bc66c4a0c","venue_1":"Wirtschaftsinformatik","year":"2011","title":"Micro-Blogging Adoption in the Enterprise: An Empirical Analysis","authors":"Valentin Schöndienst, Hanna Krasnova, Oliver Günther, Dirk Riehle","author_ids":"2582249, 1991522, 1680584, 2905414","abstract":"Given the increasing interest in using social software for company-internal communication and collaboration, this paper examines drivers and inhibitors of micro-blogging adoption at the workplace. While nearly one in two companies is currently planning to introduce social software, there is no empirically validated research on employees' adoption. In this paper, we build on previous focus group results and test our research model in an empirical study using Structural Equation Modeling. Based on our findings, we derive recommendations on how to foster adoption. We suggest that micro-blogging should be presented to employees as an efficient means of communication, personal brand building, and knowledge management. In order to particularly promote content contribution, privacy concerns should be eased by setting clear rules on who has access to postings and for how long they will be archived.","cites":"6","conferencePercentile":"89.13043478"},{"venue":"Wirtschaftsinformatik","id":"5ae128acc6b16482e62fb6271dcbef0ef6989f10","venue_1":"Wirtschaftsinformatik","year":"2007","title":"Third Generation Knowledge Management Systems - Towards an Augmented Technology Acceptance Model","authors":"Kai Dingel, Sarah Spiekermann","author_ids":"2403199, 1681853","abstract":"The paper examines the applicability and sufficiency of the Technology Acceptance Model (TAM) in the context of social software and newer generation knowledge management systems (KMS). A reinterpretation of the two TAM constructs \" Perceived Usefulness \" and \" Perceived Ease of Use \" in light of expectancy-valence theory reveals that the TAM predominantly focuses on performance expectations on different behavioral levels and, thus, fails to account for the entire range of drivers and barriers related to KMS usage.","cites":"1","conferencePercentile":"48.4375"},{"venue":"Wirtschaftsinformatik","id":"a70a47ef6685e4cdc6059ab8bf8aa7bf082d135b","venue_1":"Wirtschaftsinformatik","year":"2009","title":"Non-optimized Temporal Structures as a Failure Factor in Virtual Teams","authors":"Felix Köbler, Marilyn Tremaine, Jan Marco Leimeister, Helmut Krcmar","author_ids":"2814697, 3263455, 1737216, 1712422","abstract":"Despite the expected benefits of global virtual teams, their performance has been spotty and management continues to search for reasons why these teams fail. This work addresses this issue by performing a longitudinal case study of two virtual teams in order to uncover why one was more successful than the other. The study found that a key factor for one team's poor performance was the entrainment of the temporal norms of both the countries and the social situations of the members that reduced the available real time meeting space to zero.","cites":"0","conferencePercentile":"16.66666667"},{"venue":"Wirtschaftsinformatik","id":"7fba3c648e3e11876d27f965f28db251e34b8b47","venue_1":"Wirtschaftsinformatik","year":"2009","title":"Cooperation Mechanisms for Monitoring Agents in Service-oriented Architectures","authors":"André Miede, Jean-Baptiste Beiniet, Nicolas Repp, Julian Eckert, Ralf Steinmetz","author_ids":"1860209, 3026010, 3104557, 1782412, 1725298","abstract":"The Service-Oriented Architecture paradigm (SOA), e.g., realized with Web Services technology, enables enterprises to establish cross-organizational, service-based workflows. An important issue is the monitoring of the fulfillment of Service Level Agreements (SLAs) which define the responsibilities between the participants. Recent research has shown that agent technology is a useful approach in this context. Thus, we present ways for agent cooperation on different levels of abstraction. This cooperation aims at monitoring workflows and especially to react to deviations in different scenarios of SLA violations.","cites":"2","conferencePercentile":"60"},{"venue":"Wirtschaftsinformatik","id":"91adb59cd127b474cee4a9a75d720b54a7848766","venue_1":"Wirtschaftsinformatik","year":"2005","title":"How Similar Is It? Towards Personalized Similarity Measures in Ontologies","authors":"Abraham Bernstein, Esther Kaufmann, Christoph Buerki, Mark Klein","author_ids":"1780758, 2578263, 1974367, 3920905","abstract":"Finding a good similarity assessment algorithm for the use in ontologies is central to the functioning of techniques such as retrieval, matchmaking, clustering , data-mining, ontology translations, automatic database schema matching, and simple object comparisons. This paper assembles a catalogue of ontology based similarity measures, which are experimentally compared with a \" similarity gold standard \" obtained by surveying 50 human subjects. Results show that human and algorithmic similarity predications varied substantially, but could be grouped into cohesive clusters. Addressing this variance we present a personal-ized similarity assessment procedure, which uses a machine learning component to predict a subject's cluster membership, providing an excellent prediction of the gold standard. We conclude by hypothesizing ontology dependent similarity measures .","cites":"40","conferencePercentile":"96.2962963"},{"venue":"Wirtschaftsinformatik","id":"32c6618fc70d16f60dab3cde5f492060372ba1c7","venue_1":"Wirtschaftsinformatik","year":"2011","title":"Increasing Global Reach: Using Social Network Sites for Employer Branding","authors":"Franziska Brecht, Ksenia Koroleva, Oliver Günther","author_ids":"2664920, 3165456, 1680584","abstract":"Employer branding by means of Social Network Sites (SNS) has been inspired by two recent developments: the increase of user-generated content with the spread of Web 2.0 and the lack of specialized human resources. However, this phenomenon is yet not very well understood: Which companies use SNS for employer branding? What are the motivations behind it and what are the necessary success strategies? In this paper, we uncover main goals companies pursue, strategies that are employed and the possible benefits that can be attained with an SNS presence. Our results are based on an evaluation of a quantitative survey and a qualitative analysis of interviews with company representatives. We find that, if an SNS presence is established strategically, companies can increase their global reach, improve employer brand awareness, achieve positive user bonding, gather valuable feedback as well as recruit for vacant positions.","cites":"6","conferencePercentile":"89.13043478"},{"venue":"Wirtschaftsinformatik","id":"22beeecb4f6a467f54332af356b8d4118ad50e63","venue_1":"Wirtschaftsinformatik","year":"2013","title":"Personal Information Markets AND Privacy: A New Model to Solve the Controversy","authors":"Alexander Novotny, Sarah Spiekermann","author_ids":"7355478, 1681853","abstract":"From the early days of the information economy, personal data has been its most valuable asset. Despite data protection laws, companies trade personal information and often intrude on the privacy of individuals. As a result, consumers feel out of control and lose trust in electronic environments. Technologists and regulators are struggling to develop solutions that meet business-es' demand for more personal information while maintaining privacy. However, no promising proposals seem to be in sight. We propose a 3-tier personal information market model with privacy. In our model, clear roles, rights and obligations for all actors re-establish trust. The 'relationship space' enables data subjects and visible business partners to build trusting relationships. The 'ser-vice space' supports customer relationships with distributed information processing. The 'rich information space' enables anonymized information exchange. To transition to this model, we show how existing privacy-enhancing technologies and legal requirements can be integrated. 1 Introduction The digital economy is in a deep crisis. From the inception of the digital economy, personal information (PI) has emerged as its core asset. PI is \" any information relating to an identified or identifiable natural person \" [1]. Abundantly leveraged as a free commons, PI is at the core of Internet economics and is considered the motor for online innovation. \" Personal data is the new oil of the Internet and the new currency of the digital world \" [2]. It finances the Internet's free content. It strengthens an Inter-net company's competitive stance. In many cases, it is even the only ingredient that brings an online service to life (e.g., social networking). However, PI is also at the core of three facets that constitute humanity: Identity, dignity and privacy. And as PI is increasingly collected, used, packaged, and sold, more conflict arises around how people can retain control of their identities and protect their dignity and privacy. Under the umbrella terms \" data protection \" and \" privacy \"-the ability to control both the circulation of PI (out-flowing information) and the access of others to the self (in-flowing information) [3]-a global political debate has","cites":"3","conferencePercentile":"88.88888889"},{"venue":"Wirtschaftsinformatik","id":"31f3a1afebe961940c359fbee37ec2664265c62e","venue_1":"Wirtschaftsinformatik","year":"2005","title":"Drivers and Impediments of Consumer Online Information Search: Self-controlled versus Agent-assisted Search","authors":"Sarah Spiekermann, Dirk Temme, Martin Strobel","author_ids":"1681853, 2589440, 3184318","abstract":"This research investigates drivers of consumer's online search activity. Traditional constructs relevant in offline information search (including perceived product risk, purchase involvement and product knowledge) are tested for an on-line environment on the basis of a structural equation model. In addition, new constructs impacting online search, namely privacy concerns and flow, are analysed. A major contribution of this research is the explicit distinction of consumers' preference for agent-assisted search versus self-controlled search forms. The analysis is based on 116 subjects that were observed in their search behaviour during a 'real-world' shopping trip for cameras.","cites":"1","conferencePercentile":"25.92592593"},{"venue":"Wirtschaftsinformatik","id":"3c289b30ec96ebac232a939e7f64dc830ab22696","venue_1":"Wirtschaftsinformatik","year":"2005","title":"An Integrated Platform for Mobile, Context-Aware, and Adaptive Enterprise Applications","authors":"Gerald Hübsch, Thomas Springer, Axel Spriestersbach, Thomas Ziegert","author_ids":"2317953, 2227308, 2048793, 2915704","abstract":"In this paper we present an approach for the device-independent author-ing of mobile, context-aware and adaptive web applications. We present concepts for the semantic and syntactic adaptation of web dialogs to heterogeneous devices based on the Dialog Description Language. We describe advanced concepts for the integration of dynamic content and user interaction handling in device-independent application engineering. Furthermore, the software architecture of the Transcoding Framework, a runtime environment for dialog adaptation, is introduced. Finally, we present an adaptive sample application and give an outlook to future research topics.","cites":"1","conferencePercentile":"25.92592593"},{"venue":"Wirtschaftsinformatik","id":"60a75baa0d3c93382291c121f2ea8a33bbbd960d","venue_1":"Wirtschaftsinformatik","year":"2009","title":"Identity Management in Business Process Modelling: A Model-driven Approach","authors":"Heiko Klarl, Christian Wolff, Christian Emig","author_ids":"3193675, 1797184, 1704031","abstract":"The modelling of business processes is widely used in enterprises. Though this is very common, requirements for identity management and access control are often collected separately in documents or requirement tools. Due to the business-driven background of access control, this kind of requirement should be collected at the business site's business process model. This work introduces a meta-model for modelling access control requirements at the business process level. It combines the model and its requirements, reducing the risk of inconsistencies caused by process changes. A model-driven development process utilises the enriched models for generating policies for different identity management products.","cites":"5","conferencePercentile":"90"},{"venue":"Wirtschaftsinformatik","id":"7f006ebe4c5b98399978936a88a64fdb95f798c2","venue_1":"Wirtschaftsinformatik","year":"2013","title":"Towards Understanding Social Software and Its Impact on Corporate E-Learning Motivation","authors":"Thomas Wirtky, Sven Laumer, Andreas Eckhardt, Tim Weitzel","author_ids":"1747577, 1734224, 1720885, 1684996","abstract":"This research combines recent discussions in the cross-disciplinary areas of e-learning, social software, and training motivation. On the one hand, e-learning with its role in a fast paced knowledge society, its potential to revolutionize education and the gap between research and practitioners is already in discussion for years. Discussions are becoming more intense with the rise of social software. On the other hand, human resources, lifelong learning, and motivating employees to participate in trainings appear critical to organizations. This research focuses on e-learning in the corporate context and examines the impact of social software features on user motivation based on a review of training motivation literature and on 39 interviews conducted in an international IT services company. Findings suggest that the impact of social software features is still unknown, and that differentiating them by the learner's needs leads to further insights. 1 Introduction Trained employees are the most critical resource in a knowledge society [1] but knowledge becomes quickly outdated due to the increasing pace of changes. Lifelong learning becomes more than a popular phrase. The need for flexible ways of training is eminent and no longer met by constantly updating traditional classroom trainings. It is therefore not surprising that e-learning was thought to be one of the fastest growing sectors [2] and to revolutionize education [3]. While successful adoption of e-learning implementations was considerable in academia [4], it was only limited in the corporate context [5]. The reason for this lack of success is unlikely to be the e-learning technology, content or design as these factors hardly differ between academic and corporate contexts. The contextual difference is more likely to stem from the ultimate beneficiary. In the corporate context, it is not the learner ultimately benefiting from e-learning, but the investing corporation. Thus, additional motivation of the learner is one crucial factor for corporate e-learning to be successful [6].","cites":"1","conferencePercentile":"58.58585859"}]}