{"WISA.csv":[{"venue":"WISA","id":"304a25c0400f9ebbbff0e33d218be59e81efcda3","venue_1":"WISA","year":"2012","title":"Lightweight Client-Side Methods for Detecting Email Forgery","authors":"Eric Lin, John Aycock, Mohammad Mannan","author_ids":"5692166, 1747867, 7701975","abstract":"We examine a related, but distinct, problem to spam detection. Instead of trying to decide if email is spam or ham, we try to determine if email purporting to be from a known correspondent actually comes from that person – this may be seen as a way to address a class of targeted email attacks. We propose two methods, geolocation and stylometry analysis. The efficacy of geolocation was evaluated using over 73,000 emails collected from real users; stylometry, for comparison with related work from the area of computer forensics, was evaluated using selections from the Enron corpus. Both methods show promise for addressing the problem, and are complementary to existing anti-spam techniques. Neither requires global changes to email infrastructure, and both are done on the email client side, a practical means to empower end users with respect to security. Furthermore, both methods are lightweight in the sense that they leverage existing information and software in new ways, instead of needing massive deployments of untried applications.","cites":"5","conferencePercentile":"100"},{"venue":"WISA","id":"ba5d7132bcb3aa484099e6c380929be818b7d4f2","venue_1":"WISA","year":"2013","title":"Resistance Is Not Futile: Detecting DDoS Attacks without Packet Inspection","authors":"Arjun P. Athreya, Xiao Wang, Yu Seung Kim, Yuan Tian, Patrick Tague","author_ids":"2485724, 2632562, 2136427, 1696287, 2331637","abstract":"Packets in anonymous networks are fully protected. Therefore , traditional methods relying on packet header and higher layer information do not work to detect Distributed-Denial-of-Service (DDoS) attacks in anonymous networks. In this paper we propose to use observable statistics at routers that need no packet inspection to infer the presence of an attack. We propose packet resistance as a metric to detect the presence of attacks which reduce the availability of channel bandwidth for wireless routers in the core network. Our proposed detection framework is distributed, wherein each router in the network core monitors and reports its findings to an intermediate router. These intermediate routers form a hierarchical overlay to eventually reach a centralized attack monitoring center. The alarm messages are used to construct an attack path and determine the origin of the attack. We present simulation results to demonstrate the effectiveness of our proposed metric.","cites":"2","conferencePercentile":"59.09090909"},{"venue":"WISA","id":"677c49a14e4a6ee063a6cbd83a186f5aa507660a","venue_1":"WISA","year":"2014","title":"I've Got Your Number: - Harvesting Users' Personal Data via Contacts Sync for the KakaoTalk Messenger","authors":"Eunhyun Kim, Kyungwon Park, Hyoungshick Kim, Jaeseung Song","author_ids":"8536699, 6769175, 1802864, 3187321","abstract":"Instant messaging (IM) is increasingly popular among not only Internet but also smartphone users. In this paper, we analyze the security issue of an IM application, KakaoTalk, which is the most widely used in South Korea, with a focus on automated friends registration based on contacts sync. We demonstrate that there are multiple ways of collecting victims' personal information such as their names, phone numbers and photos, which can be potentially misused for a variety of cyber criminal activities. Our experimental results show that a user's personal data can be obtained automatically (0.26 seconds on average), and a large portion of KakaoTalk users (around 73%) uses their real names as display names. Finally, we suggest reasonable countermeasures to mitigate the discovered attacks, which have been confirmed and patched by the developers.","cites":"3","conferencePercentile":"100"},{"venue":"WISA","id":"1d09c5063644fa73b7a8add0a51236ad20111428","venue_1":"WISA","year":"2013","title":"We Are Still Vulnerable to Clickjacking Attacks: About 99 % of Korean Websites Are Dangerous","authors":"Daehyun Kim, Hyoungshick Kim","author_ids":"2170078, 1802864","abstract":"Clickjacking is an attack that tricks victims into clicking on invisible elements of a web page to perform an unintended action that is advantageous for an attacker. To defend against clickjacking, many techniques have already been proposed, but it is still unclear whether they are effectively deployed in practice. We study how vulnerable Korean websites are to clickjacking attacks by performing real attacks on top 100 popular Korean websites as well as all the financial websites. Our results are quite significant: almost all Korean websites (about 99.2%) that we looked at are vulnerable to clickjacking attacks. Extending our observation to mobile websites, we can also obtain similar results.","cites":"1","conferencePercentile":"36.36363636"},{"venue":"WISA","id":"fe89b0d4220c000d3cb7fd57315df419d9a68b53","venue_1":"WISA","year":"2003","title":"PANA/IKEv2: An Internet Authentication Protocol for Heterogeneous Access","authors":"Paulo S. Pagliusi, Chris J. Mitchell","author_ids":"2438857, 1723348","abstract":"Currently there are no Internet access authentication protocols available that support both symmetric and asymmetric cryptographic techniques, can be carried over arbitrary access networks, and are flexible enough to be re-used in all the likely future ubiquitous mobility access contexts. This article proposes the PANA/IKEv2 authentication protocol for heterogeneous network access as a step towards filling this gap. A security analysis of the PANA/IKEv2 protocol is also provided. This article aims primarily at contributing to the design of authentica-tion protocols suitable for use in future heterogeneous Internet access environments supporting ubiquitous mobility.","cites":"0","conferencePercentile":"16.66666667"},{"venue":"WISA","id":"5148bd8045ecc007f0e34f7bb9384395c582e66d","venue_1":"WISA","year":"2014","title":"Analyzing Unnecessary Permissions Requested by Android Apps Based on Users' Opinions","authors":"Jina Kang, Daehyun Kim, Hyoungshick Kim, Jun Ho Huh","author_ids":"8513018, 2170078, 1802864, 1805420","abstract":"Many existing mobile apps request for unnecessary permissions knowing that users often ignore permission warning messages. We conducted an online user study to investigate how users feel about permissions being requested by both free and paid Android apps. Results show that users tend to feel that free Android apps request for more unnecessary permissions compared to paid apps. Users also felt that older apps (those that are previously released and have gone through several updates) request for more unnecessary permissions than those that are newly released. Based on that observation, we surmise that many developers initially publish apps that require a small set of permissions (so that users are not discouraged from installing an app), and gradually add more permissions to their apps through updates.","cites":"0","conferencePercentile":"50"},{"venue":"WISA","id":"caf95d3f75c5a286aae94d154014739ed6514273","venue_1":"WISA","year":"2006","title":"Controllable Ring Signatures","authors":"Wei Gao, Guilin Wang, Xueli Wang, Dongqing Xie","author_ids":"1698396, 8349653, 8681157, 1808535","abstract":"This paper introduces a new concept called controllable ring signature which is ring signature with additional properties as follow. (1) Anonymous identification: by an anonymous identification protocol, the real signer can anonymously prove his authorship of the ring signature to the verifier. And this proof is non-transferable. (2) Linkable signature: the real signer can generate an anonymous signature such that every one can verify whether both this anonymous signature and the ring signature are generated by the same anonymous signer. (3) Convertibility: the real signer can convert a ring signature into an ordinary signature by revealing the secret information about the ring signature. These additional properties can fully ensure the interests of the real signer. Especially, compared with a standard ring signature, a controllable ring signature is more suitable for the classic application of leaking secrets. We construct a controllable ring signature scheme which is provably secure according to the formal definition.","cites":"1","conferencePercentile":"25"},{"venue":"WISA","id":"ca56e61e136ae7153c6cfd6ad3c7124fc4d8a6f9","venue_1":"WISA","year":"2015","title":"Encryption is Not Enough: Inferring User Activities on KakaoTalk with Traffic Analysis","authors":"Kyungwon Park, Hyoungshick Kim","author_ids":"6769175, 1802864","abstract":"Many people started being concerned about their privacy in delivering private chats, photographs, contacts and other personal information through mobile instant messaging services. Fortunately, in the majority of mobile instant messaging services, encrypted communication channels (e.g., using the SSL/TLS protocols) are used by default to protect delivered messages against eavesdropping attacks. In this paper, however, we show that encryption is not enough. For example, in a real world service named KakaoTalk, many users' online activities can effectively be identified with 99.7% accuracy even though traffic is encrypted. We present a practical traffic analysis attack using a supervised machine learning technique.","cites":"0","conferencePercentile":"50"},{"venue":"WISA","id":"1668a1d1196f988b497d2e9465e365b7fabb804e","venue_1":"WISA","year":"2013","title":"Bifocals: Analyzing WebView Vulnerabilities in Android Applications","authors":"Erika Chin, David Wagner","author_ids":"3158618, 4073051","abstract":"WebViews allow Android developers to embed a webpage within an application, seamlessly integrating native application code with HTML and Java-Script web content. While this rich interaction simplifies developer support for multiple platforms, it exposes applications to attack. In this paper, we explore two WebView vulnerabilities: excess authorization, where malicious JavaScript can invoke Android application code, and file-based cross-zone scripting, which exposes a device's file system to an attacker. We build a tool, Bifocals, to detect these vulnerabilities and characterize the prevalence of vulnerable code. We found 67 applications with WebView-related vulnerabilities (11% of applications containing WebViews). Based on our findings , we suggest a modification to WebView security policies that would protect over 60% of the vulnerable applications with little burden on developers.","cites":"14","conferencePercentile":"100"}]}