{"WISCSCCS.csv":[{"venue":"WISCS@CCS","id":"42c029d4cc2c585b6ec5543572dd72332108786d","venue_1":"WISCS@CCS","year":"2014","title":"Privacy Preserving Data Quality Assessment for High-Fidelity Data Sharing","authors":"Julien Freudiger, Shantanu Rane, Alejandro E. Brito, Ersin Uzun","author_ids":"1706269, 2028448, 1747120, 2530323","abstract":"In a data-driven economy that struggles to cope with the volume and diversity of information, data quality assessment has become a necessary precursor to data analytics. Real-world data often contains inconsistencies, conflicts and errors. Such dirty data increases processing costs and has a negative impact on analytics. Assessing the quality of a dataset is especially important when a party is considering acquisition of data held by an untrusted entity. In this scenario, it is necessary to consider privacy risks of the stakeholders.\n This paper examines challenges in privacy-preserving data quality assessment. A two-party scenario is considered, consisting of a client that wishes to test data quality and a server that holds the dataset. Privacy-preserving protocols are presented for testing important data quality metrics: completeness, consistency, uniqueness, timeliness and validity. For semi-honest parties, the protocols ensure that the client does not discover any information about the data other than the value of the quality metric. The server does not discover the parameters of the client's query, the specific attributes being tested and the computed value of the data quality metric. The proposed protocols employ additively homomorphic encryption in conjunction with condensed data representations such as counting hash tables and histograms, serving as efficient alternatives to solutions based on private set intersection.","cites":"4","conferencePercentile":"80"},{"venue":"WISCS@CCS","id":"30ae96bb289f5f652f1bafea26774e182c0e10e1","venue_1":"WISCS@CCS","year":"2015","title":"Mandatory Security Information Sharing with Authorities: Implications on Investments in Internal Controls","authors":"Stefan Laube, Rainer Böhme","author_ids":"2032471, 1748910","abstract":"New regulations mandating firms to share information on security breaches and security practices with authorities are high on the policy agenda around the globe. These initiatives are based on the hope that authorities can effectively advise and warn other firms, thereby strengthening overall defense and response to cyberthreats in an economy. If this mechanism works (as assumed in this paper with varying effectiveness), it has consequences on security investments of rational firms. We devise an economic model that distinguishes between investments in detective and preventive controls, and analyze its Nash equilibria. The model suggests that firms subject to mandatory security information sharing 1) over-invest in security breach detection as well as under-invest in breach prevention, and 2), depending on the enforcement practices, may shift investment priorities from detective to preventive controls. We also identify conditions where the regulation increases welfare.","cites":"3","conferencePercentile":"94.44444444"},{"venue":"WISCS@CCS","id":"258ef4b0299f6b98c4453a02d25a4112e756bb46","venue_1":"WISCS@CCS","year":"2014","title":"Critter: Content-Rich Traffic Trace Repository","authors":"Vinod Sharma, Genevieve Bartlett, Jelena Mirkovic","author_ids":"5544418, 2087629, 1725213","abstract":"Access to current application and network data is vital to cybersecurity and networking research. Intrusion detection, steganography, traffic camouflaging, traffic classification and modeling all benefit from real-world data. Such data provides training, testing, and evaluation as well as furthers efforts to reach ground truth. Currently available network data--especially data with application-level information--is often outdated and is either private or customized to specific, narrow research needs. The biggest hurdle to obtaining such content-rich data is addressing the huge privacy risks associated with sharing such complex and open-ended data. In this paper we present a data sharing system called Critter-at-Home which addresses these challenges. Critter connects end-users willing to share data with researchers and strikes a balance between privacy risks for a data contributor and utility for a researcher.","cites":"2","conferencePercentile":"45"},{"venue":"WISCS@CCS","id":"16fa13f88b1d7310906b3c4140ed115e7da54499","venue_1":"WISCS@CCS","year":"2014","title":"PrefiSec: A Distributed Alliance Framework for Collaborative BGP Monitoring and Prefix-based Security","authors":"Rahul Hiran, Niklas Carlsson, Nahid Shahmehri","author_ids":"2954448, 1739691, 1723372","abstract":"This paper presents the design and data-driven overhead analysis of PrefiSec, a distributed framework that helps collaborating organizations to effectively maintain and share network information in the fight against miscreants. PrefiSec is a novel distributed IP-prefix-based solution, which maintains information about the activities associated with IP prefixes (blocks of IP addresses) and autonomous systems (AS). Within PrefiSec, we design and evaluate simple and scalable mechanisms and policies that allow participating entities to effectively share network information, which helps to protect against prefix/subprefix attacks, interception attacks, and a wide range of edge-based attacks, such as spamming, scanning, and botnet activities. Timely reporting of such information helps participants improve their security, keep their security footprints clean, and incentivizes participation. Public wide-area BGP-announcements, traceroutes, and simulations are used to estimate the overhead, scalability, and alert rates. Our results show that PrefiSec helps improve system security, and can scale to large systems.","cites":"2","conferencePercentile":"45"},{"venue":"WISCS@CCS","id":"1f217b234fab516030ecd3265ae4544d3f64d39d","venue_1":"WISCS@CCS","year":"2015","title":"UX Aspects of Threat Information Sharing Platforms: An Examination & Lessons Learned Using Personas","authors":"Tomas Sander, Joshua M. Hailpern","author_ids":"2952332, 2837900","abstract":"This paper initiates the systematic study of the human elements of participating in an information exchange using a Threat Information Sharing Platform (TISP). Much of the most valuable information to be shared within a TISP is created or validated by human security analysts. Thus getting UX design and the human motivations for a TISP right is crucial for its success. We approach this problem from one of the primary HCI and UX methods | personas. Our results allow TISP engineers and designers to understand and articulate the value propositions as well as the obstacles of a TISP for the CSIRT (Computer Security Incident and Response Team) of an organization. Second, we crafted a set of design requirements explicitly drawn from our personas. These design requirements explicitly highlight how TISPs can be improved, or needs that should be addressed to increase their value-add and usability. Our five personas were created from eight hour long interviews as well as over 20 hours of ethnographic observation of CSIRTs and Security Operations Centers (SOCs.)","cites":"1","conferencePercentile":"33.33333333"}]}