{"WISDOM_12.csv":[{"venue":"WISDOM '12","id":"afb2e516165043c8e673ef1c0ff5214bb8f52a07","venue_1":"WISDOM '12","year":"2012","title":"Combining lexicon and learning based approaches for concept-level sentiment analysis","authors":"Andrius Mudinas, Dell Zhang, Mark Levene","author_ids":", 1725070, 1722499","abstract":"In this paper, we present the anatomy of <i>pSenti</i> --- a concept-level sentiment analysis system that seamlessly integrates into opinion mining lexicon-based and learning-based approaches. Compared with pure lexicon-based systems, it achieves significantly higher accuracy in sentiment polarity classification as well as sentiment strength detection. Compared with pure learning-based systems, it offers more structured and readable results with aspect-oriented explanation and justification, while being less sensitive to the writing style of text. Our extensive experiments on two real-world datasets (CNET software reviews and IMDB movie reviews) confirm the superiority of the proposed hybrid approach over state-of-the-art systems like <i>SentiStrength</i>.","cites":"23","conferencePercentile":"100"},{"venue":"WISDOM '12","id":"41bc6b023648985067d611c7aa78d7ed0c2112c4","venue_1":"WISDOM '12","year":"2012","title":"Predicting collective sentiment dynamics from time-series social media","authors":"Le T. Nguyen, Pang Wu, William Chan, Wei Peng, Ying Zhang","author_ids":"3244957, 2284055, 4217438, 1716703, 1752812","abstract":"More and more people express their opinions on social media such as Facebook and Twitter. Predictive analysis on social media time-series allows the stake-holders to leverage this immediate, accessible and vast reachable communication channel to react and proact against the public opinion. In particular, understanding and predicting the sentiment change of the public opinions will allow business and government agencies to react against negative sentiment and design strategies such as dispelling rumors and post balanced messages to revert the public opinion. In this paper, we present a strategy of building statistical models from the social media dynamics to predict collective sentiment dynamics. We model the collective sentiment change without delving into micro analysis of individual tweets or users and their corresponding low level network structures. Experiments on large-scale Twitter data show that the model can achieve above 85% accuracy on directional sentiment prediction.","cites":"10","conferencePercentile":"80"},{"venue":"WISDOM '12","id":"4287066d1eaabc8c4bd48cd5853080659fdd15e4","venue_1":"WISDOM '12","year":"2012","title":"Crowdsourcing recommendations from social sentiment","authors":"Yusheng Xie, Yu Cheng, Daniel Honbo, Kunpeng Zhang, Ankit Agrawal, Alok Choudhary","author_ids":"3052897, 3614526, 2963927, 6333335, 1725914, 1686646","abstract":"In this paper, we investigate an innovative recommendation system by incorporating relevant social opinion and sentiment information. Our recommendation system, a powerful application of social sentiment analysis, differs from many existing models, which investigate the situation where the social network itself is structured to work with the product ranking and is specially built inside an e-commerce website. In contrast, our proposed system focuses on constructing and inferring product recommendations from external social network services (SNS) such as Facebook. In our system, we process product features in a finite-dimensional polynomial linear space. Additional components of our proposed system include an asymmetric similarity measurement and an asymmetric advantage measurement. We also show that our definitions for the two measurements include specific properties that reduce the computational overhead in the experiments. An important aspect of our modeling is to incorporate user-generated high-level semantic sentiment in the analysis. We apply our models to real time data and observe promising results for not only product recommendation but also job recommendation.","cites":"3","conferencePercentile":"60"},{"venue":"WISDOM '12","id":"2b10b8aada91b91d3424c69773bbc906f9ca3e1d","venue_1":"WISDOM '12","year":"2012","title":"Finding emotion in image descriptions","authors":"Morgan Ulinski, Victor Soto, Julia Hirschberg","author_ids":"3037767, 3328734, 1784850","abstract":"In this paper, we approach the problem of classifying emotion in image descriptions. A method is proposed to perform 6-way emotion classification and is tested against two labeled datasets: a corpus of blog posts mined from LiveJournal and a corpus of descriptive texts of computer generated scenes. We perform feature selection using the mRMR technique and then use a multi-class linear predictor to classify posts among the Ekman Big Six emotions (<i>happiness, sadness, anger, surprise, fear, and disgust</i>) [9]. We find that TFIDF scores on lexical features and LIWC scores are much more helpful in emotion classification than using scores calculated from existing sentiment dictionaries, and that our proposed method performs significantly better than a baseline classifier that chooses the majority class. On the blog posts, we achieve 40% accuracy, and on the corpus of image descriptions, we achieve up to 63% accuracy.","cites":"1","conferencePercentile":"40"}]}