{"WISEC.csv":[{"venue":"WISEC","id":"5592c23ec60bc6e7501a69e85410e9d04915d211","venue_1":"WISEC","year":"2015","title":"How talkative is your mobile device?: an experimental study of Wi-Fi probe requests","authors":"Julien Freudiger","author_ids":"1706269","abstract":"The IEEE 802.11 standard defines Wi-Fi probe requests as a active mechanism with which mobile devices can request information from access points and accelerate the Wi-Fi connection process. Researchers in previous work have identified privacy hazards associated with Wi-Fi probe requests, such as leaking past access points identifiers and user mobility. Besides several efforts to develop privacy-preserving alternatives, modern mobile devices continue to use Wi-Fi probe requests. In this work, we quantify Wi-Fi probe requests' threat to privacy by conducting an experimental study of the most popular smartphones in different settings. Our objective is to identify how different factors influence the probing frequency and the average number of broadcasted probes. Our conclusions are worrisome: On average, some mobile devices send probe requests as often as 55 times per hour, thus revealing their unique MAC address at high frequency. Even if a mobile device is not charging and in sleep mode, it might broadcast about 2000 probes per hour. We also evaluate a commercially deployed MAC address randomization mechanism, and demonstrate a simple method to re-identify anonymized probes.","cites":"9","conferencePercentile":"97.05882353"},{"venue":"WISEC","id":"adf4fbc05d13b29eac201fbcd9e11b1d0441468a","venue_1":"WISEC","year":"2008","title":"Wireless authentication using remote passwords","authors":"Andrew Harding, Timothy W. van der Horst, Kent E. Seamons","author_ids":"1736294, 2882066, 1774940","abstract":"Current wireless authentication mechanisms typically rely on inflexible shared secrets or a heavyweight public-key infrastructure with user-specific digital certificates and, as such, lack general support for environments with dynamic user bases where guest access is frequent. Simple Authentication for the Web (SAW) facilitates dynamic user bases in the context of web site logins by enabling users to authenticate to personal messaging identifiers (e.g., email addresses, IM handles, cell phone numbers). SAW, however, is ill-suited for wireless authentication because, in most cases, it is dependent on client-side Internet connectivity. Wireless Authentication using Remote Passwords (WARP) overcomes this constraint by building a hybrid protocol that combines the principles of SAW authentication with the Secure Remote Password (SRP) protocol.","cites":"3","conferencePercentile":"12.06896552"},{"venue":"WISEC","id":"b7698b3541f8f1f761e950890c12950fedf1c672","venue_1":"WISEC","year":"2010","title":"Preventing multi-query attack in location-based services","authors":"Nilothpal Talukder, Sheikh Iqbal Ahamed","author_ids":"1692757, 1741081","abstract":"Despite increasing popularity, Location-based Services (LBS) (e.g., searching nearby points-of-interest on map) on mobile handheld devices have been subject to major privacy concerns for users. The existing third-party privacy protection methods hide the exact location of users from service providers by sending cloaking regions (CR) that contain several other user locations in the vicinity. However, this has not ensured LBS full immunity from the privacy concerns. In this paper, we describe a serious privacy problem of LBS called multi-query attack. In this attack, the exact location of the service requester can be inferred by the adversary through obtaining cloaking regions that are shrunk or extended in subsequent queries. This problem can be addressed by judiciously retaining, over a period of time, the cloaking regions for the same set of users. Most methods in the literature are weakened for considering only a static snapshot of users during evaluation. Thus, any update due to user movements in real time becomes very costly. Our proposed approach, ANNC (Adaptive Nearest Neighborhood Cloaking) ,emphasizes developing disjoint sets of users dynamically over time in order to share the common CRs. The CRs are organized in balanced binary trees with restricted height. Thus ANNC achieves the balance between search efficiency and quality of cloaking with higher anonymity levels. The experimental evaluation demonstrates that ANNC will be more efficient in practice than other well-known approaches.","cites":"8","conferencePercentile":"52.27272727"},{"venue":"WISEC","id":"2e206b97ce245db1f150bd4280ad323239228914","venue_1":"WISEC","year":"2016","title":"A Prover-Anonymous and Terrorist-Fraud Resistant Distance-Bounding Protocol","authors":"Xavier Bultel, Sébastien Gambs, David Gerault, Pascal Lafourcade, Cristina Onete, Jean-Marc Robert","author_ids":"3399390, 1777382, 3385569, 3438430, 3219611, 2291969","abstract":"Contactless communications have become omnipresent in our daily lives, from simple access cards to electronic passports. Such systems are particularly vulnerable to <i>relay attacks</i>, in which an adversary relays the messages from a prover to a verifier. Distance-bounding protocols were introduced to counter such attacks. Lately, there has been a very active research trend on improving the security of these protocols, but also on ensuring strong privacy properties with respect to active adversaries and malicious verifiers.\n In particular, a difficult threat to address is the <i>terrorist fraud</i>, in which a far-away prover cooperates with a nearby accomplice to fool a verifier. The usual defence against this attack is to make it impossible for the accomplice to succeed unless the prover provides him with enough information to recover his secret key and impersonate him later on. However, the mere existence of a long-term secret key is problematic with respect to privacy.\n In this paper, we propose a <i>novel approach</i> in which the prover does not leak his secret key but a reusable session key along with a group signature on it. This allows the adversary to impersonate him even without knowing his signature key. Based on this approach, we give the first distance-bounding protocol, called SPADE, integrating anonymity, revocability and provable resistance to standard threat models.","cites":"1","conferencePercentile":"82.25806452"},{"venue":"WISEC","id":"1ebcbe54c115e1ec75dd622257472d44cc745b9a","venue_1":"WISEC","year":"2009","title":"An attacker model for MANET routing security","authors":"Jared Cordasco, Susanne Wetzel","author_ids":"1718085, 1739446","abstract":"Mobile ad-hoc networks are becoming ever more popular due to their flexibility, low cost, and ease of deployment. However, to achieve these benefits the network must employ a sophisticated routing protocol. Early proposed routing protocols were not designed to operate in the presence of attackers. There have been many subsequent attempts to secure these protocols, each with its own advantages and disadvantages. To allow for a comparison of these secure protocols, a single common attacker model is needed. Our first contribution in this work is to develop a comprehensive attacker model categorizing attackers based on their capabilities. This is in contrast to the existing models which seek to categorize attacks and then map that categorization back onto the attackers. Our second contribution is an analysis of the SAODV routing protocol using our new model, which demonstrates the structured approach inherent in our model and its benefits compared to existing work.","cites":"5","conferencePercentile":"21.15384615"},{"venue":"WISEC","id":"1bda4141843b19cb403c0209d88b5a76c5242ed8","venue_1":"WISEC","year":"2011","title":"On the robustness of IEEE 802.11 rate adaptation algorithms against smart jamming","authors":"Guevara Noubir, Rajmohan Rajaraman, Bo Sheng, Bishal Thapa","author_ids":"1742346, 1696669, 2226840, 1821336","abstract":"We investigate the resiliency of IEEE802.11 rate adaptation algorithms (RAA) against smart jamming attacks. We consider several classes of state-of-the-art RAAs that include the SampleRate, ONOE, AMRR, and the RAA used in Atheros Microsoft Windows XP driver. We model the behavior of these algorithms, and show the existence of very efficient attacks that exploit RAA-specific vulnerabilities as well as the inherent weaknesses that exist in the design of IEEE802.11 MAC and link layer protocol: in particular the overt packet rate information being transmitted, predictable rate selection mechanism, performance anomaly caused by the equiprobability of transmissions among all nodes regardless of the data rates being employed, and the lack of interference differentiation from poor link quality by IEEE802.11 RAAs. In this work, we present algorithms that determine optimal jamming strategies against RAAs for a given jamming budget, and experimentally demonstrate the efficiency of these smart jamming attacks, which can be orders of magnitude more efficient than naive jamming. For example, in the case of SampleRate, eight reactive jamming pulses every second are sufficient to achieve the same network throughput degradation achieved by a periodic jammer with the jamming energy cost 100 times higher. Some of the RAAs react even worse to smart jamming attacks; ONOE in particular suffers from the phenomenon of congestion collapse where the nodes fail to recover from the lowest data rate even after the jammer stops jamming. At the end, we summarize fundamental reasons behind such RAA vulnerabilities and propose a preliminary set of mitigation techniques. We leave the experimental demonstration of the efficiency of the proposed mitigation mechanisms for future work.","cites":"31","conferencePercentile":"94.73684211"},{"venue":"WISEC","id":"2bfbfb72a149ebcbb0761d0653626e6de02e0b4d","venue_1":"WISEC","year":"2008","title":"Anti-jamming timing channels for wireless networks","authors":"Wenyuan Xu, Wade Trappe, Yanyong Zhang","author_ids":"1737805, 1702051, 1813845","abstract":"Wireless communication is susceptible to radio interference, which prevents the reception of communications. Although evasion strategies have been proposed, such strategies are costly or ineffective against broadband jammers. In this paper, we explore an alternative to evasion strategies that involves the establishment of a timing channel that exists in spite of the presence of jamming. The timing channel is built using failed packet reception times. We first show that it is possible to detect failed packet events inspite of jamming. We then explore single sender and multisender timing channel constructions that may be used to build a low-rate overlay link-layer. We discuss implementation issues that we have overcome in constructing such jamming-resistant timing channel, and present the results of validation efforts using the MICA2 platform. Finally, we examine additional error correction and authentication mechanisms that may be used to cope with adversaries that both jam and seek to corrupt our timing channel.","cites":"38","conferencePercentile":"81.03448276"},{"venue":"WISEC","id":"b894181fbef2bd8bee8389204fe4a244afcd7769","venue_1":"WISEC","year":"2014","title":"Short paper: \"here i am, now pay me!\": privacy concerns in incentivised location-sharing systems","authors":"Luke Hutton, Tristan Henderson, Apu Kapadia","author_ids":"2572249, 1709994, 3163956","abstract":"Social network sites, location-sharing services and, more recently, applications enabling the quantified self, mean that people are generating and sharing more data than ever before. It is important to understand the potential privacy impacts when such personal data are commercialised, to ensure that expectations of privacy are preserved. This paper presents the first user study of incentivised location sharing, where people are given a direct monetary incentive to share their location with a business or their social network. We use Nissenbaum's framework of contextual integrity in a preliminary user study (n=22) to investigate potential privacy risks with such services. We find that monetisation changes why people share their data, but not the frequency of disclosures. Our results motivate further study and are useful for designers of location-sharing systems and researchers who wish to leverage the diverse range of personal data that are available in a privacy-sensitive manner.","cites":"2","conferencePercentile":"32.69230769"},{"venue":"WISEC","id":"73dd39eaa26c327ece1d67a870242b4f402a1b03","venue_1":"WISEC","year":"2013","title":"SeDyA: secure dynamic aggregation in VANETs","authors":"Rens Wouter van der Heijden, Stefan Dietzel, Frank Kargl","author_ids":"2027849, 1767520, 1728575","abstract":"In vehicular ad-hoc networks (VANETs), a use case for mobile ad-hoc networks (MANETs), the ultimate goal is to let vehicles communicate using wireless message exchange to provide safety, traffic efficiency, and entertainment applications. Especially traffic efficiency applications benefit from wide-area message dissemination, and aggregation of information is an important tool to reduce bandwidth requirements and enable dissemination in large areas. The core idea is to exchange high quality summaries of the current status rather than forwarding all individual messages. Securing aggregation schemes is important, because they may be used for decisions about traffic management, as well as traffic statistics used in political decisions concerning road safety and availability. The most important challenge for security is that aggregation removes redundancy and the option to directly verify signatures on atomic messages. Existing proposals are limited, because they require roads to be segmented into small fixed-size regions, beyond which aggregation cannot be performed. In this paper, we introduce SeDyA, a scheme that allows more dynamic aggregation compared to existing work, while also providing stronger security guarantees. We evaluate SeDyA against existing proposals to show the benefits in terms of information accuracy, bandwidth usage, and resilience against attacks.","cites":"2","conferencePercentile":"26"},{"venue":"WISEC","id":"6a51b5b254f1c00b0ba6535d99406a101fa90d29","venue_1":"WISEC","year":"2008","title":"RFID security and privacy: long-term research or short-term tinkering?","authors":"Gene Tsudik, Mike Burmester, Ari Juels, Alfred Kobsa, David Molnar, Roberto Di Pietro, Melanie R. Rieback","author_ids":"1702391, 1726346, 1687161, 1715227, 2804783, 1728076, 2408308","abstract":"RFID technology has raised a number of both real and imagined security and privacy fears and concerns. Since roughly 2001, a number of researchers have stepped up to the plate and proposed techniques for strengthening RFID security and privacy, while others have focused on attacking (and demonstrating weaknesses in) currently deployed RFID systems. Despite a few PhD theses devoted to this topic, it remains to be seen whether there are any new long-term fundamental issues involved in RFID security &amp; privacy. Therefore, this panel's goal is to present and debate the panelists' diverse perspectives on the future (or lack thereof) of RFID security and privacy research.\n One line of thought is that this topic is a mere fad. After all, RFID tags are computational amoebas, akin to dumb sensors that sense nothing. RFID tags do not network and do not collect anything; hence, the only interaction worth considering is between a tag and a reader. Is there anything challenging remaining beyond the set of cryptographically contortionist protocols and techniques already proposed in the literature?\n An opposing point of view is that RFID technology has opened up a new and exciting avenue for research which is here to stay. Although some basic protocols have been designed, there are several important outstanding issues, including (but not limited to) the following. One purely technical issue that remains unaddressed is how to handle revocation of rogue readers. Inherent lack of on-board clocks makes revocation checking very difficult. There is also the problem of secure pairing of personal RFID tags (e.g., in passports and transponders) with other ubiquitous devices, e.g., cell-phones, laptops or PDAs. Another is the design of inexpensive and robust privacy \"shields\" for protecting RFID tags -- carried by a potentially unwitting user -- from leaking information. Yet another important unexplored issue is <i>user perception</i> and, more generality, usability aspects of RFID tags. This is surprising since, unlike sensors/WSNs or MANETs, RFID tags are expected to be close and relevant to the average user/consumer.\n This international panel is composed of academic and industrial experts in cryptography, security/privacy and usability, each with a track record of research results in the respective aspects of RFID technology. The panelists' statements and the summary of the panel discussion will be available (after the conference) at: http://sconce.ics.uci.edu/wisec08-rfid-panel.","cites":"2","conferencePercentile":"6.896551724"},{"venue":"WISEC","id":"17d0709ce90dba257f372511b3215443e4f142be","venue_1":"WISEC","year":"2012","title":"Design of SMS commanded-and-controlled and P2P-structured mobile botnets","authors":"Yuanyuan Zeng, Kang G. Shin, Xin Hu","author_ids":"1692657, 1730051, 5232730","abstract":"Botnets are one of the most serious security threats to the Internet and personal computer (PC) users. Although botnets have not yet caused major outbreaks in the mobile world, with the rapidly-growing popularity of smartphones such as Apple's iPhone and Android-based phones that store more personal data and gain more capabilities than earlier generation handsets, botnets are expected to become a severe threat to smartphones soon. In this paper, we propose the design of a mobile botnet that makes the most of mobile services and is resilient to disruption. The mobile botnet utilizes SMS messages for C&#38;C and a P2P structure as its topology. Our simulation results demonstrate that a modified Kademlia---a structured architecture---is a better choice for the mobile botnet's topology. In addition, we discuss potential countermeasures to defend against this mobile botnet threat.","cites":"21","conferencePercentile":"82.35294118"},{"venue":"WISEC","id":"9a0f48ab046da2e7782fb1176dcf4610b26bf00f","venue_1":"WISEC","year":"2013","title":"Private proximity testing with an untrusted server","authors":"Gökay Saldamli, Richard Chow, Hongxia Jin, Bart P. Knijnenburg","author_ids":"1702452, 2227735, 1705713, 2477993","abstract":"The privacy of location-based services has gained attention with their increased popularity. To date, citing insufficient privacy demand and inefficient/immature privacy preserving technologies, service providers have not been willing to build private-enhanced systems in which they do not have access to users' location information. However, current practice is likely to change in coming years with increasing privacy awareness and technological advances. For instance, Narayanan et al. recently introduced a fast private equality testing protocol for proximity testing with an untrusted server. In the current work, based on basic notions of geometry and linear algebra, we describe a new three-party protocol for solving the same problem. Our proposed protocol decreases the number of encryptions needed and gives a more efficient solution for private equivalence testing.","cites":"4","conferencePercentile":"48"},{"venue":"WISEC","id":"ede0481b621cad3f4e3e6f9101778e27a7a68a16","venue_1":"WISEC","year":"2015","title":"A measurement study of tracking in paid mobile applications","authors":"Suranga Seneviratne, Harini Kolamunna, Aruna Seneviratne","author_ids":"3342663, 3134176, 1678254","abstract":"Smartphone usage is tightly coupled with the use of apps that can be either free or paid. Numerous studies have investigated the tracking libraries associated with free apps. Only a limited number of these have focused on paid apps. As expected, these investigations indicate that tracking is happening to a lesser extent in paid apps, yet there is no conclusive evidence. This paper provides the first large-scale study of paid apps. We analyse top paid apps obtained from four different countries: Australia, Brazil, Germany, and US, and quantify the level of tracking taking place in paid apps in comparison to free apps. Our analysis shows that 60% of the paid apps are connected to trackers that collect personal information compared to 85%--95% in free apps. We further show that approximately 20% of the paid apps are connected to more than three trackers. With tracking being pervasive in both free and paid apps, we then quantify the aggregated privacy leakages associated with individual users. Using the data of user installed apps of over 300 smartphone users, we show that 50% of the users are exposed to more than 25 trackers which can result in significant leakages of privacy.","cites":"2","conferencePercentile":"64.70588235"},{"venue":"WISEC","id":"fc0eefc6b12383848824288c851206d6388d71ec","venue_1":"WISEC","year":"2012","title":"Security for cyber-physical systems: case studies with medical devices, robots, and automobiles","authors":"Tadayoshi Kohno","author_ids":"1769675","abstract":"Today's and tomorrow's emerging technologies and cyber-physical systems have the potential to greatly improve the quality of our lives. Without the appropriate checks and balances, however, these emerging technologies also have the potential to compromise our digital and physical security and privacy. This talk will explore three case studies in the design and analysis of secure cyber-physical systems: wireless medical devices, robots, and automobiles. We will discuss the discovery of vulnerabilities in leading examples of these technologies, the challenges to securing these technologies and the ecosystem leading to their vulnerabilities, and new directions for security.","cites":"1","conferencePercentile":"26.47058824"},{"venue":"WISEC","id":"517c0b1faacea61373a5fcc9e9cf85c8e0a54dea","venue_1":"WISEC","year":"2016","title":"POSTER: Friend or Foe? Context Authentication for Trust Domain Separation in IoT Environments","authors":"Markus Miettinen, Jialin Huang, Thien Duc Nguyen, N. Asokan, Ahmad-Reza Sadeghi","author_ids":"2869255, 2053239, 3093740, 1735412, 8415280","abstract":"The Internet of Things (IoT) is rapidly emerging, resulting in a growing demand for guaranteeing its security and privacy. Imagine the following scenario: In a not so distant future you have just purchased a number of Internet-of-Things (IoT) appliances for your smart home. You are standing in your living room and would like to have these new devices wirelessly connect to each other and your home network. The set of your own devices in your network constitute your trust domain. Most IoT devices are equipped with environmental sensors, e.g., for monitoring ambient luminosity, audio, or temperature. A breach in your trust domain could leak such sensor data, and hence potentially sensitive private information about your behavior and habits, to outsiders. Therefore, you want to make sure that none of your devices accidentally connect to your neighbor's home network. You also want to make sure that only your own devices are granted access to your trust domain. The devices could use appropriate service discovery and key exchange protocols to establish secure communication links with each other and other devices like the home WiFi router. But how can your devices distinguish between other devices that belong to your trust domain and devices of your neighbors that happen to lie within wireless communication range? That is, how can devices in a trust domain (e.g., your home) authenticate each other? 2. PREVIOUS APPROACHES One approach is to ask user's interaction to facilitate au-thentication as in Bluetooth Secure Simple Pairing [4]. However , user-mediated \" manual authentication \" is not appropriate for IoT scenarios for two reasons. First, even a simple interaction requirement quickly becomes burdensome if Permission to make digital or hard copies of part or all of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for third-party components of this work must be honored. users have to repeat it separately for dozens or hundreds of devices in their IoT domains such as smart homes. Second, many IoT devices lack the necessary hardware (such as user I/O or NFC peripherals) for manual authentication. Another approach which is common practice today for admitting a new WiFi-enabled IoT device into a user's domain is to involve a smartphone to assist in the process. The user …","cites":"1","conferencePercentile":"82.25806452"},{"venue":"WISEC","id":"ce4f084c43b6303a6e1808d133c989ac0ec24a49","venue_1":"WISEC","year":"2016","title":"Vibreaker: Securing Vibrational Pairing with Deliberate Acoustic Noise","authors":"S. Abhishek Anand, Nitesh Saxena","author_ids":"8696579, 1716235","abstract":"Pairing between wireless devices may be secured by the use of an auxiliary channel such as audio, visuals or vibrations. A simple approach to pairing involves one of the devices initiating the transmission of a key, or keying material like a short password, over the auxiliary channel to the other device. A successful pairing is achieved when the receiving device is able to decode the key without any errors while the attacker is unable to eavesdrop the key.\n In this paper, we focus on the security of the vibration channel when used for the key transmission. As shown in some recent work, sending the keying material over a clear vibrational channel poses a significant risk of an acoustic side channel attack. Specifically, an adversary can listen onto the acoustic sounds generated by the vibration motor of the sending device and infer the keying material with a high accuracy. To counteract this threat, we propose a novel pairing scheme, called <i>Vibreaker</i> (a ``Vibrating speaker''), that involves active injection of acoustic noise in order to mask the key signal. In this scheme, the sending device artificially injects noise in the otherwise clear audio channel while transmitting the keying material via vibrations. We experiment with several choices for the noise signal and demonstrate that the security of the audio channel is significantly enhanced with Vibreaker when appropriate noise is used. The scheme requires no additional effort by the user, and imposes minimum hardware requirement and hence can be applied to many different contexts, such as pairing of IoT and implanted devices, wearables and other commodity gadgets.","cites":"1","conferencePercentile":"82.25806452"},{"venue":"WISEC","id":"228fd67eba0b6b723363c10dd672bf8c781beb88","venue_1":"WISEC","year":"2008","title":"Body sensor network security: an identity-based cryptography approach","authors":"Chiu Chiang Tan, Haodong Wang, Sheng Zhong, Qun Li","author_ids":"1724352, 2758920, 1782313, 1686663","abstract":"A body sensor network (BSN), is a network of sensors deployed on a person's body, usually for health care monitoring. Since the sensors collect personal medical data, security and privacy are important components in a body sensor network. At the same time, the collected data has to readily available in the event of an emergency. In this paper, we present IBE-Lite, a lightweight identity-based encryption suitable for sensors, and developed protocols based on IBE-Lite for a BSN.","cites":"37","conferencePercentile":"72.4137931"},{"venue":"WISEC","id":"84641f6d240d1dadbf66bc379ca0af9f62bdba20","venue_1":"WISEC","year":"2015","title":"Is your commute driving you crazy?: a study of misbehavior in vehicular platoons","authors":"Bruce DeBruhl, Sean Weerakkody, Bruno Sinopoli, Patrick Tague","author_ids":"2151885, 1782027, 1704072, 2331637","abstract":"Traffic is not only a source of frustration but also a leading cause of death for people under 35 years of age. Recent research has focused on how driver assistance technologies can be used to mitigate traffic fatalities and create more enjoyable commutes. In this work, we consider cooperative adaptive cruise control (CACC) or platooning, a driver assistance technology that controls the speed of vehicles and inter-vehicle spacing. CACC equipped cars use radar to fine tune inter-vehicle spacing and dedicated short-range communication (DSRC) to collaboratively accelerate and decelerate. Platooning can reduce fuel consumption by over 5% and increases the density of cars on a highway. Previous work on platooning has focused on proving string stability, which guarantees that the error between cars does not grow with the length of a platoon, but little work has considered the impact an attacker can have on a platoon. To design safe distributed controllers and networks it is essential to understand the possible attacks that could be mounted against platoons.\n In this work, we design a set of insider attacks and abnormal behaviors that occur in a platoon of cars. For example, we introduce the collision induction attack where an attacker exploits the platoon controller to cause a high-speed accident with the car following it. To mitigate these insider attacks we design a model-based detection scheme that leverages the broadcast nature of DSRC. Each car uses DSRC messages from other cars in the platoon to model the expected behavior of the car directly preceding it. If the expected behavior and actual behavior differ the monitoring vehicle switches to non-cooperative ACC, relying solely on radar, to mitigate the impact of the attack. We show that our detection scheme is able to detect many of our proposed insider attacks and when combined with a well designed ACC controller can avoid collisions. We propose combining our detection scheme with a global reputation scheme to detect when a car is malicious or needs maintenance.","cites":"2","conferencePercentile":"64.70588235"},{"venue":"WISEC","id":"d515c9c7836335fa16164d8081340fb977e75e52","venue_1":"WISEC","year":"2015","title":"A framework for evaluating pseudonym strategies in vehicular ad-hoc networks","authors":"David Förster, Frank Kargl, Hans Löhr","author_ids":"2624151, 1728575, 1731980","abstract":"The standard approach to privacy-friendly authentication in vehicular ad-hoc networks is the use of pseudonym certificates. The level of location privacy users can enjoy under the threat of an attacker depends on the attacker's coverage and strategy as well as on the users' strategy for changing their pseudonym certificates.\n With this paper, we propose a generic framework for evaluation and comparison of different pseudonym change strategies with respect to the privacy level they provide under the threat of a realistic, local, passive attacker. To illustrate the applicability of this framework, we propose a new tracking strategy that achieves unprecedented success in vehicle tracking and thus lowers the achievable location privacy significantly. We use this attacker as a means to evaluate different pseudonym change strategies and highlight the need for more research in this direction.","cites":"0","conferencePercentile":"17.64705882"},{"venue":"WISEC","id":"9eba445dc87bcd59813cfffab77d99c787e05e3c","venue_1":"WISEC","year":"2016","title":"Don't Touch that Column: Portable, Fine-Grained Access Control for Android's Native Content Providers","authors":"Aisha Ali Gombe, Golden G. Richard, Irfan Ahmed, Vassil Roussev","author_ids":"2698112, 1705632, 1683458, 1743959","abstract":"Android applications access native SQLite databases through their Universal Resource Identifiers (URIs), exposed by the Content provider library. By design, the SQLite engine used in the Android system does not enforce access restrictions on database content nor does it log database accesses. Instead, Android enforces read and write permissions on the native providers through which databases are accessed via the mandatory applications permissions system. This system is very coarse grained, however, and can allow applications far greater access to sensitive data than a user might intend.\n In this paper, we present a novel technique called <i>priVy</i> that merges static bytecode weaving and database query rewriting to achieve low-level access control for Android native providers at the application level. <i>priVy</i> defines access control for both database schema and entities and does not require any modifications to the underlying operating system and/or framework code. Instead, it provides a new Controller stub which is statically woven into the target application and a Controller interface for setting access levels, thus making it accessible and easily adoptable by average users. We provide an evaluation in terms of the resilience of applications to instrumentation as well as static and runtime instrumentation overhead. In our testing, <i>priVy</i> incurs an average of 1032 additional method calls or joinpoints created and it takes an average of 15 seconds to recompile an app and imposes virtually no runtime overhead.","cites":"0","conferencePercentile":"32.25806452"},{"venue":"WISEC","id":"a4ab2f9937855ce0ad75647ecd2c6d0a374bd6c4","venue_1":"WISEC","year":"2015","title":"Securacy: an empirical investigation of Android applications' network usage, privacy and security","authors":"Denzil Ferreira, Vassilis Kostakos, Alastair R. Beresford, Janne Lindqvist, Anind K. Dey","author_ids":"1878497, 1781697, 2619693, 1735867, 1703700","abstract":"Smartphone users do not fully know what their apps do. For example, an applications' network usage and underlying security configuration is invisible to users. In this paper we introduce <i>Securacy</i>, a mobile app that explores users' privacy and security concerns with Android apps. Securacy takes a reactive, personalized approach, highlighting app permission settings that the user has previously stated are concerning, and provides feedback on the use of secure and insecure network communication for each app. We began our design of Securacy by conducting a literature review and in-depth interviews with 30 participants to understand their concerns. We used this knowledge to build Securacy and evaluated its use by another set of 218 anonymous participants who installed the application from the Google Play store. Our results show that access to address book information is by far the biggest privacy concern. Over half (56.4%) of the connections made by apps are insecure, and the destination of the majority of network traffic is North America, regardless of the location of the user. Our app provides unprecedented insight into Android applications' communications behavior globally, indicating that the majority of apps currently use insecure network connections.","cites":"11","conferencePercentile":"100"},{"venue":"WISEC","id":"8183343ba787008d47d255da593f144a630ed318","venue_1":"WISEC","year":"2012","title":"Toward a healthy wireless privacy ecosystem","authors":"Edward W. Felten","author_ids":"1752733","abstract":"Privacy can be a fraught topic even on traditional desktop systems, and mobility only complicates the issue. Consumers, companies, researchers, and government all want an outcome in which consumers feel safe entrusting their data to mobile technologies, rapid innovation continues, and researchers create the technologies of the future. What does this healthy outcome look like, and how can we get there? What can we do now to make it more likely? How can researchers contribute?","cites":"0","conferencePercentile":"11.76470588"},{"venue":"WISEC","id":"34fce3b85f830879ecf6dd9e4acacaebed52fc9d","venue_1":"WISEC","year":"2014","title":"Duet: library integrity verification for android applications","authors":"Wenhui Hu, Damien Octeau, Patrick D. McDaniel, Peng Liu","author_ids":"1731466, 1793187, 2228601, 1712572","abstract":"In recent years, the Android operating system has had an explosive growth in the number of applications containing third-party libraries for different purposes. In this paper, we identify three library-centric threats in the real-world Android application markets: (i) the library modification threat, (ii) the masquerading threat and (iii) the aggressive library threat. These three threats cannot effectively be fully addressed by existing defense mechanisms such as software analysis, anti-virus software and anti-repackaging techniques. To mitigate these threats, we propose Duet, a library integrity verification tool for Android applications at application stores. This is non-trivial because the Android application build process merges library code and application-specific logic into a single binary file. Our approach uses reverse-engineering to achieve integrity verification. We implemented a full working prototype of Duet. In a dataset with 100,000 Android applications downloaded from Google Play between February 2012 and September 2013, we verify integrity of 15 libraries. On average, 80.50% of libraries can pass the integrity verification. In-depth analysis indicates that code insertion, obfuscation, and optimization on libraries by application developers are the primary reasons for not passing integrity verification. The evaluation results not only indicate that Duet is an effective tool to mitigate library-centric attacks, but also provide empirical insight into the library integrity situation in the wild.","cites":"2","conferencePercentile":"32.69230769"},{"venue":"WISEC","id":"8dba2a210a43d7616662f5a6abe1fbd51fabca73","venue_1":"WISEC","year":"2009","title":"Privacy-preserving 802.11 access-point discovery","authors":"Janne Lindqvist, Tuomas Aura, George Danezis, Teemu Koponen, Annu Myllyniemi, Jussi Mäki, Michael Roe","author_ids":"1735867, 1710566, 1722262, 2462394, 2626161, 2660672, 2398096","abstract":"It is usual for 802.11 WLAN clients to probe actively for access points in order to hasten AP discovery and to find \"hidden\" APs. These probes reveal the client's list of preferred networks, thus, present a privacy risk: an eavesdropper can infer attributes of the client based on its associations with networks. We propose an access-point discovery protocol that supports fast discovery and hidden networks while also preserving privacy. Our solution is incrementally deployable, efficient, requires only small modifications to current client and AP implementations, interoperates with current networks, and does not change the user experience. We note that our solution is faster than the standard hidden-network discovery protocol based on measurements on a prototype implementation.","cites":"14","conferencePercentile":"50"},{"venue":"WISEC","id":"942ff841927c36c25f8717be3ffe029190b36566","venue_1":"WISEC","year":"2014","title":"Power napping with loud neighbors: optimal energy-constrained jamming and anti-jamming","authors":"Bruce DeBruhl, Christian Kroer, Anupam Datta, Tuomas Sandholm, Patrick Tague","author_ids":"2151885, 2211504, 1699116, 1732422, 2331637","abstract":"The openness of wireless communication and the recent development of software-defined radio technology, respectively, provide a low barrier and a wide range of capabilities for misbehavior, attacks, and defenses against attacks. In this work we present finite-energy jamming games, a game model that allows a jammer and sender to choose (1) whether to transmit or sleep, (2) a power level to transmit with, and (3) what channel to transmit on. We also allow the jammer to choose on how many channels it simultaneously attacks. A major addition in finite-energy jamming games is that the jammer and sender both have a limited amount of energy which is drained according to the actions a player takes.\n We develop a model of our system as a zero-sum finite-horizon stochastic game with deterministic transitions. We leverage the zero-sum and finite-horizon properties of our model to design a simple polynomial-time algorithm to compute optimal randomized strategies for both players. The utility function of our game model can be decoupled into a recursive equation. Our algorithm exploits this fact to use dynamic programming to construct solutions in a bottom-up fashion. For each state of energy levels, a linear program is solved to find Nash equilibrium strategies for the subgame. With these techniques, our algorithm has only a linear dependence on the number of states, and quadratic dependence on the number of actions, allowing us to solve very large instances.\n By computing Nash equilibria for our game models, we explore what kind of performance guarantees can be achieved both for the sender and jammer, when playing against an optimal opponent. We also use the optimal strategies to simulate finite-energy jamming games and provide insights into robust communication among reconfigurable, yet energy-limited, radio systems. To test the performance of the optimal strategies we compare their performance with a random and adaptive strategy. Matching our intuition, the aggressiveness of an attacker is related to how much of a discount is placed on data delay. This results in the defender often choosing to sleep despite the latency implication, because the threat of jamming is high. We also present several other findings from simulations where we vary the strategies for one or both of the players.","cites":"3","conferencePercentile":"53.84615385"},{"venue":"WISEC","id":"cd42108fdc0eb84b2041e0206e412ee0fd6f16c2","venue_1":"WISEC","year":"2013","title":"Tap-Wave-Rub: Lightweight Malware Prevention for Smartphones Using Intuitive Human Gestures","authors":"Haoyu Li, Di Ma, Nitesh Saxena, Babins Shrestha, Yan Zhu","author_ids":"5773735, 5784153, 1716235, 2042385, 1746624","abstract":"We introduce a lightweight permission enforcement approach - <i>Tap-Wave-Rub (TWR)</i> - for smartphone malware prevention. TWR is based on simple human gestures (implicit or explicit) that are very quick and intuitive but less likely to be exhibited in users' daily activities. Presence or absence of such gestures, prior to accessing an application, can effectively inform the OS whether the access request is benign or malicious. In this paper, we focus on the design of an <i>accelerometer-based phone tapping detection</i> mechanism. This implicit tapping detection mechanism is geared to prevent malicious access to NFC services, where a user is usually required to tap her phone with another device. We present a variety of novel experiments to evaluate the proposed mechanism. Our results suggest that our approach could be very effective for malware prevention, with quite low false positives and false negatives, while imposing no additional burden on the users. As part of the TWR framework, we also briefly explore explicit gestures (finger tapping, rubbing or hand waving based on proximity sensor), which could be used to protect services which do not have a unique implicit gesture associated with them.","cites":"5","conferencePercentile":"54"},{"venue":"WISEC","id":"350c93aea102f56c082a223abe683c2330eec96e","venue_1":"WISEC","year":"2013","title":"Selfish manipulation of cooperative cellular communications via channel fabrication","authors":"Shrikant Adhikarla, Min Suk Kang, Patrick Tague","author_ids":"2719156, 3088671, 2331637","abstract":"In today's cellular networks, user equipment (UE) have suffered from low spectral efficiency at cell-edge region due to high interference from adjacent base stations (BSs), which share the same spectral radio resources. In the recently proposed cooperative cellular networks, geographically separated multiple BSs cooperate on transmission in order to improve the UE's signal-to-interference-plus-noise-ratio (SINR) at cell-edge region. The service provider of the system dynamically assigns the cluster of BSs to achieve higher SINR for the UE while optimizing the use of system radio resources. Although it is the service provider that makes the the clustering decision for the UE, the service provider relies on the UE's input to the decision; i.e., the channel states from the adjacent BSs to the UE. In essence, the operation of the cooperative cellular netwokrs heavily relies on the trust in the UEs. In this paper, we propose a new selfish attack against the cooperative cellular networks; an adversary reprograms her UE to report fabricated channel information to cause the service provider to make a decision that benefits the adversary while wasting its system resources. We evaluate the proposed attack in a cooperative cellular network having various performance goals on the simulation-based experiments and show that the adversary can trick the service provider into expending 3.7 times more radio resources for the adversary and, accordingly, the adversary achieves up to 16 dB SINR gain. Finally, we propose a threshold-based countermeasure for the service provider to detect the attack with approximately 90% of accuracy.","cites":"1","conferencePercentile":"12"},{"venue":"WISEC","id":"e4f72a311193461b0ce5840b45e3b40e277243ec","venue_1":"WISEC","year":"2016","title":"Slogger: Smashing Motion-based Touchstroke Logging with Transparent System Noise","authors":"Prakash Shrestha, Manar Mohamed, Nitesh Saxena","author_ids":"8715426, 2920218, 1716235","abstract":"Recent research shows that it is possible to infer a user's touchscreen inputs (e.g., passwords) on Android devices based on inertial (motion/position) sensors, currently freely-accessible by any Android app. Given the high accuracies of such touchstroke logging attacks, they are now considered a significant threat to user privacy. Consequently, the security community has started exploring defenses to such side channel attacks, but the suggested solutions are either not effective (e.g., those based on vibrational noise) and/or may significantly undermine system usability (e.g., those based on keyboard layout randomization).\n In this paper, we introduce a novel and practical defense to motion-based touchstroke leakage based on <i>system-generated, fully automated</i> and <i>user-oblivious</i> sensory noise. Our defense leverages a recently developed framework, SMASheD, that takes advantage of the Android's ADB functionality and can programmatically inject noise to various inertial sensors. Although SMASheD was originally advertised as a malicious app by its authors, we use it to build a defense mechanism, called <i>Slogger</i> (\"Smashing the logger\"), for defeating sensor-based touchstroke logging attacks. Slogger transparently inserts noisy sensor readings in the background as the user provides sensitive touchscreen input (e.g., password, PIN or credit card info) in order to obfuscate the original sensor readings. It can be installed in the user space without the need to root the device and to change the device's OS or kernel.\n Our contributions are three-fold. <i>First</i>, we introduce Slogger, identifying a novel, benign use case of SMASheD that can defeat touchstroke logging attacks. <i>Second</i>, we design and implement the Slogger app system that can be used to protect sensitive touchscreen input from leaking away. <i>Third</i>, we comprehensively evaluate Slogger against state-of-the-art touchstroke detection and inference attacks. Our results show that Slogger can significantly reduce the level of touchstroke leakage to the extent these attacks may become unworkable in practice, without affecting other benign apps. We also show that the leakage can be minimized even when attacks utilize a <i>fusion</i> of multiple motion-position sensors.","cites":"1","conferencePercentile":"82.25806452"},{"venue":"WISEC","id":"1a74b23ccf41f484d95a0390e9d9947db01ffd8c","venue_1":"WISEC","year":"2012","title":"Location-aware and safer cards: enhancing RFID security and privacy via location sensing","authors":"Di Ma, Anudath K. Prasad, Nitesh Saxena, Tuo Xiang","author_ids":"5784153, 3260096, 1716235, 2971507","abstract":"In this paper, we report on a new approach for enhancing security and privacy in certain RFID applications whereby location or location-related information (such as speed) can serve as a legitimate access context. Examples of these applications include access cards, toll cards, credit cards and other payment tokens. We show that location awareness can be used by both tags and back-end servers for defending against unauthorized reading and relay attacks on RFID systems. On the tag side, we design a location-aware selective unlocking mechanism using which tags can selectively respond to reader interrogations rather than doing so promiscuously. On the server side, we design a location-aware secure transaction verification scheme that allows a bank server to decide whether to approve or deny a payment transaction and detect a specific type of relay attack involving malicious readers. The premise of our work is a current technological advancement that can enable RFID tags with low-cost location (GPS) sensing capabilities. Unlike prior research on this subject, our defenses do not rely on auxiliary devices or require any explicit user involvement.","cites":"9","conferencePercentile":"73.52941176"},{"venue":"WISEC","id":"2ce4889ec2455a04de87545f8d4fc8f784754400","venue_1":"WISEC","year":"2009","title":"A coding-theoretic approach for efficient message verification over insecure channels","authors":"David Slater, Patrick Tague, Radha Poovendran, Brian J. Matt","author_ids":"1798923, 2331637, 1678631, 1740936","abstract":"We address the problem of allowing authorized users, who have yet to establish a secret key, to <i>securely</i> and <i>efficiently</i> exchange key establishment messages over an insecure channel in the presence of jamming and message insertion attacks. This problem was first introduced by Strasser, P&#246;pper, &#268;apkun, and &#268;agalj in their recent work, leaving joint consideration of security and efficiency as an open problem. In this paper, we present three approaches based on coding theory which reduce the overall time required to verify the packets and reconstruct the original message in the presence of jamming and malicious insertion. We first present the Hashcluster scheme which reduces the total overhead included in the short packets. We next present the Merkleleaf scheme which uses erasure coding to reduce the average number of packet receptions required to reconstruct the message. We then present the Witnesscode scheme which uses one-way accumulators to individually verify packets and reduce redundancy. We demonstrate through analysis and simulation that our candidate protocols can significantly decrease the amount of time required for key establishment in comparison to existing approaches without degrading the guaranteed level of security.","cites":"33","conferencePercentile":"84.61538462"},{"venue":"WISEC","id":"8409a6c5beaf99d762b3f12fb5232916b85c492b","venue_1":"WISEC","year":"2015","title":"UWB rapid-bit-exchange system for distance bounding","authors":"Nils Ole Tippenhauer, Heinrich Luecken, Marc Kuhn, Srdjan Capkun","author_ids":"2225170, 2637536, 3010049, 1791522","abstract":"Distance bounding protocols enable one device (the verifier) to securely establish an upper bound on its distance to another device (the prover). These protocols can be used for secure location verification and detection of relay attacks, even in presence of strong attackers. The <i>rapid-bit-exchange</i> is the core of distance bounding protocols---the verifier sends single bit challenges, which the prover is expected to answer with minimal and stable processing delay. Based on the measured round trip time of flight, the verifier calculates its upper bound to the prover. Although several aspects of distance bounding implementations have been discussed in the past, no full implementation of a wireless distance bounding system has been presented so far.\n In this work, we present the first full realization of a rapid bit exchange system for distance bounding. Our system consists of an Ultra-Wideband (UWB) ranging radio and of an efficient digital processing implemented on an Field-Programmable-Gate-Array (FPGA) board; it achieves a ranging accuracy of 7:5 cm and a short processing delay at the prover (&lt; 100 ns). This minimal processing delay is the lowest reported so far for provers that demodulate the challenge before responding.","cites":"1","conferencePercentile":"44.11764706"},{"venue":"WISEC","id":"e620b4133b080a8b8bd2e928f33a211e94372591","venue_1":"WISEC","year":"2014","title":"Short paper: detection of GPS spoofing attacks in power grids","authors":"Der-Yeuan Yu, Aanjhan Ranganathan, Thomas Locher, Srdjan Capkun, David A. Basin","author_ids":"3239067, 1751349, 1769077, 1791522, 1725559","abstract":"Power companies are deploying a multitude of sensors to monitor the energy grid. Measurements at different locations should be aligned in time to obtain the global state of the grid, and the industry therefore uses GPS as a common clock source. However, these sensors are exposed to GPS time spoofing attacks that cause misaligned aggregated measurements, leading to inaccurate monitoring that affects power stability and line fault contingencies. In this paper, we analyze the resilience of phasor measurement sensors, which record voltages and currents, to GPS spoofing performed by an adversary external to the system. We propose a solution that leverages the characteristics of multiple sensors in the power grid to limit the feasibility of such attacks. In order to increase the robustness of wide-area power grid monitoring, we evaluate mechanisms that allow collaboration among GPS receivers to detect spoofing attacks. We apply multilateration techniques to allow a set of GPS receivers to locate a false GPS signal source. Using simulations, we show that receivers sharing a local clock can locate nearby spoofing adversaries with sufficient confidence.","cites":"4","conferencePercentile":"69.23076923"},{"venue":"WISEC","id":"5060f9751f526122484617fde87a5f6a2cd22411","venue_1":"WISEC","year":"2010","title":"A secure and scalable identification for hash-based RFID systems using updatable pre-computation","authors":"Yasunobu Nohara, Sozo Inoue","author_ids":"2577092, 3194073","abstract":"In this paper, we propose a secure identification scheme for RFID with efficient time and memory, and also an efficient update of pre-computed values on the server side. Although RFID ( Radio Frequency IDentification ) is becoming popular with pervasive computing environments, a privacy problem still remains, where an adversary can trace users' behavior by linking identification log by adversary readers. For this problem, a hash-chain scheme has been proposed as a secure identification for low-cost RFID tags, and its long identification time has been reduced by Avoine et al. using pre-computation on the server side. However, Avoine's scheme uses static pre-computation, and therefore pre-computed values include ones which are already used and no longer used. An efficient update of pre-computation is needed to remove these wasted values and this can reduce memory usage. In this paper, we optimize a lookup of pre-computed values using d-left hashing, which is a fast lookup technique, and provide efficient update of pre-computed values. We also show reasonable analytical evaluation and experimental result for memory and pre-computation/identification/update time.","cites":"1","conferencePercentile":"11.36363636"},{"venue":"WISEC","id":"c996c2ab0e226ae1327d76c0dca946c493e89d47","venue_1":"WISEC","year":"2016","title":"The Ultimate Frontier for Privacy and Security: Medicine","authors":"Jean-Pierre Hubaux","author_ids":"1757221","abstract":"Personalized medicine brings the promise of better diagnoses, better treatments, a higher quality of life and increased longevity. To achieve these noble goals, it exploits a number of revolutionary technologies, including genome sequencing and DNA editing, as well as wearable devices and implantable or even edible biosensors. In parallel, the popularity of \"quantified self\" gadgets shows the willingness of citizens to be more proactive with respect to their own health. Yet, this evolution opens the door to all kinds of abuses, notably in terms of discrimination, blackmailing, stalking, and subversion of devices. After giving a general description of this situation, in this talk we will expound on some of the main concerns, including the temptation to permanently and remotely monitor the physical (and metabolic) activity of individuals. We will describe the potential and the limitations of techniques such as cryptography (including secure multi-party computation), trusted hardware and differential privacy. We will also discuss the notion of consent in the face of the intrinsic correlations of human data. We will argue in favor of a more systematic, principled and cross-disciplinary research effort in this field and will discuss the motives of the various stakeholders.","cites":"0","conferencePercentile":"32.25806452"},{"venue":"WISEC","id":"18545b3dde47a86d318bd135ff9c86fea23d22e2","venue_1":"WISEC","year":"2012","title":"Physical-layer attacks on chirp-based ranging systems","authors":"Aanjhan Ranganathan, Boris Danev, Aurélien Francillon, Srdjan Capkun","author_ids":"1751349, 1754853, 1794828, 1791522","abstract":"Chirp signals have been extensively used in radar and sonar systems to determine distance, velocity and angular position of objects and in wireless communications as a spread spectrum technique to provide robustness and high processing gain. Recently, several standards have adopted chirp spread spectrum (CSS) as an underlying physical-layer scheme for precise, low-power and low-complexity real-time localization. While CSS-based ranging and localization solutions have been implemented and deployed, their security has so far not been analyzed.\n In this work, we analyze CSS-based ranging and localization systems. We focus on distance decreasing relay attacks that have proven detrimental for the security of proximity-based access control systems (e.g., passive vehicle keyless entry and start systems). We describe a set of distance decreasing attacks realizations and verify their feasibility by simulations and experiments on a commercial ranging system. Our results demonstrate that an attacker is able to effectively reduce the distance measured by chirp-based ranging systems from 150 m to 600 m depending on chirp configuration. Finally, we discuss possible countermeasures against these attacks.","cites":"4","conferencePercentile":"47.05882353"},{"venue":"WISEC","id":"c9d39db0e48c187c0bbccdf85e409622cc2a5532","venue_1":"WISEC","year":"2009","title":"A practical secure neighbor verification protocol for wireless sensor networks","authors":"Reza Shokri, Marcin Poturalski, Gael Ravot, Panagiotis Papadimitratos, Jean-Pierre Hubaux","author_ids":"2520493, 2697914, 2642467, 2870791, 1757221","abstract":"Wireless networking relies on a fundamental building block, <i>neighbor discovery</i> (ND). The nature of wireless communications, however, makes attacks against ND easy: An adversary can simply replay or relay (wormhole) packets across the network and mislead disconnected nodes into believing that they communicate directly. Such attacks can compromise the overlying protocols and applications. Proposed methods in the literature seek to secure ND, allowing nodes to <i>verify</i> they are neighbors. However, they either rely on specialized hardware or infrastructure, or offer limited security. In this paper, we address these problems, designing a practical and <i>secure neighbor verification</i> protocol for constrained Wireless Sensor networks (WSNs). Our scheme relies on estimated distance between nodes and simple geometric tests, and it is fully distributed. We prove our protocol is secure against the classic 2-end wormhole attack. Moreover, we provide a proof-of-concept implementation with off-the-shelf WSN equipment: Cricket motes.","cites":"22","conferencePercentile":"69.23076923"},{"venue":"WISEC","id":"173c6dc8d413a4a85679ba248abc079c8247f231","venue_1":"WISEC","year":"2009","title":"Towards a theory for securing time synchronization in wireless sensor networks","authors":"Murtuza Jadliwala, Qi Duan, Shambhu J. Upadhyaya, Jinhui Xu","author_ids":"2235825, 2195465, 1761869, 3441955","abstract":"Time synchronization in highly distributed wireless systems like sensor and ad hoc networks is extremely important in order to maintain a consistent notion of time throughout the network and to support the various timing-based applications. But, cheating behavior by the participating nodes in the network can severely jeopardize the accuracy of the associated time synchronization process. Despite recent advances in this direction, a key fundamental question still remains unanswered: Is it theoretically feasible to secure distributed time synchronization protocols, given complete (or global) time and time difference information in the network?\n In this paper, we attempt to answer this question with the help of sound mathematical modeling and analysis. We first formulate the problem of distributed time synchronization as a <i>Constraint Satisfaction Problem (CSP)</i> in a graph-based model of the network. Then, we prove that efficiently eliminating cheating behavior in distributed time synchronization protocols is combinatorially hard (<i>NP</i>-hard), i.e., it is highly unlikely that there exists an algorithm that solves, or even approximates, this problem in polynomial (in terms of total number of nodes) time. Due to this negative result for the general case, we focus on studying the problem for a special case of the graph-based model of the network, namely completely connected graphs. We derive an upper bound on the best possible solution quality for this problem, propose two polynomial-time approximation strategies, and present an empirical evaluation of their performance.","cites":"4","conferencePercentile":"13.46153846"},{"venue":"WISEC","id":"0a29375ddb1d59e8ac7207bfc49a68cd8c917d91","venue_1":"WISEC","year":"2008","title":"RFID authentication protocol for low-cost tags","authors":"Boyeon Song, Chris J. Mitchell","author_ids":"7992763, 1723348","abstract":"In this paper, we investigate the possible privacy and security threats to RFID systems, and consider whether previously proposed RFID protocols address these threats. We then propose a new authentication protocol which provides the identified privacy and security features and is also efficient. The new protocol resists tag information leakage, tag location tracking, replay attacks, denial of service attacks, backward traceability, forward traceability (under an assumption), and server impersonation (also under an assumption). We also show that it requires less tag-side storage and computation than other similarly structured RFID protocols.","cites":"88","conferencePercentile":"100"},{"venue":"WISEC","id":"8ac3c6f34d94cac12215223fc1de13c877e8d1a2","venue_1":"WISEC","year":"2009","title":"A grammatical evolution approach to intrusion detection on mobile ad hoc networks","authors":"Sevil Sen, John A. Clark","author_ids":"1768088, 2591945","abstract":"In recent years mobile ad hoc networks (MANETs) have become a very popular research topic. By providing communication in the absence of a fixed infrastructure they are very attractive for many applications such as tactical and disaster recovery operations and virtual conferences. On the other hand, this flexibility introduces new security risks. Moreover, different characteristics of MANETs make conventional security systems ineffective and inefficient for this new environment. Intrusion detection, which is an indispensable part of a security system, presents also a particular challenge due to the dynamic nature of MANETs, the lack of central points, and their highly constrained nodes. In this paper, we propose to investigate the use of an artificial intelligence based learning technique to explore this difficult design space. The grammatical evolution technique inspired by natural evolution is explored to detect known attacks on MANETs such as DoS attacks and route disruption attacks. Intrusion detection programs are evolved for each attack and distributed to each node on the network. The performance of these programs is evaluated on different types of networks with different mobility and traffic patterns to show their effects on intrusion detection ability.","cites":"10","conferencePercentile":"42.30769231"},{"venue":"WISEC","id":"aa356319ef647eced255ccf38d303f14ddf58ae4","venue_1":"WISEC","year":"2010","title":"Effectiveness of distance-decreasing attacks against impulse radio ranging","authors":"Manuel Flury, Marcin Poturalski, Panagiotis Papadimitratos, Jean-Pierre Hubaux, Jean-Yves Le Boudec","author_ids":"2602285, 2697914, 2870791, 1757221, 1737578","abstract":"We expose the vulnerability of an emerging wireless ranging technology, impulse radio ultra-wide band (IR-UWB), to distance-decreasing attacks on the physical communication layer (PHY). These attacks violate the security of secure ranging protocols that allow two wireless devices to securely estimate the distance between them, with the guarantee that the estimate is an upper-bound on the actual distance. Such protocols serve as crucial building blocks in security-sensitive applications such as location tracking, physical access control, or localization.\n Prior works show the theoretical possibility of PHY attacks bypassing cryptographic mechanisms used by secure ranging protocols. They also demonstrates that for physical layers used in ISO 14443 RFID and wireless sensor networks, some PHY attacks are indeed feasible. IR-UWB was proposed as a possible solution, but we show that the de facto standard for IR-UWB, IEEE 802.15.4a, does not automatically provide security against such attacks. We find that with the mandatory modes of the standard an external attacker can decrease the measured distance by as much as 140 meters with a high probability (above 99%).","cites":"11","conferencePercentile":"68.18181818"},{"venue":"WISEC","id":"58dfbe1e7d52d8a950c8d2bd56058047937a2d18","venue_1":"WISEC","year":"2008","title":"RFID security: in the shoulder and on the loading dock","authors":"Ari Juels","author_ids":"1687161","abstract":"RFID (Radio-Frequency IDentification) tags are microchips that communicate via radio. In common use today, they promise to become a ubiquitous tool for labeling objects and identifying people. Protection against counterfeiting and privacy infringement in RFID systems is therefore an imperative. The unifying theme of this two-part talk is key distribution, a perennial security challenge in computing systems that is particularly tricky for RFID. I'll discuss human-implantable RFID devices and the intricate privacy and security problems associated with these \"prosthetic biometrics.\" I'll then introduce a new approach to distributing the keys required for privacy protection and authentication in RFID-enhanced supply chains - tracing the lifecycle of tags from the warehouse to the loading dock to the hands of the consumer.","cites":"3","conferencePercentile":"12.06896552"},{"venue":"WISEC","id":"5a6b989668566207539c44a95bfcc8f4ddb21a30","venue_1":"WISEC","year":"2014","title":"On mobile malware infections","authors":"N. Asokan","author_ids":"1735412","abstract":"D.4.6 [Security and Protection]: Invasive software Concerns about mobile malware are not new. There is a steady stream of news stories about the exponential growth of malware targeted at specific smartphone operating systems. Given the extent of smartphone usage, a malware epidemic affecting smartphones could potentially have devastating consequences. Yet, anecdotal evidence seems to suggest that malware infection of smartphones in the wild is not at the same scale as malware infection of personal computers. Estimates of the rates of malware infection on mobile devices are surprisingly rare. Even the few available public estimates differ greatly (ranging between 0.0009% to about 5%). We found only one previous independent and rigorous estimate [1] which used an indirect method to estimate infection rate of mobile devices using a dataset of DNS queries made by users in the United States. In this backdrop, we set out to estimate infection rates on Android devices directly by collecting data from a large number of devices (reported in [2]). In this talk, I will describe our experience and some lessons we learned. Infection rates in our dataset, according the two malware datasets we used, were small (about 0.26%) but significantly higher than the previous independent estimate [1]. Different anti-malware vendors use different criteria for deciding if a given software package is malicious. We were surprised to find that none of the malware instances found in our dataset was flagged as malware by a majority of vendors. Some application stores have a greater density of malicious applications than others. Advertising within applications and cross-promotional deals could potentially act as infection vectors whereby installing one application would lead to installing additional applications. Based on these observations we conjectured that the set of \" clean \" applications on a device can serve as an indicator for infection of that Permission to make digital or hard copies of part or all of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage, and that copies bear this notice and the full citation on the first page. Copyrights for third-party components of this work must be honored. For all other uses, contact the owner/author(s). Copyright is held by the author/owner(s). device. By analyzing our dataset, we found that while the set of applications alone is not an accurate indicator of infection a classifier trained using the application …","cites":"2","conferencePercentile":"32.69230769"},{"venue":"WISEC","id":"be84bb31f179fc0043af193bd9db3167de330f80","venue_1":"WISEC","year":"2011","title":"Short paper: PEPSI - privacy-enhanced participatory sensing infrastructure","authors":"Emiliano De Cristofaro, Claudio Soriente","author_ids":"1728207, 2678175","abstract":"Participatory Sensing combines the ubiquity of mobile phones with the sensing capabilities of Wireless Sensor Networks. It targets the pervasive collection of information, e.g., temperature, traffic conditions, or medical data. Users produce measurements from their mobile devices, thus, a number of privacy concerns -- due to the personal information conveyed by reports -- may hinder the large-scale deployment of participatory sensing applications. Prior work has attempted to protect privacy in participatory sensing, but it relied on unrealistic assumptions and achieved no provably-secure guarantees. In this paper, we introduce PEPSI: Privacy-Enhanced Participatory Sensing Infrastructure. We explore realistic architectural assumptions and a minimal set of formal requirements aiming at protecting privacy of both data producers and consumers. We also present an instantiation that attains privacy guarantees with provable security at very low additional computational cost and almost no extra communication overhead. Finally, we highlight some problems that call for further research in this developing area.","cites":"21","conferencePercentile":"84.21052632"},{"venue":"WISEC","id":"07f7f36b10e950ac8d5018aac4dc7c5237a33ed2","venue_1":"WISEC","year":"2015","title":"SpotShare and nearbyPeople: applications of the Social PaL framework","authors":"Marcin Nagy, Thanh Bui, Swapnil Udar, N. Asokan, Jörg Ott","author_ids":"2358922, 4667865, 2930503, 1735412, 6651579","abstract":"Imagine if there is a privacy-preserving mechanism for two mobile devices to determine if their owners have common friends. It can be useful for access control in applications like ride-sharing, sharing Internet access or even just a simple \"people radar\" app for showing nearby friends and friends-of-friends. Current mechanisms for doing this come at the cost of revealing these interactions and the users' locations to central servers. In a paper that appears in the WiSec 2015 proceedings, we describe Social Pal [2], a framework that allows privacy-preserving discovery of the distance between two users in a social network. Social Pal was implemented as a general purpose software framework that can be easily used by application developers who wish to incorporate such functionality into their applications.","cites":"0","conferencePercentile":"17.64705882"},{"venue":"WISEC","id":"8e743a98beed5ce896d86bf770bd04a1aa7bb21c","venue_1":"WISEC","year":"2010","title":"Secure walking GPS: a secure localization and key distribution scheme for wireless sensor networks","authors":"Qi Mi, John A. Stankovic, Radu Stoleru","author_ids":"2005833, 7230666, 1736776","abstract":"In many applications of wireless sensor networks, sensor nodes are manually deployed in hostile environments where an attacker can disrupt the localization service and tamper with legitimate in-network communication. In this paper, we introduce Secure Walking GPS, a secure localization and key distribution solution for manual deployments of WSNs. Using the location information provided by the GPS and inertial guidance modules on a special master node, Secure Walking GPS achieves accurate node localization and location-based key distribution at the same time. Our analysis and simulation results indicate that the Secure Walking GPS scheme makes a deployed WSN resistant to the Dolev-Yao, the wormhole, and the GPS-denial attacks, has good localization and key distribution performance, and is practical for large-scale WSN deployments.","cites":"3","conferencePercentile":"29.54545455"},{"venue":"WISEC","id":"3cffb2e2bf9c5062e5961f9a6bb77ecc805c09fd","venue_1":"WISEC","year":"2008","title":"Towards event source unobservability with minimum network traffic in sensor networks","authors":"Yi Yang, Min Shao, Sencun Zhu, Bhuvan Urgaonkar, Guohong Cao","author_ids":"1698559, 2030120, 1712616, 1684443, 1740564","abstract":"Sensors deployed to monitor the surrounding environment report such information as event type, location, and time when a real event of interest is detected. An adversary may identify the real event source through eavesdropping and traffic analysis. Previous work has studied the source location privacy problem under a <i>local</i> adversary model. In this work, we aim to provide a stronger notion: <i>event source unobservability</i>, which promises that a <i>global</i> adversary cannot know whether a real event has ever occurred even if he is capable of collecting and analyzing all the messages in the network at all the time. Clearly, event source unobservability is a desirable and critical security property for event monitoring applications, but unfortunately it is also very difficult and expensive to achieve for resource-constrained sensor network.\n Our main idea is to introduce carefully chosen dummy traffic to hide the real event sources in combination with mechanisms to drop dummy messages to prevent explosion of network traffic. To achieve the latter, we select some sensors as proxies that proactively filter dummy messages on their way to the base station. Since the problem of optimal proxy placement is NP-hard, we employ local search heuristics. We propose two schemes (i) Proxy-based Filtering Scheme (PFS) and (ii) Tree-based Filtering Scheme (TFS) to accurately locate proxies. Simulation results show that our schemes not only quickly find nearly optimal proxy placement, but also significantly reduce message overhead and improve message delivery ratio. A prototype of our scheme was implemented for TinyOS-based Mica2 motes.","cites":"75","conferencePercentile":"96.55172414"},{"venue":"WISEC","id":"136bc973680dcdb3227800a7e040027ecf699a95","venue_1":"WISEC","year":"2015","title":"How far removed are you?: scalable privacy-preserving estimation of social path length with Social PaL","authors":"Marcin Nagy, Thanh Bui, Emiliano De Cristofaro, N. Asokan, Jörg Ott, Ahmad-Reza Sadeghi","author_ids":"2358922, 4667865, 1728207, 1735412, 6651579, 8415280","abstract":"Social relationships are a natural basis on which humans make trust decisions. Online Social Networks (OSNs) are increasingly often used to let users base trust decisions on the existence and the strength of social relationships. While most OSNs allow users to discover the length of the social path to other users, they do so in a centralized way, thus requiring them to rely on the service provider and reveal their interest in each other.\n This paper presents Social PaL, a system supporting the privacy-preserving discovery of arbitrary-length social paths between any two social network users. We overcome the bootstrapping problem encountered in all related prior work, demonstrating that Social PaL allows its users to find all paths of length two and to discover a significant fraction of longer paths, even when only a small fraction of OSN users is in the Social PaL system -- e.g., discovering 70% of all paths with only 40% of the users. We implement Social PaL using a scalable server-side architecture and a modular Android client library, allowing developers to seamlessly integrate it into their apps.","cites":"2","conferencePercentile":"64.70588235"},{"venue":"WISEC","id":"265acb217a55825a8a6103ee65676c1d22e73c9b","venue_1":"WISEC","year":"2013","title":"SnapMe if you can: privacy threats of other peoples' geo-tagged media and what we can do about it","authors":"Benjamin Henne, Christian Szongott, Matthew Smith","author_ids":"2602231, 3029655, 1767286","abstract":"The amount of media uploaded to the Web is still rapidly expanding. The ease-of-use of modern smartphones in combination with the proliferation of high-speed mobile networks facilitates a culture of spontaneous and often carefree sharing of user-generated content, especially photos and videos. An increasing number of modern devices are capable of embedding location information and other metadata into created content. However, currently there is not much user awareness of possible privacy consequences of such data. While in most cases users upload their own media consciously, the flood of media uploaded by others is so huge that it is almost impossible for users to stay aware of all media that might be relevant to them. Current social network services and photo-sharing sites mainly focus on the privacy of users' own media in terms of access control, but offer few possibilities to deal with privacy implications created by other users' actions. We conducted an online survey with 414 participants. The results show that users would like to get more information about media shared by others. Based on an analysis of prevalent sharing services like Flickr, Facebook, or Google+ and an analysis of metadata of three different sets of crawled photos, we discuss privacy implications and potentials of the emerging trend of (geo-)tagged media. Finally, we present a novel concept on how location information can actually help users to control the flood of potentially infringing or interesting media.","cites":"15","conferencePercentile":"90"},{"venue":"WISEC","id":"5e0f07645c87f40ee707da66bcdd04d13fc47cc4","venue_1":"WISEC","year":"2010","title":"Attacks on physical-layer identification","authors":"Boris Danev, Heinrich Luecken, Srdjan Capkun, Karim M. El Defrawy","author_ids":"1754853, 2637536, 1791522, 2857155","abstract":"Physical-layer identification of wireless devices, commonly referred to as Radio Frequency (RF) fingerprinting, is the process of identifying a device based on transmission imperfections exhibited by its radio transceiver. It can be used to improve access control in wireless networks, revent device cloning and complement message authentication protocols. This paper studies the feasibility of performing impersonation attacks on the modulation-based and transient-based fingerprinting techniques. Both techniques are vulnerable to impersonation attacks; however, transient-based techniques are more difficult to reproduce due to the effects of the wireless channel and antenna in their recording process. We assess the feasibility of performing impersonation attacks by extensive measurements as well as simulations using collected data from wireless devices. We discuss the implications of our findings and how they affect current device identification techniques and related applications.","cites":"36","conferencePercentile":"100"},{"venue":"WISEC","id":"145d3dc6f40af90ee6f687337ce21a59a993ff36","venue_1":"WISEC","year":"2010","title":"On the efficiency of secure beaconing in VANETs","authors":"Elmar Schoch, Frank Kargl","author_ids":"3060703, 1728575","abstract":"Direct inter-vehicle communication enables numerous safety applications like intersection collision warning. Beacons - periodic one-hop link-layer broadcast messages containing, e.g., location, heading, and speed - are the basis for many such applications. For security, current work often requires all messages to be signed and to carry a certificate to ensure integrity and authenticity. However, high beacon frequency of 1 - 10 Hz and dense traffic situations lead to significant communication and computational overhead. In this paper, we propose several mechanisms to significantly reduce this overhead while maintaining a comparable level of security. The general idea is to omit signatures, certificates, or certificate verification in situations where they are not necessarily required. This creates a security-performance trade-off that we analyze in detail. The results show that significant savings can be achieved with only small impact on security.","cites":"14","conferencePercentile":"77.27272727"},{"venue":"WISEC","id":"f2628da485b7f039278bae154055974125a61e4f","venue_1":"WISEC","year":"2015","title":"Device analyzer: a privacy-aware platform to support research on the Android ecosystem","authors":"Daniel T. Wagner, Daniel R. Thomas, Alastair R. Beresford, Andrew C. Rice","author_ids":"3995445, 2259738, 2619693, 1805120","abstract":"Device Analyzer is an Android app available from the Google Play store. It is designed to collect a large range of data from the handset and, with agreement from our contributors, share it with researchers around the world. Researchers can access the data collected, and can also use the platform to support their own user studies. In this paper we provide an overview of the privacy-enhancing techniques used in Device Analzyer, including transparency, consent, purpose, access, withdrawal, and accountability. We also demonstrate the utility of our platform by assessing the security of the Android ecosystem to privilege escalation attacks and determine that 88% of Android devices are, on average, vulnerable to one or more of these type of attacks.","cites":"1","conferencePercentile":"44.11764706"},{"venue":"WISEC","id":"10c56b35f151ac9e6620eb7dc5ef1907412d8282","venue_1":"WISEC","year":"2010","title":"On the tradeoff between trust and privacy in wireless ad hoc networks","authors":"Maxim Raya, Reza Shokri, Jean-Pierre Hubaux","author_ids":"2152296, 2520493, 1757221","abstract":"As privacy moves to the center of attention in networked systems, and the need for trust remains a necessity, an important question arises: How do we reconcile the two seemingly contradicting requirements? In this paper, we show that the notion of data-centric trust can considerably alleviate the tension, although at the cost of pooling contributions from several entities. Hence, assuming an environment of privacy-preserving entities, we provide and analyze a game-theoretic model of the trust-privacy tradeoff. The results prove that the use of incentives allows for building trust while keeping the privacy loss minimal. To illustrate our analysis, we describe how the trust-privacy tradeoff can be optimized for the revocation of misbehaving nodes in an ad hoc network.","cites":"11","conferencePercentile":"68.18181818"},{"venue":"WISEC","id":"292269b2a3496cd2e5831a1dac8b6ba6adcc8a85","venue_1":"WISEC","year":"2011","title":"Inferring users' online activities through traffic analysis","authors":"Fan Zhang, Wenbo He, Xue Liu, Patrick G. Bridges","author_ids":"1726798, 6417067, 1723807, 1695450","abstract":"Traffic analysis may threaten user privacy, even if the traffic is encrypted. In this paper, we use IEEE 802.11 wireless local area networks (WLANs) as an example to show that inferring users' online activities accurately by traffic analysis without the administrator's privilege is possible during very short periods (e.g., a few seconds). The online activities we investigated include web browsing, chatting, online gaming, downloading, uploading and video watching, etc. We implement a hierarchical classification system based on machine learning algorithms to discover what a user is doing on his/her computer. Furthermore, we conduct experiments in different network environments (e.g., at home, on university campus, and in public areas) with different application scenarios to evaluate the performance of the classification system. Results show that our system can distinguish different online applications on the accuracy of about 80% in 5 seconds and over 90% accuracy if the eavesdropping lasts for 1 minute.","cites":"24","conferencePercentile":"89.47368421"},{"venue":"WISEC","id":"0ce331085b6b7b95a6e9b5c8fa7dea564d2161fe","venue_1":"WISEC","year":"2008","title":"Simple and effective defense against evil twin access points","authors":"Volker Roth, Wolfgang Polak, Eleanor G. Rieffel, Thea Turner","author_ids":"3370624, 2423252, 1710276, 2729644","abstract":"Wireless networking is widespread in public places such as cafes. Unsuspecting users may become victims of attacks based on \"evil twin\" access points. These rogue access points are operated by criminals in an attempt to launch man-in-the-middle attacks. We present a simple protection mechanism against binding to an evil twin. The mechanism leverages short authentication string protocols for the exchange of cryptographic keys. The short string verification is performed by encoding the short strings as a sequence of colors, rendered sequentially by the user's device and by the designated access point of the cafe. The access point must have a light capable of showing two colors and must be mounted prominently in a position where users can have confidence in its authenticity. We conducted a usability study with patrons in several cafes and participants found our mechanism very usable.","cites":"37","conferencePercentile":"72.4137931"},{"venue":"WISEC","id":"457677672a750061d0e47c5de755c4ceb908cb17","venue_1":"WISEC","year":"2013","title":"Differential privacy in intelligent transportation systems","authors":"Frank Kargl, Arik Friedman, Roksana Boreli","author_ids":"1728575, 1806350, 1840101","abstract":"In this paper, we investigate how the concept of differential privacy can be applied to Intelligent Transportation Systems (ITS), focusing on protection of Floating Car Data (FCD) stored and processed in central Traffic Data Centers (TDC). We illustrate an integration of differential privacy with privacy policy languages and policy-enforcement frameworks like the PRECIOSA PeRA architecture. Next, we identify differential privacy mechanisms to be integrated within the policy-enforcement framework and provide guidelines for the calibration of parameters to ensure specific privacy guarantees, while still supporting the level of accuracy required for ITS applications. We also discuss the challenges that the support of user-level differential privacy presents and outline a potential solution. As a result, we show that differential privacy could be put to practical use in ITS to enable strong protection of users' personal data.","cites":"3","conferencePercentile":"40"},{"venue":"WISEC","id":"315ec8d8a9f86dc6bc1d3c2c633667c1cd1e1225","venue_1":"WISEC","year":"2011","title":"Accelerometers and randomness: perfect together","authors":"Jonathan Voris, Nitesh Saxena, Tzipora Halevi","author_ids":"2422726, 1716235, 1719765","abstract":"Accelerometers are versatile sensors that are nearly ubiquitous. They are available on a wide variety of devices and are particularly common on those that are mobile or have wireless capabilities. Accelerometers are applicable in a number of settings and circumstances, including important security and privacy domains. In this paper, we investigate the use of accelerometers for the purpose of true random number generation. As our first contribution, we discover that an accelerometer possesses two unique and appealing properties when used as an entropy source. First, contrary to intuition, an accelerometer can derive sufficient entropy even when it is stationary (i.e., not subject to perceivable acceleration). Next, and more importantly, the entropy of a stationary accelerometer can not be reduced in the presence of a variety of environmental variations or even under adversarial manipulations. This means that, unlike other sensors, accelerometers are resistant to changing environments, benign or otherwise. To support this claim, we develop a thorough experimental adversarial model for accelerometers that supply a system with entropy. To the authors' knowledge, this is the first real world model in the context of entropy collection. As our second contribution, we demonstrate the validity of accelerometer based random number generation on an RFID tag, which is a highly resource constrained device. We present the design and implementation of our method on an Intel WISP tag and conduct several novel experiments to evaluate its feasibility. Our results indicate that a high quality 128-bit random number can be extracted using an accelerometer in about 1.5 seconds even when the sensor is in a stationary state. To our knowledge, this is the first random number generation technique that is known to be viable for RFID devices based on general-purpose hardware.","cites":"7","conferencePercentile":"52.63157895"},{"venue":"WISEC","id":"c3568c1e80e6c8803257daea20cb52a45659ce8e","venue_1":"WISEC","year":"2016","title":"DARPA: Device Attestation Resilient to Physical Attacks","authors":"Ahmad Ibrahim, Ahmad-Reza Sadeghi, Gene Tsudik, Shaza Zeitouni","author_ids":"4465442, 8415280, 1702391, 2811044","abstract":"As embedded devices (under the guise of \"smart-whatever\") rapidly proliferate into many domains, they become attractive targets for malware. Protecting them from software and physical attacks becomes both important and challenging. Remote attestation is a basic tool for mitigating such attacks. It allows a trusted party (verifier) to remotely assess software integrity of a remote, untrusted, and possibly compromised, embedded device (prover).\n Prior remote attestation methods focus on software (malware) attacks in a one-verifier/one-prover setting. Physical attacks on provers are generally ruled out as being either unrealistic or impossible to mitigate. In this paper, we argue that physical attacks must be considered, particularly, in the context of many provers, e.g., a network, of devices. As- suming that physical attacks require capture and subsequent temporary disablement of the victim device(s), we propose DARPA, a light-weight protocol that takes advantage of absence detection to identify suspected devices. DARPA is resilient against a very strong adversary and imposes minimal additional hardware requirements. We justify and identify DARPA's design goals and evaluate its security and costs.","cites":"1","conferencePercentile":"82.25806452"},{"venue":"WISEC","id":"15ad4984309200b4aaf754c6026dd9ea562b3265","venue_1":"WISEC","year":"2009","title":"Collaborative authentication in unattended WSNs","authors":"Roberto Di Pietro, Claudio Soriente, Angelo Spognardi, Gene Tsudik","author_ids":"1728076, 2678175, 2549445, 1702391","abstract":"An unattended wireless sensor network (UWSN) might collect valuable data representing an attractive target for the adversary. Since a sink visits the network infrequently, unattended sensors cannot immediately off-load data to some safe external entity. With sufficient time between sink visits, a powerful mobile adversary can easily compromise sensor-collected data.\n In this paper, we propose two schemes (CoMAC and ExCo) that leverage sensor co-operation to achieve data authentication. These schemes use standard (and inexpensive) symmetric cryptographic primitives coupled with key evolution and few messages exchange. We provide security analysis for proposed schemes and assess their effectiveness via simulations. We show that proposed schemes cope well with real WSN issues, such as message loss and sensor failure. We also compare the two schemes with respect to robustness and overhead, which allows network designers to carefully select the right scheme and tune appropriate system parameters.","cites":"16","conferencePercentile":"57.69230769"}]}