{"WISMM.csv":[{"venue":"WISMM","id":"03edc398cdf0810b65e425a3ac1b05d155643e2e","venue_1":"WISMM","year":"2014","title":"Bridging the User Intention Gap: an Intelligent and Interactive Multidimensional Music Search Engine","authors":"Shenggao Zhu, Jingli Cai, Jiangang Zhang, Zhonghua Li, Ju-Chiang Wang, Ye Wang","author_ids":"2901597, 5370107, 2390165, 2746295, 1727820, 1681196","abstract":"Music is inherently abstract and multidimensional. However, existing music search engines are usually not convenient or too complicated for users to create multidimensional music queries, leading to the intention gap between users' music information needs and the input queries. In this paper, we present a novel content-based music search engine, the Intelligent &#38; Interactive Multidimensional mUsic Search Engine (i2MUSE), which enables users to input music queries with multiple dimensions efficiently and effectively. Six musical dimensions, including tempo, beat strength, genre, mood, instrument, and vocal, are explored in this study. Users can begin a query from any dimension and interact with the system to organize the query. Once the parameters of some dimensions have been set, i2MUSE is able to intelligently highlight a suggested parameter and gray out an un-suggested parameter for every other dimension, helping users express their music intentions and avoid parameter conflicts in the query. In addition, i2MUSE provides a real-time illustration of the percentage of matched tracks in the database. Users can also set the relative weight of each specified dimension. We have conducted a pilot user study with 30 subjects and validated the effectiveness and usability of i2MUSE.","cites":"1","conferencePercentile":"71.42857143"},{"venue":"WISMM","id":"600986e482047ce0cdfcbf9022d1a5e39c0d8755","venue_1":"WISMM","year":"2014","title":"Storytelling with Big Multimedia Data: Keynote Talk","authors":"Ramesh Jain","author_ids":"4521564","abstract":"Big data is becoming increasingly multimedia data. Storytelling is one of the oldest and the most popular activity for humans. Historically, since the early days of human existence, storytelling has been used as a means of simple communication as well as medium of entertainment, education of people, cultural preservation, and instilling moral values through examples. A story is presentation of experiences related to events. Events and their experiences are selected to communicate the intent of a story compellingly. The art of storytelling always had close relationship to technology of the time. A good story considers the message and the audience and then selects appropriate events and proper related experiential media and information to weave a compelling and engaging account of the events.\n There is a virtuous cycle between storytelling and the technology that is intertwined and synergistic. Historically, both have evolved together and are likely to continue evolving together in the near future. Most events of interest occur in physical world and must be captured using different sensors. Usually a single sensor is inadequate to capture diverse aspects of the event and hence the use of multiple sensors or media to capture an event and also to present event experiences for re-experiencing the events. Now we have diverse sensors to capture an event in all its details and use what will be compelling in storytelling.\n A good story is the result of many activities: collection of data, analysis of data, selection of events and experiences that are relevant to the message, and a compelling presentation using this material. All of these activities are active research areas in multimedia big data. We discuss different forms of storytelling as they evolved and the role of technology in different stages of storytelling. We believe that now we have powerful tools and technologies to make the art of storytelling really effective. In this presentation we will show challenges for multimedia researchers that could make storytelling very effective and very compelling.","cites":"0","conferencePercentile":"32.14285714"}]}