{"WISM.csv":[{"venue":"WISM","id":"270e26bafd30e9b3834d546da855fdd79cd21813","venue_1":"WISM","year":"2006","title":"Aligning Software Architectures of Mobile Applications on Business Requirements","authors":"Volker Gruhn, André Köhler","author_ids":"1743762, 3200819","abstract":"The support of mobile workers with mobile IT solutions can create dremendous improvements in mobile business processes of a company. The main charateristic of such a mobile system is the ability to connect via a (mobile) network to a central server, e.g. in order to access customer data. The frequency and the location of the use, data topi-cality, interaction requirements and many more are central aspects when developing a suitable system architecture. This paper provides a detailed decription of the four main software architectures for mobile systems and their main charateristics. Beyond, typical business requirements are developed , the implications for the system architecture for each of them is shown.","cites":"1","conferencePercentile":"25"},{"venue":"WISM","id":"bfca841b6a206a718573a557422c81ef2b59c0be","venue_1":"WISM","year":"2012","title":"Tuple Refinement Method Based on Relationship Keyword Extension","authors":"Xiaoling Yang, Jing Yang, Chao Chen","author_ids":"4073851, 1741099, 2067320","abstract":"Entity relation extraction is mainly focused on researching extraction approaches and improving precision of the extraction results. Although many efforts have been made on this field, there still exist some problems. In order to improve the performance of extracting entity relation, we propose a tuple refinement method based on relationship keyword extension. Firstly, we utilize the diversity of relationships to extend relationship keywords, and then, use the redundancy of network information to extract the second entity based on the principle of proximity and the predefined entity type. Under open web environment, we take four relationships in the experiments and adopt bootstrapping algorithm to acquire the initial tuple set. Three tuple refinement methods are compared: refinement method with threshold set, refinement method with relation extension and refinement method without relation extension. The average F-scores of the experimental results show the proposed method can effectively improve the performance of entity relation extraction. 1 Introduction With the rapid development of the Internet, extracting structured data from the vast amounts unstructured data called as information extraction (IE) has been the present research hotspot. The major research directions of IE [10, 11] are named entity recognition, anaphora resolution and relation extraction (RE). Since RE can be used in many applications such as semantic web, automatic answering and social relationship network, it is very important in the IE. Generally speaking, RE has two methods based on knowledge engineering and machine learning. Knowledge engineering methods require a lot of professional knowledge, which waste a lot of time and manpower. Meanwhile they lack the area portability. Machine learning methods need to apply a lot of deep natural language processing (NLP) technologies which inevitably produce a lot of noise. SVM methods use syntactic analysis and semantic analysis [5, 6, 7] to construct feature vectors,","cites":"1","conferencePercentile":"50"}]}