{"Wissensmanagement.csv":[{"venue":"Wissensmanagement","id":"8e4252485420fde7a4f8bd9d4fbaecb4031b301a","venue_1":"Wissensmanagement","year":"2009","title":"A Paper-based Technology for Personal Knowledge Management","authors":"Kinga Schumacher, Marcus Liwicki, Andreas Dengel","author_ids":"1684342, 1743758, 1703343","abstract":"In this paper we extend the Semantic Desktop with a novel input modality: handwriting on paper. This extension allows for annotating printed documents with handwritten notes, which are then recognized, interpreted and integrated into the personal knowledge space. Thus it supports personal knowledge work on paper. In particular , the user can mark any text segment and annotate it with his or her own comments. The semantic of these comments and marks are then interpreted and, finally, the result is included in the user's Semantic Desktop. The methodology for finding the intended meaning of the annotation in context of the marked text is presented in this paper. To demonstrate the applicability of our approach, we have implemented a prototype for the NEPOMUK Semantic Desktop.","cites":"1","conferencePercentile":"66.25"},{"venue":"Wissensmanagement","id":"a49961616172ae625ee166881786fae0a9ec5115","venue_1":"Wissensmanagement","year":"2011","title":"The Handling of External Knowledge in Innovation Processes: Knowledge Management and the Open Innovation Paradigm","authors":"Gergana Vladova, Elisabeth Müller, Andreas Braun, Silvia Adelhelm","author_ids":"1700138, 1746743, 1727402, 1749289","abstract":"Due to different factors, SMEs' innovation processes nowadays are increasingly dependent on external sources. In this paper we discuss the open innovation paradigm and evaluate the characteristics of knowledge transfer in such open innovation processes. We start by analysing concrete innovation processes in three partnering organisations. Based on the results of the analysis, a target concept was developed in close cooperation with the investigated companies. The concept displays all phases of the innovation process with focus on the openness of this process to the external environment, taking into account the challenges and risks as well as requirements of the resource allocation in SMEs. The link between the innovation process flow, the knowledge flow and the tool support is essential for the success of the concept.","cites":"0","conferencePercentile":"42.42424242"},{"venue":"Wissensmanagement","id":"524e94046f3d22260e4bc2287f39bcf0e657833f","venue_1":"Wissensmanagement","year":"2011","title":"Enterprise Wikis: Technical Challenges and Opportunities","authors":"Benedikt Kämpgen, Basil Ell, Elena Paslaru Bontas Simperl, Denny Vrandecic, Frank Dengler","author_ids":"3227317, 3353313, 2927032, 1808632, 2589182","abstract":"Social software has proven valuable in enterprises for collaborative knowledge management. In order to introduce a wiki in the enterprise, we propose a solution that combines Web 2.0 and Semantic Web technologies. We describe how this solution resolves the technical challenges, beyond that, opens up new opportunities, and, also, how it can be realized in a concrete enterprise scenario.","cites":"0","conferencePercentile":"42.42424242"},{"venue":"Wissensmanagement","id":"bf3d3d42f4f15dc57b88427aab689ed95bf4b7b3","venue_1":"Wissensmanagement","year":"2005","title":"Application of Knowledge Problem Patterns in Process Oriented Organizations","authors":"Markus Strohmaier, Stefanie N. Lindstaedt","author_ids":"1743043, 1757419","abstract":"This contribution introduces a method for the identification of knowledge problems in process-oriented organizations. On an operative level, knowledge problems occur when the generation, storage, transfer or application of knowledge is not in accordance with an organiza-tion's business goals. The introduced method represents an instrument for pointing organizations to such shortcomings and thereby opens up solution spaces for overcoming them. This contribution introduces a set of knowledge problem patterns and an accompanying process of applying them in organizations-both supported by empirical data generated in three conducted case studies. In doing that, this contribution provides new stimuli and insights for current research in the domain of business process oriented knowledge modeling and-audits. 1 Motivation Modern knowledge-based organizations increasingly face an urgent need to consciously deal with and effectively manage their most critical resource knowledge. On an operational level, many efforts focus on the management of knowledge activities in organizations such as the generation, storage, transfer or application of knowledge [1]. To ensure that KM initiatives focus on relevant areas of organizational knowledge work, often a process-oriented approach is pursued [2, 3]. By analyzing business processes from a knowledge perspective, relevant knowledge activities in organizations can be identified through e.g. the concept of knowledge processes [4]. With knowledge processes, organizational knowledge work within and across distributed business processes can be visualized [5]. Based on such knowledge processes, problems and barriers in organizational knowledge work can be detected. Many factors are known that represent problems for the effective execution of knowledge processes such as a lack of technological resources, transparency or trust [6]. Yet, these factors implicitly assume the suitability of existing knowledge processes and do not question the design or execution of them. Therefore, the contribution at hand introduces a set of hypothetical knowledge problem patterns on a generic level together with empirical experiences that aim to 1) point organizations to wrongly defined or sub-optimally executed knowledge processes and 2) sketch up solution spaces in order to enable organizations \" to do the right things \" (vs. \" to do things right \") when it comes to","cites":"1","conferencePercentile":"33.8028169"},{"venue":"Wissensmanagement","id":"48cc4cb1251946d732e7049266df983317100661","venue_1":"Wissensmanagement","year":"2005","title":"Future Studies of Learning Software Organizations","authors":"Kari Smolander, Kurt Schneider, Torgeir Dingsøyr, Finn Olav Bjørnson, Pasi Juvonen, Päivi Ovaska","author_ids":"1726281, 1724127, 1723591, 1981074, 2357493, 3064127","abstract":"We suggest to study learning software organizations in three projects; one to analyse the current situation for local software and system houses, one to study improvement and learning through examining knowledge flows, and a third to study the impact of a large-scale interaction process: Open Space Technology to share domain knowledge.","cites":"0","conferencePercentile":"14.78873239"},{"venue":"Wissensmanagement","id":"a8e1424d6e843883b1247196e9289eeb1b8a61cd","venue_1":"Wissensmanagement","year":"2005","title":"Knowledge Problems in Process-Oriented Organizations: A Pattern Approach","authors":"Markus Strohmaier, Stefanie N. Lindstaedt, Wilhelm Dietrich, Philipp Koronakis","author_ids":"1743043, 1757419, 2415350, 2398033","abstract":"This contribution introduces a novel approach for the identification of knowledge problems in process-oriented organizations. On an operative level, knowledge problems occur when the generation, storage, transfer or application of knowledge is not in accordance with an orga-nization's business goals. The concept of knowledge problem patterns represents a sound instrument to point organizations to such shortcomings and thereby opens up solution spaces for overcoming them. This contribution briefly introduces a set of knowledge problem patterns and an accompanying process of applying them in real world environments-both supported by empirical data generated in three conducted case studies. The concepts of this work provide new stimuli and insights for current research in the domain of business process oriented knowledge modelling and-audits. 1 Motivation Modern knowledge-based organizations increasingly face an urgent need to consciously deal with and effectively manage their most critical resource knowledge. On an operational level, many efforts focus on the management of knowledge activities in organizations such as the generation, storage, transfer or application of knowledge [1]. To ensure that KM initiatives focus on relevant areas of organizational knowledge work, often a process-oriented approach is pursued. By analyzing business processes from a knowledge perspective, relevant knowledge activities in organizations can be identified through e.g. the concept of knowledge processes. Here, knowledge processes are considered to visualize organizational knowledge work within and across distributed business processes [2]. Many factors are known that represent barriers for the execution of knowledge processes such as a lack of technological resources, transparency or trust [3]. Yet, these factors implicitly assume the suitability of existing knowledge processes and do not question the design or execution of them. Therefore, the contribution at hand introduces a set of very concrete knowledge problem patterns on an operative","cites":"1","conferencePercentile":"33.8028169"},{"venue":"Wissensmanagement","id":"6f03960b93db04c8cc525f5827979854c659001b","venue_1":"Wissensmanagement","year":"2011","title":"SpotTheLink: A Game for Ontology Alignment","authors":"Stefan Thaler, Elena Paslaru Bontas Simperl, Katharina Siorpaes","author_ids":"1931140, 2927032, 1980497","abstract":"The interoperability of data depends on the availability of alignments among different ontologies. Various approaches to match, merge and integrate ontologies and, more recently, to interlink RDF data sets were developed over. Even though the research area has matured, the full automation of the ontology alignment process is not feasible and the human user is indispensable. Such tasks involve mainly bootstrapping the underlying methods and for validating and enhancing their results. The question of acquiring such input still remains to be solved, in particular when it comes to the motivators and incentives that are likely to make people dedicate labor to ontology alignment tasks. In this paper we build on previous work of ours on using casual games to tackle this problem. We present SpotTheLink, the latest release of the OntoGame framework, which allows for the definition of mappings between Semantic Web ontologies as part of a collaborative game experience. We illustrate the idea of SpotTheLink in an instance of the game aiming to align DBpedia and PROTON, and explain the game background mechanics by which players' inputs are translated into SKOS-based ontology mappings. A summary of findings of SpotTheLink user evaluation and the experiences we gained throughout the entire life span of OntoGame allow us to derive a number of best practices and guidelines for the design of incentives-minded semantic-content-authoring technology, in which human and computational intelligence are smoothly interwoven.","cites":"13","conferencePercentile":"100"},{"venue":"Wissensmanagement","id":"243acb855d8159e70a9e2a64b9089c4e24c27b3d","venue_1":"Wissensmanagement","year":"2005","title":"Search, Comparison and Evaluation in Exploratory E-Learning with Subjunctive Interfaces","authors":"Klaus P. Jantke, Aran Lunzer","author_ids":"1738124, 3306182","abstract":"E-learning deals with knowledge management, for sure, and knowledge management very frequently results in learning. So far, there is an obviously close relationship between the two disciplines. However, deeper insights do not arise easily. Here we investigate how one approach to enhancing information access interfaces may inspire an improvement in knowledge management for e-learning. Subjunctive interfaces support users in investigating and visualizing information obtained in parallel through multiple enquiries. A wide spectrum of exploratory e-learning approaches may benefit from adopting and adapting the subjunctive interface concept.","cites":"1","conferencePercentile":"33.8028169"},{"venue":"Wissensmanagement","id":"8fe7e9f4f949d106888a8e9fa3d61e88fba42c7c","venue_1":"Wissensmanagement","year":"2005","title":"Minimal Activity Plans: Artifacts for Self-Organized Learning within Organizations","authors":"Christoph Richter, Heidrun Allert, Wolfgang Nejdl","author_ids":"4280894, 1757391, 1744808","abstract":"In this paper we present an educational approach to foster self-organized learning within organizations. Based on the notion that learning as well as work is embedded in collectively organized and artifact mediated activity systems and that learning entails individual and social transformation we outline the concept of Minimal Activity Plans and describe potential use cases. In order to organize the use of Minimal Activity Plans and to combine it with knowledge management technologies a descriptive framework is sketched.","cites":"2","conferencePercentile":"47.18309859"},{"venue":"Wissensmanagement","id":"0cc4f55bd0144d120f477bdbdce524c4b66491ab","venue_1":"Wissensmanagement","year":"2011","title":"Unterstützung des Wissensreifungsprozesses durch Einsatz von Web 2.0 in Unternehmen","authors":"Nicolas Weber, Gerhard Frühstück, Tobias Ley","author_ids":"2602079, 2821714, 1790612","abstract":"In Unternehmen ist die Dokumentation von anfallendem Wissen meist ein 1 Einleitung","cites":"0","conferencePercentile":"42.42424242"},{"venue":"Wissensmanagement","id":"0930932d5aaed3aa59023007ce6af4a63b945774","venue_1":"Wissensmanagement","year":"2005","title":"Competency Development in Knowledge Management and eLearning: Supporting Informal Workplace Learning","authors":"Tobias Ley, Stefanie N. Lindstaedt, Dietrich Albert","author_ids":"1790612, 1757419, 1694011","abstract":"We show how competence spaces that establish a strong link between competencies and the tasks in which they are applied may be used for supporting competency development in Knowledge Management and eLearning. Two scenarios illustrate the integration of competence spaces into a workplace learning environment, which supports self directed learning from a knowledge repository and enhances feedback mechanisms in a coaching process.","cites":"1","conferencePercentile":"33.8028169"},{"venue":"Wissensmanagement","id":"aea16e4e6ac624210ed4f1feb192053408266905","venue_1":"Wissensmanagement","year":"2005","title":"Subjunctive Interfaces in Exploratory e-Learning","authors":"Klaus P. Jantke, Aran Lunzer, Jun Fujima","author_ids":"1738124, 3306182, 2490602","abstract":"E-learning deals with knowledge management, for sure, and knowledge management very frequently results in learning. So far, there is an obviously close relationship between the two disciplines. However, deeper insights do not arise easily. Here we investigate how one approach to enhancing information-access interfaces may inspire an improvement in knowledge management for e-learning. Subjunctive interfaces support users in investigating and visualizing information obtained in parallel through multiple enquiries. A wide spectrum of exploratory e-learning approaches may benefit from adopting and adapting the subjunctive interface concept.","cites":"2","conferencePercentile":"47.18309859"},{"venue":"Wissensmanagement","id":"4d6a978d6433247cb1258d260d5ab320f91aeb4c","venue_1":"Wissensmanagement","year":"2005","title":"Clinical Experiences with a Knowledge-Based System in Sonography (SonoConsult)","authors":"Frank Puppe, Georg Buscher, Martin Atzmüller, Matthias Hüttig, Hans-Peter Buscher","author_ids":"1707592, 1693190, 2985108, 2514238, 1903215","abstract":"We evaluated the clinical effects of the knowledge-based documentation and diagnosis system SonoConsult for sonography, which has been used in clinical routine for more than 2 years. The evaluation focuses on the following aspects from the clinical point of view: quality of documentation, quality of diagnostic conclusions, training effects, and research effects. In contrast to widespread expectations in the knowledge-based community, the diagnostic conclusions were less important than the other aspects, being much more welcomed by clinicians.","cites":"3","conferencePercentile":"62.67605634"},{"venue":"Wissensmanagement","id":"0cff77c1d64779ef103fca2156eaef21627e36f1","venue_1":"Wissensmanagement","year":"2005","title":"PAIKM-2005 - Peer-to-Peer and Agent Infrastructures for Knowledge Management","authors":"Andreas Abecker, Ludger van Elst, Steffen Staab","author_ids":"1689856, 1727962, 1752093","abstract":"Today's IT infrastructures for knowledge management often build on centralized information systems architectures, e.g., Web servers. Such systems have shown their benefits in many situations where knowledge processes are comparatively rigid and where the value of knowledge to be contributed to such a centralized repository can be easily assessed. Unfortunately, knowledge-intensive work frequently exhibits some different characteristics: – It happens sporadically; – It is not tightly embedded in standardized processes or knowledge structures; – It includes previously unseen domains of interest to the knowledge worker; – It requires a lot of ad-hoc interaction with other knowledge workers; – Its value is hard to be assessed and it will end up in a set of best-practices only after a long time. Hence, a lot of results of such knowledge-intensive work do not make it into centralized repositories. They remain closed away on PCs or laptops and are unaccessible to the organisation. Thus, a lot of redundant work may be performed and people do not fully benefit from the work of their colleagues. Peer-to-Peer (P2P) and agent infrastructures serve the needs of knowledge workers for a more flexible knowledge sharing environment adapted to their personal needs and up-to-date with regard to ad-hoc knowledge provided by others. In the workshop, we saw a set of techniques that contribute to this overall goal spanning the full breadth from reusing existing servers to finding the right peer to talk to. In particular, the latter topic is germane to knowledge management. While we interact with computers as one of the main parts of our knowledge work these days, it appears very promising to let our computers communicate with each other in order to find the right peers to talk to—for human communication as well as for retrieval of facts and documents at the technical level. Thus, P2P and agent infrastructures in KM do enhance our individual capabilities for collaboration and our individual capabilities for socializing for the purpose of knowledge management. The two papers that are included in this conference post-proceedings emphasize on linking peers in P2P networks, thus showing the potential of P2P","cites":"0","conferencePercentile":"14.78873239"},{"venue":"Wissensmanagement","id":"6ebb8240f1f7af088b3f8f0b50178e08faa0d02d","venue_1":"Wissensmanagement","year":"2009","title":"Towards Ontology-based Information Extraction and Annotation of Paper Documents for Personalized Knowledge Acquisition","authors":"Benjamin Adrian, Heiko Maus, Malte Kiesel, Andreas Dengel","author_ids":"1746927, 1685168, 1733793, 1703343","abstract":"Despite the advent of electronic personal information management (PIM) tools, knowledge workers are still heavily using paper-based information sources. But up to now, even in sophisticated tools for PIM such as the Semantic Desktop, the knowledge workers' paper world is still neglected. Thus, electronic archiving of a web page for later reference is much easier than taking care of an interesting article in a magazine—whose copy might set dust on the user's shelf and will long be forgotten when it would be helpful for a specific task. This paper presents how to use document analysis, ontology-based information extraction, and annotation techniques for personal knowledge acquisition in order to bridge the gap between the user's paper world and his personal knowledge space in the Semantic Desktop. A recent prototype shows the feasibility of the approach.","cites":"3","conferencePercentile":"87.5"},{"venue":"Wissensmanagement","id":"1c14fcbd9526c1a58d58dfcfe56b62df802161c4","venue_1":"Wissensmanagement","year":"2011","title":"Life-Based Design as an Inclusive Tool for Managing Microinnovations","authors":"Rebekah Rousi, Jaana Leikas, Pertti Saariluoma, Mari Ylikauppila","author_ids":"2142544, 3329099, 7328452, 2307673","abstract":"This paper investigates the role of focus group methodology within the context of microinnovation management and life-based design (LBD). LBD is a multi-dimensional approach which emphasises the importance of understanding people's lives (forms of life and circumstances) as a basis for creating design ideas and concept design. Human-technology interaction (HTI) is embedded in the everyday lives of people from all age groups, yet the levels and approaches to this interaction vastly differ between various groups. Thus, based on the principles of LBD, this paper discusses a method for collecting and managing people's experiences to serve as guidelines within an inclusive design process. The focus group method operates in the form of group interviews, where the discussion is led by a theme and/or a particular activity. Microinnovation management concentrates on the management of smaller innovations such as those produced on an individual or group level, within such processes as focus groups. We are using this paper as an opportunity to theorise the focus group method as an example of Experience Management, in the generation and management of microinnovations. In this paper we discuss the way we have the focus group method as a means to gain critical feedback and reformulate a user-centred questionnaire and conceptual design. Experience is seen as central to this paper for the following two reasons: 1) that we can learn from a variety of people's life experiences, based on various forms of life, in order to inform our own decisions when assembling design frameworks; and 2) that experience is an outcome of the design process – either past, present or future. The notion of microinnovation management comes into play when discussing the utilisation of ideas generated through such design methodologies to inform concrete design decisions.","cites":"0","conferencePercentile":"42.42424242"},{"venue":"Wissensmanagement","id":"ebc03d942ef4af6cbd629e9bce021b185bb0f742","venue_1":"Wissensmanagement","year":"2003","title":"Situated Models and Metadata for Learning Management form an Organisational and Personal Perspective","authors":"Heidrun Allert, Christoph Richter, Wolfgang Nejdl","author_ids":"1757391, 4280894, 1744808","abstract":"This paper depicts the interrelation between situated learning and learning management from an organisational and personal perspective. Based on this introduction we show how educational metadata can be used for approaches of situated learning and how we can take care of learning approaches and contexts using situated and context specific metadata and role-based models.","cites":"0","conferencePercentile":"31.81818182"}]}