{"Wissen_in_Aktion.csv":[{"venue":"Wissen in Aktion","id":"2621389394e7c5159e2010d61c354d5f1dc71d68","venue_1":"Wissen in Aktion","year":"2004","title":"Preserving Privacy in Awareness Systems","authors":"Sameer Patil, Alfred Kobsa","author_ids":"2604012, 1715227","abstract":"Increasingly, software development teams comprise members who are geographically distributed across buildings, cities, countries or even continents. In order to raise the efficiency and effectiveness of such collaboration, team members need timely and context-specific information about the various activities of the other members. This information can be utilized to (re)schedule ones own work activities, to determine who needs to be consulted and whether they are available, and it also facilitates informal communication among team members (Dourish & Bellotti, 1992; Herbsleb et. al., 2000). However, this need for information about the activities, work and routines of team members is quite frequently at odds with the individual needs and desires for privacy, even within teams of peers. This leads to a tension between awareness and privacy in the context of collaborative work. Many suspect that the promise of collaborative technologies that increase group awareness and communication is often overshadowed by hidden privacy concerns, which are inherent to such systems. This chapter discusses various factors and principles that influence privacy management, as a first step toward informing design of socio-technical solutions to alleviate these tensions. For the discussion, we have used Instant Messaging (IM) as an example of an awareness technology for collaborative work. Awareness of the activities of collaborators helps individuals plan, orient and coordinate their own work to fit in with the larger scheme of things with respect to the team, department or organization. This results in increased efficiency and effectiveness of individual work as well as the work that is carried out collaboratively [Dourish & Bellotti 1992]. It is no surprise then that the more tightly-coupled the collaborative activity, the higher the","cites":"5","conferencePercentile":"100"},{"venue":"Wissen in Aktion","id":"13b08d8a6c2fb86496cd7a3e0c4c55f0f3d29eed","venue_1":"Wissen in Aktion","year":"2004","title":"Universal Actability of and with Knowledge: Managing and Communicating Knowledge with Patterns","authors":"Fahri Yetim","author_ids":"3020070","abstract":"Dieses Dokument wird unter folgender creative commons Lizenz veröffentlicht: Abstract Managing and communicating information and knowledge with patterns entail a multitude of assumptions, interests, and validity claims. Patterns are socially constructed, and they may consequently be socially more or less acceptable or contested. Before the background of global diversity, the issue of universal actability of and with knowledge gains significance and calls for more reflections. In this context, this paper deals with some concepts for enabling reflective practice in applying and communicating knowledge. 1 Introduction \" Knowledge in action \" is the \" buzz phrase \" with which scientists, practitioners, and managers operate. It emphasizes simultaneously that knowledge acts or does something and that it plays a significant role in an (human) action or doing. Consequently, it invites us to pay more attention to the actability of knowledge and human actability with knowledge. Especially, before the background of value pluralism, universal actability of and with knowledge gains more significance and requires additional reflections. Relevant is not only the question of what is and is not knowledge, but also that of what knowledge should or should not be known by or communicated to individuals and the society as a whole. 1 In this context, this paper reflects on some aspects of universal actability when patterns of communication are used for managing and communicating knowledge. These reflections cannot do justice to these issues entirely. More 1 A typical case example for controversies is the imparting sexual knowledge in the school, which conflicts with the religious and cultural values (see, for example, the resolution of","cites":"2","conferencePercentile":"91.17647059"}]}