{"WISTP.csv":[{"venue":"WISTP","id":"f60fb4683e137d0fd52f139ce7dc905bdefd3d7e","venue_1":"WISTP","year":"2012","title":"Privacy Preserving Social Network Publication on Bipartite Graphs","authors":"Jian Zhou, Jiwu Jing, Ji Xiang, Lei Wang","author_ids":"1682802, 1757984, 2137868, 1743559","abstract":"In social networks, some data may come in the form of bipar-tite graphs, where properties of nodes are public while the associations between two nodes are private and should be protected. When publishing the above data, in order to protect privacy, we propose to adopt the idea generalizing the graphs to super-nodes and super-edges. We investigate the problem of how to preserve utility as much as possible and propose an approach to partition the nodes in the process of generalization. Our approach can give privacy guarantees against both static attacks and dynamic attacks, and at the same time effectively answer aggregate queries on published data.","cites":"0","conferencePercentile":"25"},{"venue":"WISTP","id":"5e8b1bcce56370c4366f51d3bc2c1886482fe92b","venue_1":"WISTP","year":"2012","title":"HiPoLDS: A Security Policy Language for Distributed Systems","authors":"Matteo Dell'Amico, Gabriel Serme, Muhammad Sabir Idrees, Anderson Santana de Oliveira, Yves Roudier","author_ids":"1789432, 1717748, 2482860, 1724759, 1790707","abstract":"Expressing security policies to govern distributed systems is a complex and error-prone task. Policies are hard to understand, often expressed with unfriendly syntax, making it difficult to security administrators and to business analysts to create intelligible specifications. We introduce the Hierarchical Policy Language for Distributed Systems (HiPoLDS). HiPoLDS has been designed to enable the specification of security policies in distributed systems in a concise, readable, and ex-tensible way. HiPoLDS's design focuses on decentralized execution environments under the control of multiple stakeholders. Policy enforcement employs distributed reference monitors who control the flow of information between services. HiPoLDS allows the definition of both abstract and concrete policies, expressing respectively high-level properties required and concrete implementation details to be ultimately introduced into the service implementation.","cites":"1","conferencePercentile":"59.375"},{"venue":"WISTP","id":"34842f55d03019d5d89f65296752e06935981ef8","venue_1":"WISTP","year":"2011","title":"SSL/TLS Session-Aware User Authentication Using a GAA Bootstrapped Key","authors":"Chunhua Chen, Chris J. Mitchell, Shaohua Tang","author_ids":"2450674, 1723348, 6329803","abstract":"Most SSL/TLS-based electronic commerce (e-commerce) applications (including Internet banking) are vulnerable to man in the middle attacks. Such attacks arise since users are often unable to authenticate a server effectively, and because user authentication methods are typically decoupled from SSL/TLS session establishment. Cryptographically binding the two authentication procedures together, a process referred to here as SSL/TLS session-aware user authentication (TLS-SA), is a lightweight and effective countermeasure. In this paper we propose a means of implementing TLS-SA using a GAA bootstrapped key. The scheme employs a GAA-enabled user device with a display and an input capability (e.g. a 3G mobile phone) and a GAA-aware server. We describe a simple instantiation of the scheme which makes the password authen-tication mechanism SSL/TLS session-aware; in addition we describe two possible variants that give security-efficiency trade-offs. Analysis shows that the scheme is effective, secure and scalable. Moreover, the approach fits well to the multi-institution scenario.","cites":"2","conferencePercentile":"50"},{"venue":"WISTP","id":"430fd9d65373fe469da7cea41ee30ad3776a9d4d","venue_1":"WISTP","year":"2016","title":"Password Generators: Old Ideas and New","authors":"Fatma Al Maqbali, Chris J. Mitchell","author_ids":"3461514, 1723348","abstract":"This paper considers password generators, i.e. systems designed to generate site-specific passwords on demand. Such systems are an alternative to password managers. Over the last 15 years a range of password generator systems have been described. This paper proposes the first general model for such systems, and critically examines options for instantiating this model; options considered include all those previously proposed as part of existing schemes as well as certain novel possibilities. The model enables a more objective and high-level assessment of the design of such systems; it has also been used to sketch a possible new scheme, AutoPass, intended to incorporate the best features of the prior art whilst also addressing many of the most serious shortcomings of existing systems through the inclusion of novel features .","cites":"0","conferencePercentile":"75"},{"venue":"WISTP","id":"0cacc612af2ee881c53fe8630aa5b9b686b4d2ff","venue_1":"WISTP","year":"2010","title":"Secure and Usable Out-Of-Band Channels for Ad Hoc Mobile Device Interactions","authors":"Ronald Kainda, Ivan Flechais, A. W. Roscoe","author_ids":"2337876, 1740080, 8455568","abstract":"Protocols for bootstrapping security in ad hoc mobile device interactions rely on users' ability to perform specific tasks such as transferring or comparing fingerprints of information between devices. The size of fingerprints depends on the level of technical security 1 required by a given application but, at the same time, is limited by users' inability to deal with large amounts of data with high levels of accuracy. Large fingerprints provide high technical security but potentially reduce usability of protocols which may result in users making mistakes that compromise security. This conflict between technical security and usability requires methods for transferring fingerprints between devices that maximise both to achieve acceptable effective security. In this paper, we propose two methods for transferring fingerprints between devices. We conducted a usability and security evaluation of the methods and our results show that, in contrast to previous proposals, our methods are both usable and resistant to security failures.","cites":"3","conferencePercentile":"65.51724138"},{"venue":"WISTP","id":"aed7e652c5c7644cc356ec6772bad4f9ecbd0dd2","venue_1":"WISTP","year":"2008","title":"Probabilistic Identification for Hard to Classify Protocol","authors":"Elie Bursztein","author_ids":"1687723","abstract":"With the growing use of protocols obfuscation techniques, protocol identification for Q.O.S enforcement, traffic prohibition, and intrusion detection has became a complex task. This paper address this issue with a probabilistic identification analysis that combines multiples advanced identification techniques and returns an ordered list of probable protocols. It combines a payload analysis with a classifier based on several discriminators, including packet entropy and size. We show with its implementation, that it overcomes the limitations of traditional port-based protocol identification when dealing with hard to classify protocol such as peer to peer protocols. We also details how it deals with tunneled session and covert channel.","cites":"1","conferencePercentile":"45.45454545"},{"venue":"WISTP","id":"72a83f3b12e2b90aac4c4e7e45403f894965a9d6","venue_1":"WISTP","year":"2010","title":"Efficient Mutual Authentication for Multi-domain RFID Systems Using Distributed Signatures","authors":"Michael Braun, Ulrike Meyer, Susanne Wetzel","author_ids":"4753507, 1716985, 1739446","abstract":"The use of RFID technology in complex and distributed environments often leads to a multi-domain RFID system in which security issues such as authentication of tags and readers, granting access to data, and revocation of readers turn into an administrative challenge. In this paper, we propose a new public-key-based mutual authentication protocol that addresses the reader revocation problem while maintaining efficiency and identity privacy. In addition, our new protocol integrates fine-grained access control and key establishment with mutual authenti-cation. The core of our solution is the use of the concepts of key-splitting and distributed signatures to solve the validation and revocation problem. We show that our protocols can be implemented on RFID tags using lightweight implementations of elliptic curve cryptography.","cites":"0","conferencePercentile":"13.79310345"}]}