{"WKDD.csv":[{"venue":"WKDD","id":"bd62065ac907ec38db54d400407c8c5c09fae57f","venue_1":"WKDD","year":"2009","title":"Modeling and Simulation of Container Terminal Logistics System","authors":"Li Li, Xiaodong Wang","author_ids":"1682059, 7136549","abstract":"As the highly complex logistics system, container terminal logistics systems (CTLS) play an increasingly important role in modern international logistics, and therefore their scheduling and decision-making process of much significance to the operation and competitiveness of harbors. In this paper, the handling, stacking and transportation in CTLS are regarded as a kind of generalized computing and compared with the working in general computer systems, whereupon the Harvard architecture and agent-based computing paradigm are fused to model the operational processing of CTLS, and the kernel thoughts in computer organization, architecture and operating system are introduced into CTLS to support and evaluate container terminal planning, scheduling and decision-making. A new agile, efficient and robust compound modeling and scheduling methodology for CTLS is obtained consequently. Finally a series of single-vessel simulations on handling and transportation are designed, implemented, performed, evaluated and analyzed, which validate the feasibility and creditability of the systematic methodology effectively.","cites":"0","conferencePercentile":"30"},{"venue":"WKDD","id":"750f979b40edb38f6ac56793c6b8035d62df4cf6","venue_1":"WKDD","year":"2008","title":"Solving Constrained Optimization via a Modified Genetic Particle Swarm Optimization","authors":"Zhiming Liu, Cheng Wang, Jian Li","author_ids":"2057478, 3879731, 1701502","abstract":"The genetic particle swarm optimization (GPSO) was derived from the original particle swarm optimization (PSO), which is incorporated with the genetic reproduction mechanisms, namely crossover and mutation. Based on which a modified genetic particle swarm optimization (MGPSO) was introduced to solve constrained optimization problems. In which the differential evolution (DE) was incorporated into GPSO to enhance search performance. At each generation GPSO and DE generated a position for each particle, respectively, and the better one was accepted to be a new position for the particle. To compare and ranking the particles, the lexicographic order ranking was introduced. Moreover, DE was incorporated to the original PSO with the same method, which was used to be compared with MGSPO. MGPSO were experimented with well-known benchmark functions. By comparison with original PSO algorithms and the evolution strategy, the simulation results have shown its robust and consistent effectiveness.","cites":"4","conferencePercentile":"85.71428571"}]}