{"WMASH.csv":[{"venue":"WMASH","id":"74d0207f72f4b33babd85430b2b2bb902f0286c0","venue_1":"WMASH","year":"2005","title":"Supporting terminal mobility by means of self-adaptive communication object migration","authors":"Karin Anna Hummel, Szabolcs Pota, Christian Schusterreiter","author_ids":"1746763, 3157462, 2672403","abstract":"Mobile devices, like PDAs or smart phones, exhibit limited capabilities in terms of processing power and memory. Supported by advanced WLAN hotspot grid infrastructures, mobile terminals may enhance their computing capabilities significantly by utilizing remote resources in virtually shared spaces. Due to privacy and performance issues, the shared communication objects should be kept in proximity to the roaming owner which requires object migration.We propose a novel self-adaptive decision algorithm for object migration based on a cost-benefit function. This function considers parameters describing the expected latency caused by migration and the expected response time saved by local access. The importance of each parameter is determined by a weight and adapted using Bayesian concept learning. The feasibility of the approach is demonstrated by a prototypical implementation for PDAs based on the space-based middleware CORSO. We further investigate the decision algorithm by means of simulation.","cites":"2","conferencePercentile":"38.88888889"},{"venue":"WMASH","id":"dbb457b1401be32318abcba2a159f78fe801dfe1","venue_1":"WMASH","year":"2005","title":"An implementation and evaluation of a mobile hotspot","authors":"Eranga Perera, Henrik Petander, Kun-Chan Lan, Aruna Seneviratne","author_ids":"2003809, 1939849, 8008072, 1678254","abstract":"The unprecedented proliferation of wireless networking services and products has taken the notion of hotspots a step further to accommodate \"mobile hotspots\". The deployment of hotspots in trains, ships, planes, buses etc. would certainly change the way we travel. These moving hotspots would potentially contain a large number of devices requiring global connectivity. In such situations employing one device namely a Mobile Router for the mobility management of the entire network would be a lucrative solution in terms of performance and costs. Such an architecture has been proposed and standardized by the IETF's Network Mobility Working Group [1]. In this paper we present our implementation of a mobile hotspot using a Mobile Router architecture and give initial results on our performance study. Further we present our preliminary results of incorporating handoff and routing optimizations on our mobile hotspot.","cites":"2","conferencePercentile":"38.88888889"},{"venue":"WMASH","id":"34d49b6d07aaf706f103da7437d7df16d84d6427","venue_1":"WMASH","year":"2005","title":"A multimedia guidebook implementation using a bluetooth wireless information point network","authors":"Matthew D'Souza, Adam Postula, Neil W. Bergmann, Montserrat Ros","author_ids":"2314262, 8496287, 1731327, 2252612","abstract":"This paper describes the implementation of a Bluetooth Village Guide Book (VGB) scenario for use in the Kelvin Grove Urban Village located in Brisbane, Australia. An Information Point Station Network (IPSN) was developed, along with software for two types of mobile computing devices. The implementation consists of several Information Point Stations (IPSs) placed at locations of significance, with access to information items on a centralized server. Once a user is registered on the network, he/she is given the opportunity to experience context and eventually user aware information on demand and in various multimedia formats. These information items are selected by the user, either by way of a menu system appearing on their mobile computing device or a more intuitive pointer-tag system. Information items are then 'beamed' to the user's mobile computing device for the user to view. The implementation was found to be successful and was tested with multiple users accessing information items from a given IPS as well as multiple IPSs attached to the centralized server. A multimedia guidebook communications protocol was also developed to overcome the varying Bluetooth capabilities of a range of mobile computing devices. The future work includes further developing the VBG software to include a user-registration system and other features.","cites":"4","conferencePercentile":"72.22222222"},{"venue":"WMASH","id":"1f68d22ee06886a8b01d2264f73a085d4e49287d","venue_1":"WMASH","year":"2003","title":"Wireless hotspots: current challenges and future directions","authors":"Anand Balachandran, Geoffrey M. Voelker, Paramvir Bahl","author_ids":"3095954, 1739245, 2897351","abstract":"In recent years, wireless Internet service providers (WISPs) have established Wi-Fi hotspots in increasing numbers at public venues, providing local coverage to traveling users and empowering them with the ability to access email, Web, and other Internet applications on the move. In this paper, we observe that while the mobile computing landscape has changed both in terms of number and type of hotspot venues, there are several technological and deployment challenges remaining before hotspots can become an ubiquitous infrastructure. These challenges include authentication, security, coverage, management, location services, billing, and interoperability. We discuss existing research, the work of standards bodies, and the experience of commercial hotspot providers in these areas, and then describe compelling open research questions that remain.","cites":"50","conferencePercentile":"90"},{"venue":"WMASH","id":"34f375461c6c35c7008377e3c533692ea1fb3f83","venue_1":"WMASH","year":"2004","title":"Reputation-based Wi-Fi deployment protocols and security analysis","authors":"Naouel Ben Salem, Jean-Pierre Hubaux, Markus Jakobsson","author_ids":"2897500, 1757221, 2836467","abstract":"In recent years, wireless Internet service providers (WISPs) have established thousands of WiFi hot spots in cafes, hotels and airports in order to offer to travelling Internet users access to email, web or other Internet service. However, two major problems still slow down the deployment of this kind of networks: the lack of a seamless roaming scheme and the variable quality of service experienced by the users. This paper provides a response to these two problems: We present a solution that, on the one hand, allows a mobile node to connect to a foreign WISP in a secure way while preserving its anonymity and, on the other hand, encourages the WISPs to provide the users with good QoS. We analyse the robustness of our solution against various attacks and we prove by means of simulations that our reputation model indeed encourages the WISPs to behave correctly.","cites":"19","conferencePercentile":"75"},{"venue":"WMASH","id":"37d81d53579d8cf8ce928e9ef7fb4c42483d48d2","venue_1":"WMASH","year":"2003","title":"End-to-end throughput and delay assurances in multihop wireless hotspots","authors":"Kuang-Ching Wang, Parameswaran Ramanathan","author_ids":"1706084, 4175169","abstract":"Next generation Wireless Local Area Networks (WLAN's) are likely to require multihop wireless connections between mobile nodes and Internet gateways to achieve high data rates from larger distances. The paper addresses the challenges in concurrently providing a wide range of end-to-end throughput and delay assurances in such mobile multihop WLAN hotspots. The proposed solution is based on the Neighborhood Proportional Delay Differentiation (NPDD) service model. With NPDD, Transmission Control Protocol (TCP) based applications achieve their desired throughputs using a dynamic class selection mechanism. This approach integrates well with the NPDD-based end-to-end delay assurance mechanism proposed earlier. The integrated throughput and delay assurance mechanisms are evaluated with simulations. To better model the node mobility in a multihop hotspot, the Public Hotspot Mobility (PHM) model is proposed. Simulation results show that the proposed solution is better in meeting the desired throughputs and delays as compared with best effort and strict priority approaches.","cites":"7","conferencePercentile":"60"},{"venue":"WMASH","id":"6d4320618e3b38ab5332ddf1760887013faecad7","venue_1":"WMASH","year":"2003","title":"Challenge: ubiquitous location-aware computing and the \"place lab\" initiative","authors":"Bill N. Schilit, Anthony LaMarca, Gaetano Borriello, William G. Griswold, David W. McDonald, Edward D. Lazowska, Anand Balachandran, Jason I. Hong, Vaughn Iverson","author_ids":"1711856, 7871341, 1735801, 6980007, 1742657, 1683210, 3095954, 1689960, 3103134","abstract":"To be widely adopted, location-aware computing must be as effortless, familiar and rewarding as web search tools like Google. We envisage the global scale Place Lab, consisting of an open software base and a community building activity as a way to bootstrap the broad adoption of location-aware computing. The initiative is a laboratory because it will also be a vehicle for research and instruction, especially in the formative stages. The authors draw on their experiences with campus and building-scale location systems to identify the technological and social barriers to a truly ubiquitous deployment. With a grasp of these \"barriers to adoption,\" we present a usage scenario, the problems in realizing this scenario, and how these problems will be addressed. We conclude with a sketch of the multi-organization cooperative being formed to move this effort forward.","cites":"99","conferencePercentile":"100"},{"venue":"WMASH","id":"00a36817bb1aa712d5d068db63b078a3171d1b1a","venue_1":"WMASH","year":"2004","title":"SOWER: self-organizing wireless network for messaging","authors":"Márk Félegyházi, Srdjan Capkun, Jean-Pierre Hubaux","author_ids":"2015769, 1791522, 1757221","abstract":"Short Message Service (SMS) has become extremely popular in many countries, and represents a ~multi-billion dollars market. Yet many consumers consider that the price charged by the cellular network operators is too high. In this paper, we explain that there exist alternatives to cellular networks for the provision of SMS. In particular, we present the Self-Organizing Wireless messaging nEtwoRk (SOWER), an all-wireless network operable in cities. In SOWER, each user installs a wireless, power-plugged device at home and communicates by means of a mobile device. Based on our experimental measurements of IEEE 802.11 equipped devices, we show the feasibility of the concept in various urban scenarios. We also show that city-wide connectivity can be achieved even with a limited market penetration. We explain that the capacity of such networks is sufficient to support messaging communication.","cites":"0","conferencePercentile":"10.71428571"},{"venue":"WMASH","id":"cc2de4e97b675081a18de27a54fc9f756cf766cc","venue_1":"WMASH","year":"2005","title":"Security analysis on public wireless internet service models","authors":"Kenji Ohira, Ying Huang, Yasuo Okabe, Kenji Fujikawa, Motonori Nakamura","author_ids":"2156509, 1743853, 1836560, 2979819, 3195697","abstract":"A new service model of public wireless Internet access, called autonomous distributed public wireless Internet access, is presented. In the service model any volunteer with broadband Internet access lines can provide his access points for public service without any fear of malicious use. A user of such service is assumed to have his own account on a authentication server at home in the Internet, and all the Internet access through any of those access points can be treated as if it is from the home. In this paper, we present how the autonomous distributed Internet access services can be securely provided with the combinations of two aspects: treatment of authentication transactions at access points and data path of communication transaction.","cites":"3","conferencePercentile":"61.11111111"},{"venue":"WMASH","id":"55260f6a8f394b0f75950242b0ea79917752b44c","venue_1":"WMASH","year":"2004","title":"Stateful publish-subscribe for mobile environments","authors":"Mihail F. Ionescu, Ivan Marsic","author_ids":"1779154, 1707841","abstract":"The Publish-Subscribe paradigm has become an important architectural style for designing distributed systems. In the recent years, we have been witnessing an increasing demand for supporting publish-subscribe for mobile systems in wireless environments. In this paper we present SUBLIM, a stateful model for publish-subscribe systems, which is suitable for mobile systems. In our system, the server maintains a state for each client, which contains variables that describe the properties of particular clients, such as the quality of the connection or the battery utilization. The interest of each subscriber can be expressed in terms of these variables. Based on the subscriber interests, an associated agent is created on the server. The agent filters the data that reach the subscriber based on the content of the message and the current subscriber state. Experimental results show good performance and scalability of our approach.","cites":"4","conferencePercentile":"35.71428571"},{"venue":"WMASH","id":"16002218daa61e4d0e555375806f3d938d09dba4","venue_1":"WMASH","year":"2005","title":"An approach to enhance inter-provider roaming through secret sharing and its application to WLANs","authors":"Ulrike Meyer, Jared Cordasco, Susanne Wetzel","author_ids":"1716985, 1718085, 1739446","abstract":"In this paper, we show how secret sharing can be used to address a number of shortcomings in state-of-the-art public-key-based inter-provider roaming. In particular, the new concept does not require costly operations for certificate validation by the mobile device. It furthermore eliminates the need for a secure channel between providers upon roaming. We demonstrate the new approach by introducing a new protocol, EAP-TLS-KS, for roaming between 802.11i-protected WLANs. In addition, we show that the properties of EAP-TLS-KS allow for an efficient integration of a micropayment scheme.","cites":"6","conferencePercentile":"83.33333333"},{"venue":"WMASH","id":"24a9d849527df6df25a8f6795df43c21b61fd7f8","venue_1":"WMASH","year":"2004","title":"A scalable framework for wireless network monitoring","authors":"Camden C. Ho, Krishna N. Ramachandran, Kevin C. Almeroth, Elizabeth M. Belding-Royer","author_ids":"2357290, 2853673, 3131174, 2377614","abstract":"The advent of small form-factor devices, falling hardware prices, and the promise of untethered communication is driving the prolific deployment of wireless networks. The monitoring of such networks is crucial for their robust operation. To this end, this paper presents VISUM, a scalable framework for wireless network monitoring. VISUM relies on a distributed set of agents within the network to monitor network devices and store the collected information at data repositories. VISUM's key features are its extensibility for new functionality, and its seamless support for new devices and agents in the monitoring framework. These features enable network operators to deploy, maintain, and upgrade VISUM with little effort. VISUM can also visualize collected data in the form of interactive network topology maps as well as real-time statistical graphs and reports. These visualizations provide an intuitive, up-to-date, and useful overview of a wireless network. We have implemented VISUM and used it to monitor a wireless network deployment at UC-Santa Barbara. In this paper, we describe the architecture of VISUM and report on the performance of the monitored network using information collected by VISUM.","cites":"19","conferencePercentile":"75"}]}