{"WMCSA_Supplement.csv":[{"venue":"WMCSA Supplement","id":"49e32674e2e7404adc8990dab2fda648561b7400","venue_1":"WMCSA Supplement","year":"2006","title":"Indoor Localization Using Camera Phones","authors":"Nishkam Ravi, Pravin Shankar, Andrew Frankel, Ahmed M. Elgammal, Liviu Iftode","author_ids":"3226186, 2846340, 5868930, 1707395, 2345961","abstract":"There has been a shift in the focus of indoor lo-calization research from improving accuracy to minimizing infrastructure requirements [4, 6, 1]. The reason is well understood: since location information only serves as a parameter to location-based services, the cost of deploying localization systems should be a minute fraction of the total cost of provisioning location-based services. We demonstrate the possibility of determining user's location indoors based on what the camera-phone \" sees \". The camera-phone is worn by the user as a pendant(Figure 1) and images are periodically captured and transmitted over GPRS to a web server. The web server has a database of images with their corresponding location. Upon receiving an image, the web server compares it with stored images, and based on the match, estimates user's location. We accomplish this with off-the-shelf image matching algorithms (namely Color Histograms [7], Wavelet Decomposition [2] and Shape Matching [3]) by tailoring them for our purpose. We use three methods for determining location: Naive, Heirarchical and History-based [5]. The advantage of our approach is that neither custom hardware, nor wireless access points are required. Physical objects do not have to be \" tagged \" and users do not have to carry any device apart from what they already do: a mobile phone. The only cost involved is that of building an image database. We constructed a partial image database for the third floor of the Rutgers Computer Science building with multiple images per \" corner \" to account for issues such as varying heights of the users, different angles of view, etc. Our experimental results indicate that room-level accuracy can be achieved with more than 90% success probability, and meter-level accuracy can be achieved with more than 80% success probability. The goal of this demo is to illustrate the basic functionality of the system in a limited setting. We will construct an image database for the demo-room on the spot, and demonstrate our system on this database using the Heirarchical approach. We will use a Nokia 6650 phone running a Java client that would capture images and display location, and a server that would host the image database and the location determination algorithms. We will briefly explain the underlying algorithms, the database construction methodology and the key challenges.rus: wireless acoustic location with room-level resolution using ultrasound. In MobiSys '05: Proceedings of the 3rd international conference on Mobile systems, applications, and services, …","cites":"39","conferencePercentile":"100"}]}