{"WMCSA.csv":[{"venue":"WMCSA","id":"50c1fb6e858785a151779e0e6cd0141148e0179f","venue_1":"WMCSA","year":"1994","title":"Supporting Adaptive Services in a Heterogeneous Mobile Environment","authors":"Nigel Davies, Gordon S. Blair, K. Cheuerst, Adrian Friday","author_ids":"1789887, 1700173, 3050534, 8133498","abstract":"Future computer environments will include mobile computers which will either be disconnected, weakly interconnected by low speed wireless networks such as GSM, or fully interconnected by high speed networks ranging from Ethernet to ATM. While the transition between networks is currently a heavyweight operation we believe that developments in network interface technology will soon enable mobile computers to dynamically select their network service based on cost and performance requirements. Such flexibility, coupled with the inherent unreliability of mobile communications, means that system services and applications will be subject to rapid and massive fluctuations in the quality-of-service provided by their underlying communications infrastructure. In this paper we discuss the design of a distributed systems platform to support the development of services which are able to tolerate this environment by dynamically adapting to changes in the available communications quality-of-service. Future computer environments will include mobile computers which will either be disconnected, weakly interconnected by low speed wireless networks such as GSM, or fully interconnected by high speed networks ranging from Ethernet to ATM ([1, 2]). Two key characteristics of such environments are:-(i) a heterogeneous processing environment (including relatively low-power mobile hosts) and, (ii) rapid and massive fluctuations in the quality of service (QoS) provided by the underlying communications infrastructure. The first of these issues, i.e. heterogeneity, can be addressed by exploiting emerging distributed systems standards such as the International Standards Organisation Reference Model for Open Distributed Processing (RM-ODP) [3], the Open Software Foundation's Distributed Computing Environment (OSF-DCE) [4] or the Object Management Group's Common Object Request Broker Architecture (OMG-CORBA) [5]. Such standards provide applications with uniform computational models for accessing services and enables them to operate over a variety of processor/operating system configurations. The second of these issues, QoS fluctuations, is, we believe, one of the most fundamental problems in the field of mobile computing. In this position paper we address this issue and propose extensions to emerging distributed systems standards to support mobile computing. These extensions are designed to allow the development of adaptive or reactive applications [2, 6] which are able to tailor their behaviour based on changes in their communications infrastructure. Section 2 of this paper presents a rational for developing adaptive services and highlights the role of QoS management in supporting such services. Section 3 then describes a distributed systems platform we have developed based on the ODP-like ANSAware system [7]. This platform provides QoS management facilities to …","cites":"39","conferencePercentile":"61.53846154"},{"venue":"WMCSA","id":"2afefc0ee083cd61bad5830f0618d4cee0842122","venue_1":"WMCSA","year":"2006","title":"Are GSM Phones THE Solution for Localization?","authors":"Alex Varshavsky, Mike Y. Chen, Eyal de Lara, Jon Froehlich, Dirk Hähnel, Jeffrey Hightower, Anthony LaMarca, Fred Potter, Timothy Sohn, Karen P. Tang, Ian E. Smith","author_ids":"2281469, 2335746, 1879216, 1752433, 1771066, 2528029, 7871341, 1812798, 1680921, 1778322, 3093905","abstract":"In this paper, we argue that localization solution based on cellular phone technology, specifically GSM phones, is a sufficient and attractive option in terms of coverage and accuracy for a wide range of indoor, outdoor, and place-based location-aware applications. We present preliminary results that indicate that GSM-based localization systems have the potential to detect the places that people visit in their everyday lives, and can achieve median localization accuracies of 5 and 75 meters for indoor and outdoor environments , respectively.","cites":"56","conferencePercentile":"80"},{"venue":"WMCSA","id":"82eb2d56836159f51c71487a123d523021b4797a","venue_1":"WMCSA","year":"2003","title":"Payment Support in Ubiquitous Computing Environments","authors":"Prasad Boddupalli, Fahd Albinali, Nigel Davies, Adrian Friday, Oliver Storz, Maomao Wu","author_ids":"2171457, 3072621, 1789887, 8133498, 2518780, 1767716","abstract":"Despite ten years of extensive research, Weiser's vision of ubiquitous computing is far from a widespread reality. While research into enabling technologies has progressed significantly, there has been a lack of research into the economic and commercial aspects of ubiquitous computing. In this paper, we investigate techniques that will enable investors in ubiquitous computing infrastructure and services to recoup their investment through charging for service use. In particular, we identify the key requirements for a ubiquitous computing payment system, discuss existing payment systems and present the Payment Session Protocol (PSP) that is designed to support payment-enabled ubiquitous computing environments.","cites":"9","conferencePercentile":"53.57142857"},{"venue":"WMCSA","id":"4521bc06d39ff1b7c21a97289ec3ca6af8e120e1","venue_1":"WMCSA","year":"1999","title":"TCP Performance in Wireless Multi-hop Networks","authors":"Mario Gerla, Ken Tang, Rajive L. Bagrodia","author_ids":"8467438, 2528116, 1722527","abstract":"In this study we investigate the interaction between TCP and MAC layer in a wireless multi-hop network. Using simulation, we provide new insight into two critical problems of TCP over wireless multi-hop. The first is the conflict between TCP data packets and TCP ACKs, which causes performance to degrade for window sizes greater than 1 packet. The second is the interaction between TCP and MAC layer backoff timers which causes severe unfairness and capture conditions. We show that these effects are particularly pronounced in two families of MAC protocols that have been extensively used in ad-hoc network simulation and implementations, namely CSMA and FAMA (a descendent of MACA). We then demonstrate that these problems are in part overcome by using MACAW, a MAC layer protocol which extends MACA by adding link level ACKs and a less aggressive backoff policy. We argue that link level protection, backoff policy and selective queue scheduling are critical elements for efficient and fair operation of ad-hoc networks under TCP. These conclusions are supported by extensive simulation and measurement experiments.","cites":"171","conferencePercentile":"70"},{"venue":"WMCSA","id":"160b2269547ad29db551aa5a038b091a1a48b570","venue_1":"WMCSA","year":"1994","title":"Mobility: A Medium for Computation, Communication, and Control","authors":"Arup Mukherjee, Daniel P. Siewiorek","author_ids":"2044018, 1742634","abstract":"The advent of ubiquitous mobile computing has widely been regarded as the convergence of pager-like communications technology and laptop-like computational power, enabling applications that span both realms of functional-ity. However, ubiquitous mobile computing, coupled with the proliferation of microprocessor-controlled appliances and networking, creates another important new application arena: that in which mobile computers act as controllers for, and interfaces to, appliances and services in the surrounding environment. This position paper explores the convergence of computation with communications and control applications, and the models of mobile computing that consequently arise. Established applications and models are positioned relative to this framework, and hitherto unexplored control-based models of mobile computation are described.","cites":"4","conferencePercentile":"13.46153846"},{"venue":"WMCSA","id":"81ea0414e6f34ab977614e79912fb32d6d20a652","venue_1":"WMCSA","year":"2002","title":"Context Authentication Using Constrained Channels","authors":"Tim Kindberg, Kan Zhang, Narendar Shankar","author_ids":"2718255, 1715449, 2877615","abstract":"This paper presents practical protocols for authenticating the parameters that characterise a principal's context. Context features in what are known as mobile, ubiquitous, pervasive and nomadic computing systems. Location, in particular, is a highly significant contextual parameter. We present a model of context authentication based on the characteristics of communication channels. Then we present protocols for location authentication that are based on physical channel characteristics, including a protocol that we have implemented over HTTP for use from any Web browser. We conclude with a summary and discussion of the work.","cites":"64","conferencePercentile":"50"},{"venue":"WMCSA","id":"bcfe63a301abed03b9432b9fbcd9b0ddf1273ef8","venue_1":"WMCSA","year":"2004","title":"Information Transfer Techniques for Mobile Devices by \"Toss\" and \"Swing\" Actions","authors":"Koji Yatani, Koiti Tamura, Masanori Sugimoto, Hiromichi Hashizume","author_ids":"3260704, 2636798, 1679714, 2972584","abstract":"In recent years, mobile devices have rapidly penetrated into our daily lives. Several drawbacks of mobile devices have been mentioned so far, such as their limited computational capability, small screen real estate, and, so on, as compared with notebook or desktop computers. However, by fully utilizing the most notable feature of mobile devices, that is, mobility, we can explore possibilities for a new user interface of the devices. In this paper, we use and propose intuitive information transfer techniques for them, which could not be achieved with notebook or desktop computers. By using the system called Toss-It, a user can send information from the user's PDA to other electronic devices with a \" toss \" or \" swing \" action, as the user would toss a ball or deals cards to others. We have developed a circuit board designed to be attached to a PDA and algorithms for recognizing \" toss \" and \" swing \" actions. Preliminary user studies of Toss-It indicated that it could correctly identify receivers of information by \" toss \" or \" swing \" actions. Our research project is in progress, and this paper describes the current status of the project by focusing on issues related to HCI (Human Computer Interaction). We will discuss about several critical issues to be investigated in our studies.","cites":"8","conferencePercentile":"47.36842105"},{"venue":"WMCSA","id":"9e02e3d08da9e8243244b2a982dde861e9a80474","venue_1":"WMCSA","year":"2002","title":"User Interfaces for Network Services: What, from Where, and How","authors":"Shankar Ponnekanti, Luis Alberto Robles, Armando Fox","author_ids":"3076687, 8063703, 1736156","abstract":"An important problem in the context of network services in ubiquitous computing is the support of ad-hoc interaction. Ad-hoc interaction allows a user entering an environment to discover, request, and interact with user interfaces for the locally available network services, even if she has done minimal or no installation in advance. We observe that most recently-proposed ad-hoc interaction frameworks lack two important mechanisms: distribution and person-alization. A distribution mechanism would make it easy to add third-party UI's and to centrally administer UI's across multiple independent workspaces forming an administrative or logical unit, such as all workspaces on a campus. A per-sonalization mechanism would enable a user to see familiar UI's as she roams to different workspaces. We propose extensions to an existing ad-hoc interaction system, ICrafter, that enable these two independent behaviors. The mechanisms raise important policy questions; although we have not studied optimal policies, we outline the policy space and the policies we have adopted.","cites":"8","conferencePercentile":"12.5"},{"venue":"WMCSA","id":"12e44dda468477124d65ed42f791528c0e3c9441","venue_1":"WMCSA","year":"2000","title":"The Roma personal metadata service","authors":"Edward Swierk, Emre Kiciman, Vince Laviano, Mary Baker","author_ids":"2364953, 1754874, 2537816, 6173215","abstract":"People now have available to them a diversity of digital storage facilities, including laptops, cell phone address books, handheld devices, desktop computers and web-based storage services. Unfortunately, as the number of personal data repositories increases , so does the management problem of ensuring that the most up-to-date version of any document in a user's personal file space is available to him on the storage facility he is currently using. We introduce the Roma personal metadata service to make it easier to locate current versions of personal files and ensure their availability across different repositories. This centralized service stores information about each of a user's files, such as name, location, timestamp and keywords, on behalf of mobility-aware applications. Separating out these metadata from the data respositories makes it practical to keep the metadata store on a highly available, portable device. In this paper we describe the design requirements, architecture and current prototype implementation of Roma.","cites":"33","conferencePercentile":"60"},{"venue":"WMCSA","id":"55d3ca632cb1a48711e509e8c06a58fe2001b3c3","venue_1":"WMCSA","year":"1994","title":"On Travelling Incognito","authors":"Amir Herzberg, Hugo Krawczyk, Gene Tsudik","author_ids":"1748437, 7972269, 1702391","abstract":"User mobility is rapidly becoming an important and popular feature in today's networks. This is especially evident in wireless/cellular environments. While useful and desirable, user mobility raises a number of important security-related issues and concerns. One of them is the issue of tracking mobile user's movements and current whereabouts. Ideally, no entity other than the user himself and a responsible authority in the user's home domain should know either the real identity or the current location of the mobile user. At present, environments supporting user mobility either do not address the problem at all or base their solutions on the speciic hardware capabilities of the user's personal device, e.g., a cellular telephone. This paper discusses a wide range of issues related to anonymity in mobile environments, reviews current state-of-the-art approaches and proposes several potential solutions. Solutions vary in complexity, degree of protection and assumptions about the underlying environment .","cites":"13","conferencePercentile":"38.46153846"},{"venue":"WMCSA","id":"23ddb0af52c56bbb8c757fefa7b9e95a5499fb6d","venue_1":"WMCSA","year":"2002","title":"The Event Heap: A Coordination Infrastructure for Interactive Workspaces","authors":"Brad Johanson, Armando Fox","author_ids":"1698349, 1736156","abstract":"Coordinating the interactions of applications running on the diversity of both mobile and embedded devices that will be common in ubiquitous computing environments is still a difficult and not completely solved problem. We look at one such environment, an interactive workspace, where groups come together to collaborate on solving problems. Such a space will contain a heterogeneous collection of both new and legacy applications and devices. We propose the Event Heap, a coordination model most similar to tuplespaces, as being appropriate for such environments. We also present a prototype implementation of the Event Heap, and show that the system has performed well in actual use over the last two years in our prototype interactive workspace, the iRoom.","cites":"128","conferencePercentile":"75"},{"venue":"WMCSA","id":"e095cdcf42f084e78ac3b3bd8b26b3b1eaeeffe1","venue_1":"WMCSA","year":"2006","title":"Mobile Phones Will Become The Primary Personal Computing Devices","authors":"John J. Barton, Shumin Zhai, Steve B. Cousins","author_ids":"3127043, 1748079, 1705038","abstract":"A merger of the lowly USB memory stick and the mobile telephone provide a new platform for information solutions. Microscopic portable memory with capacity similar to today's PC disk drives will spark a transformation which will then be driven by new use models for mobile phones and a new class of \" computer user \" , one that has no \" personal computer \" at all. Since more people carry phones than laptops the PC will fade into a role similar to today's view of the once mighty mainframe. Laptop-loving dinosaurs at the workshop will protest that phones will never replace their favorite machines, in much same way the mainframe developers scoffed at PCs throughout the 1980s. We still have mainframe developers, but the PC created new categories of computer use. We need to understand what new uses will emerge with the computer-phone. 1. Mobile computing but not \" Personal Computing \" Imagine a mobile device with the shape of a modern cellular phone containing all of the functions we expect in such a phone plus wireless Internet radio connection and a digital storage of one terabyte. Since it looks like a phone, we call it a phone. Such a phone would have all the capabilities of a typical PC laptop except for two major shortcomings: the display and the keyboard are tiny. (We will use \" keyboard \" as shorthand for input devices including pointing devices). Indeed if such a device were connected to a keyboard and screen, the entire user experience of a PC could be reproduced in principle. On the other hand, such a phone would be much easier to carry than a laptop, it would be easier to store, and it would be much more convenient to use for audio/video services like music, telephony and simple video. There in lies the fundamental challenges-human control and visual output – and the opportunities-extreme portability and simplified audio/video uses. If we can engineer solutions to the challenges we can unleash the potential. Let us further imagine a world where work and entertainment spaces routinely contain full sized displays and keyboards. If we had the technology to bind the phone to these devices, then we would have the capability of a PC at work and home, but the portability of a phone in between or when traveling. This binding has been termed \" opportunistic annexing \" by Pierce and Mahaney …","cites":"10","conferencePercentile":"70"},{"venue":"WMCSA","id":"656a01cce3e7d0992dfab70229cfbb9e401e4e27","venue_1":"WMCSA","year":"2006","title":"Connection Time for Strange Devices","authors":"John J. Barton, Fopefolu O. Folowosele, Stina Nylander, Mave Houston, Shumin Zhai","author_ids":"3127043, 2368258, 1770842, 1845124, 1748079","abstract":"Connecting small, mobile computers to other computers, especially when these connections are not preconfigured, is a critical element in the user experience of multi-device applications. We empirically studied the user performance and experience of such connections using WiFi phones with Session Initiation Protocol (SIP), Universal Serial Bus (USB), Bluetooth radio, and wired connections in a docking cradle. Results show that the gain of easier information access by connecting phones to larger displays and keyboards could outweigh the cost of making the connection for text entry with as few as a dozen characters.","cites":"2","conferencePercentile":"40"},{"venue":"WMCSA","id":"cedf1f11d6f24d21c9e517f0520af478c60b222e","venue_1":"WMCSA","year":"2002","title":"Extensible Adaptation via Constraint Solving","authors":"Yuri Dotsenko, Eyal de Lara, Dan S. Wallach, Willy Zwaenepoel","author_ids":"2191359, 1879216, 1798983, 1711100","abstract":"Applications running on a mobile and wireless devices must be able to adapt gracefully to limited and fluctuating network resources. The variety of applications, platforms upon which they run, and desires of their users, require a variety of adaptation policies to be implemented and maintained. Therefore, it becomes important for adaptation policies to be easy to develop, to debug, and to compose together to form complex policies that satisfy the needs of mobile users. This paper presents the design, implementation, and evaluation of a simple programming language for expressing scheduling policies for transmission of multiple objects across a shared network connection. A key design component of our language is the ability to express constraints among the objects to be transmitted. A policy can make ordering constraints such as \" all text objects are transmitted before any image objects \" or a policy might express rules on the the relative bandwidth allocations across objects of different types. Because it is possible to express contradictory constraints, our system finds suitable approximate solutions when no precise solution is available.","cites":"8","conferencePercentile":"12.5"},{"venue":"WMCSA","id":"bb680b5ea56b2efdaecf96688b82635a69df57bd","venue_1":"WMCSA","year":"2003","title":"River: An Infrastructure for Context Dependent, Reactive Communication Primitives","authors":"Jong Hee Kang, Matthai Philipose, Gaetano Borriello","author_ids":"2758138, 3041721, 1735801","abstract":"Applications and services in ubiquitous computing systems often interact in a context-dependent, reactive manner. How information flows, and what services communicate when, is determined by the context of the physical space, the context of users, and the services that are available. Existing discovery systems provide basic facilities for finding services based on their static descriptions in the form of attributes. Context-dependent attributes are not included in the service advertisements as they may in turn be computed and stored in other services. We propose an infrastructure, called River, that provides various context-dependent, reactive communication primitives. These primitives are implemented using a single underlying technique called Relational Query Based Dispatching (RQD), which views the set of services in the system as a federation of databases, the discovery service as a distributed query processor for these databases, and communication as a combination of query processing and dispatching. In this paper, we describe the design and implementation of the River infrastructure. We also show that the context-dependent query processing within the discovery service can actually reduce the lookup latency with little effect on overall throughput.","cites":"4","conferencePercentile":"21.42857143"},{"venue":"WMCSA","id":"878b3b1bc0a74274c971b47f822e34a2b0275065","venue_1":"WMCSA","year":"2004","title":"Using Stigmergy to Co-Ordinate Pervasive Computing Environments","authors":"Peter Barron, Vinny Cahill","author_ids":"2095531, 1687186","abstract":"Pervasive computing environments have proven difficult to develop in a form that supports the integration and organisation of devices and applications in a spontaneous and transparent manner. This is partly due to the highly dynamic and unpredictable nature of these types of environments , and is often further hampered by the limited resources found on devices. In this paper we present a highly decentralized method of organising the components of a pervasive computing environment, supporting spontaneous interaction between entities and providing robust-system wide behavior. Our inspiration for this work stems from nature and the observations made by the French biologist Grassé on how social insects coordinate their actions using indirect communication via the environment, a phenomenon that has become known as stigmergy. In the stigmergic approach there are fewer dependences between entities allowing for the incremental construction and improvement of solutions without adversely effecting the rest of the pervasive computing environment. The approach is encapsulated in Cocoa, a framework that supports the use of stigmergy to build self-organising environments that promotes the autonomy of entities. Experiences in using Cocoa have shown that entities can be integrated into a pervasive environment in a spontaneous manner and that coordinated behavior can emerge.","cites":"10","conferencePercentile":"55.26315789"},{"venue":"WMCSA","id":"0b7c3ad049492e9337f376ec46aea040598afad6","venue_1":"WMCSA","year":"1999","title":"Ad-hoc On-Demand Distance Vector Routing","authors":"Charles E. Perkins, Elizabeth M. Belding-Royer","author_ids":"1727296, 2377614","abstract":"An ad-hoc network is the cooperative engagement of a c ollection of mobile nodes without the required intervention of any centralized a c cess point or existing infrastructure. In this paper we present Ad-hoc O n D e-mand Distance V ector Routing AODV, a novel algorithm for the operation of such ad-hoc networks. Each Mobile Host operates as a specialized r outer, and routes are obtained a s n e eded i.e., on-demand with little or no reliance o n p eriodic advertisements. Our new routing algorithm is quite suitable for a dynamic self-starting network, as required by users wishing to utilize ad-hoc networks. AODV p r ovides loop-free r outes even while repairing broken links. Because the protocol does not require global periodic routing advertisements, the demand on the overall bandwidth available to the mobile nodes is substantially less than in those protocols that do necessitate such advertisements. Nevertheless we can still maintain most of the advantages of basic distance-vector routing mechanisms. We show that our algorithm scales to large populations of mobile nodes wishing to form ad-hoc networks. We also include an evaluation methodology and simulation results to verify the operation of our algorithm.","cites":"162","conferencePercentile":"60"},{"venue":"WMCSA","id":"dcbb0aa5e33e825775de958847907c3f57e6c1e2","venue_1":"WMCSA","year":"2004","title":"Ubiquitous Computing Using Wireless Broadcast","authors":"Jong Hee Kang, Gaetano Borriello","author_ids":"2758138, 1735801","abstract":"Ubiquitous computing applications collect information from a variety of sources so as to provide behavior that is tailored to the user's context. Typically, client devices connect through appropriate middleware and wireless infrastructure to a variety of services and data sources and, increasingly, local sensor data. In this paper, we present a different approach to constructing ubiquitous computing applications that relies on wireless broadcasting of information by the infrastructure. Clients silently listen to these broadcasts and harvest the data they need. We believe this complementary approach exhibits promising properties for scalability and privacy. All clients receive the same data and use what they need solely by listening and without compromising their presence. We have constructed a broadcast infrastructure in our office building and, together with colleagues, have developed three applications that demonstrate the promise of the approach.","cites":"6","conferencePercentile":"34.21052632"},{"venue":"WMCSA","id":"c66168434aa4b07c65eae4c894e432965bdcb440","venue_1":"WMCSA","year":"2003","title":"Rapid Prototyping of Mobile Input Devices Using Wireless Sensor Nodes","authors":"James Carlson, Richard Han, Shandong Lao, Chaitanya Narayan, Sagar Sanghani","author_ids":"7819172, 1719013, 2679053, 2430283, 3268653","abstract":"Many options exist for prototyping software-based human-computer interfaces, but there are few comparable technologies that allows application developers to create ad-hoc hardware interfaces with corresponding ease and flexibility. In this paper, we present a system for rapidly constructing low cost prototypes of mobile input devices by leveraging wireless sensor nodes. We demonstrate two proof-of-concept applications–a conduc-tor's baton and a scene navigation controller–that are prototyped using wireless sensor networks. These applications illustrate that wireless sensor technology can be used to quickly and inexpensively prototype diverse physical user interfaces. We believe that this technology will be of value in many areas, including the study of er-gonomics, haptic interfaces, collaborative design, low-cost VR systems, and usability research.","cites":"8","conferencePercentile":"39.28571429"},{"venue":"WMCSA","id":"5fe01682a00acf5193c31f7a8557a1b2190ea272","venue_1":"WMCSA","year":"2003","title":"Footloose: A Case for Physical Eventual Consistency and Selective Conflict Resolution","authors":"Justin Mazzola Paluska, David Saff, Tom Yeh, Kathryn Chen","author_ids":"1737421, 3348953, 1704158, 1719464","abstract":"Users are increasingly inundated with small devices with communication and storage capabilities. Unfortunately, the user is still responsible for reconciling all of the devices whenever a change is made. We present Footloose, a user-centered data store that can share data and reconcile conflicts across diverse devices. Footloose is an optimistic system based on physical eventual consistency—consistency based on the movement of devices—and selective conflict resolution—which allows conflicts to flow through devices that cannot resolve the conflict to devices the can. Using these techniques, Footloose can present consistent views of data on the devices closest to the user without user interaction .","cites":"28","conferencePercentile":"71.42857143"},{"venue":"WMCSA","id":"3b83c555288c7cd82495a66b882af99146d5492f","venue_1":"WMCSA","year":"2002","title":"Supporting Aggregate Queries Over Ad-Hoc Wireless Sensor Networks","authors":"Samuel Madden, Robert Szewczyk, Michael J. Franklin, David E. Culler","author_ids":"3107990, 1735911, 1982103, 1706858","abstract":"We show how the database community's notion of a generic query interface for data aggregation can be applied to ad-hoc networks of sensor devices. As has been noted in the sensor network literature, aggregation is important as a data-reduction tool; networking approaches, however, have focused on application specific solutions, whereas our in-network aggregation approach is driven by a general purpose , SQL-style interface that can execute queries over any type of sensor data while providing opportunities for significant optimization. We present a variety of techniques to improve the reliability and performance of our solution. We also show how grouped aggregates can be efficiently computed and offer a comparison to related systems and database projects.","cites":"250","conferencePercentile":"91.66666667"},{"venue":"WMCSA","id":"6a35a65c1e6a1ad55ac03383247317b17d4082c9","venue_1":"WMCSA","year":"2006","title":"Bustle: Using Hitchhiking to Monitor Meaningful Locations","authors":"Karen P. Tang, James Fogarty, Pedram Keyani, Jason I. Hong","author_ids":"1778322, 1738171, 3201269, 1689960","abstract":"Hitchhiking is a client-focused, software-based approach to anonymous and privacy-sensitive collection of sensed data in location-based applications. In this paper, we demonstrate hitchhiking by implementing a WiFi-based location-centric service called Bustle. Using only software sensors, Bustle models the busyness of coffee shops while incorporating hitchhiking principles to protect the anonymity and privacy of the application users.","cites":"0","conferencePercentile":"15"},{"venue":"WMCSA","id":"933def96c48258aab7b64978a6a6d576ab9140f1","venue_1":"WMCSA","year":"1994","title":"W4 - The Wireless World Wide Web","authors":"Joel F. Bartlett","author_ids":"1871951","abstract":"4. Choosing wireless communications In order to separate promises from practice in PDAs From the beginning, we were not interested in wire-and wireless communications, we decided to try to build a less local area communications. We wanted the focus to wireless PDA-based client to access the World Wide Web. be on the PDA and not on the installation and manage-This paper describes our design choices and experience ment of the network. If we got something built, we with W4, the Wireless World Wide Web. wanted to take it on the road. Much of the \"look and feel\" of mobile computing is lost if you can't bring the demo to","cites":"25","conferencePercentile":"53.84615385"},{"venue":"WMCSA","id":"11184876816647e4cd1501c5069671c867a18ef8","venue_1":"WMCSA","year":"1994","title":"Context-Aware Computing Applications","authors":"Bill N. Schilit, Norman Adams, Roy Want","author_ids":"1711856, 1961902, 1802351","abstract":"This paper describes software that examines and reacts to an individual's changing context. Such software can promote and mediate people's interactions with devices, computers, and other people, and it can help navigate unfamiliar places. We believe that a limited amount of information covering a person's proximate environment is most important for this form of computing since the interesting part of the world around us is what we can see, hear, and touch. In this paper we define context-aware computing, and describe four categories of context-aware applications: proximate selection, automatic contextual reconfiguration, contextual information and commands, and context-triggered actions. Instances of these application types have been prototyped on the PARCTAB, a wireless, palm-sized computer.","cites":"1275","conferencePercentile":"100"},{"venue":"WMCSA","id":"41cfc6bfd3cf169358ef4ffe3b245c0be415f150","venue_1":"WMCSA","year":"1994","title":"Anonymity in a Mobile Computing Environment","authors":"N. Asokan","author_ids":"1735412","abstract":"In a mobile computing environment, it is desirable to protect information about the movements and activities of mobile entities from onlookers. Solutions to this problem of providing anonymity have to be developed with the constraints of mobile computing environments in mind. In this paper, it is argued that this issue merits investigation. A brief survey of the nature of anonymity provided in proposed or existing mobile computing environments is presented. It is argued further that achieving limited but practical anonymity using standard cryptographic techniques is feasible. Example solutions are presented.","cites":"24","conferencePercentile":"50"},{"venue":"WMCSA","id":"1a11cf22babdf1fe6f410819c896392eddf8661f","venue_1":"WMCSA","year":"2006","title":"LLAMA: An Adaptive Strategy for Performing Background Tasks on Mobile Devices","authors":"Denitsa Tilkidjieva, Nilanjan Banerjee, Maria A. Kazandjieva, Sami Rollins, Mark D. Corner","author_ids":"3188548, 1698909, 1722751, 1774595, 2664272","abstract":"1. Overview Most computing applications are user-driven; a user must explicitly instruct a device to perform a particular task. To reduce latency and intrusiveness, some applications will act on a user's behalf even when the user is not actively using the device. For example, e-mail clients often periodically check for new mail and virus scanners can be scheduled to run during idle periods. This model is okay for devices that are always connected to a network and power supply, but it is not suitable for mobile devices that meet neither property. When they are not actively used, mobile devices often go into a power-saving state. To perform periodic tasks on behalf of the user, applications would have to wake the device which would require large amounts of energy. The goal of this work is to enable mobile devices to perform background tasks on behalf of the user by adaptively determining the amount of energy devices can spare. We consider the amount of energy remaining on the device when it begins to recharge, estimate the amount of energy that can be spent, and devote it to background tasks. This work presents Longer-Lifetime Algorithms for Mobile Applications (LLAMA), a middleware layer for mobile devices. LLAMA determines when a device should run background tasks based on previous battery usage and availability. At that time, it wakes the device from a power-saving state if necessary, allows applications to perform their tasks, and returns the device to the previous power state. To test our adaptive strategy, we run a simulated experiment, using real battery traces collected from 13 devices over a two-month period (February 16 – April 15, 2006). We vary the confidence with which we can assure that we will not use more than the device's available energy and measure the total number of background tasks performed as a percentage of the ideal number of background tasks that would be performed if we used a periodic algorithm (i.e. if we wake the device every five minutes).","cites":"1","conferencePercentile":"30"},{"venue":"WMCSA","id":"b7c7737b19b048cf826fc4eacbd00f26c69eef3f","venue_1":"WMCSA","year":"2004","title":"Community-Driven Adaptation: Automatic Content Adaptation in Pervasive Environments","authors":"Iqbal Mohomed, Alvin Chin, Jim Chengming Cai, Eyal de Lara","author_ids":"1703622, 2357140, 2136661, 1879216","abstract":"Mobile devices are increasingly being used to access Web content but lack the resources for proper presentation to the user. To address this problem, content is typically adapted to be more suitable for a mobile environment. Community-Driven Adaptation (CDA) is a novel approach to automatic content adaptation for mobile devices that adapts content based on feedback from users. CDA groups users into communities based on common characteristics, and assumes that users of the same community have similar adaptation requirements. CDA learns how to adapt content by observing how members of a community alter adapted content to make it more useful to them. Experiments that consider the idealized case, where all users perform the same task, show that CDA can reduce wastage of network bandwidth by up to 90% and requires less user interaction to correct bad adaptation decisions compared with existing approaches to automatic content adaptation.","cites":"12","conferencePercentile":"63.15789474"},{"venue":"WMCSA","id":"ae087cd40ab18fa41fd2cda13e944b4ac5b23e8d","venue_1":"WMCSA","year":"2003","title":"Real-world Implementation of the Location Stack: The Universal Location Framework","authors":"David Graumann, Jeffrey Hightower, Walter Lara, Gaetano Borriello","author_ids":"2491282, 2528029, 2194016, 1735801","abstract":"Both the research community and developers in industry have identified the need for a clearly defined vocabulary and programming framework for location technologies. A layered Location Stack that provides appropriate abstractions, common terminology, and a clear API has been proposed in the last edition of WMCSA. This paper relates the experience gained in applying the Location Stack abstractions to the design and implementation of a location system using three separate location technologies integrated in a wireless computer. A single application interface, termed the Universal Location Framework, is designed to aggregate indoor, outdoor, and proximity sensor technologies. Our focus is on how well partitioning and parameter passing between the layers worked for our purposes as well as identifying system requirements not currently part of the stack. In closing, we provide evidence in support of the Location Stack's usefulness and we make some recommendations for its potential evolution.","cites":"32","conferencePercentile":"85.71428571"},{"venue":"WMCSA","id":"bd6a072f0f4d3f782c0aaf7ee26886fe0304b9dd","venue_1":"WMCSA","year":"2006","title":"Opportunistic File-Associations for Mobile Operating Systems","authors":"Umar Saif","author_ids":"2868135","abstract":"This paper presents the design and implementation of Opportunistic file-associations, designed to decouple the storage and handling of user files in a mobile device. A file with an Opportunistic file-association is not limited to a local application environment on a mobile device. Rather, the runtime environment supporting Opportunistic file associations causes a user file to be opened at the most appropriate device in the environment of the user.","cites":"0","conferencePercentile":"15"},{"venue":"WMCSA","id":"8da30bca8404dd9c717a10338cc42a2292dafc80","venue_1":"WMCSA","year":"2004","title":"User Mobility for Opportunistic Ad-Hoc Networking","authors":"Jing Su, Alvin Chin, Anna Popivanova, Ashvin Goel, Eyal de Lara","author_ids":"2079986, 2357140, 1964581, 2203731, 1879216","abstract":"As mobile devices become increasingly pervasive and commonly equipped with short-range radio capabilities, we observe that it might be possible to build a network based only on pair-wise contact of users. By using user mobility as a network transport mechanism, devices can intelligently route latency-insensitive packets using power-efficient short-range radio. Such a network could provide communication capability where no network infrastructure exists, or extend the reach of established infrastructure. To collect user mobility data, we ran two user studies by giving instrumented PDA devices to groups of students to carry for several weeks. We evaluate our work by providing empirical data that suggests that it is possible to make intelligent routing decisions based on only pair-wise contact, without previous knowledge of the mobility model or location information.","cites":"79","conferencePercentile":"94.73684211"},{"venue":"WMCSA","id":"b93a9dd96fc8a975a9834892caf79675933950eb","venue_1":"WMCSA","year":"2003","title":"The MeetingMachine: Interactive Workspace Support for Nomadic Users","authors":"John J. Barton, Tony Hsieh, Brad Johanson, Vikram Vijayaraghavan, Armando Fox, Tomoto Shimizu","author_ids":"3127043, 2321022, 1698349, 2862069, 1736156, 2622903","abstract":"Ubiquitous computing embraces both nomadic computing and infrastructure-rich interactive workspaces. Although most effort in these areas to date has focused narrowly on one domain, there are interesting challenges at their intersection. To start a discussion on how some of the benefits of interactive workspaces can be provided to nomadic users, we present MeetingMachine, a digital media projector that incorporates both interactive workspace and nomadic computing technologies in an appliance form factor. As a research effort, the MeetingMachine attempts to bridge the gap between space-embedded and mobile computing models of ubiquitous computing, specifically focusing on the task of sharing information brought into and created during meetings. As a prototype artifact, the design of the MeetingMachine seeks to place ubiquitous computing technology into an appliance, whose role would be similar to that of a digital projector or conference room telephone.","cites":"5","conferencePercentile":"28.57142857"},{"venue":"WMCSA","id":"5ddbf8b4004f12c14597642450db4c50accd6147","venue_1":"WMCSA","year":"2000","title":"Adding some smartness to devices and everyday things","authors":"Hans-Werner Gellersen, Albrecht Schmidt, Michael Beigl","author_ids":"4919595, 1678329, 1692616","abstract":"In mobile computing, context-awareness indicates the ability of a system to obtain and use information on aspects of the system environment. To implement context-awareness, mobile system components have to be augmented with the ability to capture aspects of their environment. Recent work has mostly considered location-awareness, and hence augmentation of mobile artifacts with locality. In this paper we discuss augmentation of mobile artifacts with diverse sets of sensors and perception techniques for awareness of context beyond location. We report experience from two projects, one on augmentation of mobile phones with awareness technologies, and the other on embedding of awareness technology in everyday non-digital artifacts.","cites":"36","conferencePercentile":"70"},{"venue":"WMCSA","id":"f1c19cc605daeea932454b66e5b05fe7dfadc49d","venue_1":"WMCSA","year":"2004","title":"Towards Distributed Awareness -- An Artifact Based Approach","authors":"Florian Michahelles, Albrecht Schmidt, Bernt Schiele, Michael Beigl","author_ids":"1779122, 1678329, 1697100, 1692616","abstract":"Perception is a central issue for many applications in ubiquitous computing. However, in current implementations , sensing and distributed perception is re-invented over and over again. Identifying commonalities and synthesizing a common model would be more effective both from an economic as well as scientific perspective. We have analyzed the properties of ubicomp perception systems and used their characteristics as a main input for the design of a perception model. We present a layered perception model, discriminating functionality on artifact, setting, and application level. On the artifact layer, data collection, perception, and recognition for the particular artifact is modelled and implemented. The setting layer deals with perception and recognition tasks for a tightly coupled group of artifacts. In the application layer, perception and application-specific recognition resides. The approach was evaluated by building applications, two of which are also reported in the paper. The wider applicability of the model was assessed by analyzing further applications and how they map onto the artifact-based approach.","cites":"4","conferencePercentile":"26.31578947"},{"venue":"WMCSA","id":"6f5a3d2ab72ed79afd73f7713bfa046466d18981","venue_1":"WMCSA","year":"2004","title":"6th IEEE Workshop on Mobile Computing Systems and Applications (WMCSA 2004), 2-10 December 2004, Lake District National Park, UK","authors":"Adrian Friday, Mary Baker, Sachin Goyal, Fahd Al, Bin Ali","author_ids":"8133498, 6173215, 6530848, , ","abstract":"The WMCSA series of workshops was started in 1994 to explore a new and extremely active emerging area of research centered on the advent of truly portable devices and wireless telecommunications. Explicitly seeking to create an open and interactive atmosphere, the workshop attendance was capped at 70; all attendees had to submit either a long or a short paper to ensure that all participants were active in the field, and the program provided frequent opportunities for interaction, including panel sessions and breakout groups along with more formal paper presentations. Ten years later, the field now mature and having spawned a whole series of high-quality conferences and workshops, we witnessed a still thriving research community , although arguably now working on different, more wide-ranging problems. The workshop, now in its sixth generation, still retains many of the core attributes that galvanized a community a decade ago: small numbers, rigorous peer review ensuring that we accept the best-quality work, and plenty of breaks to allow people to engage naturally with one another. It was with this legacy in mind that we set out to open the workshop in a reflective mood—what impact had we, as a community, had over the last decade? Rather than a traditional keynote address, we began the workshop as we hoped it would continue, in discussion. Despite months of careful planning, we decided the evening before that the opening panel was likely to be too didactic and instill too much of a presentation culture for the remainder of the workshop. The opening panel was replaced with a group discussion involving the entire plenary. Each delegate was asked to join a small group of four to five nearby participants and to reflect on the following questions: 1. What impact have we had? Has any of the work we've done been adopted and found useful (successes)? 2. What hasn't been picked up, what wasn't useful? And what stopped its adoption? 3. Are there lessons we can learn from this? And where should we go over the next 10 years? What ensued was a lively and interactive session, which informal feedback suggests was both one of the most enjoyable aspects of the workshop and an excellent ice breaker. The sessions certainly enabled all to participate, from first-time WMCSA attendees to battle-hardened veterans of WMCSA. The feedback from the groups was extremely varied, encompassing the full spectrum from (subject to artistic license) …","cites":"0","conferencePercentile":"5.263157895"},{"venue":"WMCSA","id":"f95a4642ee05a3aa319780740bc0bc8483330766","venue_1":"WMCSA","year":"2006","title":"Measurements of In-Motion 802.11 Networking","authors":"Richard Gass, James Scott, Christophe Diot","author_ids":"3303869, 5675901, 1737360","abstract":"Wireless networking can support in-motion users by providing occasional opportunities to transmit and receive data. We measure the performance of UDP and TCP transfers between a car traveling at speeds from 5 mph to 75 mph and an 802.11b access point. We analyze the impact of bandwidth and delay limitations in the backhaul network on the feasibility of in-motion transfer with typical Internet applications. We observe that in interference-free environments , a significant amount of data can be transferred using off-the-shelf equipment. We find that performance suffers mostly from network or application related problems instead of wireless link issues, i.e., protocols with handshakes , bandwidth limitations, and long round-trip times.","cites":"80","conferencePercentile":"100"},{"venue":"WMCSA","id":"83be879b3388d29ddf5325843278e6b0b9dedac7","venue_1":"WMCSA","year":"2003","title":"Pervasive Information Acquisition for Mobile AR-Navigation Systems","authors":"Wolfgang Narzt, Gustav Pomberger, Alois Ferscha, Dieter Kolb, Reiner Müller, Jan Wieghardt, Horst Hörtner, Christopher Lindinger","author_ids":"1708732, 1714202, 1745790, 2666181, 2846940, 2578107, 1722934, 1683814","abstract":"Today car-navigation systems are increasingly penetrating the automotive market. However, the need for location-based information systems is no longer limited to cars. Mobile outdoor navigation systems for pedestrians and electronic tourist guides are already available on PDAs. In addition, new indoor positioning technologies extend the area of application for location-based systems. Unfortunately, current navigation systems are burdened by the fact that they are bound to a specific tracking technology (e.g., a car navigation system works exclusively with GPS) and therefore cannot be employed in areas with alternative tracking equipment. Furthermore, the information is provided through an abstract metaphor that the user has to understand and translate into action. This paper presents a new augmented-reality-based paradigm and a framework for mobile navigation systems 1 that pervasively extracts position and orientation information from any sensory source and enhances the association to the real world by combining video techniques and 3D-graphics in an augmented reality view.","cites":"21","conferencePercentile":"64.28571429"},{"venue":"WMCSA","id":"520ab6cfe2148beeff6aa7deea0a77d815874e82","venue_1":"WMCSA","year":"2002","title":"The Location Stack: A Layered Model for Location in Ubiquitous Computing","authors":"Jeffrey Hightower, Barry Brumitt, Gaetano Borriello","author_ids":"2528029, 2050563, 1735801","abstract":"Based on five design principles extracted from a survey of location systems, we present the Location Stack, a lay-ered software engineering model for location in ubiquitous computing. Our model is similar in spirit to the seven-layer Open System Interconnect (OSI) model for computer networks. We map two existing ubiquitous computing systems to the model to illustrate the leverage the Location Stack provides. By encouraging system designers to think of their applications in this way, we hope to drive location-based computing toward a common vocabulary and standard infrastructure , permitting members of the ubiquitous computing community to easily evaluate and build on each other's work.","cites":"115","conferencePercentile":"66.66666667"},{"venue":"WMCSA","id":"eae99a46c35d23f42055a50bd70bd95e31bb3756","venue_1":"WMCSA","year":"2002","title":"Hot-Spot Congestion Relief in Public-Area Wireless Network","authors":"Anand Balachandran, Paramvir Bahl, Geoffrey M. Voelker","author_ids":"3095954, 2897351, 1739245","abstract":"Wireless LAN administrators are often called upon to deal with the problem of sporadic user congestion at certain popular spaces (\" hot-spots \") within the network. To address this problem, we describe and evaluate two new approaches, explicit channel switching and network-directed roaming for providing hot-spot congestion relief while maintaining pre-negotiated user bandwidth agreements with the network. The goals of these algorithms are: (i) to accommodate more users by dynamically providing capacity where it is needed, when it is needed; (ii) to improve overall network utilization by making more efficient use of deployed resources; and (iii) to guarantee at least a minimum amount of bandwidth to users. We propose that both the network and its users should explicitly and cooperatively adapt themselves to changing load conditions depending on their geographic location within the network. We describe how these algorithms enable the network to transparently adapt to user demands and balance load across its access points (APs). We evaluate the effectiveness of these algorithms on improving user service rates and network utilization using simulations. Our algorithms improve the degree of load balance in the system by over 30%, and user bandwidth allocation by up to 52% in comparison to existing schemes that offer little or no load balancing .","cites":"13","conferencePercentile":"25"},{"venue":"WMCSA","id":"aacad36b6bfa601e6ef6905424081ea7ca3403fd","venue_1":"WMCSA","year":"2006","title":"Designing an Architecture for Delivering Mobile Information Services to the Rural Developing World","authors":"Tapan S. Parikh","author_ids":"1755518","abstract":"Implementing successful rural computing applications requires addressing a number of significant challenges. Recent advances in mobile phone computing capabilities make this device a likely candidate to address the client hardware constraints. Long battery life, wireless connectivity, solid-state memory, low price and immediate utility all make it better suited to rural conditions than a PC. However, current mobile software platforms are not as appropriate. Web-based mobile applications are hard to use, do not take advantage of the mobile phone's media capabilities and require an online connection. Custom mobile applications are difficult to develop and distribute. To address these limitations we present CAM - a new framework for developing and deploying mobile computing applications in the rural developing world. CAM applications are accessed by capturing barcodes using the mobile phone camera, or entering numeric strings with the keypad. Supporting minimal navigation, direct linkage to paper practices and offline multi-media interaction, CAM is uniquely adapted to rural device, user and infrastructure constraints. To illustrate the breadth of the framework, we list a number of CAM-based applications that we have implemented or are planning. These include processing microfinance loans, facilitating rural supply chains, documenting grassroots innovation and accessing electronic medical histories.","cites":"78","conferencePercentile":"90"},{"venue":"WMCSA","id":"78ed372516860a07f36a2d1c208bdac455926259","venue_1":"WMCSA","year":"2000","title":"Scylla: a smart virtual machine for mobile embedded systems","authors":"Phillip Stanley-Marbell, Liviu Iftode","author_ids":"2984663, 2345961","abstract":"With the proliferation of wireless devices with embedded processors, there is an increasing desire to deploy applications that run transparently over the varied architectures of these devices. Virtual machines are one solution for code mobility, providing a virtualized processor architecture that is implemented over the individual node architectures. Current virtual machines are generally slow and consume significant energy, making them unsuitable for embedded devices with limited processing power and energy resources. Presented is a novel virtual machine architecture, Scylla, specially designed for mobile embedded systems, that is simple , fast and robust. In addition to a basic instruction set, Scylla supports inter-device communication, power management and error recovery. To make on-they compilation extremely eecient, the instruction set closely matches the processor architectures that can be found in embedded systems today. The paper describes Scylla, along with a preliminary evaluation of its performance, including the costs of the on-they compilation and the overhead of having a virtual machine, based on simulations and measurements on a prototype system.","cites":"25","conferencePercentile":"45"},{"venue":"WMCSA","id":"1b0f9906a13bd86c01f303d266486fd951941967","venue_1":"WMCSA","year":"2004","title":"Physical Posters as Gateways to Context-Aware Services for Mobile Devices","authors":"Enrico Rukzio, Albrecht Schmidt, Heinrich Hußmann","author_ids":"2021950, 1678329, 3952330","abstract":"In this paper we describe the usage of physical posters as gateways to mobile services that are related to advertisements and information presented on these posters. In our approach the user can interact through a mobile device with services that are represented by a poster. Our aim is to create a system that allows seamless and natural interaction of users with posters. Our work is based on a requirements analysis. We investigated placement and physical accessibility of posters and the behaviour of people waiting in public places. Based on these observations, additional interviews, and an internet questionnaire, we extracted scenarios and present an overall architecture of our system. A prototype, taking these results into account is outlined at the end of the paper.","cites":"26","conferencePercentile":"73.68421053"},{"venue":"WMCSA","id":"1e09eb2923b055fb578837b930ff4c67a51671d5","venue_1":"WMCSA","year":"2000","title":"Adapting to mobile contexts with user-interface modeling","authors":"Jacob Eisenstein, Jean Vanderdonckt, Angel R. Puerta","author_ids":"1752524, 1749130, 2810933","abstract":"Mobile computing offers the possibility of dramatically expanding the versatility of computers, by bringing them off the desktop and into new and unique contexts. However , this newfound versatility poses difficult challenges for user-interface designers. We propose three model-based techniques that will aid UI designers who are working in the domain of mobile computing. These techniques will allow designers to build UIs across several platforms, while respecting the unique constraints posed by each platform. In addition, these techniques will help designers to recognize and accommodate the unique contexts in which mobile computing occurs. All three techniques depend on the development of a user-interface model which serves to isolate those features that are common to the various contexts of use, and to specify how the user-interface should adjust when the context changes. User-interface models allow automatic and automated tool support that will enable UI designers to overcome the challenges posed by mobile computing.","cites":"39","conferencePercentile":"80"},{"venue":"WMCSA","id":"4c21828885997dc52083fd8414253feb5589e261","venue_1":"WMCSA","year":"1994","title":"The Bayou Architecture: Support for Data Sharing Among Mobile Users","authors":"Alan J. Demers, Karin Petersen, Mike Spreitzer, Douglas B. Terry, Marvin Theimer, Brent B. Welch","author_ids":"1686255, 5186930, 1703040, 1680763, 1714945, 1719695","abstract":"The Bayou System is a platform of replicated, highly-available, variable-consistency, mobile databases on which to build collaborative applications. This paper presents the preliminary system architecture along with the design goals that influenced it. We take a fresh, bottom-up and critical look at the requirements of mobile computing applications and carefully pull together both new and existing techniques into an overall architecture that meets these requirements. Our emphasis is on supporting application specific conflict detection and resolution and on providing application-controlled inconsistency.","cites":"232","conferencePercentile":"92.30769231"},{"venue":"WMCSA","id":"0d7509cd6ec9a13227cf91caabe0bac45b83564a","venue_1":"WMCSA","year":"2003","title":"Web Services on Mobile Devices - Implementation and Experience","authors":"Stefan Berger, Scott McFaddin, Chandrasekhar Narayanaswami, Mandayam T. Raghunath","author_ids":"1855784, 2537039, 1991394, 2664115","abstract":"Web Services have started to appear on servers as interfaces between business-to-business applications. To date, mobile devices have only consumed Web Services running on stationary servers. We expand this notion so that mobile devices can both offer and consume Web Services. We discuss some interesting classes of applications that can be enabled when mobile devices can host Web Services. This can be a powerful model for facilitating automatic interaction between resource-constrained mobile devices, time starved users, and pervasive infrastructure. We also explore the issues that arise due to mobility of devices hosting Web Services, such as service discovery, device disambiguation, software footprint, and security requirements. To explore this paradigm and to gain an understanding of these issues, we have implemented a retail shopping scenario where a mobile device offers wallet services to an electronic check-out kiosk. This demonstration is now housed at the IBM Industry Solutions Lab and has been operational for several months.","cites":"31","conferencePercentile":"78.57142857"},{"venue":"WMCSA","id":"614d83611be2203f1eafb3703abfc6ff012ba7fa","venue_1":"WMCSA","year":"2002","title":"Context Aggregation and Dissemination in Ubiquitous Computing Systems","authors":"Guanling Chen, David Kotz","author_ids":"3045450, 1710979","abstract":"Many \" ubiquitous computing \" applications need a constant flow of information about their environment to be able to adapt to their changing context. To support these \" context-aware \" applications we propose a graph-based abstraction for collecting, aggregating, and disseminating context information. The abstraction models context information as events, produced by sources and flowing through a directed acyclic graph of event-processing operators, then delivered to subscribing applications. Applications describe their desired event stream as a tree of operators that aggregate low-level context information published by existing sources into the high-level context information needed by the application. The operator graph is thus the dynamic combination of all applications' subscription trees. In this paper, we motivate and describe our graph abstraction , and discuss a variety of critical design issues. We also sketch our Solar system, an implementation that represents one point in the design space for our graph abstraction, and present the specific choices made by Solar and how its future evolution will be guided by the design discussion.","cites":"75","conferencePercentile":"58.33333333"},{"venue":"WMCSA","id":"4cc3420aafc490fb1dd934050e53abf45d2400e2","venue_1":"WMCSA","year":"1994","title":"Dealing with Tentative Data Values in Disconnected Work Groups","authors":"Marvin Theimer, Alan J. Demers, Karin Petersen, Mike Spreitzer, Douglas B. Terry, Brent B. Welch","author_ids":"1714945, 1686255, 5186930, 1703040, 1680763, 1719695","abstract":"This paper describes a problem of weakly-consistent replicated data systems used in support of disconnected groups of people. The problem concerns actions and updates derived from tentative data updates that are ultimately determined to be in conflict. While some such actions and updates can be automatically resolved, many require human intervention. Furthermore, although some file and database systems support internal conflict detection and resolution, derived actions may be external to those systems, implying that human users must ensure that proper consistency is maintained between independent components of the system. The entire problem becomes exascerbated when disconnected work groups are taken into account, where tentative data values may be seen and acted upon by multiple people. In a world containing mobile computer users who can communicate with each other only part of the time, there is growing interest in disconnected operation and in weakly-consistent replicated data. This can be seen from the success of systems such as Lotus Notes[6], Coda[7][11], and Ficus[4][5]. Some of these systems ignore the issue of conflicting, concurrent updates to data; others support some form of conflict detection and even automatic conflict resolution in certain cases. However, none of them deals with the problem in its full generality. Two kinds of inconsistency can arise when concurrent updates occur in a partitioned system: write/write conflicts and read/write conflicts. In the former case, two write operations attempt to update the same data in parallel, while in the latter a client reads data that is being updated in parallel and then performs other operations on the basis of the stale data it has read. These \" derived \" operations may be other write operations, but they may also be \" external \" operations that are not directly reflected in the replicated data of the system. If the data in a system is partitioned into multiple disjoint subsystems-for example, into a file system and a separate database system-then a write to the data in one subsystem that is derived from a read of stale data in another subsystem would also look like an external operation to each subsystem with respect to the question of conflict detection. The basic problem is that most systems have only a poor notion of dependencies among multiple data objects, applications and user actions. In traditional file systems such dependencies are generally not recorded, and appropriate compensating actions are not explicitly specified. Systems such as Coda and …","cites":"13","conferencePercentile":"38.46153846"},{"venue":"WMCSA","id":"599778502e39d34046e00c1502a94212bde22985","venue_1":"WMCSA","year":"2004","title":"PAWP: A Power Aware Web Proxy for Wireless LAN Clients","authors":"Marcel-Catalin Rosu, C. Michael Olsen, Chandrasekhar Narayanaswami, Lu Luo","author_ids":"2420495, 1917885, 1991394, 8043426","abstract":"The relative power consumed in the WLAN interface of a mobile device is rising due to significant improvements in the energy efficiency of the other device components. The unpredictability of the incoming WLAN traffic limits the effectiveness of existing power saving techniques. This paper introduces a Power Aware Web Proxy (PAWP) architecture designed to schedule incoming web traffic into intervals of high and no communication. This traffic pattern allows WLAN interfaces to switch to a low power state after very short idle intervals. PAWP uses a collection of HTTP-level techniques to compensate any negative impact that traffic scheduling may have. PAWP does not require any client or web server modifications. In this paper, we describe our initial experiences with a PAWP implementation for 802.11b WLANs. Our experiments show savings of more than 50% in the energy consumed by the WLAN interface. Finally, our experiences give us insights into possible browser improvements when power consumption is taken into account.","cites":"16","conferencePercentile":"68.42105263"},{"venue":"WMCSA","id":"0a013ba0361689917fc3fbdde736b363fbdfe95d","venue_1":"WMCSA","year":"2002","title":"A Platform Supporting Coordinated Adaptation in Mobile Systems","authors":"Christos Efstratiou, Adrian Friday, Nigel Davies, Keith Cheverst","author_ids":"1778167, 8133498, 1789887, 1744905","abstract":"Mobile environments are highly dynamic, characterised by frequent and sudden changes in resource availability. As a consequence, adaptive mobile applications need to be capable of adapting their behaviour to ensure they continue to offer the best possible level of service to the user. Our experience of developing such applications has led us to believe that existing mobile middleware platforms fail to consider adaptive applications on a host as an ensemble of entities competing for the same resources; instead, fo-cusing on the requirements of each application in isolation. A new approach is required which offers the mechanisms to support coordination of the adaptive behaviour of multiple applications in order to achieve a common goal. In this paper, we present a platform designed to meet this objective. Our platform is based on the notion of the definition of system-wide flexible adaptation policies written using a form of Kowalsky's event calculus, that may be adapted according to user needs. Moreover, we also believe that by using our approach it will soon be possible to identify and resolve conflicts caused by the need to adapt to multiple contextual triggers.","cites":"22","conferencePercentile":"41.66666667"},{"venue":"WMCSA","id":"80b4b7aaa81ebe2d9ad988b3ac8a72de9cea21c5","venue_1":"WMCSA","year":"2000","title":"A Composable Framework for Secure Multi-Modal Access to Internet Services from Post-PC Devices","authors":"Steven J. Ross, Jason L. Hill, Michael Y. Chen, Anthony D. Joseph, David E. Culler, Eric A. Brewer","author_ids":"2655028, 2915922, 8408440, 1687701, 1706858, 1759010","abstract":"The Post-PC revolution is bringing information access to a wide-range of devices beyond the desktop, such as public kiosks, and mobile devices like cellular telephones, PDAs, and voice based vehicle telematics. However, existing deployed Internet services are geared toward the secure rich interface of private desktop computers. We propose the use of an infrastructure-based secure proxy architecture to bridge the gap between the capabilities of Post-PC devices and the requirements of Internet services. By combining generic content and security transformation functions with service-specific rules, the architecture decouples device capabilities from service requirements and simplifies the addition of new devices and services. Security and protocol specifics are abstracted into re-usable components. Additionally , the architecture offers the novel ability to deal with untrusted public Internet access points by providing fine-grain control over the content and functionality exposed to the end device, as well as support for using trusted and un-trusted devices in tandem. Adding support for a deployed Internet service requires a few hundred lines of scraping scripts. Similarly, adding support for a new device requires a few hundred lines of stylesheets for the device fromat. The average latency added by proxy transformations is around three seconds in our unoptimized Java implementation.","cites":"23","conferencePercentile":"30"}]}