{"WMNC.csv":[{"venue":"WMNC","id":"548733c62c6a77d4b35cb15619a9cd1d91edc2c1","venue_1":"WMNC","year":"2010","title":"Intelligent role-based routing for dense wireless sensor networks","authors":"Antonio Manuel Ortiz, Teresa Olivares, José Carlos Castillo, Luis Orozco-Barbosa, Pedro José Marrón, Fernando Royo","author_ids":"2044812, 2289499, 2439331, 1758953, 1755985, 3174122","abstract":"— The task of routing data from a source to the sink is a critical issue in ad hoc and wireless sensor networks. In this paper, the use of fuzzy logic to perform role assignment during route establishment and maintenance is proposed. An intelligent role-based approach is presented and compared with similar existing routing protocols. Experiments show promising results for our proposal and its suitability for operating with dense networks, obtaining quick path creation and energy efficiency. I. INTRODUCTION Wireless Sensor Networks (WSNs), as well as other wireless personal area networks, have stirred up the world of wireless communications since they present new challenges in terms of energy efficiency and communications performance. Sensor nodes are resource constrained in terms of energy, processing, storage and efficiency. This kind of networks also has to deal with problems such as mobility and reliability. All these problems make necessary some kind of network organization to create and maintain data paths and to ensure reliable and efficient communications among network nodes. Routing data in a network, composed in many cases of a high number of low-resourced nodes, is a difficult task since the algorithms and protocols have to save as much energy as possible and offer good performance. These protocols take into account important node features such as the remaining battery, number of hops to the sink, signal strength and so on. Not considering this information leads to problems in the network such as interrupted paths, data loss or isolated nodes, among others. These problems are directly related to latency and throughput values. Routing approaches provide network load balance to extend network lifetime, efficiency improvements, and data loss reduction. Network monitoring is also necessary to control topology changes and the addition or elimination of nodes in the network. The network lifetime will finish when the working routing protocol can no longer support the whole WSN. In this paper, NORIA (Network rOle-based Routing Intelligent Algorithm), a novel routing algorithm for wireless sensor networks which combines different effective techniques is presented. These techniques are role assignment to distribute tasks over the network nodes and fuzzy logic for making decisions. Role assignment means that nodes with greater resources will forward data flowing from more distant nodes up to the base station. The comparison of node","cites":"3","conferencePercentile":"60"},{"venue":"WMNC","id":"4b115c74a6029e89a6a07cfe4d2927fc44c9ba2f","venue_1":"WMNC","year":"2014","title":"On detecting WLAN users communication attempts","authors":"Fatemeh Ganji, Anatolij Zubow, Lukasz Budzisz, Adam Wolisz","author_ids":"7594196, 2827545, 2827152, 1778337","abstract":"— Power wastage in dense WLANs is a challenging problem. In order to reduce the power wastage, AP switching on/off strategies have been developed, aiming at decreasing the number of active APs (according to the traffic conditions). The efficiency of such strategies is strongly dependent on the efficiency of detecting WLAN users communication attempts, as a trigger for switching on the inactive APs. We demonstrate that such a communication attempts can be efficiently identified even for SNR values far below thresholds needed for frame reception. We present a signal-detection-based approach and verify its efficiency experimentally.","cites":"0","conferencePercentile":"32.14285714"},{"venue":"WMNC","id":"81a866d65ae3ddb929ba189a62714d696104279f","venue_1":"WMNC","year":"2013","title":"An autonomous framework for supporting energy efficiency and communication reliability in WSNs","authors":"Osama Khader, Andreas Willig, Adam Wolisz","author_ids":"3228457, 3150869, 1778337","abstract":"—We propose a novel decentralized and self-learning framework to support both communication reliability and energy-efficiency for periodic traffic applications in WSNs. Our autonomous framework comprises three main components: estimation and identification of multi-flow traffic, dynamic multi-flow wakeup scheduling, and asynchronous channel hopping. With asynchronous channel hopping the frequency hopping pattern is determined by each source node autonomously, and forwarders have to identify and follow the pattern. We also propose a light and efficient controller to eliminate the collision caused by multi-flow overlap at forwarders. We present design and evaluation of our autonomous framework using real world measurements, and realistic trace-based simulation. The results show that our asynchronous channel hopping solution improves the packet reception rate compared to the single channel solutions without the need of an expensive signaling and time synchronization overhead. We also show that with this scheme the average energy consumption yields a ≈ 50% lower than the single channel solutions. This paper is to the best our knowledge, the first to explore channel hopping without maintaining a tight time synchronization protocol.","cites":"0","conferencePercentile":"19.04761905"},{"venue":"WMNC","id":"10d6acda5654e0615105d6075e36f5fe8dbb35fa","venue_1":"WMNC","year":"2013","title":"Accuracy analysis on call quality assessments in voice over IP","authors":"Yi Han, John Fitzpatrick, Liam Murphy, J. Dunne","author_ids":"1756372, 6950122, 1743092, 5099369","abstract":"—Voice over IP (VoIP) now has tremendous influence on the telecommunication market with its flexibility and price advantage. Users of VoIP expect call quality to be as good as, if not better than the traditional Public Switched Telephone Network (PSTN). However in VoIP, factors that are related to the IP transport network such as packet loss, delay, bandwidth, jitter, and voice encoding (codec) all affect call quality. Call quality assessment in VoIP systems is mainly conducted with off-line tests using the Perceptual Evaluation of Speech Quality (PESQ) [1] methodology. Another method that can be utilised is an on-line approach using the E-Model, which can be used in real time. However, these two methods have limits and inaccuracy, and often do not give the same results. Call quality assessment is often used to adjust system and codec parameters. Therefore, given inaccurate results, the system would decrease the adjustment efficiency or even inadvertently decrease call quality. The primary contribution of this paper is a comparison between the accuracy of PESQ and the E-Model investigated by conducting an extensive set of experiments in a real enterprise network using a widely deployed Voice over IP (VoIP) product. Experiments were conducted under varying controlled network conditions. The results show that under various conditions, loss rates, codecs and across a range of languages that there can be significant differences between the call quality measurement obtained when using the E-model versus a PESQ analysis.","cites":"1","conferencePercentile":"47.61904762"},{"venue":"WMNC","id":"3781c62a707f14ab6ead0e981e72cfdfea6ccc84","venue_1":"WMNC","year":"2014","title":"Energy consumption in personal mobile devices sensing applications","authors":"Cristiano G. Pendão, Adriano J. C. Moreira, Helena Rodrigues","author_ids":"2687525, 2453271, 2128960","abstract":"—Personal mobile devices have a strong impact in the daily life of their users, making part of their daily routines. Most of these devices are equipped with several sensors and interfaces that may be used to study human mobility and its interaction with the elements present in physical spaces. Our goal was to develop an application for Android smartphones that could be used to collect data from several of the devices' interfaces (Wi-Fi, GPS, Bluetooth and GSM), and to send that data to a server for later processing and analysis. In order to maximise the autonomy of the devices, energy resources must be used efficiently. This paper focus on a power-consumption saving solution for mobile phone-based sensing systems in the context of human motion analysis. Experiments were conducted with the objective of comparing power-consumption in different situations using our solution. Results have shown that, considering current power consumption patterns, carefully designed solutions for mobile phone-based sensing for observing human motion may enhance energy efficiency satisfactorily. In this particular domain, we have explored periodic sampling of the sensors and the suspension of the sampling process in the Android operating system whenever the device is not moving and we report such results in this paper.","cites":"2","conferencePercentile":"89.28571429"},{"venue":"WMNC","id":"63b927d47435e8d24e90921f089bce23f58c839f","venue_1":"WMNC","year":"2013","title":"Effect of locality of node mobility on epidemic broadcasting in DTNs","authors":"Kohei Watabe, Hiroyuki Ohsaki","author_ids":"7988668, 1808774","abstract":"DTNs, represented by MANET, where nodes are sparse, have attracted considerable attention. Epidemic broadcasting is method for one-to-all communication in DTNs composed of mobile nodes. In epidemic broadcast, nodes carrying a message (infected nodes) forward the message when they enter the communication range of other nodes. Mobile node Message (Information) An infected node forwards a message ! if it is in contact with other nodes. Generally, node mobility affects the communication performance of DTNs, where nodes communicate through epidemic broadcasting or other manner. When nodes movement has spatial locality, in the field, it is expected that the message dissemination speed is heavily restricted. A mobile node The field in which the nodes can move Low locality High locality Contact frequency is limited There has been no research focusing on effect of locality of node mobility on message dissemination. Objectives We evaluate the effect of locality of node mobility on message dissemination in epidemic broadcasting. 1 We express the locality of node mobility through the shape of the positional distribution of nodes. 2 We quantify the intensity of locality as E[L]. L denotes the distance from the center (mean/mode) point to the current node position. 3 We analytically derive the message dissemination speeds from the stationary positional distribution of the nodes.","cites":"0","conferencePercentile":"19.04761905"},{"venue":"WMNC","id":"2cb1ecccc5114abb5b987311152fbaf478e3ac96","venue_1":"WMNC","year":"2013","title":"A multi-layer architecture for wireless sensor network virtualization","authors":"Imran Khan, Fatna Belqasmi, Roch H. Glitho, Noël Crespi","author_ids":"3496035, 1756723, 1804547, 1737867","abstract":"—Wireless sensor networks (WSNs) have become pervasive and are used for a plethora of applications and services. They are usually deployed with specific applications and services; thereby precluding their re-use when other applications and services are contemplated. This can inevitably lead to the proliferation of redundant WSN deployments. Virtualization is a technology that can aid in tackling this issue. It enables the sharing of resources/infrastructures by multiple independent entities. This position paper proposes a novel multi-layer architecture for WSN virtualization and identifies the research challenges. Related work is also discussed. We illustrate the potential of the architecture by applying it to a scenario in which WSNs are shared for fire monitoring.","cites":"7","conferencePercentile":"97.61904762"}]}