{"WMTE.csv":[{"venue":"WMTE","id":"8812a469bf1caf6472cdfd74d78c812e3fc41ee8","venue_1":"WMTE","year":"2006","title":"Unified and Personalized Messaging to Support E-Learning","authors":"Keith Mitchell, Nicholas J. P. Race, Duncan McCaffery, Mark Bryson, Zhen Cai","author_ids":"8496756, 1780344, 2699482, 1867258, 5657466","abstract":"The University of Lancaster is a campus based educational institution with over 10,000 members of staff and students on campus during a typical day. The University is currently investigating the use of mobile and smart devices as a platform for delivering mobile learning services and administrative information on a personalised basis. This paper describes two current active areas of development. First, we present an SMS text messaging extension to our Virtual Learning environment (VLE) and describe how this is used to provide personalised messaging. Second, we present our work on a Bluetooth based communications service, named BlueZone, which we use to complement SMS text messaging to offer an alternative communications platform to students. The combination of these technologies provides a unified and cost effective delivery mechanism for communicating with University undergraduates on a large scale.","cites":"5","conferencePercentile":"53.33333333"},{"venue":"WMTE","id":"c66d3ffcfe43b3096026710f9a5e5f45c94069e5","venue_1":"WMTE","year":"2004","title":"Transportable Research Instrument: a PDA-based Laboratory for Science Experiments","authors":"Nathan Skalsky, Robert Pastel","author_ids":"2465875, 2290635","abstract":"We introduce the Transportable Research Instrument (TRIcorder) System, an implementation of a PDA-based laboratory (PBL). The hardware component uses PDAs and wireless sensors to conduct and collect data for high school laboratory experiments. The software component, Experimental Assistant uses a gesturing user-interface to lead students through the experimental procedure and graphically present the experimental results. The TRIcorder system design attempts to capitalize on the unique PDA's affordances of portability, context sensitivity, and individuality to implement a PBL.","cites":"1","conferencePercentile":"13.88888889"},{"venue":"WMTE","id":"66d01426413bcb65134ee4a04d0150df40b1a9f0","venue_1":"WMTE","year":"2005","title":"Innovative Media in Support of Distributed Intelligence and Lifelong Learning","authors":"Gerhard Fischer, Shin'ichi Konomi","author_ids":"2449381, 1741223","abstract":"Individual, unaided human abilities are constrained. Media have helped us to transcend boundaries in thinking, working, learning, and collaborating by supporting distributed intelligence. Wireless and mobile technologies provide new opportunities for empowering humans, but not without potential pitfalls. We explore these opportunities and pitfalls from a lifelong-learning perspective and discuss how wireless and mobile technologies can influence and change conceptual frameworks such as the relationship between planning and situated action, context awareness, human attention, distances in collaborative design activities, and the trade-off between tools for living and tools for learning. The impact of wireless and mobile technologies is illustrated with our research projects, which focus on moving \" computing off the desktop \" by \" going small, large, and everywhere. \" Specific examples include human-centered public transportation systems, collaborative design, and information sharing with smart physical objects.","cites":"11","conferencePercentile":"73.68421053"},{"venue":"WMTE","id":"2fd9189c0a1417ed7c88123eb1e49ae911240b0d","venue_1":"WMTE","year":"2005","title":"Lifeblog: A New Concept in Mobile Learning?","authors":"Elizabeth Hartnell-Young, Frank Vetere","author_ids":"2425409, 1812707","abstract":"In this paper we report early findings from a sample of Australian participants using Nokia's Lifeblog software on mobile phones to record aspects of living and learning in both formal and informal settings. We take the view that learning is the process people engage in when they are making meaning and constructing knowledge. The Lifeblog software affords new opportunities to capture, manipulate and communicate daily events and thoughts that assist in making meaning in individual and collective contexts. We aim to link this with the emerging phenomena of digital storytelling and ePortfolios, which are both examples of learners actively creating digital material for an audience, rather than passively receiving information. Findings to date indicate that the creative capacity of the mobile phones is not frequently encouraged in formal educational settings.","cites":"6","conferencePercentile":"26.31578947"},{"venue":"WMTE","id":"e3264fc264a8e48674ab0620c5ebf1dc993b8ce4","venue_1":"WMTE","year":"2004","title":"SMS-based Discussions - Technology Enhanced Collaboration for a Literature Course","authors":"Lars Bollen, Sabrina C. Eimler, Heinz Ulrich Hoppe","author_ids":"1811239, 2374750, 8106368","abstract":"In this paper we present a communication and discussion toolkit based on sending short messages designed for use in schools. Our approach uses PDAs in a wireless network to build an environment that emulates sending of short messages with mobile phones. The messages created by the students are collected in a database and establish a base for a discussion and analysis later on using Cool Modes, a graph based modeling and discussion system. The most common types of mobile and wireless devices are probably remote controls and mobile phones. Mobile phones have even created a new style or \" culture \" of communication through SMS messaging, particularly among young user communities [1]. This is an interesting phenomenon, also from an educational point of view, which is itself a potential subject of technology-supported learning. Inspired by the original idea of a secondary school teacher, we have designed a technical platform and framework that facilitates communicative classroom experience and reflective analysis around SMS messaging in school classrooms. The system design and development has been conducted in a project seminar with university students of Applied Media and Communication Sciences. Modern cellular phones integrate more and more of the functionality of portable computing devices such as PDAs. Accordingly, mobile phones have been considered to be used instead of other networked computational devices for learning purposes (cf., e.g., [2], [3]). In our project, we take the inverse direction: We use PDAs to emulate SMS messaging and to support reflective and constructive learning processes based on these communications. A formal reason for not using mobile phones directly is due to current restrictions for using mobile phones in schools and classrooms. A methodological advantage lies in the potential of opening up the emulated SMS communication for detailed transcription and analysis. Based on these premises, our concrete scenario consists of a set of PDAs that are connected through a WLAN. The PDAs can be assigned predefined user profiles or identities. All messages are stored in a database and labelled with the profile ID's of sender and receiver, the role-play context or frame, time and duration. The original idea was to contrast the reading and interpretation of Goethe's classical Werther letters with related experience in SMS-based communication. For this purpose, student should engage in SMS dialogues using mobile devices. The students will be assigned specific roles that correspond to protagonists of the original letters. The messages will be collected …","cites":"25","conferencePercentile":"83.33333333"},{"venue":"WMTE","id":"87c43dacd605ae679c485e9e0a0a8d7d37e6309b","venue_1":"WMTE","year":"2005","title":"Quilt Snaps: A Fabric Based Computational Construction Kit","authors":"Leah Buechley, Nwanua Elumeze, Camille Dodson, Michael Eisenberg","author_ids":"1742691, 2964702, 2088200, 1749923","abstract":"In this paper we present Quilt Snaps, a fabric based construction kit consisting of a set of computationally enhanced quilting pieces. Our discussion focuses on three ways that children can engage with Quilt Snaps. First, Quilt Snaps allows children to act as the engineers, designers, and decorators of their own digital manipulatives. Second, by playing with the manipulatives that they've helped to construct, children can learn about concepts relevant to programming, graph theory, and dynamical systems. Finally, since Quilt Snaps is fabric based, children can use the pieces they construct as personal mobile display media.","cites":"11","conferencePercentile":"73.68421053"},{"venue":"WMTE","id":"5cbda26392c761d6f0b246a7aa7521e12bbcce57","venue_1":"WMTE","year":"2006","title":"The Focus Problem in Mobile Learning","authors":"Christoph Göth, Dirk Frohberg, Gerhard Schwabe","author_ids":"1687179, 2058435, 1691246","abstract":"Mobile learning has a lot of potential for supporting learning in situations such as in a museum, at a tourist sight or when exploring biological phenomena at a riverside. There learners can interact with their environment and still make use of the advantages of computational power. However, we have found many of such projects hindered by placing the technology too much in the focus of the learner. Instead of interacting with the environment , we found the learners interacting with the device, heads down and ignoring the environment. We found the issue of focus to be a massive problem, one which needs a completely new metaphor for the design of an educational and technical setting. Until now, the mobile devices have been interpreted as small desktops, always in the foreground of the learners' focus. Instead, we propose a different approach, deduced from the usage of mobile phones. Mobile applications need to be designed explicitly to free the learners' focus and push the application to the background. The good news is that the actual changes to be made in existing systems are not as fundamental as one may think.","cites":"7","conferencePercentile":"63.33333333"},{"venue":"WMTE","id":"73077ef8e94c3aabc35a5e954e5ceb0e5bd819b1","venue_1":"WMTE","year":"2004","title":"Handheld Tools that \"Informate\" Assessment of Student Learning in Science: A Requirements Analysis","authors":"Jeremy Roschelle, William R. Penuel, Louise Yarnall, Deborah G. Tatar","author_ids":"1802395, 2947250, 3310269, 1762184","abstract":"An important challenge faced by many teachers as they involve students in science investigations is measuring ('assessing') students' progress. Our detailed requirements analysis in a particular school district led to the idea that what teachers need most are ways to increase the quality of the information they have about what students know and can do, not automation of typical assessment practices. We see handheld computers as promising tools for addressing this need because they can give students and teachers frequent, integral access to new ways of expressing and communicating what they know and can do. Our requirements analysis has led us to emphasize a need for handheld-based tools that 'informate' science instruction by: Being oriented to the needs of teachers in transition to inquiry-oriented pedagogy; expanding the range of assessment tasks through a new representational medium and communication infrastructure; creating new roles for students in expressing what they know and can do; and focusing both students' and teachers' attention on scientific concepts.","cites":"12","conferencePercentile":"66.66666667"},{"venue":"WMTE","id":"7381c5003e719d4f6a54e8b5e99798a80ef748f8","venue_1":"WMTE","year":"2004","title":"Roles for Mobile Learner Models","authors":"Susan Bull, Yanchun Cui, Adam Thomas McEvoy, Eileen Reid, Wei Yang","author_ids":"1725865, 3224882, 2980770, 7966438, 1742383","abstract":"This paper discusses uses for learner models in mobile adaptive learning environments, focussing on how different learner modelling issues and attributes may be relevant in a mobile learning context. These issues are illustrated by four simple systems. More complex environments can be built according to the principles illustrated in these initial implementations.","cites":"15","conferencePercentile":"72.22222222"},{"venue":"WMTE","id":"162d442b7cd790080d0fd4b4421a27b62c785f20","venue_1":"WMTE","year":"2002","title":"M-Education: Bridging the Gap of Mobile and Desktop Computing","authors":"Umer Farooq, Wendy A. Schafer, Mary Beth Rosson, John M. Carroll","author_ids":"1769361, 1878189, 1715072, 1682687","abstract":"Mobile Education or M-Education is a new conceptual paradigm in the use of mobile and wireless technologies for education. M-Education encourages distributed peer collaboration over wireless devices and desktop computers to create opportunities for discovery and education in the field and community. It is a project-oriented approach that will use a wireless virtual community to facilitate the learning activities of teachers, students, and peers through collaboration in a distributed environment. M-Education is significantly different from existing mobile learning systems in that it leverages its collaborative activities from an existing desktop-based online virtual community (MOOsburg), and thus offers a range of collaboration opportunities, such as synchronous and asynchronous interactions with peers, and viewing or changes to persistent data. In this paper, an innovative use of wireless and mobile technologies in education is explored as part of a scenario-based design process [7].","cites":"24","conferencePercentile":"70"},{"venue":"WMTE","id":"1b5362a5cac31e28ff9aa847d51842e90909f9b5","venue_1":"WMTE","year":"2004","title":"Producing Guidelines for Learning, Teaching and Tutoring in a Mobile Environment","authors":"Giasemi N. Vavoula, Paul Lefrere, Claire O'Malley, Mike Sharples, Josie Taylor","author_ids":"2602785, 2792816, 7598785, 2357522, 1983815","abstract":"We review the research on mobile learning and theories of learning in order to produce a pedagogically sound set of guidelines for learners, teachers, and policy makers who are considering adopting m-learning technology. The guidelines are not primarily intended as requirements for systems design, but they will be of use to systems designers, in alerting them to the settings in which the technology will be used and issues arising from deployment with teachers and learners. The paper offers an interpretation of the nature and utility of the guidelines, and describes a process for producing new guidelines. We propose an initial set of guidelines for deploying, managing and teaching with mobile technology.","cites":"5","conferencePercentile":"38.88888889"},{"venue":"WMTE","id":"0396917648b5d2edebcac6d9323ff871220ab974","venue_1":"WMTE","year":"2004","title":"Functioning in the Wireless Classroom","authors":"Shelley V. Goldman, Roy D. Pea, Heidy Maldonado, Lee Martin, Toby White","author_ids":"3139018, 2076328, 2002142, 2336719, 3164805","abstract":"Code It! fosters mathematics learning environments where pre-algebra students use handheld technologies to confidently and enjoyably explore and learn about functions. The resources we developed-server-based and handheld software and paper-based student and teacher texts-were packaged as a 20-session unit on code making and breaking and designed to boost students' understanding of mathematical functions and their facility with the multiple representations of tables, graphs and symbols. We field tested the wireless system with two teachers and 120 students during summer school, and conducted studies on the features and function of the technology as a learning and teaching resource. We report on project development and research, focusing on lessons learned about the strengths and difficulties of wireless, handheld technology in the mathematic classroom. This is a particularly important time to develop and research technologies for math learning. Across the US, there is a push to raise lukewarm achievement results on standardized tests and international comparisons. Teachers are being asked to teach more content while raising the level of achievement, but are left unprepared. The Code It! materials-technology and real world based-were designed to address this challenge, capitalizing on developing technology for stimulating high performance while providing a satisfying, successful learning experience on the topic of functions. Technology should be providing tools to support the activities of mathematics classrooms. thanks to our partnering teachers and their students, the Stanford Teacher Education Program and the Stanford student teachers, and the Santa Clara School District. This project was supported by Stanford Center for Innovation in Learning (SCIL) and the Wallenberg Global Learning Network. We also thankfully acknowledge an HP mobile wireless computing equipment grant to SCIL. complex calculations are all greatly facilitated by computers, yet many problems have accompanied classroom computer use: prohibitive cost, use models that do not mesh with classroom structure. and a learning curve for teachers that has been too high for too little gain. Even when researchers developed compelling exemplars [1,2], changes in organizational, social, and pedagogical practices with computers produced high hurdles [3,4]. The combination of increased access, increasing teacher knowledge, decreasing technology costs, and new portable devices is creating a synergy and new possibilities for mitigating problems. Early studies of handheld technology use are modest yet suggestive of how they might best be applied [ 5 , 6, 7, 8, 9, 101 These are promising trends, and to tap the potential in Code I t ! , we developed …","cites":"8","conferencePercentile":"61.11111111"},{"venue":"WMTE","id":"badb171a7ffda56bae608c29967c2f77dcda8b89","venue_1":"WMTE","year":"2002","title":"To Unlock the Learning Value of Wireless Mobile Devices, Understand Coupling","authors":"Jeremy Roschelle, Charles Patton, Roy D. Pea","author_ids":"1802395, 1804064, 2076328","abstract":"Handheld computers will become an increasingly compelling choice of technology for K-12 classrooms because they will enable a transition from occasional, supplemental use to frequent, integral use. Early evaluations suggest teachers and students respond to handhelds favorably. At the same time, these devices will become communication enabled, through wireless technologies such as infrared beaming or radio-based local area networks. This current research base, however, is insufficient to unlock the value of wireless internet learning devices (WILDs). A important issue, hinted at but not fully explored in prior work, now must become our central focus of attention. The issue is the nature of the coupling between social and informatic worlds, and within the social and info rmatic worlds. We articulate three coupling issues: (1) Curricular Activity Spaces versus Personal Learning Connections (2) Integrated vs. Synchronized Educational Databases (3) Broad vs. Narrow Technological Mediation of Discourse.","cites":"12","conferencePercentile":"60"},{"venue":"WMTE","id":"3a79185b697a76919dc4fd70d22e47bb341c5fb0","venue_1":"WMTE","year":"2004","title":"An Interactive Maze Scenario with Physical Robots and Other Smart Devices","authors":"Marc Jansen, Maria Oelinger, Kay Hoeksema, Heinz Ulrich Hoppe","author_ids":"2928422, 2747087, 2153676, 8106368","abstract":"This paper describes an educational application that combines handhelds (PDAs) and programmable Lego bricks in a classroom scenario that deals with the problem of letting a robot escape from a maze. It is specific to our setting the the problem can be solved both in the physical world by steering a Lego robot and in a simulated software environment on a PDA or on a PC. This approach enables the students to generate successful sets of rules in the simulation and to test these sets of rules later in physical mazes, or to create new types of mazes as challenges for known rule sets. In this paper we describe the technical setting for this scenario, different pedagogical scenarios and we will report an evaluation with a group of studens in a school environment.","cites":"6","conferencePercentile":"50"},{"venue":"WMTE","id":"a50162c6c99c3f66f6c616f8cceff812064d1253","venue_1":"WMTE","year":"2005","title":"Location is not enough!': an Empirical Study of Location-Awareness in Mobile Collaboration","authors":"Nicolas Nova, Fabien Girardin, Pierre Dillenbourg","author_ids":"1977377, 3107724, 1799133","abstract":"There is an ever growing number of mobile learning applications based on location-awareness, However, there is still a lack of information concerning how it might impact socio-cognitive processes involved in collaboration. This is what the following empirical study aimed to address. We used a mobile and collaborative game, running on Tablet PCs, to test two conditions. On one hand, groups could see the positions of each member; while in the other location-awareness was not provided. All users could use the Tablet PC to communicate through annotations. We found no differences between the two conditions with regard to the task performance. Neither were there any differences in terms of cognitive workload. However, players without the location-awareness indications had a better representation of their partners' paths. They wrote more messages and better explicated their strategies. The paper concludes with remarks about how this can be taken into account by mobile learning practitioners.","cites":"18","conferencePercentile":"84.21052632"},{"venue":"WMTE","id":"256a3583efdc50ec1058f64956c9192c91af216f","venue_1":"WMTE","year":"2004","title":"Designing an Untethered Educational Digital Library","authors":"Andy Dong, Alice M. Agogino","author_ids":"1697102, 1740037","abstract":"Digital libraries, such as the SMETE Digital Library at UC Berkeley (www.smete.org), are quickly becoming mainstream tools for science, technology, engineering, and mathematics (STE&M) education at all levels. And while the vision exists for \" anytime, anywhere \" access to resources from educational digital libraries, the reality is that learners are tethered to these resources through connected computers in classrooms or homes. Because nearly 85% of students' time is spent outside a formal classroom, transforming coincidental, daily events into meaningful learning opportunities would be expected to impact the level of science learning for children. This paper reports on a workshop held at UC Berkeley on the use of multimedia, wireless technologies and other information technologies for educational digital libraries and knowledge management. The paper also describes a prototype solution for an untethered digital library used to stimulate a discussion on nomadic inquiry and the potential for nomadic computing technologies to support the pursuit of personally-relevant questions and explanations linked to real world contexts and problems.","cites":"5","conferencePercentile":"38.88888889"},{"venue":"WMTE","id":"caf0f574bb9b9fbafcffe20a81fd04a2fe89d897","venue_1":"WMTE","year":"2004","title":"Musex: A System for Supporting Children's Collaborative Learning in a Museum with PDAs","authors":"Koji Yatani, Masanori Sugimoto, Fusako Kusunoki","author_ids":"3260704, 1679714, 1748655","abstract":"Using handheld devices in educational environments has begun to be recognized as suitable. Due to the drastic revisions in Japanese curriculum standards for elementary school children, new theories, systems and practices to support children in their learning are required. Therefore, we focused attention on science museums, which are different learning environments from schools. In this paper, we propose a system called Musex, which is used to support children in learning and exploring collaboratively in a museum with two PDAs (Personal Digital Assistants). Through Musex, children can collaboratively challenge some questions which are related to exhibitions. Solving the questions let children pay their attention to exhibitions naturally and understand contents of exhibitions more. We evaluated the system in a Japanese science museum and confirmed its effectiveness.","cites":"44","conferencePercentile":"94.44444444"},{"venue":"WMTE","id":"9a17753c78c1741ecdbce24fb6b60b6de144774a","venue_1":"WMTE","year":"2006","title":"Handheld-Mediated Communication to Support the Effective Sharing of Meaning in Joint Activity","authors":"Kibum Kim, Deborah G. Tatar, Steve R. Harrison","author_ids":"1724801, 1762184, 2418522","abstract":"This paper reports the results of a laboratory study of a proposed solution to the problem of coordinating entry into collaborative activity while protecting the privacy and control of individuals over small-scale devices. The particular set of design requirements we work with are abstracted away from prior work on the constraints and affordances of a middle school teaching/learning setting. We implement on handheld devices a proposed functionality, Look, intended to enable a side assistant to see what is happening in an activity without interrupting that activity. The question is whether Look is sufficient to allow effective comprehension of the situation and effective action based on that comprehension. To evaluate the success of this functionality, we draw on preexisting psycholinguistic/CSCL (computer supported collabor-ative learning) theory on (1) shared visual spaces and (2) overhearer comprehension. The associated experimental paradigm increases the occurrence of the interpersonal challenges we wish to study over their spontaneous rate in the classroom. Our variant of the paradigm provides preliminary evidence that our design is viable. It also extends the paradigm by casting light on which elements of the situation were responsible for results in prior experiments, and which may be further amenable to technological manipulation.","cites":"2","conferencePercentile":"40"},{"venue":"WMTE","id":"0c951651a7d295749e13bba8902cd5e7bd2d915a","venue_1":"WMTE","year":"2004","title":"Exploring the Use of Mobile Devices to Facilitate Educational Interoperability around Digitally Enhanced Experiments","authors":"Marcelo Milrad, Heinz Ulrich Hoppe, Joshua Gottdenker, Marc Jansen","author_ids":"1750947, 8106368, 3323853, 2928422","abstract":"In this paper we describe our efforts to foster educational interoperability in scenarios using mobile and wireless technologies to support hands-on scientific experimentation and learning. A special focus is given to the idea that innovative uses of mobile and wireless technologies enhance the learners' scientific experience. Specific contributions include the creation of new applications to support interoperability between different mobile devices, thus to provide \" glue \" between different learning situations. We describe a number of educational scenarios as well as the technologies and the architectural principles behind them.","cites":"5","conferencePercentile":"38.88888889"},{"venue":"WMTE","id":"44f2b6d6215bc95b88978654864b8d702af2f1ff","venue_1":"WMTE","year":"2006","title":"PDAs as Input Devices in Brainstorming and Creative Discussions","authors":"Lars Bollen, Guillermo Juarez, Micha Westermann, Heinz Ulrich Hoppe","author_ids":"1811239, 2011553, 3328646, 8106368","abstract":"In this paper we present the use of PDAs as input devices in brainstorming sessions and creative discussions using the Mobile Notes architecture and application. Mobile Notes enables heterogeneous, mobile input devices together with collaborative modelling environments to be used in different discussion scenarios, e.g. classroom discussions, seminars or lectures. Based on the conceptual perspective of assigning specific functionalities to different devices in technology enhanced learning environments, we describe the design, implementation and first experiences with Mobile Notes.","cites":"9","conferencePercentile":"83.33333333"},{"venue":"WMTE","id":"5dff6ba7c25b7e5fddc5a39998f88ed41aac8d52","venue_1":"WMTE","year":"2005","title":"AirTransNote: Augmented Classrooms with Digital Pen Devices and RFID Tags","authors":"Motoki Miura, Susumu Kunifuji, Buntarou Shizuki, Jiro Tanaka","author_ids":"1745017, 1806054, 1765222, 1726327","abstract":"This paper introduces our design of \" AirTransNote, \" a computer-mediated learning system that employs digital pen devices to minimize student's exertion in classrooms. But although the design frees students from PC operation the teachers still have to handle their PC during their lectures. We have enhanced the system by introducing an RFID technique in which a portable controller enables the teacher to show a student's note with an intuitive operation and enhance our concept of \" Augmented Classroom. \" Augmented Classroom enriches conventional classroom with augmented reality technologies. The design is presented along with a feasibility study that assesses the effect of the interface.","cites":"11","conferencePercentile":"73.68421053"},{"venue":"WMTE","id":"cb825777e110732bdf55cb6ee72a3bbeea73fe1a","venue_1":"WMTE","year":"2006","title":"Invisibility Considered Harmful: Revisiting Traditional Principles of Ubiquitous Computing in the Context of Education","authors":"Michael Eisenberg, Ann Eisenberg, Leah Buechley, Nwanua Elumeze","author_ids":"1749923, 2898007, 1742691, 2964702","abstract":"Ubiquitous computing, as a subfield of computer science, has traditionally been associated with a set of principles expressed (loosely but tellingly) with terms like transparency, invisibility, and the like: essentially, the idea is that people should be able to use ubiquitous computing artifacts while hardly being conscious that they are doing so. We argue that, as a design principle, \"invisibility\" has advantages in some domains; but that it has powerful, and ultimately counterproductive, connotations for educational design. We present an alternative set of potential design principles for educational ubiquitous computing, stressing values such as expressiveness, creative control, and aesthetics; and we illustrate these principles with several projects undertaken in our lab.","cites":"0","conferencePercentile":"10"}]}