{"WMTNAACL-HLT.csv":[{"venue":"WMT@NAACL-HLT","id":"e72b1c8f9ccfdd0e371111257362d3e59492fc7d","venue_1":"WMT@NAACL-HLT","year":"2012","title":"QCRI at WMT12: Experiments in Spanish-English and German-English Machine Translation of News Text","authors":"Francisco Guzmán, Preslav Nakov, Ahmed Thabet, Stephan Vogel","author_ids":"1838579, 1683562, 8494848, 1684854","abstract":"We describe the systems developed by the team of the Qatar Computing Research Institute for the WMT12 Shared Translation Task. We used a phrase-based statistical machine translation model with several non-standard settings, most notably tuning data selection and phrase table combination. The evaluation results show that we rank second in BLEU and TER for Spanish-English, and in the top tier for German-English.","cites":"3","conferencePercentile":"19.49152542"},{"venue":"WMT@NAACL-HLT","id":"20c8b9e1b39edbf539aa255b843430dfac89c682","venue_1":"WMT@NAACL-HLT","year":"2012","title":"Joint WMT 2012 Submission of the QUAERO Project","authors":"Markus Freitag, Stephan Peitz, Matthias Huck, Hermann Ney, Jan Niehues, Teresa Herrmann, Alexander H. Waibel, Hai Son Le, Thomas Lavergne, Alexandre Allauzen, Bianka Buschbeck-Wolf, Josep Maria Crego, Jean Senellart","author_ids":"1680950, 1700238, 1839533, 1685956, 2920247, 2244151, 4500589, 2784529, 3321150, 2311059, 1945886, 2209023, 3053934","abstract":"This paper describes the joint QUAERO submission to the WMT 2012 machine translation evaluation. Four groups (RWTH Aachen University, Karlsruhe Institute of Technology , LIMSI-CNRS, and SYSTRAN) of the QUAERO project submitted a joint translation for the WMT German→English task. Each group translated the data sets with their own systems and finally the RWTH system combination combined these translations in our final submission. Experimental results show improvements of up to 1.7 points in BLEU and 3.4 points in TER compared to the best single system.","cites":"4","conferencePercentile":"31.3559322"},{"venue":"WMT@NAACL-HLT","id":"7a97dc2a3d8dc2b50c157e153eb12dfb707fe65d","venue_1":"WMT@NAACL-HLT","year":"2012","title":"SPEDE: Probabilistic Edit Distance Metrics for MT Evaluation","authors":"Mengqiu Wang, Christopher D. Manning","author_ids":"3034293, 1812612","abstract":"This paper describes Stanford University's submission to the Shared Evaluation Task of WMT 2012. Our proposed metric (SPEDE) computes probabilistic edit distance as predictions of translation quality. We learn weighted edit distance in a probabilistic finite state machine (pFSM) model, where state transitions correspond to edit operations. While standard edit distance models cannot capture long-distance word swapping or cross alignments, we rectify these shortcomings using a novel pushdown automaton extension of the pFSM model. Our models are trained in a regression framework, and can easily incorporate a rich set of linguistic features. Evaluated on two different prediction tasks across a diverse set of datasets, our methods achieve state-of-the-art correlation with human judgments.","cites":"13","conferencePercentile":"64.40677966"},{"venue":"WMT@NAACL-HLT","id":"32d87adf6e551d5c166771a32ad1eb1c8010c5a0","venue_1":"WMT@NAACL-HLT","year":"2012","title":"Limsi @ Wmt12","authors":"Hai Son Le, Thomas Lavergne, Alexandre Allauzen, Marianna Apidianaki, Li Gong, Aurélien Max, Artem Sokolov, Guillaume Wisniewski, François Yvon","author_ids":"2784529, 3321150, 2311059, 2817917, 1703194, 1734827, 1774833, 1696542, 1846431","abstract":"This paper describes LIMSI's submissions to the shared translation task. We report results for French-English and German-English in both directions. Our submissions use n-code, an open source system based on bilingual n-grams. In this approach, both the translation and target language models are estimated as conventional smoothed n-gram models; an approach we extend here by estimating the translation probabilities in a continuous space using neural networks. Experimental results show a significant and consistent BLEU improvement of approximately 1 point for all conditions. We also report preliminary experiments using an \" on-the-fly \" translation model.","cites":"2","conferencePercentile":"9.322033898"},{"venue":"WMT@NAACL-HLT","id":"07efe6e165e3668fd449baea6b44c54e3fa9de11","venue_1":"WMT@NAACL-HLT","year":"2012","title":"The Karlsruhe Institute of Technology Translation Systems for the WMT 2012","authors":"Jan Niehues, Yuqi Zhang, Mohammed Mediani, Teresa Herrmann, Eunah Cho, Alexander H. Waibel","author_ids":"2920247, 2617419, 1861148, 2244151, 8115904, 4500589","abstract":"This paper describes the phrase-based SMT systems developed for our participation in the WMT12 Shared Translation Task. Translations for English↔German and English↔French were generated using a phrase-based translation system which is extended by additional models such as bilingual, fine-grained part-of-speech (POS) and automatic cluster language models and discriminative word lexica. In addition, we explicitly handle out-of-vocabulary (OOV) words in German, if we have translations for other morphological forms of the same stem. Furthermore, we extended the POS-based reordering approach to also use information from syntactic trees.","cites":"3","conferencePercentile":"19.49152542"}]}