{"WMuNeP.csv":[{"venue":"WMuNeP","id":"4f4017208eff655ecb86f9fec75625dddd7e01ed","venue_1":"WMuNeP","year":"2008","title":"On workload merging and filtering effects in hierarchical wireless media streaming","authors":"Jean Cao, Carey L. Williamson","author_ids":"2109500, 3152750","abstract":"In wireless networks, bandwidth is relatively scarce, especially for supporting on-demand media streaming. In wired networks, multicast stream merging is a well-known technique for scalable on-demand streaming. Also, caching proxies are widely used on the Internet to offload servers and reduce network traffic. This paper uses simulation to examine a caching hierarchy for wireless streaming video distribution, in combination with multicast stream merging. The main purpose is to gain insight into the filtering effects caused by caching and merging. Using request frequencies, entropy, and inter-reference times as metrics, we illustrate how merging, caching, and traffic aggregation affect the traffic characteristics at each level. The simulation results provide useful insights into caching performance in a video streaming hierarchy.","cites":"0","conferencePercentile":"18.75"},{"venue":"WMuNeP","id":"e934601eb31e393a01de09b4524a91e5a502967a","venue_1":"WMuNeP","year":"2008","title":"An in-network reduction algorithm for real-time wireless sensor network applications","authors":"André L. L. de Aquino, Antonio Alfredo Ferreira Loureiro, Antônio Otávio Fernandes, Raquel A. F. Mini","author_ids":"1754971, 1757448, 1751017, 2125743","abstract":"This work evaluates the OGK (On a Good Knowledge), an in-network data stream based reduction algorithm for real-time wireless sensor network (WSN) applications. OGK uses the knowledge about the stream items to choose the appropriate reduction solution in real-time WSN applications. OGK is integrated in forward tree routing phase to allow the stream item reduction, by routing nodes, when the stream item cannot be delivered on time. Simulation results reveal the efficiency of OGK in achieving the deadlines without loosing data representativeness in real-time applications.","cites":"1","conferencePercentile":"43.75"}]}