{"WMUTE.csv":[{"venue":"WMUTE","id":"cf730dadf63cbe374caa3cd7c53e7dbd2271acb9","venue_1":"WMUTE","year":"2008","title":"Analysis on the Prospects of Parent-Adolescent Communication Served by Mobile Technology","authors":"Shenggang Yang, Qian Li, Xiaochen Wang, Yushun Li, Ronghuai Huang","author_ids":"2007674, 7137586, 3735498, 3025772, 2231264","abstract":"Parent-child's relationships has attracted more and more attention reveals the lack of exploration of advanced technology in family education. Based on the collaborative project between Beijing Normal University and NOKIA, this article concerns about the prospects of providing services in family education by using mobile technology. This project is conducted by virtue of the combination of qualitative research methods and quantitative research methods. Survey results showed that mobile technology will do good to the parent-child's relationship. Based on the results, the author will analyze the possibilities of providing services in parent-adolescent communication. The author also hopes that this study could expand the scope of using technology in education, especially set a good application in the domain of family education. It can be said that mobile study in family education in China mainland is still a blank page. Family education [1] plays a vital role in the growth of children. The parent-child relationship [2] is the basic and most important one. As an effective means to achieve a good parent-child relationship, parent-adolescent communication's unique and irreplaceable role is becoming more apparent. In early stage, the project team used a radio messages assembly, group interviews (cluster sampling), and essay competition in K-12 students. Seven in-depth interviewers were selected from the groups participating by stratified sampling in mid-stage. In order to verify the rigor of the project, the project team used a questionnaire survey. The study sample covered institutions of higher learning, K-12 schools, kindergartens, ordinary families and radio stations and the sampling areas","cites":"2","conferencePercentile":"50"},{"venue":"WMUTE","id":"cb4ea4c511bae1e961b68e6b42266a22c7ff81b8","venue_1":"WMUTE","year":"2008","title":"Tools for Students Doing Mobile Fieldwork","authors":"Mattias Rost, Lars Erik Holmquist","author_ids":"2043689, 1696081","abstract":"Students are not always sitting at their desk but are also out in the world. In a university course teaching ethnography and design students were out in the field making observations and collecting data. We gave them access to a wiki, which they used to upload field notes and material as a support for collaboration. In this paper we present three tools we built and deployed to aid the students when in field and when collaborating. The first is a mobile tool used to gather data: a program running on the students' mobile phones let them take photos, record video and audio, and write simple text notes, which are automatically uploaded to the wiki. The second is an awareness tool that enables the students to quickly see what the others have done in the wiki. The third is a novel browser for the uploaded data, which relates objects by both time and location. We also talk about the experience from having students using the tools live during the course.","cites":"5","conferencePercentile":"66.66666667"},{"venue":"WMUTE","id":"045cf210a8693790a7e59a6d9f8e2d384858b9d9","venue_1":"WMUTE","year":"2010","title":"Go Math! How Research Anchors New Mobile Learning Environments","authors":"April Alexander, Kristen Pilner Blair, Shelley V. Goldman, Osvaldo Jimenez, Masataka Nakaue, Roy D. Pea, Andrew Russell","author_ids":"3197766, 2051968, 3139018, 2717689, 3275060, 2076328, 5886398","abstract":"A reciprocal research and design process (RR&D) became central to the development of mobile learning environments for families. Go Math! applications were developed to support families in the situations they face in their daily activities where problem solving involves mathematics. The foundation of the RR&D process is that it is effective for synthesizing design and development choices with consideration of the results of basic research on mathematics in everyday life, the voice of users, the social context of use, and mobile affordances. The RR&D process is described, and two mobile mathematics applications illustrate how the process maintains fidelity among related research, the development of design criteria, and user voice and practice. We consider the process important in the development of mobile learning environments.","cites":"3","conferencePercentile":"50"},{"venue":"WMUTE","id":"68d7fd2f6d6807161cfeb600e05e8b0ad8aaaf7f","venue_1":"WMUTE","year":"2010","title":"LET's GO! to the Creek: Co-design of Water Quality Inquiry Using Mobile Science Collaboratories","authors":"Heidy Maldonado, Roy D. Pea","author_ids":"2002142, 2076328","abstract":"—Learning ecological science content and inquiry strategies should increasingly use the new tools from science – sensors for data capture, information visualization for data-analysis, low-cost mobile computers and mobiles for field-based science. The LET'S GO! project seeks to develop, implement, research, and sustainably scale a new paradigm for fostering high school student learning in teams for ecological sciences. Our \"open inquiry\" vision uses mobile computing to provide open software tools/resources, participation frameworks for learner project collaboration, mobile media/data capture, analysis, reflection and publishing. We integrate geo-positional data sensing, multimedia communication, information visualization & Web 2.0 tools to create science learning collaboratories, using co-design methods with teachers, learners, developers, learning & domain scientists. The present paper describes the background for our project, related work, goals, and reports on the success of the co-design workshops and school pilots conducted last year. I. INTRODUCTION The LET'S GO! Project (Learning Ecology through Technologies from Science for Global Outcomes) aims to provide educational activities and tools for helping students participate in collaborative science inquiry involving local environmental data. This data is collected, analyzed, reflected on, and reported through mobile and sensor technologies. The activities are co-designed with teachers and administrators at the schools, then piloted to assess their feasibility and students' success. Currently, we have completed these phases of the project and are beginning trials at four schools. The present paper describes the background for our project, related work, goals, and reports on the success of the co-design workshops and school pilots conducted last year. Educational computing increasingly involves e-learning—distributed learning using online courseware or collaborative learning projects. Integration of 1:1 computer-to-learner models with wireless mobile computing provides innovative integrations of indoor/outdoor learning experiences [19] into \" seamless learning \" across learning contexts [4]. This indoor-outdoor integration introduces context awareness and","cites":"4","conferencePercentile":"81.25"},{"venue":"WMUTE","id":"3bcb4b09ed26201476308839eefc89fcacbb32c2","venue_1":"WMUTE","year":"2010","title":"Collaboration with Mobile Media: Shifting from 'Participation' to 'Co-creation'","authors":"Sarah Lewis, Roy D. Pea, Joseph Rosen","author_ids":"6096645, 2076328, 2149096","abstract":"While mobile social networking applications such as Twitter and Facebook have opened new possibilities for human interaction, the wellspring of potential for learning and collaboration with social media networks has barely begun to be tapped. Although these applications encourage people to be persistently aware of what friends and acquaintances do or care about, rarely do they foster a persistent sense of \" doing \" or \" caring \" together. We propose that social mobile applications to support distributed learning communities would benefit from a shift in framing, away from the popular \" participation \" model of mobile media to a \" co-creation \" model. We describe a mobile media application under development that supports collaboration via mobile media co-creation called \" Mobltz. \"","cites":"5","conferencePercentile":"100"}]}