{"WOA.csv":[{"venue":"WOA","id":"656001a175254a0586fd558dbebfc8d075cbca87","venue_1":"WOA","year":"2001","title":"A OO Framework for Multi-Agent Systems","authors":"Stefania Bandini, Flavio De Paoli, Sara Manzoni, Carla Simone","author_ids":"1701922, 1744309, 1718628, 1697525","abstract":"Multi-Agent Systems (MAS) are of great interest as they can be used to model complex phenomena that involve several actors that interact in various ways. This paper describes a framework to support the development of Multi-Agent Systems. The framework is based on the Reaction Diffusion Machine (RDM) and defines the run-time support for the L*MASS language. The language formalizes the concepts of the framework to provide designers with constructs that facilitate the development of Multi-Agent Systems. The underlying RDM ensures soundness to both language and framework. The work is still in progress; therefore, what is presented in this paper need to be further discussed and consolidated.","cites":"0","conferencePercentile":"25"},{"venue":"WOA","id":"336502786ac3438e8c12cb8c7ebf9c551d209c30","venue_1":"WOA","year":"2000","title":"OO Reactive Agents for RDM-Based Simulations","authors":"Stefania Bandini, Flavio De Paoli, Sara Manzoni, Carla Simone","author_ids":"1701922, 1744309, 1718628, 1697525","abstract":"The computer simulation of complex phenomena is a challenging issue for studying their properties. Several models and techniques have been developed in order to provide useful conceptual and computational frameworks. The aim of this paper is to present a simulation model based on the Reaction-Diffusion Machine (RDM) and to discuss its implementation by a system based on multi-agent and Object Oriented paradigms. The chemical extraction of substances in washing phenomena occurring in percolation processes has been considered as reference application.","cites":"1","conferencePercentile":"62.5"},{"venue":"WOA","id":"106771af7b17a22ee07d9d134185b2a5e71b745d","venue_1":"WOA","year":"2002","title":"Conceptual and concrete architectures in the design of CSCW applications","authors":"Daniela Micucci, Marcello Sarini, Carla Simone, Francesco Tisato, Andrea Trentini","author_ids":"1699669, 2525492, 1697525, 1687332, 3113298","abstract":"— CSCW applications support the development of various types of cooperative applications and their integration. However, little attention has been paid to the gap between the semantic level of articulation work and the semantic level of the implementation platform. This semantic level gap is widely recognized in CSCW as a big source of problems from the application usability point of view. The paper presents a framework for the construction of supports to articulation work which tries to overcome the semantic gap by starting from the requirements of articulation work and by identifying its conceptual model (components, their aggregations and communication language). This leads to a component based view of the resulting system, where components play active and specialized roles and interact via well identified communication patterns. In this view, it was natural to think of a conceptual architecture based on a multi-agent approach, where agents are heterogeneous. Finally, the paper shows how the conceptual architecture can be mapped onto a concrete architecture, whose characteristics are generality, efficiency, robustness and so on.","cites":"1","conferencePercentile":"42.30769231"},{"venue":"WOA","id":"bba26806a8edee08c7519574495fc90949716592","venue_1":"WOA","year":"2010","title":"Programming Open Systems with Agents, Environments and Organizations","authors":"Michele Piunti, Alessandro Ricci, Olivier Boissier, Jomi Fred Hübner","author_ids":"1831718, 1698051, 1683347, 1798785","abstract":"—MAS research pushes the notion of openness related to systems combining heterogeneous computational entities. Typically, those entities answer to different purposes and functions and their integration is a crucial issue. Starting from a comprehensive approach in developing agents, organizations and environments, this paper devises an integrated approach and describes a unifying programming model. It introduces the notion of embodied organization, which is described first focusing on the main entities as separate concerns; and, second, establishing different interaction styles aimed to seamlessly integrate the various entities in a coherent system. An integration framework, built on top of Jason, CArtAgO and Moise (as programming platforms for agents, environments and organizations resp.) is described as a suitable technology to build embodied organizations in practice.","cites":"0","conferencePercentile":"19.04761905"},{"venue":"WOA","id":"02b46d1cc53716aa6563ce07b84a20ce47e8772c","venue_1":"WOA","year":"2005","title":"CASMAS: An Agent-Based Support for Modulated Participation in Cooperative Applications","authors":"Federico Cabitza, Marco P. Locatelli, Marcello Sarini","author_ids":"3037324, 2700201, 2525492","abstract":"model to design an environment of collaborative applications by taking into account the notion of community. Within this model, communities are characterized by declarative rules that express and shape the participative behavior of the community members. The degree of participation of each member can dynamically change according to her physical location and her position in the logical space of the applications used within the community. The paper shows how this approach can facilitate the design of collaborative applications that are community-aware, that is augmented with mechanisms by which to manage different levels of participation of the community members. I. BACKGROUND AND MOTIVATIONS S widely recognized in the specialistic literature [1] the multi-agent approach makes easier to define a clear separation between the units of computation and the interactions among them in order to achieve some application goals through \"separation of concern\" and modularity [2]. Moreover agents can be conceived of as useful tools to describe (complex) systems from a systemic point of view. Because of the complexity of systems to design, it is impossible to predict (and design) in advance all the possible behaviors of the running system: hence agents are provided with simple behaviors and interaction capabilities and let interact within some computational environment so that the system is able to cope with unpredictable patterns of conditions by exhibiting an overall behavior that is an emerging property of the system itself [3]. The relevance of these approaches is also due to some important characteristics that they provide to designers: distributedness, openness, scalability, incremental design. In fact, agents are inherently distributed, and this makes the system more easily open, in terms of the possibility to add new elements given that they behave according to the established protocol; and robust, in terms of easy substitution of malfunctioning agents and of modification of incrementally designed agents. More recently the characteristics of agent-based approaches have been also considered in the light of the design of applications that support collaboration among people [4]. In the area of computer supported cooperative work (CSCW) cooperative applications pose strong requirements in terms of flexibility, adaptability, openness to environment in order to reflect the complexities of real work settings, that is of environments (or workplaces) where people work distributed in space, and can freely join and leave dynamically collaboration spaces, where collaborative behaviors can change according to the context. Agent-based approaches have been proposed to support different aspects …","cites":"0","conferencePercentile":"18.75"},{"venue":"WOA","id":"062fc9d218144caaf947aa84c45723118feb0856","venue_1":"WOA","year":"2006","title":"Mechanisms of Self-Organization in Pervasive Computing","authors":"Nicola Bicocchi, Marco Mamei, Franco Zambonelli","author_ids":"1693197, 1715670, 1684412","abstract":"in overlay knowledge network offering applications comprehensive and understandable information about their computational environment.","cites":"0","conferencePercentile":"10.71428571"},{"venue":"WOA","id":"77ba1cab6bcb30e34b44ffcf491b8a29941c20d5","venue_1":"WOA","year":"2012","title":"The Indiana MAS Project: Goals and Preliminary Results","authors":"Angela Locoro, Viviana Mascardi, Daniela Briola, Maurizio Martelli, Massimo Ancona, Vincenzo Deufemia, Luca Paolino, Genny Tortora, Giuseppe Polese, Rita Francese","author_ids":"1756869, 1719055, 1721729, 8262155, 3276013, 1734026, 1715336, 1732546, 1745736, 1721733","abstract":"Ricerca 2010 \" program, aims at providing a framework for the digital protection and conservation of rock art natural and cultural heritage sites, by storing, organizing and presenting information about them in such a way to encourage scientific research and to raise the interest and sensibility towards them from the common people. The project involves two research units, namely Genova (Dipartimento di Informatica, Bioingegneria, Robotica e Ingeg-neria dei Sistemi) and Salerno (Dipartimento di Matematica e Informatica), for a period of 36 months, starting from march 8th, 2012. The technologies adopted in the project range from agents to ontologies, as requested by the complex nature of the platform, where each module is devoted to a specific task: sketch and symbol recognition, semantic interpretation of complex visual scenes, multi-language text understanding, storing, classification and indexing of multimedia and heterogeneous digital objects. All of them should cooperate and coordinate in order to enable higher level components to reason on them and to detect relationships among different digital objects, hence providing new hypothesis based on such relationships.","cites":"3","conferencePercentile":"92.30769231"},{"venue":"WOA","id":"720eb1396a268b8c39f71ca2703012c05f19990e","venue_1":"WOA","year":"2000","title":"An Agent-based Paradigm for Allocating Multi-Provider Service Demands","authors":"Monique Calisti, Boi Faltings","author_ids":"2836202, 1735128","abstract":"The increasing number of competitors and the growing traffic demand are the main factors pushing for a more dynamic and flexible service demand allocation mechanism. Human interactions are becoming more and more inadequate to solve this task, since many different issues have to be considered for optimising all possible choices and strategies. Software tools are becoming fundamental for supporting human decisions and/or for reducing the need of human intervention. Nowadays, agent technology promises a good support for pro-active and autonomous network control , that would enable the automation of many network provider tasks. In order to prove the feasibility of such automation through the use of agents, a multi-agent simulator for the allocation of service demands has been developed. This paper describes the simulator and aims to give a useful feedback for agent developers.","cites":"0","conferencePercentile":"28.125"},{"venue":"WOA","id":"9881f31f1e0164d1eb8cf8ae13e8c8d96aa5f67f","venue_1":"WOA","year":"2001","title":"Mobile Agent Organizations","authors":"Giacomo Cabri, Letizia Leonardi, Marco Mamei, Franco Zambonelli","author_ids":"1682769, 1679937, 1715670, 1684412","abstract":"Mobile agents are a useful paradigm – other than a useful technology – for the development of complex Internet applications. However, the effective development of mobile agent applications requires suitable models and infrastructures. This paper proposes an organizational approach to the high-level design of mobile agent applications. The idea is to models the Internet as a multiplicity of local and active organizational contexts, intended as the places where coordination activities of application agents occur and are ruled. The paper discusses the advantages and the generality of such an approach, also with the help of a case study in the area of tourist assistance.","cites":"1","conferencePercentile":"53.125"},{"venue":"WOA","id":"035fb29f899978fcad71b2689e9df77a8e19871b","venue_1":"WOA","year":"2002","title":"Tuples On The Air: a Middleware for Context-Aware Multiagent Systems","authors":"Marco Mamei, Franco Zambonelli, Letizia Leonardi","author_ids":"1715670, 1684412, 1679937","abstract":"We present TOTA (\" Tuples On The Air \"), a novel middleware for supporting adaptive context-aware activities in multi agent systems. The key idea in TOTA is to rely on spatially distributed tuples for both representing contextual information and supporting uncoupled and adaptive interactions between application agents. On the one hand, the middleware propagates tuples across a network on the basis of application-specific patterns, to define sorts of \" computational fields \" , and adaptively reshape the resulting distributed structures accordingly to changes in the network scenario. On the other hand, application agents can locally \" sense \" these fields and can rely on them for both acquiring contextual information and carry on complex coordination activities in an adaptive way. Several examples in different scenarios show the effectiveness of such an approach.","cites":"2","conferencePercentile":"73.07692308"},{"venue":"WOA","id":"3459c2bed587280b3a928670c95bc9cdfa69314c","venue_1":"WOA","year":"2005","title":"Pervasive Pheromone-based Interaction with RFID Tags","authors":"Marco Mamei, Franco Zambonelli","author_ids":"1715670, 1684412","abstract":"Despite the growing interest in pheromone-based interaction to enforce adaptive and context-aware coordination, the number of deployed systems exploiting digital pheromones to coordinate the activities of situated autonomous agents is still very limited. In this article, we present a simple low-cost and general-purpose implementation of a pheromone-based interaction mechanism for pervasive environments. This is realized by making use of RFID tags to store digital pheromones and by having humans or robots spread/sense pheromones by properly writing/reading RFID tags populating the surrounding physical environment. We exemplify and evaluate the effectiveness of our approach via an application for object-tracking. This application allows robots and humans to find forgotten-somewhere objects by following pheromones trails associated with them. In addition, we sketch further potential applications of our approach in pervasive computing scenarios, discuss related work in the area, and identify future research directions.","cites":"32","conferencePercentile":"100"},{"venue":"WOA","id":"7a9636040f98a5eabe2529f8fd1fef66872877b6","venue_1":"WOA","year":"2006","title":"The W4 Model and Infrastructure for Context-aware Browsing The World","authors":"Gabriella Castelli, Alberto Rosi, Marco Mamei, Franco Zambonelli","author_ids":"2880880, 3274074, 1715670, 1684412","abstract":"imminent mass deployment of pervasive computing technologies such as sensor networks and RFID tags, together with the increasing participation of the Web community in feeding geo-located information within tools such as Google Earth, will soon make available an incredible amount of information about the physical and social worlds and their processes. This opens up the possibility of exploiting all such information for the provisioning of pervasive context-aware services for \" browsing the world \" , i.e., for facilitating users in gathering information about the world, interacting with it, and understanding it. However, for this to occur, proper models and infrastructures must be developed. In this paper we propose a simple model for the representation of contextual information, the design and implementation of a general infrastructure for browsing the world, as well as some exemplar services we have implemented over it.","cites":"3","conferencePercentile":"80.35714286"},{"venue":"WOA","id":"5ff7409e61e606f81f8fff2b18e357bfb6424b02","venue_1":"WOA","year":"2016","title":"Supporting Learner-to-Learner Interactions Using Online Social Network Information","authors":"Pasquale De Meo, Fabrizio Messina, Domenico Rosaci, Giuseppe M. L. Sarnè","author_ids":"1709372, 7946796, 1727476, 7600364","abstract":"—E-Learning students can benefit from proper class formation process based on the student needs. In particular, Online Social Networks make available data concerning users' interactions, as skills and trust relationships, that are behind the dynamics of thematic social network groups, and can be explouted to form e-Learning classes. To this aim, we propose a model based on such information, which are properly combined to support the dynamics of e-Learning classes on Online Social Networks. The approach provide a way to give suggestions to users about the best classes to join with and to class adminastrors the best students to accept. The proposed approach has been tested by simulating an e-Learning scenario within a large social network by showing its capability to satisfy all the actors.","cites":"0","conferencePercentile":"50"},{"venue":"WOA","id":"986a863b1442bd506b9c088c92ab5383437aea1a","venue_1":"WOA","year":"2010","title":"From Service-Oriented Architectures to Nature-Inspired Pervasive Service Ecosystems","authors":"Franco Zambonelli, Mirko Viroli","author_ids":"1684412, 1728548","abstract":"—Emerging pervasive computing scenarios require open service frameworks promoting situated adaptive behaviors and supporting diversity in services and long-term evolvability. We argue that this naturally calls for a nature-inspired approach , in which pervasive services are modeled and deployed as autonomous individuals in an ecosystem of other services, data sources, and pervasive devices. As an evolution of standard service-oriented architectures, we present a general framework framing the concepts expressed, and discuss a number of natural metaphors that we can adopt to concretely incarnate the proposed framework and implement pervasive service ecosystems. I. INTRODUCTION The ICT landscape, yet notably changed by the advent of ubiquitous wireless connectivity, is further reshaping due to the increasing deployment of pervasive computing technologies. Via RFID tags and alike, objects will carry on digital information of any sort. Wireless sensor networks and camera networks will be spread in our cities and buildings to monitor physical phenomena. Smart phones and alike will increasingly sense and store notable amounts of data related to our personal, social and professional activities, other than feeding (and being fed by) the Web with spatial and social real-time information [1]. This evolution is contributing to building integrated and dense infrastructures for the pervasive provisioning of general-purpose digital services. If all their components will be able to opportunistically connect with each other, such infrastructures can be used to enrich existing services with the capability of autonomously adapting their behavior to the physical and social context in which they are invoked, and will also support innovative services for enhanced interactions with the surrounding physical and social worlds [2]. Users will play an active role, by contributing data and services and by making available their own sensing and actuating devices. This will make pervasive computing infrastructures as participatory and capable of value co-creation as the Web [3], eventually acting as globally shared substrates to externalize and enhance our physical and social intelligence, and make it become collective and more valuable. We are already facing the commercial release of a variety of early pervasive services trying to exploit the possibilities opened by these new scenarios: GPS navigator systems providing real-time traffic information and updating routes accordingly, cooperative smart phones that inform us about","cites":"2","conferencePercentile":"78.57142857"},{"venue":"WOA","id":"07f5a8611e2ad1d89d83d223bbd28fb63af9660c","venue_1":"WOA","year":"2000","title":"A Web Infrastructure for People and Agent Interaction and Collaboration","authors":"Giacomo Cabri, Letizia Leonardi, Franco Zambonelli","author_ids":"1682769, 1679937, 1684412","abstract":"Internet pervasive services call for flexible supports to enable a wide degree of collaboration. On the one hand, many people are connected to the Internet and surf the Web not only to retrieve information, but also to carry out several kinds of different tasks via the on-line services. On the other hand, the Internet is likely to be soon populated by software agents that will act in behalf of users, \" intelligent \" enough to achieve the better result without boring their users. In this paper we present a Web-based modular architecture that permits interaction and collaboration among people and agents, leading to a more fruitful exploitation of the capabilities offered by the Internet. A negotiation application based on auctions is used to show the advantages of the proposed architecture.","cites":"1","conferencePercentile":"62.5"},{"venue":"WOA","id":"aec5bd6f19153a8b1b4d58f0e124e7611d0d1e05","venue_1":"WOA","year":"2000","title":"Designing an Agent to Support Interactive Access to Museum Information","authors":"Luisa Marucci, Fabio Paternò","author_ids":"2431867, 1793926","abstract":"If we consider most applications accessible through the Web, we can notice a lack of support able to adapt to the different information needs that different users may have regarding a certain topic. Adaptive support, by which an application provides different information taking into account the users' interactions, can provide useful assistance. However, completely automatic adaptive support can still be confusing for users who may not understand the reasons for the dynamic change in behaviour of the application. Thus, users may benefit from the introduction of agents aiming at providing interactive support to access information of interest. In this paper, we present an approach that provides an agent (a virtual assistant) able to implement adaptive behaviour in such a way as to support a Web visit to museum information.","cites":"0","conferencePercentile":"28.125"},{"venue":"WOA","id":"409c5178b366b67fb6778878df0ae68ce015bca2","venue_1":"WOA","year":"2002","title":"Un linguaggio per esprimere transizioni","authors":"Paolo Bottoni, Maria De Marsico, Paolo Di Tommaso, Stefano Levialdi, Domenico Ventriglia","author_ids":"1781927, 1763890, 3062856, 1990702, 2059031","abstract":"— I linguaggi di specifica del comportamento di agenti, e pì u in generale di sistemi reattivi, spesso utilizzano notazioni grafiche per esprimere le configurazioni significative dello stato dell'agente e le trasformazioni ammissibili di tali configurazioni. L'espressione dei due aspettipù o essere delegata a diversi tipi di diagrammi, o venire incorporata in un unico diagramma. Inoltre, si possono sviluppare diagrammi comportamentali per diverse componenti del sistema, eventualmente impiegando diagrammi di tipo diverso per ogni sottosistema. A un livello astratto, tutti questi diagrammi esprimono qualche forma di trasformazione del sistema, chepù o essere caratterizzata esprimendone le pre-e post-condizioni, e una politica di esecuzione delle trasformazioni. In questo lavoro, pro-poniamo un approccio uniforme alla gestione di transizioni, in-dipendente dalla notazione diagrammatica adottata, e chepù o es-sere usata per stabilire corrispondenze tra modifiche della rappre-sentazione visuale e trasformazioni del modello sottostante. Interaction Machines [ACP93], a sua volta una visione astratta del modello di LO (Linear Objects) [AP91]. Questi modelli sono basati sul cosiddetto frammento moltiplicativo della logica lineare [Gir95], [And92], in cui un passo di computazionè e es-senzialmente costituito della produzione e del consumo di in-siemi finiti di risorse in un resource pool, mentre alcune risorse possono essere trasmesse in modo broadcast ad altri agenti. A differenza del modello LO, in WIPPOG non permettiamo la creazione di nuovi agenti, e consideriamo un meccanismo di registrazione mediante interfacce di import e export. Un simile meccanismò e stato usato nell'ambiente Forumtalk [And95], dove le risorse possono venire trasmesse sia ad altri agenti nella stessa locazione virtuale, sia ad agenti le cui locazioni sono state registrate per l'import. In Forumtalk, come in LO, le risorse ricevute vengono internalizzate all'agente, senza distin-guerle da quelle prodotte internamente. Molti modelli definiscono sistemi reattivi o concorrenti in modo indipendente dalle realizzazioni specifiche, ma tenendo in considerazione le componenti generali di una trasfor-mazione. Un esempio di questo approcciò e il formalismo","cites":"0","conferencePercentile":"15.38461538"},{"venue":"WOA","id":"62b1b31758ec6043afa58cd2c102fc4a8408b065","venue_1":"WOA","year":"2012","title":"Behavior Predictability Despite Non-Determinism in the SAPERE Ecosystem Preliminary Ideas","authors":"Gabriella Castelli, Marco Mamei, Alberto Rosi, Franco Zambonelli","author_ids":"2880880, 1715670, 3274074, 1684412","abstract":"—How can we have confidence that self organizing systems actually do what we expect them to? In this position paper we overview some mechanisms at the basis of controlling and predicting the behavior of autonomous and self-organizing systems despite components' autonomy and non-deterministic behavior. In particular we focus the analysis on the SAPERE ecosystem as an exemplary model to frame the discussion. We identify three main directions with which to gain confidence on the overall system behavior: (i) confidence from layering, (ii) confidence from large numbers, (iii) confidence form the structure and dynamics of the state space. In the paper we describe this ideas and their implication in the design of self organizing applications. I. INTRODUCTION The increasing evolution and spread of pervasive computing technologies is defining the basis for the emergence of a dense and global decentralized infrastructure for the creation of general-purpose pervasive services. In particular, such novel pervasive application scenarios call for adopting self-organizing service coordination approaches comprising autonomous and adaptive components to interact and coordinate with each other to provide services and applications. A number of approaches, taking inspiration from swarm intelligent examples [9], [12], [8], try to achieve the above results by making use of a large number of simple autonomous components, that self-organize to achieve a desired application. Examples in this direction are the work on collective robotics [12], [13], autonomous and adaptive systems and distributed computing [17], [18], [6]. One of the main scientific questions in this kind of scenarios is: How can we have confidence that self organizing systems actually do what we expect them to? Providing convincing answers to that questions is fundamental to engineer robust and dependable systems based on the above self-organizing principles. In this position paper we present thee main directions showing guidelines on to design self organizing applications so as to retain confidence in their behavior. In particular we identified three main mechanisms to be considered 1) Confidence from layering. System's reliable func-tionalities are realized on top of the self-aware layer. In","cites":"1","conferencePercentile":"73.07692308"},{"venue":"WOA","id":"6d80d564dcb93c9cc7ea657f84ed3376f745f5a0","venue_1":"WOA","year":"2015","title":"Coordination of Large-Scale Socio-Technical Systems: Challenges and Research Directions","authors":"Andrea Omicini, Franco Zambonelli","author_ids":"3119182, 1684412","abstract":"—Most of the emerging software-intensive systems nowadays are very large-scale ones, and inherently socio-technical. In this position paper, we argue that the peculiar features of such emerging systems (up to millions of interacting components, lacking central control, mixing humans and artificial components) call for novel approaches to coordinate the overall activities and functionalities. Accordingly, we discuss the key challenges to be faced by research in coordination models and technologies, and try to sketch some promising research directions.","cites":"0","conferencePercentile":"28.26086957"},{"venue":"WOA","id":"127e570a9de62df0e5bc655bb38f560142d5dcdd","venue_1":"WOA","year":"2002","title":"Applying Tropos Methodology to a real case study: Complexity and Criticality Analysis","authors":"Maddalena Garzetti, Paolo Giorgini, John Mylopoulos, Fabrizio Sannicolò","author_ids":"3138075, 2247594, 1750566, 2521915","abstract":"— Currently in Requirements Engineering the attention is being focused more and more on the understanding of a problem by studying the existing organizational setting in which the system will operate. In this paper we present the application of the Tropos early requirements analysis to a real case study, the Ice Co. We introduce a new type of analysis for actor diagrams based on two different parameters, complexity and criticality, and we show the results we obtained during the case study.","cites":"10","conferencePercentile":"100"},{"venue":"WOA","id":"2b5a45e318079d3edb815f45eb27d9c93063a5e5","venue_1":"WOA","year":"2016","title":"Towards a Discipline of IoT-Oriented Software Engineering","authors":"Franco Zambonelli","author_ids":"1684412","abstract":"—Despite the rapid progresses in IoT research, a general principled software engineering approach for the systematic development of IoT systems and applications is still missing. In this article, by synthesizing form the state of the art in the area, we attempt at framing the key concepts and abstractions that revolve around the design and development of IoT systems and applications, and that could represent the ground on which to start shaping the guidelines of a new IoT-oriented software engineering discipline.","cites":"0","conferencePercentile":"50"},{"venue":"WOA","id":"c73945b25786ff4d715f355b894a5a1556fae8ee","venue_1":"WOA","year":"2001","title":"Towards an Agent Oriented Approach to Software Engineering","authors":"Anna Perini, Paolo Bresciani, Paolo Giorgini, Fausto Giunchiglia, John Mylopoulos","author_ids":"1754184, 1861562, 2247594, 1720285, 1750566","abstract":"This paper describes a methodology for agent oriented software engineering, called Tropos 1. Tropos is based on three key ideas. First, the notion of agent and all the related mentalistic notions (for instance: goals and plans) are used in all phases of software development, from the early analysis down to the actual implementation. Second, Tropos covers also the very early phases of requirements analysis, thus allowing for a deeper understanding of the environment where the software must operate, and of the kind of interactions that should occur between software and human agents. Third, Tropos adopts a transformational approach to process artifacts refinement. The methodology is partially illustrated with the help of a case study.","cites":"35","conferencePercentile":"100"},{"venue":"WOA","id":"8fd4aaae74dc537f9def2abe0df6999a9e723aa4","venue_1":"WOA","year":"2011","title":"Managing Unavailabilities in a Dynamic Scenario Following an Agent-Based Approach","authors":"Angela Locoro, Viviana Mascardi, Franco Mortara, Renato Sanna","author_ids":"1756869, 1719055, 7999438, 2098600","abstract":"—The correct management of resources that can become unavailable over time and the efficient (in terms of both cost and time) reallocation of the services they provided before becoming unavailable, is an open problem that arises in a wide range of application domains. Despite to some differences, many scenarios spanning very different domains, from logistics to industrial automation, from telecommunication to water systems, may be considered as instances of a more general situation, and the actions to take in order to solve the unavailability problem follow similar patterns. In this paper we discuss the implementation of a multiagent system for solving unavailability problems in an artificial-although realistic-scenario which takes inspiration from to the electricity power network domain.","cites":"2","conferencePercentile":"70"},{"venue":"WOA","id":"63eeec2bd9cdf512e35a894d8cbe66f4452fa3a9","venue_1":"WOA","year":"2011","title":"Coordinating Spatially-Situated Pervasive Service Ecosystems","authors":"Mirko Viroli, Elena Nardini, Gabriella Castelli, Marco Mamei, Franco Zambonelli","author_ids":"1728548, 2215491, 2880880, 1715670, 1684412","abstract":"—Technology evolution is providing new pervasive service scenarios characterised by a huge number of distributed and dynamic devices. Accordingly, a new generation of services and infrastructures are emerging which support situatedness, adaptivity and diversity. In this paper we model the overall world of services, data and devices, as a distributed computational ecosystem. Each entity will be modelled as an autonomous, spatially-situated individual of the ecosystem, whose existence is reified by an LSA (Live Semantic Annotation). Ecosystem's behaviour is controlled by coordination rules called eco-laws, which are sort of chemical-like reactions evolving the population of LSAs. We describe an architecture supporting this vision, a formal model of eco-laws, and finally show their usefulness in a scenario of crowd steering through pervasive displays.","cites":"3","conferencePercentile":"84"}]}