{"WOCC.csv":[{"venue":"WOCC","id":"d8e62959b5bbb9f3d804fcfdf1724053329cf21e","venue_1":"WOCC","year":"2014","title":"Identifying user clicks based on dependency graph","authors":"Jun Liu, Cheng Fang, Nirwan Ansari","author_ids":"1843598, 2112223, 1697417","abstract":"—Identifying user clicks from a large number of measured HTTP requests is the fundamental task for web usage mining, which is important for web administrators and developers. Nowadays, the prevalent parallel web browsing behavior caused by multi-tab web browsers renders accurate user click identification from massive requests a great challenge. In this paper, we propose a dependency graph model to describe the complicated web browsing behavior. Based on this model, we develop two algorithms to establish the dependency graph for measured requests, and identify user clicks by comparing their probabilities of being primary requests with a self-learned threshold. We evaluate our method with a large dataset collected from a real world mobile core network. The experimental results show that our method can achieve high accurate user clicks identification.","cites":"2","conferencePercentile":"92.85714286"},{"venue":"WOCC","id":"0fb1c478d3d60eb098bf847e8980fbcb74bff8e7","venue_1":"WOCC","year":"2013","title":"Performance analysis of a selective decode-and-forward cooperative system with SFBC and BICM-OFDM","authors":"Xiaofei Xu, Limin Xiao, Xin Qi, Jing Wang","author_ids":"6030324, 5537441, 1720357, 1743861","abstract":"—In this paper, we analyze the bit error rate (BER) performance of selective decode-and-forward (DF) cooperative communications incorporating space-frequency block coding (SF-BC), bit-interleaved coded modulation (BICM) and orthogonal frequency division multiplexing (OFDM). For the classical 3-node cooperation model, a tight upper bound of BER for the coded system under Rayleigh fading channels is derived. By uniting the analysis for multi-antenna cooperative schemes and the analysis for BICM under a common framework, the upper bound is proved valid for moderate SNR regime. With reasonable simplifications in the analysis, an asymptotic PEP expression that takes into account the effect of space-frequency coding, channel coding and the channel parameters is also derived, and gives insights on the diversity gain of the system. The results are validated by simulations under various settings. I. INTRODUCTION Cooperative diversity techniques offer additional diversity gains than conventional wireless communication systems, by exploiting one or more relay nodes in the transmission process. It has drawn extensive interests in academia, and has become a promising option in future cellular and ad-hoc networks. Two basic yet effective protocols, amplify-and-forward (AF) and decode-and-forward (DF), are proposed in [1]. And contributions from information theoretic views have been abundant, e.g. [2] and references therein. Moreover, Multiple-Input-Multiple-Output (MIMO) techniques have been extensively incorporated in the research of cooperative systems, to enhance performance by exploiting extra spatial dimensions. Space-Time Block Coding (STBC) and Space-Frequency Block Coding (SFBC) [3] are among the common choices for diversity gains due to their simple structure. In the existing literatures on cooperative diversity, most assume un-coded transmission and/or frequency flat fading channels for ease of analysis, but the results can hardly be applied in realistic wideband channels with severe frequency selectivity. Others consider the realistic scenarios, but concentrated on the analysis for asymptotic performance. In [4] and","cites":"0","conferencePercentile":"33.33333333"}]}