{"WODA_06.csv":[{"venue":"WODA '06","id":"00a827396baedb0e588b6ac8f71921ce8c13990f","venue_1":"WODA '06","year":"2006","title":"A dynamic analysis for revealing object ownership and sharing","authors":"Derek Rayside, Lucy Mendel, Daniel Jackson","author_ids":"2044704, 3216785, 3902081","abstract":"We present a dynamic analysis for inferring object ownership and sharing, defined in terms of the <i>write control graph</i>. We render the results in an interactive hierarchical matrix visualizer.The purpose of the analysis and visualization is to reveal object ownership and sharing relations in the program, to facilitate program understanding and modification tasks.","cites":"21","conferencePercentile":"81.81818182"},{"venue":"WODA '06","id":"32879544628e429c76d4e63368fe789defeec93e","venue_1":"WODA '06","year":"2006","title":"Web application characterization through directed requests","authors":"Sebastian Elbaum, Kalyan-Ram Chilakamarri, Marc Fisher, Gregg Rothermel","author_ids":"1793503, 2937409, 1770207, 1722304","abstract":"Web applications are increasingly prominent in society, serving a wide variety of user needs. Engineers seeking to enhance, test, and maintain these applications must be able to understand and characterize their interfaces. Third-party programmers (professional or end user) wishing to incorporate the data provided by such services into their own applications would also benefit from such characterization when the target site does not provide adequate programmatic interfaces. In this paper, therefore, we present methodologies for characterizing the interfaces to web applications through a form of dynamic analysis, in which directed requests are sent to the application, and responses are analyzed to draw inferences about its interface. We also provide mechanisms to increase the scalability of the approach. Finally, we evaluate the approach's performance on three well-known, non-trivial web applications.","cites":"15","conferencePercentile":"63.63636364"}]}