{"WoMO.csv":[{"venue":"WoMO","id":"088b4d6babf2c092585836ef497e527919755faf","venue_1":"WoMO","year":"2008","title":"POAF: Portable Ontology Aligned Fragments","authors":"Yannis Kalfoglou, Paul R. Smart, Dave Braines, Nigel Shadbolt","author_ids":"3104575, 2920835, 2215679, 1705314","abstract":"In today's semantic web, ontology fragmentation and mo-dularization are considered as important tasks due to the size and complexity of prime ontologies. At the same time, the ontology alignment community thrives with solutions for discovering and producing alignments between semantically related concepts. However, these are seldom used in bulk and their subsequent re-use is somewhat problematic. In this paper we set to explore these issues from a practical viewpoint: use ontology alignments to inform an ontology fragmentation strategy for the benefit of exposing and distributing rich ontology aligned fragments.","cites":"6","conferencePercentile":"87.5"},{"venue":"WoMO","id":"0dc788e444b2e98c2ef9be6d8050d340870bc6df","venue_1":"WoMO","year":"2006","title":"Towards Structural Criteria for Ontology Modularization","authors":"Anne Schlicht, Heiner Stuckenschmidt","author_ids":"1696045, 1698459","abstract":"Recently, the benefits of modular representations of ontolo-gies has been recognized by the semantic web community. Existing methods for splitting up models into modules either optimize for completeness of local or for the efficiency of distributed reasoning. In our work on semantics-based P2P systems, we are also concerned with the additional criteria of robustness or reasoning in cases where peers are unavailable and with ease of maintenance. We define a number of structural criteria for modularized ontologies and argue why these criteria are suitable for estimating efficiency, robustness and maintainability. We apply the criteria to a number of modularization approaches and discuss the trade-offs made. Based on the discussion we propose a general quality measure for modular representations in the context of our use case. 1 Motivation The problem of modularizing ontologies in the sense of splitting up an existing ontology into smaller, interconnected parts has recently been discussed by a number of researchers (see for example [10, 1, 9]). These approaches differ significantly in terms of the concrete goal of the modularization and consequently in terms of the criteria used to determine a good modularization. In our work we are concerned with the automatic modularization of ontologies to support a distribution of knowledge in a P2P network in such a way that following requirements are fulfilled: Efficiency Reasoning in the distributed system should be efficient. This also requires that communication costs, which are known to be a major bottleneck in distributed systems are minimized. Robustness In a P2P network, single peers can be temporarily or permanently unreachable. The impact of such failures on the completeness of reasoning should be minimized. Maintainability Ontologies evolve over time and the corresponding changes need to be propagated through the network. The number of changes and the required costs for computing necessary changes should be minimized. It is obvious that these are conflicting requirements that need to be balanced in order to determine an optimal strategy for modularization. Similar problems","cites":"11","conferencePercentile":"62.5"},{"venue":"WoMO","id":"8064cc3fb5bed61a447c4ca9ecde3d52d0bd5d7e","venue_1":"WoMO","year":"2007","title":"The State of Multi-User Ontology Engineering","authors":"Julian Seidenberg, Alan L. Rector","author_ids":"1923489, 8575990","abstract":"Collaborative ontology engineering enables the creation of large complex ontologies. However, few projects successfully perform such multiuser ontology modeling. This paper gives an overview of ten different ontology engineering projects' infrastructure, architecture and workflows. It especially focuses on issues regarding collaborative ontology modeling. The survey leads on to a discussion of the relative advantages and disadvantages of asynchronous and synchronous modalities of multiuser editing. This discussion highlights issues, trends and problems in the field of multiuser ontology development.","cites":"8","conferencePercentile":"87.5"},{"venue":"WoMO","id":"d6b61fa1ccd397774541a34228a02de0e380a674","venue_1":"WoMO","year":"2006","title":"Implementing Modular Ontologies with Distributed Description Logics","authors":"Heiner Stuckenschmidt","author_ids":"1698459","abstract":"In an earlier paper, we presented a logical framework for representing and reasoning with modular ontologies with a special focus on supporting localized reasoning and integrity in the face of changes. This framework while being based on a formal semantics, was not specific to a particular logic used to specify ontologies and links between modules. As a result, no system was provided that implemented the ideas presented in that paper. In this work, we close this gap by explaining, how the general framework for modular ontologies can be mapped onto distributed description logics and implemented using the DRAGO reasoning system. In particular, we refine the notion of modular ontologies to the case where local ontologies are represented in SHIQ. We define a sound and complete inference rule for modular ontologies based distributed decsription logic and analyze the worst case complexity of reasoning in the framework. We also briefly discuss the DRAGO system and describe how our framework can be mapped on the representations supported by DRAGO. The benefits of modularization have been acknowledged in many area of computer science. With the increasing use of ontologies in real applications, the need for modular representations that support selective reuse, easier maintenance and efficient localized reasoning has been recognized by a number of researchers (e.g. [2], [1], [5]). In [12] we proposed a representational framework for modular ontologies and discussed the problem of maintaining integrity in a system of connected modules. In particular, we proposed to extend description logics with the notion of external concepts that are defined in terms of conjunctive queries over the vocabulary of other modules. We proposed to compile implied subsumption relations to facilitate local reasoning and defined the notion of integrity of compiled knowledge. While a number of abstract definitions and algorithms were given in that paper, there was no clear indication of how to implement the approach using existing technologies. In this paper, we fill this gap by explicitly linking the notion of modular ontologies to Distributed Description Logics were the language of the local models is SHIQ. This enables us to use existing technology, in particular the DRAGO reasoning system [10]","cites":"1","conferencePercentile":"12.5"},{"venue":"WoMO","id":"c4aec6528af2e99696f6493739a98da07717ce4a","venue_1":"WoMO","year":"2007","title":"Alignment-based Modules for Encapsulating Ontologies","authors":"Jérôme Euzenat, Antoine Zimmermann, Frederico Luiz Gonçalves de Freitas","author_ids":"1800811, 1776818, 2993144","abstract":"Ontology engineering on the web requires a well-defined ontology module system that allows sharing knowledge. This involves declaring modules that expose their content through an interface which hides the way concepts are modeled. We provide a straightforward syntax for such modules which is mainly based on ontology alignments. We show how to adapt a generic semantics of alignments so that it accounts for the hiding of non-exported elements, but honor the semantics of the encapsulated ontologies. The generality of this framework allows modules to be reused within different contexts built upon various logical formalisms.","cites":"6","conferencePercentile":"68.75"},{"venue":"WoMO","id":"1bf3aed2ee3f071248cf936c7daf9e6d2b87e5e0","venue_1":"WoMO","year":"2006","title":"Semantic Import: An Approach for Partial Ontology Reuse","authors":"Jeff Z. Pan, Luciano Serafini, Yuting Zhao","author_ids":"1704953, 4924053, 1847268","abstract":"As more and more applications use ontology to represent semantic information, how to support ontology reuse is becoming more and more important. In the OWL Web Ontology Language, the main primitive for ontology reuse is owl:imports. However, this \" copy-and-paste \" approach suffers a number of problems. In this paper, we propose a new import primitive, called semantic import, to facilitate partial on-tology reuse. The main contributions of this paper include the semantics of semantic import and reasoning support for TBox reasoning in simple ontology spaces, where an ontology semantically imports vocabulary from another ontology. The semantic import approach provides a brand new way for partial ontology reuse.","cites":"22","conferencePercentile":"87.5"}]}