{"WONS.csv":[{"venue":"WONS","id":"76e4e5ea101c611205e3da4ef10feb2ebed963e6","venue_1":"WONS","year":"2013","title":"Behind the scenes: Lessons learned from the greatest intervehicular accident detection test ever","authors":"Gustavo Marfia, Marco Roccetti, Alessandro Amoroso, Mario Gerla","author_ids":"1728804, 1699031, 1767115, 8467438","abstract":"—This paper describes a few aspects of the work that led to the first experiments ever carried out on the road with an accident warning system based on vehicle-to-vehicle (V2V) communications. The mentioned experiments were performed in Los Angeles as part of a collaboration project between two teams, one from the University of Bologna and one from UCLA. In essence, driving along a few of the most crowded streets of LA and mounting on each vehicle an 802.11 based communication system, an accident warning dissemination algorithm was took for a test ride. The tested algorithm demonstrated being both in theory and simulation the optimal one, as it could successfully deal with realistic asymmetric links always choosing the optimal relay. However, a practical assessment was lacking. This required an important research and financial investment, as an accident warning system based on V2V technologies was never tested before. On the basis of that pioneering experience, we here revisit its \" behind the scenes \" results and the lessons we learned. In fact, we believe that those experiments provide new insights and point new possible directions of work. The contribution of this paper, hence, goes beyond the sharing of information, as its scope is also that of providing a vision of how vehicular research can be applied in practical terms when taken on the road.","cites":"1","conferencePercentile":"53.57142857"},{"venue":"WONS","id":"05972cedd64fe7f312e1ae69f9f3a0d5e3d3b2f4","venue_1":"WONS","year":"2005","title":"Data Dissemination Using the Energy Map","authors":"Max do Val Machado, Olga Goussevskaia, Raquel A. F. Mini, Cristiano G. Rezende, Antonio Alfredo Ferreira Loureiro, Geraldo Robson Mateus, José Marcos S. Nogueira","author_ids":"1926669, 1785331, 2125743, 2438116, 1757448, 1735875, 1746792","abstract":"One of the most important resources in wireless sensor networks is energy, since, in general, batteries cannot be recharged. The information about the amount of energy available at each part of the network is called the energy map and can be explored by routing algorithms. In this work, a new routing algorithm for wireless sensor networks is proposed. The key idea is to combine concepts presented in trajectory-based forwarding with the information provided by the energy map to determine routes in a dynamic fashion. Simulation results revealed that the energy spent with routing activity can be concentrated on nodes with high energy reserves, whereas low-energy nodes can use their energy only to perform sensing activity. In this manner, partitions of the network due to nodes that ran out of energy can be significantly delayed and the network lifetime extended.","cites":"4","conferencePercentile":"20.58823529"},{"venue":"WONS","id":"f0713c8d1e1791dbe4e98019d860093f07b2e073","venue_1":"WONS","year":"2005","title":"Multi-Home Region Location Service for Wireless Ad Hoc Networks: An Adaptive Demand-Driven Approach","authors":"Boon-Chong Seet, Yan Pan, Wen-Jing Hsu, Chiew Tong Lau","author_ids":"1796201, 2684420, 1743256, 1735669","abstract":"The design of scalable routing protocols is a fundamental challenge in wireless ad hoc networks. Position-based routing is widely considered as a potentially scalable routing solution, since nodes do not build and maintain routes to their destinations, but utilize approximate locations of local neighbors and destination in making their forwarding decisions. The location of a specific node could be acquired via a location service, the scalability of which hinges on its location discovery (query/reply) and maintenance (update) overhead. This paper proposes ADLS, an Adaptive Demand-driven Location Service – a multi-home region scheme that creates and maintains beyond a single home region for each node on-demand, based on the actual location demand for each node and the locality of the querying sources. A performance study with a current single-and multi-home region scheme shows the adaptive demand-driven approach of ADLS is a promising approach for future design of efficient and well-performing location service.","cites":"8","conferencePercentile":"44.11764706"},{"venue":"WONS","id":"4f625d095bb1c428bfbf2420c09388c55d0d03ea","venue_1":"WONS","year":"2005","title":"Dynamic Power Management in Wireless Sensor Networks: An Application-Driven Approach","authors":"Rodrigo M. Passos, Claudionor José Nunes Coelho, Antonio Alfredo Ferreira Loureiro, Raquel A. F. Mini","author_ids":"2543855, 8154096, 1757448, 2125743","abstract":"— Energy is a limited resource in wireless sensor networks. In fact, the reduction of power consumption is crucial to increase the lifetime of low power sensor networks. Several approaches on dynamic power management have contributed to reduce the power consumption, but few of them consider the application constraints to optimize it. In this paper, we propose a new application-driven power management approach, where we model the sensor node operation and the application constraints using the hybrid automata framework. We also model a real sensor network application for fire detection and we show the performance of our approach in terms of energy drop, comparing it to an Ideal Model and a Naive approach.","cites":"20","conferencePercentile":"82.35294118"},{"venue":"WONS","id":"335acf2e83b0a3b27386af390c55d9df03ce3e88","venue_1":"WONS","year":"2005","title":"Co-operative Downloading in Vehicular Ad-Hoc Wireless Networks","authors":"Alok Nandan, Shirshanka Das, Giovanni Pau, Mario Gerla, M. Y. Sanadidi","author_ids":"1713377, 2640806, 7952283, 8467438, 1708056","abstract":"Increasing need for people to be \" connected \" ; while at the same time remain as mobile as ever poses several interesting issues in wireless networks. It is conceivable in the near-future that wireless \" hotspots \" experience flash crowds-like traffic arrival pattern. A common phenomena in the Internet today characterized by sudden and unpre-dicted increase in popularity of on-line content. In this paper, we propose SPAWN, a cooperative strategy for content delivery and sharing in future vehicular networks. We study the issues involved in using such a strategy from the standpoint of Vehicular Ad-Hoc networks. In particular , we show that not only content server but also wireless access network load reduction is critical. We propose a \" communication efficient \" swarming protocol which uses a gossip mechanism that leverages the inherent broadcast nature of the wireless medium, and a piece-selection strategy that takes proximity into account in decisions to exchange pieces. We show through simulation that gossip incorporates location-awareness into peer selection, while incurring low messaging overhead, and consequently enhancing the swarming protocol performance. We develop an analytical model to characterize the performance of SPAWN.","cites":"127","conferencePercentile":"100"},{"venue":"WONS","id":"d5fb11b45b9f454ea9c5568a1af0f906d524f054","venue_1":"WONS","year":"2014","title":"LEDBAT performance in sub-packet regimes","authors":"Ioannis Komnios, Arjuna Sathiaseelan, Jon Crowcroft","author_ids":"2210126, 3205987, 1726850","abstract":"—Wireless Community Networks in the developing world satisfy the basic needs of remote users to information access. However, community networks in developing regions usually rely on low-bandwidth backhaul links that are shared amongst a large user base, driving these links to sub-packet regimes where the per-flow throughput is less than one packet per RTT. TCP performance significantly degrades in such conditions, resulting in severe unfairness and high packet loss rates. In this paper, we investigate the performance of scavenger transport methods, namely LEDBAT and its fair modification fLEDBAT, in the sub-packet regime of shared backhaul links in developing regions. Our intention is to explore the feasibility of using such scavenger transport methods for uploading content over bandwidth constrained backhauls. Our findings show that LEDBAT achieves higher link efficiency and fairness compared to TCP in a variety of sub-packet regime scenarios. When TCP and LEDBAT flows share the same link in the sub-packet regime, LEDBAT flows are more aggressive, consuming more resources than TCP. Therefore, we conclude that a more conservative strategy after consecutive timeouts and shared bottleneck detection mechanisms need to be incorporated into the core LEDBAT algorithm, in order to correctly adjust its congestion window in the sub-packet regime.","cites":"1","conferencePercentile":"40.625"},{"venue":"WONS","id":"ced20bf5fbaa8cb6f401a540b2aa59a7dffee4a9","venue_1":"WONS","year":"2012","title":"Cog-Fi: A cognitive Wi-Fi Channel Hopping architecture for urban MANETs","authors":"Brian Sung Chul Choi, Mario Gerla","author_ids":"3097845, 8467438","abstract":"—The success of wireless networks has increased the competition for wireless resources in unlicensed bands by a plethora of wireless devices. Mobile devices that operate in the unlicensed band and are not semi-permanently associated with an access point (either residential or business) find it increasingly difficult to compete in the crowded spectrum. An interesting solution is to equip the mobiles with cognitive radios and allow them to identify the set of least occupied channels and hop across them. In our previous work, we have developed the Cognitive Channel Hopping (CCH) protocol, which utilizes a subset of multiple lightly loaded channels, avoiding channels with heavy external interference. While any routing protocol can work with CCH, conventional protocols like DSR and AODV are not well-suited for CCH networks, as they are not designed to work with multiple channels (in the same MANET) and do not take into account other factors that affect the network performance, such as link rates and channel load. In this work, we define a network architecture Cog-Fi, which exploits CCH over multiple channels in MANETs. We devise a routing protocol called CH-LQSR, which further increases the network performance when used in conjunction with CCH. Our evaluation shows that Cog-Fi can exploit channel diversity without explicit coordination. It outperforms conventional approaches in MANET scenarios with multiple flows and heavy external interference. I. INTRODUCTION Recent years have witnessed a huge success of wireless networks. Traditional wired devices and appliances, like phones, have been largely replaced by their wireless counterparts, and new devices, such as baby monitors, are developed and deployed, adding to the competition for wireless resources in already crowded unlicensed bands. This has resulted in the increasing need for wireless networks (e.g., 802.11) to account for these new tenants, in order to maintain their performance. The scarcity of spectrum has also stimulated research of cognitive radio solutions that attempt to scavenge unused or lightly used radio channels. When cognitive radios are used to support and maintain wireless mobile ad hoc networks across multiple channels, several design challenges emerge. Foremost among these challenges are the coordination of the radios operating on different channels and the routing across the multi-channel, multi-hop network. In this work, we propose the Cog-Fi architecture, an efficient solution for channel rendezvous and coordination based on channel hopping, and develop developing a routing solution that operates on top of cognitive channel hopping radios in Wi-Fi-based multi-channel wireless …","cites":"0","conferencePercentile":"17.64705882"},{"venue":"WONS","id":"e4286fa599b9bfa94f5d006013a77f3098d589d9","venue_1":"WONS","year":"2004","title":"WIDE: Wireless Information Delivery Environment in Distributed Hot Spots","authors":"Mehmet Yunus Donmez, Sinan Isik, Cem Ersoy","author_ids":"3304558, 3065100, 1767459","abstract":"We developed an information delivery system, namely WIDE (Wireless Information Delivery Environment), in client-server architecture using 802.11b infrastructure. WIDE aims to deliver popular information services to registered mobile clients in WLAN hot spots. We present the proposed system architecture, related delivery mechanism and communication protocols. We also give a brief overview of mechanisms required for secure and reliable communication in WIDE system. Performance evaluation results of the proposed system using the implemented prototype are also included in this paper.","cites":"1","conferencePercentile":"34.09090909"},{"venue":"WONS","id":"90f892662ac368435c13b65715b49f3e5793d8fb","venue_1":"WONS","year":"2013","title":"Use both lanes: Multi-channel beaconing for message dissemination in vehicular networks","authors":"Florian Klingler, Falko Dressler, Jiannong Cao, Christoph Sommer","author_ids":"3134413, 1725013, 7468291, 2560036","abstract":"—We study the feasibility of multi-channel beaconing for efficient data dissemination in vehicular networks. Beaconing, i.e., sending small one-hop broadcasts in a periodic fashion, is now a state of the art method for information dissemination in vehicular networks. The main research challenge is to minimize the communication delay while efficiently using the wireless medium without ever overloading the wireless channel. Currently, several approaches to meet these demands can be identified, but they all share the disadvantage of using only a single wireless channel. This is a major bottleneck at high vehicle densities, leading to high delays or packet loss. In this work, we investigate the potentials of a multi-channel approach by extending the delay sensitive and congestion aware Adaptive Traffic Beacon (ATB) protocol to make full use of IEEE 802.11p/1609.4 DSRC/WAVE. We present a novel channel scheduling algorithm and incorporate it into an improved information dissemination protocol. We evaluate our approach in simulations, employing the extended protocol to allow vehicles to dynamically adapt their route to changing traffic conditions. We are able to demonstrate the feasibility of this multi-channel approach, showing that it successfully reduces the channel utilization and observed packet collisions without sacrificing the goodput.","cites":"0","conferencePercentile":"21.42857143"},{"venue":"WONS","id":"d30a5b36d1b75bf719f6dba10313884720d12011","venue_1":"WONS","year":"2014","title":"Spray: A multi-modal localization system for stationary sensor network deployment","authors":"Niklas Wirström, Prasant Misra, Thiemo Voigt","author_ids":"1864079, 2417475, 1754771","abstract":"—We present a localization system that targets rapid deployment of stationary wireless sensor networks (WSN). The system uses a particle filter to fuse measurements from multiple localization modalities, such as RF ranging, neighbor information or maps, to obtain position estimations with higher accuracy than that of the individual modalities. The system isolates different modalities into separate components which can be included or excluded independently to tailor the system to a specific scenario. We show that position estimations can be improved with our system by combining multiple modalities. We evaluate the performance of the system in both an indoor and outdoor environment using combinations of five different modalities. Using two anchor nodes as reference points and combining all five modalities, we obtain RMS (Root Mean Square) estimation errors of approximately 2.5 m in both cases, while using the components individually results in errors within the range of 3.5 and 9 m.","cites":"4","conferencePercentile":"90.625"}]}