{"WOOT.csv":[{"venue":"WOOT","id":"404bac1289e5cae8f8f8870231951529a72a0c5e","venue_1":"WOOT","year":"2011","title":"Energy Attack on Server Systems","authors":"Zhenyu Wu, Mengjun Xie, Haining Wang","author_ids":"1733940, 1727363, 1699802","abstract":"Power management has become increasingly important for server systems. Numerous techniques have been proposed and developed to optimize server power consumption and achieve energy proportional computing. However , the security perspective of server power management has not yet been studied. In this paper, we investigate energy attacks, a new type of malicious exploits on server systems. Targeted solely at abusing server power consumption, energy attacks exhibit very different attacking behaviors and cause very different victim symptoms from conventional cyberspace attacks. First, we unveil that today's server systems with improved power saving technologies are more vulnerable to energy attacks. Then, we demonstrate a realistic energy attack on a standalone server system in three steps: (1) by profiling energy cost of an open Web service under different operation conditions, we identify the vulnerabilities that subject a server to energy attacks; (2) exploiting the discovered attack vectors, we design an energy attack that can be launched anonymously from remote; and (3) we execute the attack and measure the extent of its damage in a systematic manner. Finally, we highlight the challenges in defending against energy attacks.","cites":"2","conferencePercentile":"19.23076923"},{"venue":"WOOT","id":"3fb4c74305c237147567a687857839ba0be2b4ab","venue_1":"WOOT","year":"2008","title":"Experiences with Model Inference Assisted Fuzzing","authors":"Joachim Viide, Aki Helin, Marko Laakso, Pekka Pietikäinen, Mika Seppänen, Kimmo Halunen, Rauli Puuperä, Juha Röning","author_ids":"2052384, 2963912, 2788802, 3150939, 3273082, 2938316, 2916411, 3213064","abstract":"In this paper we introduce the idea of model inference assisted fuzzing aimed to cost effectively improve software security. We experimented with several model inference techniques and applied fuzzing to the inferred models in order to generate robustness attacks. We proved our prototypes against real life software, namely anti-virus and archival software solutions. Several critical vulnerabili-ties were found in multiple file formats in multiple products. Based on the discovered vulnerabilities and the positive impact on the security we argue that our approach strikes a practical balance between completely random and manually designed model-based test case generation techniques.","cites":"5","conferencePercentile":"62.5"},{"venue":"WOOT","id":"34c86af4f615634744fe007b3cea8d21e33d2767","venue_1":"WOOT","year":"2008","title":"Towards Systematic Evaluation of the Evadability of Bot/Botnet Detection Methods","authors":"Elizabeth Stinson, John C. Mitchell","author_ids":"2146413, 1685743","abstract":"Automated bot/botnet detection is a difficult problem given the high level of attacker power. We propose a systematic approach for evaluating the evad-ability of detection methods. An evasion tactic has two associated costs: implementation complexity and effect on botnet utility. An evasion tactic's implementation complexity is based on the ease with which bot writers can incrementally modify current bots to evade detection. Modifying a bot in order to evade a detection method may result in a less useful botnet; to explore this, we identify aspects of bot-nets that impact their revenue-generating capability. For concreteness, we survey some leading automated bot/botnet detection methods, identify evasion tactics for each, and assess the costs of these tactics. We also reconsider assumptions about botnet control that underly many botnet detection methods.","cites":"27","conferencePercentile":"87.5"},{"venue":"WOOT","id":"59cd2c819ba857beb45ad02a6382d72c3a143ea2","venue_1":"WOOT","year":"2016","title":"A Security Analysis of an In-Vehicle Infotainment and App Platform","authors":"Sahar Mazloom, Mohammad Rezaeirad, Aaron Hunter, Damon McCoy","author_ids":"2775883, 1853966, 2769815, 1703426","abstract":"There is an increasing trend in the automotive industry towards integrating trusted third-party apps with In-Vehicle-Infotainment systems (IVI) via smartphones. This integration is typically facilitated by a pair of apps, one that executes on the smartphone and the other executes on the IVI which is connected to the Vehicle's Controller Area Network (CAN) bus. Throughout the evolution of these IVI and App platforms, there has been little public analysis of the security of these protocols and the frameworks that implement these apps on the IVI. This raises the question: to what extent are these apps, protocols and underlining IVI implementations vulnerable to an attacker who might gain control of a driver's smart-phone? In this paper, we focus on gaining insights into this question by performing a comprehensive security analysis on an IVI system that is included in at least one 2015 model vehicle from a major automotive manufacturer. This IVI system included vestigial support for the Mir-rorLink protocol which is intentionally disabled but can be enabled by updating a single configuration value after applying a publicly available firmware update that is securely signed by the manufacturer. Based on our analysis , we document and demonstrate insecurities in the MirrorLink protocol and IVI implementation that could potentially enable an attacker with control of a driver's smartphone to send malicious messages on the vehicle's internal network.","cites":"0","conferencePercentile":"42.85714286"},{"venue":"WOOT","id":"52191626e79c013f5aaab6fcc268b4292b2a2114","venue_1":"WOOT","year":"2015","title":"SURROGATES: Enabling Near-Real-Time Dynamic Analyses of Embedded Systems","authors":"Karl Koscher, Tadayoshi Kohno, David Molnar","author_ids":"3083870, 1769675, 2804783","abstract":"Embedded systems are becoming increasingly sophisticated, interconnected , and pervasive. Unfortunately, securing these systems remains challenging. While powerful dynamic analysis tools have been developed for traditional software, the unique characteristics of embedded systems make it difficult to apply these well-known techniques; prior work has been limited either to small systems or short segments of code. In this paper, we demonstrate a system that is capable of emulating and instrumenting embedded systems in near-real-time, enabling a variety of dynamic analysis techniques. Our approach uses a custom, low-latency FPGA bridge between the host's PCI Express bus and the system under test, allowing the emulator full access to the system's peripherals. This provides the emulator with a faithful representation of the environment the firmware normally executes in, enabling additional dynamic analysis techniques such as concolic execution. We discuss the design decisions and engineering tradeoffs made and evaluate our system against prior work.","cites":"0","conferencePercentile":"11.53846154"},{"venue":"WOOT","id":"8d3bef2c365db8644a60c454b6ecc2d137ae2f26","venue_1":"WOOT","year":"2014","title":"An Experience Report on Extracting and Viewing Memory Events via Wireshark","authors":"Sarah Laing, Michael E. Locasto, John Aycock","author_ids":"1678343, 1689221, 1747867","abstract":"Modern program analysis environments lack a principled method of monitoring low-level memory events. Such monitoring is of great value to activities like debugging, reverse engineering, vulnerability analysis, and security policy enforcement. Although current systems can be coerced to produce streams of memory events, most such techniques are inefficient or overly invasive and offer an unconstrained control over memory, which can subvert the reliability of such memory interposition as part of the attack engineering workflow. Our system, Cage, is a kernel-level mechanism for monitoring the memory events of a process. Like several existing memory trapping systems, Cage modifies and uses the functionality of the Linux kernel memory page subsystem. Cage translates the memory activity of a process into a packet-like format, and these events are exported over a network device. The memory event packets can be captured and displayed using an existing network packet analyzer (Wireshark). At present, Cage can monitor the memory events for the data, stack, and heap of a process as well as arbitrarily cage any other memory region. We have caged a Gnome login session successfully and noticed no ill effects. We discuss several potential applications that arise from imposing this \" network packet \" metaphor on memory events.","cites":"1","conferencePercentile":"12.5"},{"venue":"WOOT","id":"8b5b688f2b95b5cb8765a0d8b9534284449b446f","venue_1":"WOOT","year":"2016","title":"Controlling UAVs with Sensor Input Spoofing Attacks","authors":"Drew Davidson, Hao Wu, Robert Jellinek, Vikas Singh, Thomas Ristenpart","author_ids":"1693804, 1739602, 2997483, 5953788, 1707461","abstract":"There has been a recent surge in interest in autonomous robots and vehicles. From the Google self-driving car, to autonomous delivery robots, to hobbyist UAVs, there is a staggering variety of proposed deployments for autonomous vehicles. Ensuring that such vehicles can plan and execute routes safely is crucial. The key insight of our paper is that the sensors that autonomous vehicles use to navigate represent a vector for adversarial control. With direct knowledge of how sensor algorithms operate, the adversary can manipulate the victim's environment to form an implicit control channel on the victim. We craft an attack based on this idea, which we call a sensor input spoofing attack. We demonstrate a sensor input spoofing attack against the popular Lucas-Kanade method for optical flow sensing and characterize the ability of an attacker to trick optical flow via simulation. We also demonstrate the effectiveness of our optical flow sensor input spoofing attack against two consumer-grade UAVs, the AR.Drone 2.0 and the APM 2.5 ArduCopter. Finally, we introduce a method for defending against such an attack on optical-flow sensors, both using the RANSAC algorithm and a more robust weighted RANSAC algorithm to synthesize sensor outputs.","cites":"0","conferencePercentile":"42.85714286"},{"venue":"WOOT","id":"bb82d75360e41eeb13a3ce22e5829369f2b283e5","venue_1":"WOOT","year":"2013","title":"Breaking Cell Phone Authentication: Vulnerabilities in AKA, IMS, and Android","authors":"Jethro G. Beekman, Christopher Thompson","author_ids":"3107642, 4706775","abstract":"Next generation IP telephony such as the IP Multime-dia Subsystem (IMS) framework has been used to create Internet calling services which let cellular users make and receive calls even when without cellular reception. In this paper, we look at the security aspects of Inter-net calling services and other systems that use the 3GPP Authentication and Key Agreement (AKA) protocol for authentication, particularly focusing on the context of cellular authentication in Android. We describe a new man-in-the-middle attack on T-Mobile's Wi-Fi Calling service, which is installed on millions of T-Mobile An-droid smartphones. We also describe three new attacks on AKA in the context of Internet calling and Android. We have worked with T-Mobile to fix the man-in-the-middle vulnerability, and we present clear and actionable solutions to fix the remaining vulnerabilities.","cites":"2","conferencePercentile":"37.5"},{"venue":"WOOT","id":"82a4562d9ef19aec3aeaf9bd9f0ac4e09bdf5c86","venue_1":"WOOT","year":"2011","title":"Putting Out a HIT: Crowdsourcing Malware Installs","authors":"Chris Kanich, Stephen Checkoway, Keaton Mowery","author_ids":"3110399, 2642533, 2143828","abstract":"Today, several actors within the Internet's burgeoning underground economy specialize in providing services to like-minded criminals. At the same time, gray and white markets exist for services on the Internet providing reasonably similar products. In this paper we explore a hypothetical arbitrage between these two markets by purchasing \" Human Intelligence \" on Amazon's Mechanical Turk service, determining the vulnerability of and cost to compromise the computers being used by the humans to provide this service, and estimating the underground value of the computers which are vulnerable to exploitation. We show that it is economically feasible for an attacker to purchase access to high value hosts via Mechanical Turk, compromise the subset with unpatched, vulnerable browser plugins, and sell access to these hosts via Pay-Per-Install programs for a tidy profit. We also present supplementary statistics gathered regarding Mechanical Turk workers' browser security, antivirus usage, and willingness to run arbitrary programs in exchange for a small monetary reward.","cites":"5","conferencePercentile":"38.46153846"},{"venue":"WOOT","id":"b1242832d13f7c3ed52c6d5b030468a6e5c9df81","venue_1":"WOOT","year":"2015","title":"Fuzzing E-mail Filters with Generative Grammars and N-Gram Analysis","authors":"Sean Palka, Damon McCoy","author_ids":"2647242, 1703426","abstract":"Phishing attacks remain a common attack vector in to-day's IT threat landscape, and one of the primary means of preventing phishing attacks is e-mail filtering. Most e-mail filtering is done according to a either a signature-based approach or using Bayesian models, so when specific signatures are detected the e-mail is either quarantined or moved to a Junk mailbox. Much like anti-virus, though, a signature-based approach is inadequate when it comes to detecting zero-day phishing e-mails, and can often be bypassed with slight variations in the e-mail contents. In this paper, we demonstrate an approach to evaluating the effectiveness of e-mail filters using a fuzzing strategy. We present a system that utilizes generative grammars to create large sets of unique phishing e-mails, which can then be used for fuzzing input against e-mail filters. Rather than creating random text, our approach maintains a high degree of semantic quality in generated e-mails. We demonstrate how our system is able to adapt to existing filters and identify contents that are not detected, and show how this approach can be used to ensure the delivery of e-mails without the need to white-list.","cites":"1","conferencePercentile":"26.92307692"},{"venue":"WOOT","id":"ceef94e5e9b6188e9aca558efcf92e57ec987bc4","venue_1":"WOOT","year":"2014","title":"The End is Nigh: Generic Solving of Text-based CAPTCHAs","authors":"Elie Bursztein, Jonathan Aigrain, Angelique Moscicki, John C. Mitchell","author_ids":"1687723, 2145045, 2959842, 1685743","abstract":"Over the last decade, it has become well-established that a captcha's ability to withstand automated solving lies in the difficulty of segmenting the image into individual characters. The standard approach to solving captchas automatically has been a sequential process wherein a segmentation algorithm splits the image into segments that contain individual characters, followed by a character recognition step that uses machine learning. While this approach has been effective against particular captcha schemes, its generality is limited by the segmentation step, which is hand-crafted to defeat the distortion at hand. No general algorithm is known for the character collapsing anti-segmentation technique used by most prominent real world captcha schemes. This paper introduces a novel approach to solving captchas in a single step that uses machine learning to attack the segmentation and the recognition problems simultaneously. Performing both operations jointly allows our algorithm to exploit information and context that is not available when they are done sequentially. At the same time, it removes the need for any hand-crafted component, making our approach generalize to new captcha schemes where the previous approach can not. We were able to solve all the real world captcha schemes we evaluated accurately enough to consider the scheme insecure in practice , including Yahoo (5.33%) and ReCaptcha (33.34%), without any adjustments to the algorithm or its parameters. Our success against the Baidu (38.68%) and CNN (51.09%) schemes that use occluding lines as well as character collapsing leads us to believe that our approach is able to defeat occluding lines in an equally general manner. The effectiveness and universality of our results suggests that combining segmentation and recognition is the next evolution of catpcha solving, and that it supersedes the sequential approach used in earlier works. More generally, our approach raises questions about how to develop sufficiently secure captchas in the future.","cites":"13","conferencePercentile":"100"},{"venue":"WOOT","id":"20a0fcae38035f7abe19e6af6bee7663d5d3bba2","venue_1":"WOOT","year":"2011","title":"All Your Droid Are Belong to Us: A Survey of Current Android Attacks","authors":"Timothy Vidas, Daniel Votipka, Nicolas Christin","author_ids":"2835423, 3157105, 2637728","abstract":"In the past few years, mobile devices (smartphones, PDAs) have seen both their computational power and their data connectivity rise to a level nearly equivalent to that available on small desktop computers, while becoming ubiquitous. On the downside, these mobile devices are now an extremely attractive target for large-scale security attacks. Mobile device middleware is thus experiencing an increased focus on attempts to mitigate potential security compromises. In particular, Android incorporates by design many well-known security features such as privilege separation. The Android security model also creates several new security sensitive concepts such as Android's application permission system and the unmoderated Android market. In this paper we look to Android as a specific instance of mobile computing. We first discuss the Android security model and some potential weaknesses of the model. We then provide a taxonomy of attacks to the platform demonstrated by real attacks that in the end guarantee privileged access to the device. Where possible, we also propose mitiga-tions for the identified vulnerabilities.","cites":"56","conferencePercentile":"100"},{"venue":"WOOT","id":"9d123a209f965472b0b10e7632fbc135170a7f5d","venue_1":"WOOT","year":"2015","title":"Fast and Vulnerable: A Story of Telematic Failures","authors":"Ian D. Foster, Andrew Prudhomme, Karl Koscher, Stefan Savage","author_ids":"2933136, 2915360, 3083870, 1727599","abstract":"Modern automobiles are complex distributed systems in which virtually all functionality — from acceleration and braking to lighting and HVAC — is mediated by computerized controllers. The interconnected nature of these systems raises obvious security concerns and prior work has demonstrated that a vulnerability in any single component may provide the means to compromise the system as a whole. Thus, the addition of new components, and especially new components with external networking capability , creates risks that must be carefully considered. In this paper we examine a popular aftermarket telem-atics control unit (TCU) which connects to a vehicle via the standard OBD-II port. We show that these devices can be discovered, targeted, and compromised by a remote attacker and we demonstrate that such a compromise allows arbitrary remote control of the vehicle. This problem is particularly challenging because, since this is aftermarket equipment, it cannot be well addressed by automobile manufacturers themselves.","cites":"12","conferencePercentile":"100"}]}