{"WORDS.csv":[{"venue":"WORDS","id":"310cfaecb3d1a6a533c2f16e05ca9c1acfcd560f","venue_1":"WORDS","year":"2003","title":"Query Plans with Roaming Sources: Shifting Streams of Data","authors":"Alvin Chen, Kai Chung Lui, Richard R. Muntz","author_ids":"2118144, 2732980, 1704462","abstract":"Wireless embedded systems provide an opportunity for the collection of useful data from a wide range of mobile devices. However, such devices may often have strict limits on their functionality, processing power, battery life, and wireless bandwidth. We present a method for distributing mobile query operators to enhance performance in a system consisting of many such mobile devices while supporting their mobility. As the devices roam throughout the area, the system shifts query data streams to follow the mobile data sources. We then provide an analysis of such a query distribution scheme in terms of expected bandwidth usage within the system.","cites":"1","conferencePercentile":"18.18181818"},{"venue":"WORDS","id":"6dca3ab5f447fe462283bc22eed0629ce582b925","venue_1":"WORDS","year":"1999","title":"Optimization techniques for replicating CORBA objects","authors":"Xavier Défago, Pascal Felber, André Schiper","author_ids":"1735799, 1743906, 1735290","abstract":"The CORBA Object Group Service (OGS) is a new CORBA service that provides support for fault-tolerance through the replication of CORBA objects. In this paper, we present several optimization techniques that are used to improve the performance of OGS. For each optimization, we analyse the impact on the throughput and the response time of OGS. The optimization techniques presented in this paper are quite generic and can be applied to many fault-tolerant distributed algorithms based on consensus.","cites":"14","conferencePercentile":"100"},{"venue":"WORDS","id":"cea043d0ed03de445d91aa60f2eb43cc76b64040","venue_1":"WORDS","year":"2002","title":"Scalable Group Membership Service for Mobile Internet","authors":"Bumho Kim, Dongman Lee, Dukyun Nam","author_ids":"3020725, 1724024, 2713089","abstract":"Group communication system (GCS) is a useful mechanism for constructing reliable, fault-tolerant distributed application. When GCS is extended in mobile environment, the membership change occurs frequently due to the mobility of mobile nodes and unreliable wireless communication within a cell. In this paper, we propose a scalable group communication scheme to support mobile systems in an Internet environment with wireless cells. Our scheme leverages the layered approach, our previous work, to enhance the scalability. Furthermore, to shield group view from the mobility and temporary disconnection of mobile hosts, we extend the hierarchical view management of layered approach. The simulation result shows that our scheme can reduce the overhead of membership management and the number of messages exchanged to complete the view event process.","cites":"1","conferencePercentile":"17.5"},{"venue":"WORDS","id":"22359d71e94508e4355078f5cf261ed10e73ea28","venue_1":"WORDS","year":"2005","title":"Towards Self-Healing Systems via Dependable Architecture and","authors":"Hong Mei, Gang Huang, Wei-Tek Tsai","author_ids":"7151645, 3299428, 7518728","abstract":"Self-healing systems focus on how to reducing the complexity and cost of the management of dependability policies and mechanisms without human intervention. This position paper proposes a systematic approach to self-healing systems via dependable architecture and reflective middleware. Firstly, the differences between self-healing systems and traditional dependable systems are illustrated via the construction of a dependable computing model. Secondly, reflective middleware is incorporated into the dependable computing model for investigating the feasibility and benefits of implementing self-healing systems by reflective middleware. Thirdly, dependable architectures are introduced for providing application specific knowledge related to self-healing. Fourthly, an architecture based deployment tool is implemented for deploying dependable architectures into heterogeneous and distribute environments. Finally, an architecture based reflective J2EE application server, called PKUAS, is implemented for interpreting and enforcing dependable architectures at runtime, that is, discovering or predicting and recovering or preventing failures automatically under the guide of dependable architectures.","cites":"7","conferencePercentile":"41.66666667"},{"venue":"WORDS","id":"3891d96b08c6ceb63936bab4bba293bfe451dcef","venue_1":"WORDS","year":"2003","title":"Security and Middleware","authors":"Anders Andersen, Gordon S. Blair, Per Harald Myrvang, Tage Stabell-Kulø","author_ids":"4158854, 1700173, 1900560, 1737903","abstract":"The security features of current middleware platforms, like Enterprise Java Beans and CORBA, are either simple and limited or complex and difficult to use. In both cases are the provided features static and do not support the flexibility needed in a wide range of applications. This paper introduces an approach to flexible security mechanisms in the context of a reflective middleware architecture. The reflective middleware OOPP is a component and capsule (container) based platform providing its reflective features through a set of distinct meta-models. Flexible security mechanisms are provided using a specialized programming language called Obol. In OOPP the flexible security mechanisms based on Obol is a subset of reflective features of the middleware platform. Obol and its machinery is a subset of one distinct aspect or meta-model of the middleware platform.","cites":"1","conferencePercentile":"18.18181818"},{"venue":"WORDS","id":"5451d1555b0ee9d440e136d8c7e587a74bc17826","venue_1":"WORDS","year":"1994","title":"Deterministic characterization and network utilizations for several distributed real-time applications","authors":"Edward W. Knightly, Robert F. Mines, Hui Zhang","author_ids":"1747574, 3062847, 1732258","abstract":"In this paper, we investigate several distributed real-time applications. The applications are real-time in that they require per-connection end-to-end performance bounds. These bounds, in terms of throughput, delay, and delay-jitter, are provided by the network via two mechanisms: admission control to limit access to the network and priority scheduling to enforce the guarantees. Within this framework , we perform a deterministic analysis on the applications and investigate , via the admission control criteria, the resulting utilization of the network. A deterministic analysis must analyze the worst-case properties of the sources in order to provide absolute bounds on throughput and delay. Three distributed real-time applications are analyzed in this paper: a video conferencing tool, a tool for combustion modeling using distributed computing, and an MPEG video archival system. Each has minimum performance requirements that must be provided by the network. By investigating these applications, we provide insights to the traac characteristics and achievable network utilizations for practical real-time loads.","cites":"7","conferencePercentile":"87.5"},{"venue":"WORDS","id":"30950bf3eaef2bbe34ab169ff98c39736082364c","venue_1":"WORDS","year":"1999","title":"Dynamic modeling of replicated objects for dependable soft real-time distributed object systems","authors":"Vana Kalogeraki, Louise E. Moser, P. M. Melliar-Smith","author_ids":"1685532, 1708743, 1744292","abstract":"Real-time distributed object systems that must be dependable typically replicate application objects on different processors within the distributed system. In this paper we present an algorithm for determining the degree of repli-cation of each application object that aims to maximize the overall system utility, while respecting the resource constraints. The overall system utility captures the relative importance of the individual objects for the application tasks and the relative rewards of executing the application tasks. The algorithm determines an initial replication degree for each application object and may adjust the replication degree dynamically at run time.","cites":"6","conferencePercentile":"68.75"},{"venue":"WORDS","id":"e092a8d534bed2f1c709d8d2513b5202e27d6618","venue_1":"WORDS","year":"2005","title":"A Role-Based Access Control Policy Verification Framework for Real-Time Systems","authors":"Basit Shafiq, Ammar Masood, James B. D. Joshi, Arif Ghafoor","author_ids":"1772901, 3025768, 1719496, 1696394","abstract":"This paper presents a framework for verifying the access control requirements of real-time application systems such as workflow management systems and active databases. The temporal and event-based semantics of these applications can be expressed using event-driven Role Based Access Control (RBAC) model. Any comprehensive access control model such as RBAC requires verification and validation mechanisms to ensure the consistency of access control specification. An inconsistent access control specification exposes the underlying system to numerous vulnerabilities and security risks. In this paper, we propose a Petri-Net based framework for verifying the correctness of event-driven RBAC policies.","cites":"16","conferencePercentile":"85.41666667"},{"venue":"WORDS","id":"8dc1539124fb7cdb8ad20e14d6180e50a79c45e7","venue_1":"WORDS","year":"2005","title":"An RBAC Framework for Time Constrained Secure Interoperation in Multi-domain Environments","authors":"Smithi Piromruen, James B. D. Joshi","author_ids":"1893163, 1719496","abstract":"In emerging e-commerce applications, time constrained information sharing between different systems is becoming a common phenomenon. A flexible and efficient mechanism is needed to support short term time-based sharing policies between transient partners. In particular, the interacting domains need to establish a time-based inter-domain access policy without violating the original time-based security policies of the individual systems. In this paper, we address this issue using the Generalized Temporal Role Based Access Control (GTRBAC) framework. The proposed mechanism involves a system processing an inter-domain access requirement specification to extend or restructure its local GTRBAC policy with proper temporal constraints to allow its external partner domain to access its resources. The transformed local GTRBAC policy facilitates the inter-domain accesses while still conforming to the original local policy requirements.","cites":"15","conferencePercentile":"75"},{"venue":"WORDS","id":"c300fa83a7a9f9ccc472794a7ff2daff25e016d9","venue_1":"WORDS","year":"2001","title":"Time vs. Space in Fault-Tolerant Distributed Systems","authors":"Bernadette Charron-Bost, Xavier Défago, André Schiper","author_ids":"1732743, 1735799, 1735290","abstract":"Algorithms for solving agreement problems can be classified in two categories: (1) those relying on failure detectors that we call FD-based, and (2) those that rely on a Group Membership Service that we call GMS-based. The paper discusses the advantages and limitations of these two approaches, and proposes an extension to the GMS-approach that combines the advantages of both approaches, without their drawbacks. This extension leads us to distinguish between time-triggered suspicions of processes and space-triggered exclusions.","cites":"8","conferencePercentile":"83.33333333"},{"venue":"WORDS","id":"4c1cda2ab353948c651329f49a0db5fc6c36ffee","venue_1":"WORDS","year":"2002","title":"Reconfiguration of Resources in Middleware","authors":"Hector A. Duran-Limon, Gordon S. Blair","author_ids":"1806402, 1700173","abstract":"The monolithic and inflexible nature of current middleware has made it difficult to deal with emerging technologies such as multimedia. Since these applications have timeliness constraints, they are highly susceptible to dynamic and unexpected changes. Nowadays, the attempts to introduce more flexibility in middleware have not been addressed in a generic and principled way. We believe that reflection provides a principled means to achieve the flexibility and adaptation required. The main focus of this paper regards the reconfiguration of resources in middleware within the context of OpenORB, a reflective middleware architecture. A resource framework is presented which encompasses both a resource model and a task model. The resource management of the logical flow of component interactions is modeled within the task model. The resource model is then used to provide a representation of the physical resources whereby various levels of abstraction are offered. The conjunction of both models offer a high-level of resource management. The approach is validated by a series of experimental results.","cites":"18","conferencePercentile":"85"}]}