{"Workshop_on_Web_Information_and":[{"venue":"Workshop on Web Information and Data Management","id":"5f58a33dc8878577afeaa7df115b110609811314","venue_1":"Workshop on Web Information and Data Management","year":"1998","title":"WebML: Querying the World-Wide Web for Resources and Knowledge","authors":"Osmar R. Zaïane, Jiawei Han","author_ids":"1683380, 1722175","abstract":"There is a massive increase of information available on electronic networks. This profusion of resources on the WorldWide Web gave rise to considerable interest in the research community. T raditional information retrieval techniques have been applied to the document collection on the Internet, and a m yriad of search engines and tools have been proposed and implemented. However, the eectiveness of these tools is not satisfactory. None of them is capable of discovering knowledge from the Internet. We propose a declarative query language that would allow resource discovery on the Internet with interactive and progressively reened inquiries. The language also consents to the discovery of knowledge within the content of the documents and the structure of the hyperspace. 1 Introduction More than half a century ago, in a paper in which h e d e-scribes the \\Memex\", a system for storing and organizing multimedia information, Vannevar Bush invited researchers to join the eeort in building an information system for holding the human knowledge, and making it easily accessiblee4]. He writes: \\A record, if it is to be useful... must be continuously extended, it must be stored, and above all it must be consulted.\" A massive aggregation of documents is now stored on the Internet. The WorldWide Web is holding a colossal collection of resources, from structured records, images and programs to semi-structured les and free text documents. The availability of information is not questionable. We are actually overwhelmed by this excess of information. Accessibility as described by V annevar Bush however is still unsolved. For many decades, information retrieval from document repositories has drawn much attention in the research community. M a n y techniques have been proposed and implemented in successful and less prevailing applications. With the advent o f t h e W orld-Wide Web, the appearance of a panoply of services and accumulation of a colossal aggregate of resources, information retrieval techniques have been adapted to the Internet, bringing forth indexing models and search engines. However, the eeectiveness of these tools is not satisfactory and is even irritating. The annoying results of current search engine technologies have i n vited researchers to tackle new challenges. Better indexing approaches , specialized information gathering agents, ltering and clustering methods, etc. have since been proposed.","cites":"16","conferencePercentile":"85.71428571"},{"venue":"Workshop on Web Information and Data Management","id":"e92a33d29466f5d66d282187ee6f116d728e675f","venue_1":"Workshop on Web Information and Data Management","year":"1998","title":"Conjunctive Point Predicate-based Semantic Caching for Wrappers in Web Databases","authors":"Dongwon Lee, Wesley W. Chu","author_ids":"1784227, 1724907","abstract":"A semantic caching scheme suitable for web database environments is proposed. In our scheme, tasks for query trans-lation/capability mapping (named as query naturalization) between wrappers and web sources and tasks for semantic caching are seamlessly integrated, resulting in easier query optimization. A semantic cache consists of three components: 1) semantic view, a description of the contents in the cache using sub-expressions of the previous queries, 2) semantic index, an index for the tuple IDs that satisfy the semantic view, and 3) physical storage, a storage containing the tuples (or objects) that are shared by all semantic v i e w s i n t h e c a c he. Types of matching between the native query and cache query are discussed. Algorithms for nding the optimal match of the input query in semantic cache and for cache replacement are presented. The proposed techniques are being implemented in a cooperative w eb database (CoWeb) p r o t o t ype at UCLA. 1 Introduction Two t e c hniques for implementing web database systems (hereafter WebDB) a r e t h e warehousing and the virtual approaches 8]. In the warehousing approach, data from multiple sources are prefetched into a local repository and queries are applied to the repository, making query response fast and reliable with the risk of obsolete data. In the virtual approach, queries are posed to a uniform interface, which decomposes and applies queries to multiple sources at run time. Querying can be costly due to run-time costs or can not be answered if the server is unavailable. However, this approach always provides up-to-date data. Given the vast amount of web sources and their autonomous nature, an eeective way to reduce costs in using the virtual approach i s t o c a c he the results of the prior queries and reuse them. When a series of semantically associated queries are asked, the results may likely overlap or contain one another. Caching can be eeective i n i m p r o ving","cites":"9","conferencePercentile":"35.71428571"}]}