{"Workshop_on_New_Paradigms_in_In":[{"venue":"Workshop on New Paradigms in Information Visualization and Manipulation","id":"dfb95d2cc916e5152fd806f73cb4d98fb0819e36","venue_1":"Workshop on New Paradigms in Information Visualization and Manipulation","year":"1999","title":"Temporal, Geographical, and Categorial Aggregations Viewed through Coordinated Displays: A Case Study with Highway Incident Data","authors":"Anna Fredrikson, Chris North, Catherine Plaisant, Ben Shneiderman","author_ids":"2696501, 1796013, 1764846, 1740403","abstract":"Information visualization displays can hold a limited number of data points, typically a few thousand, before they get crowded. One way to solve this problem with larger data sets is to create aggregates. Aggregations were used together with the Snap-Together Visualization system to coordinate the visual displays of aggregates and their content. If two displays each hold one thousand items then rapid access and visibility can be maintained for a million points. This paper presents examples based on a database of highway incident data. 1-INTRODUCTION An information visualization display can hold a limited amount of data points, typically a few thousand, before it gets crowded. One way to accommodate larger data sets is to create aggregates. An aggregate is a single item that represents or summarizes a group of data points. Aggregates simplify the display because fewer markers are needed and users can understand overall patterns and select the details that are relevant to their tasks. Aggregations were used together with the Snap-Together Visualization system to coordinate the visual displays of aggregates and their details. This paper presents a case study with incident data from Maryland highways in which aggregation and coordinated displays were used. 2-SNAP TOGETHER VISUALIZATION Snap-Together Visualization (Snap) [NS99] enables users to explore their data by rapidly constructing their own coordinated displays. Users choose the set of component visualizations they need and specify the coordination between them as appropriate for their tasks. This allows users to mix and match visualizations and coordinations to their liking, without programming. Then, these customized displays maximize users' capability to explore, understand, and discover phenomena in their data. Snap's coordination model is based on the relational database model. First, users load and display individual relations in visualizations. Then, they coordinate the visualizations based on the join relationships between the relations. With Snap, users can create many different types of coordinations between visualizations. For example, the brushing-and-linking coordination enables users to identify corresponding data items between views. When users select and highlight an item in one view, the corresponding item is also highlighted in the other view. The synchronized-scrolling coordination enables users to easily scroll through two corresponding lists of data items simultaneously. This paper focuses on using Snap for the drill-down coordination. This enables users to navigate from aggregates in one view to aggregate details in another view (one-to-many joins). 3-AGGREGATIONS Aggregates are groups of data points that are used as summarization. …","cites":"3","conferencePercentile":"40"},{"venue":"Workshop on New Paradigms in Information Visualization and Manipulation","id":"cf338947f993e09a59c44eaefbac9bb3bee27e42","venue_1":"Workshop on New Paradigms in Information Visualization and Manipulation","year":"1998","title":"Towards visual support for document navigation through multidimensional catalogues","authors":"Thomas Klement, Matthias Hemmje, Karl Aberer","author_ids":"2815088, 1799848, 1751802","abstract":"In information systems applications, the \" catalogue \" concept is mostly used as a connotation for information systems that categorize content by means of document annotation hierarchies. Within user interfaces, catalogue metaphors are in wide spread use. To take advantage of more flexible and efficient catalogue navigation based on multidimensional menu hierarchies a project about an integrated Information Catalogue Environment (ICE) is currently performed at GMD-IPSI. The goal of the ICE project is to provide efficient and flexible catalogue oriented categorization and representation mechanisms for multimedia document types and structures. 1. MOTIVATION The catalogue metaphor is in widely used for information systems which divide large document collections into subcategories to support browsing and searching [IO] in these collections. In most catalogue applications the document categories are structured in a hierarchical way. The semantic organization of the catalogue's hierarchies plays a crucial role for the navigation efficiency and also for the effectiveness of the catalogue-oriented browsing user interface as a document exploration tool. The primary design goal of hierarchical catalogue categorizations is to create a comprehensive, memorable and convenient semantic organization of information relevant to the users' tasks and information needs. Unfortunately, as the number of categories in one-dimensional catalogue applications increases, Permission to make digital or hard copies of all or part ofthis work for personal or classroom use is granted without fee procidrd that copie2; arc no1 made (Jr distrihutcd for prolit or commercial xiv;lntogc and that copies bear this notice and the full citation on rhc first page. To copy otherwise. to republish, to post on seivers or to redistribute to lists. require5 prior specific permission and/or a fee. the difficulty to classify a document into a certain category increases as well. Furthermore, if a document's content is to be associated with multiple categories, a user interface based on a single tree structure of categories, as it is implemented in many of today's internet and file system browsers, is not suited for navigation or browsing of the multidimensional catalogue because the positioning of a document in the navigation hierarchy does not express the full multidimensional catalogue context of the document. The application of a multidimensional model in the catalogue user interface as well as in the underlying catalogue representation avoids such difficulties inherent to traditional browsing user interface approaches. If the categories are partitioned into dimensions which are semantically independent of each other, the documents are positioned with …","cites":"1","conferencePercentile":"43.33333333"},{"venue":"Workshop on New Paradigms in Information Visualization and Manipulation","id":"b03f5543681a33902c18ed9f5ffb378bc3e8900f","venue_1":"Workshop on New Paradigms in Information Visualization and Manipulation","year":"1997","title":"Multi-Dimensional Representations - How Many Dimensions?","authors":"William Wright","author_ids":"1879488","abstract":"1, ABSTRACT The purpose of this paper is to describe a new visualization technique for very high dimensional domains, and to discuss the techniques strengths and wcakncsscs, This new technique seems to be appropriate for visualizing 100 to 200 or more dlmcnsions, concurrently. This new technique is used in a clustcrlng analysis. Information visualization methods present multi-dimeneional data graphically by mapping data and properties to different visual shapes, colors, and positions [3], Visualizations can be in a 2-D or 3-D Euclidean space but often portray many more dimensions. For example, six dimensions can easily be shown by a cube's x, y and z dimension, the cube's color, and it's position on an x, z plane, Tile purpose of visualization is to improve comprehension and reveal significance, It is easier to comprehend a visual representation than a numerical one, especially when many pages or screens of data are involved. the useability of a visualization, but an appropriate visual Permimlon to make digital or hard copies of all or part ofthis work for pcmonnl or clawoom use is granted without fee provided that copies nro not made or distributed for profit or commercial advantage and that / copies bear this nolice and the full citation on the fvst page. To copy othewisc, to republish, to post on servers or to rediibute to lists, rcquircz priof specific pen&&n andhx a fee. design is the crucial first step to creating an effective visualization. As Edward Tufte [2] points out, good visual designs provide: l Complex ideas communicated with clarity, precision and efficiency; 0 Present many things in a small space; l Encourage data comparison; l Reveal data at several levels of detail; and l Induce the viewer to think about the substance. A good visual design is important for high dimensionality visualizations, and Tufte's mandates may be used as evaluation criteria. The purpose of this paper is to descriie a new visualization technique for very high dimensional domains, and to discuss the techniques strengths and weaknesses. This new technique seems to be appropriate for visualizing 100 to 200 or more dimensions, concurrently. This new 3-D visualization technique also helps illustrate the role of 3-D vs 2-D. Graphical displays of information in 2-D seem to be more suitable when there are smaller amounts of data, and/or a smaller number of dimensions to view, and when the task being supported is focused with little if any …","cites":"2","conferencePercentile":"38.23529412"},{"venue":"Workshop on New Paradigms in Information Visualization and Manipulation","id":"302e931a314d91a3be4ff2a22129d9296729aac4","venue_1":"Workshop on New Paradigms in Information Visualization and Manipulation","year":"1998","title":"Data Object and Label Placement For Information Abundant Visualizations","authors":"Jia Li, Catherine Plaisant, Ben Shneiderman","author_ids":"1687366, 1764846, 1740403","abstract":"Placing numerous data objects and their corresponding labels in limited screen space is a challenging problem in information visualization systems. Extending map-oriented techniques, this paper describes static placement algorithms and develops metrics (such as compactness and labeling rate) as a basis for comparison among these algorithms. A control panel facilitates user customization by showing the metrics for alternative algorithms. Dynamic placement techniques that go beyond map-oriented techniques demonstrate additional possibilities. User actions can lead to selective display of data objects and their labels.","cites":"8","conferencePercentile":"83.33333333"},{"venue":"Workshop on New Paradigms in Information Visualization and Manipulation","id":"1008528748574c51895575943bf5a141b6defe19","venue_1":"Workshop on New Paradigms in Information Visualization and Manipulation","year":"1997","title":"Visualizing Document Authorship Using n-grams and Latent Semantic Indexing","authors":"Ian Soboroff, Charles K. Nicholas, James M. Kukla, David S. Ebert","author_ids":"1783237, 1761870, 2220816, 1701512","abstract":"An approach to visualizing authorship and writing style of free-form text documents is described. This approach uses n-grams and latent semantic indexing (LSI) to cluster documents according to usage patterns of related n-gram \\terms\". Latent semantic indexing distributes documents and terms into a relatively low-dimensional space, which can be viewed graphically using various visualization techniques.","cites":"11","conferencePercentile":"88.23529412"},{"venue":"Workshop on New Paradigms in Information Visualization and Manipulation","id":"13e1e972ac069fb67ad6157d0dd547485d25d309","venue_1":"Workshop on New Paradigms in Information Visualization and Manipulation","year":"1998","title":"Immersive 4D Visualization of Complex Dynamics","authors":"Estela A. Gavosto, James R. Miller, John Sheu","author_ids":"1914247, 5145046, 2235384","abstract":"A visualization technique for dynamical systems in two complex variables is introduced. With this new technique, interesting properties and structures previously undetected with other methods have been observed.","cites":"1","conferencePercentile":"43.33333333"},{"venue":"Workshop on New Paradigms in Information Visualization and Manipulation","id":"4b0a01fa5cdb3d612bebaf2e89b5558234cc1e1d","venue_1":"Workshop on New Paradigms in Information Visualization and Manipulation","year":"1999","title":"Using Shape to Visualize Multivariate Data","authors":"Chris Shaw, James A. Hall, Christine Blahut, David S. Ebert, D. Aaron Roberts","author_ids":"1698197, 2153174, 2766384, 1701512, 2641249","abstract":"This paper describes our recent findings in the area of using glyph shape to display one or two data dimensions in the visualization of 3D scalar and vector fields In our glyph-based visualization system, each glyph represents a data point in 3D space Visual attributes such as size, orientation, color and transparency can be mapped to data dimensions in the 3D space We are exploring the use of glyph shape as a display dimension, using superquadric superellipses as a means of supplying a parameterizable shape A basic factor in effectively using shape for quantitative visualization is determining how many (and which) superellipse shapes people can distinguish Since the superquadric shape's parameter set is not perceptually linear, we conducted a user study to which shapes people can generally distinguish The findings show that with large superellipses, about 22 separate shapes can be distinguished on average These results provide the foundation for exploring how effective superellipses may be in quantitative shape visualization","cites":"27","conferencePercentile":"86.66666667"},{"venue":"Workshop on New Paradigms in Information Visualization and Manipulation","id":"258e10dc66771dbf0147d8bee225b26841c0b89b","venue_1":"Workshop on New Paradigms in Information Visualization and Manipulation","year":"1998","title":"Supporting dynamic information visualization with VRML and databases","authors":"Thomas Risse, Martin Leissler, Matthias Hemmje, Karl Aberer, Thomas Klement","author_ids":"1743482, 1790094, 1799848, 1751802, 2815088","abstract":"Nowadays, many state-of-the-art user interfaces to complexly structured data collections require appropriate information visualization methods. With the increase in graphics performance available on client systems, methods for three-dimensional visualization can be applied more easily. The conceptual approach presented in this paper dynamically generates three-dimensional VRML scenes from information stored in database systems. To achieve this, VRML is extended with new nodes for supporting the server side generation of VRML scenes and for supporting trigger mechanisms. An implementation of the introduced concept is introduced by means of an object relational database system which is extended with a new VRML data type and its related functions. Altogether, these concepts and software components provide a platform for server-based information visualization mechanisms.","cites":"4","conferencePercentile":"66.66666667"},{"venue":"Workshop on New Paradigms in Information Visualization and Manipulation","id":"d232387b006f089801a328eb7516f1b7337f8a5e","venue_1":"Workshop on New Paradigms in Information Visualization and Manipulation","year":"1999","title":"Conceptua;izing Bandwidth Allocation in Network Management","authors":"George Melissargos, Pearl Pu","author_ids":"2254503, 1781996","abstract":"In our work, we focus on how resource allocation can benefit from visualization. In this paper, we present the main visualization techniques used in a bandwidth allocation system for the management of circuit-switched networks.","cites":"0","conferencePercentile":"10"},{"venue":"Workshop on New Paradigms in Information Visualization and Manipulation","id":"04edf04d995cd6b0a52a7f4c0a64044d3e60fad9","venue_1":"Workshop on New Paradigms in Information Visualization and Manipulation","year":"1998","title":"Using morphing for information visualization","authors":"Wolfgang Müller, Marc Alexa","author_ids":"1722084, 1751554","abstract":"Information visualization deals with the graphical display of data. For quantitative data, data values have to be mapped onto an appropriate visual scale. Several visual scales are well known, i.e. position , size, form, color, texture of graphical objects. We propose to use morphing or warping techniques to generate visual scales. Morphing between two graphical objects results in an interval of in-between objects, which represent a smooth blend between the base objects. By morphing between an object of this interval and a third base object, we construct a two-dimensional space of visual representations. Repeating this process, a space of any given dimension can be constructed. These spaces of visual representations are ideally suited for the visualization of multivariate/ multidimensional data.","cites":"6","conferencePercentile":"73.33333333"},{"venue":"Workshop on New Paradigms in Information Visualization and Manipulation","id":"174a1b33359d82417689972fbe7dcf8ae1a884cc","venue_1":"Workshop on New Paradigms in Information Visualization and Manipulation","year":"1997","title":"Perceptual and Interpretative Properties of Motion for Information Visualization","authors":"Lyn Bartram","author_ids":"1693758","abstract":"1. ABSTRACT Visualizing information in user interfaces to complex, large-scale systems is difficult due to an enormous amount of dynamic data distributed across multiple displays. While graphical representation techniques can reduce some of the cognitive overhead associated with comprehension, current interfaces suffer from the over-use of such representation techniques and exceed the human's perceptual capacity to cfficicntly interpret them. New disphy dimensions are required to support the user in information visualization. Advances in technology have made animation a viable alternative to static representations. Motion holds promise as a perceptually rich and efficient display dimension but little is known about its attributes for information display. This paper proposes that motion may prove useful in visuahzing complex information because of its preattentive and inter-prctative perceptual properties. A review of animation in current user interface and visualization design and research indicates that, while there is strong intuition about the \" usefulness \" of motion to communicate, there are few guidelines or empirical knowledge about how to employ it. This paper summarizes types of movement characterization from diverse disciplines and proposes an initial taxonomy of motion properties and application to serve as a framework for further empirical investigation into motion as a useful display dimension. 2. INTRODUCTION Modern complex information systems range from those used in supervisory control and data acquisition (SCADA) to the more familiar information networks: they can be characterized by large volumes of often dynamic information which cannot reasonably fit into single displays or even a single computer screen. Visualizing information in these systems is difficult for several reasons. The sheer Permission lo make di&l or hard cqies ofall or part ofthis work for pmnl or cl-UseisgriWcdwithoutfceprovidcdtbatcopis ore not mnde or distributed for profit or comma&d advantpgt and that copies bau this notice and the till citation on the firsz page. To copy olhavhe, to republish, to post on savers or to rcdiaibute to Us, requires prior specific pamission and/or a fzc. amount of data demands a large area of display space requiring users to manage many windows and to monitor and scan a large area. The dynamic nature of the data demands that users are aware of and able to redirect attention to changes across the entire visual field. Finally, the same data values and information sources often appear concurrently in different representations or views of the system, increasing the user's cognitive load of assimilating and integrating a composite \" …","cites":"31","conferencePercentile":"100"},{"venue":"Workshop on New Paradigms in Information Visualization and Manipulation","id":"a211d4f7ab85b9e4b3e08b6678b101e7642af9f7","venue_1":"Workshop on New Paradigms in Information Visualization and Manipulation","year":"1998","title":"Using clustering and visualization for refining the results of a WWW image search engine","authors":"Sougata Mukherjea, Kyoji Hirata, Yoshinori Hara","author_ids":"1719710, 2178243, 1764369","abstract":"Search engines are useful because they allow the user to find information of interest from the WorldWide Web. We have developed a WWW search engine called AMORE that allows users to find images on the Web. However, like textual search engines, AMORE sometimes retrieves a lot of results. Showing the retrieved images as pages of scrolled list, like other search engines, is not very user-friendly. Therefore, we have developed a query result visualization environment that allows the user to organize the search results in a Java applet using various techniques; for example, the user can use text and image clustering. This paper presents the architecture of the system and discusses the text and image clustering algorithms. Examples are used to show the usefulness of the techniques.","cites":"9","conferencePercentile":"96.66666667"},{"venue":"Workshop on New Paradigms in Information Visualization and Manipulation","id":"1e754583e9d494d30b593241722092e76809e4f0","venue_1":"Workshop on New Paradigms in Information Visualization and Manipulation","year":"1997","title":"Visualization is a State of Mind","authors":"Maarten van Dantzich","author_ids":"3104944","abstract":"1. ABSTRACT WC claim that Information Visualization (IV) is not so much an application area as a mindset: we can think of ordinary applications as visualizations to gain a fresh perspective on their design, In addition, we can improve our visualizations by paying attention to lessons learned in general UI design. Information access tasks call for such a new design approach, We will give some examples below. Furthermore, our mindset strongly shapes work done in the field: if we consider presenting information not just through graphics but also through other channels, visualization can be much richer, The fact that we call it visualization has a limiting effect; we propose to broaden the field. 2. INTRODUCTION Computers arc evolving as tools, While they started as computational devices, they have become information processors or document production systems, and are now increasingly used as information access tools. Users are often confronted with information management and rctricval tasks of a difficulty rarely experienced before by ordinary users, Searching large databanks is no longer a task restricted to specialized knowledge workers like librarians: mainstream computer users are facing incomprehensible information structures on a daily basis. The most obvious example is of course the task of finding information on the World Wide Web, but users now also grapple with impenetrable file systems hierarchies, and for many the personal c-mail archive is becoming a substantial databank in its own right. Existing application design practices (which we will refer to as traditional graphical user interface (GUI) design) do not effectively address these changing usage patterns: they are generally designed as \" command and control \" applications rather than information access apphcations. Thus, iconic file system browsers facilitate basic operations on files, but do not provide mechanisms to effectively find documents or understand more general properties of the tiles that are present across the hierarchy. Similarly, most email clients provide only primitive search facilities, and existing web browsers can be more accurately described as HTML viewers than as tools that facilitate information access', We claim that many applications can be made far more effective if the design process bIends GUI and IV perspectives. Information Visualization is currently portrayed as a young, rising field; one that hasn't come into its own yet, and that is looking for a killer app that will expose it to the masses. In fact, IV has been on everyone's desktop for years in components of …","cites":"1","conferencePercentile":"20.58823529"},{"venue":"Workshop on New Paradigms in Information Visualization and Manipulation","id":"3281a8a8bd0b65aa8d7e6100680b5f08d19c0900","venue_1":"Workshop on New Paradigms in Information Visualization and Manipulation","year":"1999","title":"Application Redirection: Hosting Windows Applications in 3D","authors":"Maarten van Dantzich, George G. Robertson, Vadim Gorokhovsky","author_ids":"3104944, 1699184, 2225464","abstract":"We present <italic>Application Redirection</italic>, a novel architecture that lets unmodified Windows applications be hosted in a 3D virtual environment. The result is a platform for experimentation in 3D Information Visualization in which the user retains all familiar productivity tools This paper describes the implementation of Application Redirection, using the Task Gallery to illustrate how it is used","cites":"6","conferencePercentile":"53.33333333"},{"venue":"Workshop on New Paradigms in Information Visualization and Manipulation","id":"070a185ee9a424bfd5dbe8ced7c71bec03f58d6a","venue_1":"Workshop on New Paradigms in Information Visualization and Manipulation","year":"1999","title":"Interactive Video Cubism","authors":"Sidney Fels, Kenji Mase","author_ids":"1749457, 1722602","abstract":"This paper presents an interactive video visualization system. In this visualization video data is considered to be a block of three dimensional data where frames of video data comprise the third dimension. The user can manipulate and see a cut plane through the video data. The visualization leads to images that are aesthetically interesting as well as being useful for image analysis","cites":"18","conferencePercentile":"76.66666667"},{"venue":"Workshop on New Paradigms in Information Visualization and Manipulation","id":"d05d18286d9a8ab88f6e0f5c604d8a178f25c2db","venue_1":"Workshop on New Paradigms in Information Visualization and Manipulation","year":"1998","title":"Information visualization for utilizing distributed information resources","authors":"Masanori Sugimoto, Norio Katayama","author_ids":"1679714, 3188216","abstract":"In this paper, we describe a system called COSPEX (Conceptual Space Explorer) which has so far been developed in our research project. The aim of the system is to support a group of users as well as individual users in their intelligent activities by utilizing distributed information resources. Based on conceptual modeling techniques and information visualiza-tion techniques, COSPEX integrates several functions such as information retrieval, information organization , information sharing, and provides users with an environment for supporting their tasks seamlessly and effectively.","cites":"0","conferencePercentile":"20"}]}