{"Workshop_on_Universal_Accessibi":[{"venue":"Workshop on Universal Accessibility of Ubiquitous Computing","id":"5a21479a663019e25edb60effb3087bfb69d5a87","venue_1":"Workshop on Universal Accessibility of Ubiquitous Computing","year":"2001","title":"NSF funding for research on universal access","authors":"Ephraim P. Glinert","author_ids":"3072281","abstract":"In 1998, the Division of Information and Intelligent Systems (IIS) within the Directorate for Computer and Information Science and Engineering (CISE), in response to then-recent Federal legislation and input from the scientific community, identified a need to develop a focused long-term effort to support fundamental research in computer science whose primary objective is to empower people with disabilities so that they are able to participate as first class citizens in the emerging information society. In particular, this implies affording the ability to find, manipulate, process and use information in an efficient and comprehensive manner-universal access to the power of computing and to information as its primary end product. This is not to suggest that research intended to address goals such as these had not previously been supported by NSF. At least as far back as the early 1990's, a number of projects in this area, including some for which the author served as principal investigator, were fi.mded by CISE through what was then known as the Division of Cross-Disciplinary Activities (CDA). In a separate effort, the Division of Human Resource Development (HRD) within the Directorate for Education and Human Resources (EHR) established in 1992 what in 1994 formally became the Program for Persons with Disabilities (PPD), with Lawrence A. Scadden as Program Director. PPD is dedicated to increasing the number of people with disabilities employed in the nation's science, mathematics, engineering, and technology (SMET) workforce. To accomplish this end, PPD supports projects designed to: • Bring about needed changes in academic and professional climates. • Increase the awareness and recognition of the needs and capabilities of students with disabilities. • Promote the accessibility and appropriateness of instructional materials, media, and educational technologies. • Increase the availability of student enrichment resources including mentoring activities. In short, PPD supports tightly focused efforts dedicated to changing the factors wherein neglect, poverty, and indirection have historically restricted the study of science and mathematics by students with disabilities, and impeded the advancement of these individuals as they prepared themselves for careers in SMET fields. Approximately 35 projects are fimded each year, including continuing awards (NSF terminology for the current-year installment on a multiyear award to which a commitment was made in a prior year); the program's FY'01 budget is approximately $5.25 million, which translates into $1.75 million available for new awards this year. As previously mentioned, the desire to improve the quality of life and …","cites":"0","conferencePercentile":"12"},{"venue":"Workshop on Universal Accessibility of Ubiquitous Computing","id":"4d42031f3f98db2c7dccf0f821809765baf9414a","venue_1":"Workshop on Universal Accessibility of Ubiquitous Computing","year":"2001","title":"Designing for dynamic diversity: making accessible interfaces for older people","authors":"Peter Gregor, Alan F. Newell","author_ids":"3182217, 1731857","abstract":"In this paper, we describe why designers need to look beyond the twin aims of designing for the 'typical' user and designing \"prostheses.\" Making accessible interfaces for older people is a unique but many faceted challenge. Effective applications and interface design needs to address the dynamic diversity of the human species. We introduce a new design paradigm, Design for Dynamic Diversity, and a methodology to assist its achievement, User Sensitive Inclusive Design.","cites":"29","conferencePercentile":"100"},{"venue":"Workshop on Universal Accessibility of Ubiquitous Computing","id":"11d6d29378be265f83d9855c0cd7018473210a80","venue_1":"Workshop on Universal Accessibility of Ubiquitous Computing","year":"2001","title":"Ubiquitous computing and AI towards an inclusive society","authors":"Daniel Gonçalves","author_ids":"1751841","abstract":"Elder citizens are faced with a large number of problems on their everyday lives. Loss of motor, sensorial and cognitive skills results in a growing difficulty to live and interact in today's society. Ubiquitous computing can help alleviate these problems, by allowing elders to have a normal life despite their shortcomings. Medical monitoring, communication and memory aids are already being developed. However, the large amount of data produced by those devices is of little use if not subject to some kind of analysis. Some Artificial Intelligence areas such as Knowledge Representation, Learning and Automated Planning can be used with success to improve what can be learned from the data. This will open the door for a wide range of applications that will adapt to the needs of each user and greatly improve the quality of life of elders.","cites":"8","conferencePercentile":"64"},{"venue":"Workshop on Universal Accessibility of Ubiquitous Computing","id":"0ab93430c30cef0486356633d740359d2bed9bbc","venue_1":"Workshop on Universal Accessibility of Ubiquitous Computing","year":"2001","title":"EC/NSF workshop on universal accessibility of ubiquitous computing: providing for the elderly event report","authors":"Rachelle S. Heller, Joaquim A. Jorge, Richard A. Guedj","author_ids":"2436280, 1776503, 2963391","abstract":"The workshop took place on Alc&#225;cer do Sal, Portugal from May 22<sup>nd</sup> to May 25<sup>th</sup>, 2001 with the purpose to discuss approaches to universal usability for the elderly constituency. Elderly citizens are a growing age group within developed countries and their needs have been mostly ignored by Information Technology and Computing as a whole. The surge of mobile communications and universal access materialized in the push for UMTS in Europe provided a strong <i>leitmotif</i> for this meeting. For the better part of a week, a group joining twenty-six people from several different communities gathered to discuss strategic issues arising from the new context. The aim is to provide strategic inputs for major research programs in EU, USA and Japan. The present document contains a summary account of the proceedings.","cites":"11","conferencePercentile":"80"},{"venue":"Workshop on Universal Accessibility of Ubiquitous Computing","id":"6821526f27d24569c16f32016f935436387f7d1b","venue_1":"Workshop on Universal Accessibility of Ubiquitous Computing","year":"2001","title":"Web access for elderly citizens","authors":"Vicki L. Hanson","author_ids":"1730685","abstract":"With elderly citizens becoming an increasingly large proportion of the population in many countries, social as well as economic considerations suggest that they must be considered in the development of current and future technologies. This paper addresses issues of Internet access, and discusses a research project designed to make the web more usable by elderly citizens. This project uses a proxy server to transcode web pages according to user-specified preferences and capabilities. Users access web pages as usual, with no specialized hardware required.","cites":"16","conferencePercentile":"84"},{"venue":"Workshop on Universal Accessibility of Ubiquitous Computing","id":"e4595d298b5991c3c99fe0fd64f145c1fbcf542d","venue_1":"Workshop on Universal Accessibility of Ubiquitous Computing","year":"2001","title":"Open syntax: improving access for all users","authors":"Robert J. K. Jacob","author_ids":"1723792","abstract":"Trends in new multi-modal user interfaces and pervasive mobile computing are raising technical problems for building flexible interfaces that can adapt to different communication modes. I hope to show how some aspects of the technical solutions that will be needed for these problems will also help to solve problems of access for elderly users.","cites":"3","conferencePercentile":"44"},{"venue":"Workshop on Universal Accessibility of Ubiquitous Computing","id":"599496f921b7619c4b9c82af62fa521214b3e705","venue_1":"Workshop on Universal Accessibility of Ubiquitous Computing","year":"2001","title":"Designing robust multimodal systems for universal access","authors":"Sharon L. Oviatt","author_ids":"2807460","abstract":"Multimodal interfaces are being developed that permit our highly skilled and coordinated communicative behavior to control system interactions in a more transparent and flexible interface experience than ever before. As applications become more complex, a single modality alone does not permit varied users to interact effectively across different tasks and usage environments [11]. However, a flexible multimodal interface offers people the choice to use a combination of modalities, or to switch to a better-suited modality, depending on the specifics of their abilities, the task, and the usage conditions.This paper will begin by summarizing some of the primary advantages of multimodal interfaces. In particular, it will discuss the inherent flexibility of multimodal interfaces, which is a key feature that makes them suitable for universal access and mobile computing. It also will discuss the role of multimodal architectures in improving the robustness and performance stability of recognition-based systems. Data will be reviewed from two recent studies in which a multimodal architecture suppressed errors and stabilized system performance for accented nonnative speakers and during mobile use. The paper will conclude by discussing the implications of this research for designing multimodal interfaces for the elderly, as well as the need for future work in this area.","cites":"8","conferencePercentile":"64"},{"venue":"Workshop on Universal Accessibility of Ubiquitous Computing","id":"9384d2ccc65cf91af19b28bc6555fd5469781c41","venue_1":"Workshop on Universal Accessibility of Ubiquitous Computing","year":"2001","title":"Adaptive tools for the elderly: new devices to cope with age-induced cognitive disabilities","authors":"Joaquim A. Jorge","author_ids":"1776503","abstract":"We look at the issues and methodologies needed to develop, deploy, and evaluate situation-aware mobile computing devices that adapt to the needs of elder users based on observed or predicted user behavior and needs. This paper discusses how pervasive computing can help the aging population live independently for as long as possible. We believe that successfully applying technology to this problem will require careful studies of how the target population actually lives and what their actual needs are. We propose a combination of traditional laboratory studies and surveys, as well as the use of instrumented spaces and personal monitoring devices to measure how people behave, normally and while using proposed assistive devices. A key requirement is the development of ways to simultaneously monitor signals from the body, activities, and social interactions to provide a more complete view of individuals and their lives. Some of the core research issues are machine learning to design devices learn from and adapt to user behavior, user-computer interaction to build devices and systems that support users in their tasks, mobile computing to support user and device mobility, mobility and data management to represent, access, update, and protect information, sensing devices that monitor human activity and finally rapid prototyping of services in a sensor-rich environment, in a scalable and secure manner.","cites":"18","conferencePercentile":"92"},{"venue":"Workshop on Universal Accessibility of Ubiquitous Computing","id":"1a546f0f87c4baa83d7506cbdb1a0b100490b05d","venue_1":"Workshop on Universal Accessibility of Ubiquitous Computing","year":"2001","title":"EMBASSI: multimodal assistance for universal access to infotainment and service infrastructures","authors":"Thomas Kirste, Thorsten Herfet, Michael Schnaider","author_ids":"1736967, 3111491, 2853219","abstract":"EMBASSI is a joint research project with 19 partners from industry and academia. Its focus is the development new paradigms and architectures for the intuitive interaction with technical infrastructures of the everyday life, such as home entertainment and control, public terminals, and car infotainment systems. As a so-called focus project, EMBASSI is funded by the German Ministry of Education and Research (BMBF) and addresses innovative methods of man-machine interaction, where \"machine\" explicitly refers to technical systems consisting of a variety of distributed, networked devices.EMBASSI aims at enhancing the interaction with these infrastructures by providing intelligent assistance, multimodal interaction, and anthropomorphic user interfaces within a unified framework. Technical development in EMBASSI is based on a user centered approach, with accompanying psychological and ergonomics research.A primary objective of the project is to establish an \"EMBASSI layer\" that extends recently developed networking standards like HAVi, UPnP, or Konnex towards user-centered, goal-based interaction by merging experiences from knowledge based AI systems with those coming from device oriented command and control architectures. This layer will enable the unification of interaction paradigms and will assist the user by enabling \"natural\" or \"intuitive\" commands instead of forcing the user to think in terms of device functions.","cites":"5","conferencePercentile":"56"},{"venue":"Workshop on Universal Accessibility of Ubiquitous Computing","id":"b64528578a23815d00de9aff3fbc81e279c72cc6","venue_1":"Workshop on Universal Accessibility of Ubiquitous Computing","year":"2001","title":"Universal access to mobile telephony as a way to enhance the autonomy of elderly people","authors":"Julio Abascal, Antonio Abad Civit Balcells","author_ids":"1747952, 1692532","abstract":"The rise of mobile telephony has opened a vast diversity of new opportunities for older people with different levels of physical restrictions due to ageing. Mobile technology allows not only ubiquitous communications but also anytime access to some services that are vital for elderly people's security and autonomy. Nevertheless, with the numerous advantages, remote services can also introduce important social and ethical risks for this group of users. This paper tries to analyse the novelties that mobile technology may introduce into the lives of older users, points out some dangers and challenges arising from the use of these technologies and revises some future applications of the present mobile technologies.","cites":"26","conferencePercentile":"96"},{"venue":"Workshop on Universal Accessibility of Ubiquitous Computing","id":"979da01c54ec487d7cd3deccd1cbeb9e5471cdc6","venue_1":"Workshop on Universal Accessibility of Ubiquitous Computing","year":"2001","title":"Delivering instructions for inherently-3D construction tasks: lessons and questions for universal accessibility","authors":"Laura M. Leventhal","author_ids":"2167605","abstract":"The notion that usability follows from the three dimensions, user, system and task, is not new. Clearly any model of effective user-centered design includes some focus on task; our work is an attempt to refine this notion. In this paper, I discuss a class of problems that we have dubbed <i>inherently-3D construction tasks.</i> These tasks should lend themselves to dual presentations, particularly those that include user-controlled 3D models or realistic videos. The results of several studies are described; the results indicate that dual presentations are effective at presenting instructions for inherently-3D construction tasks. When embedded in dual presentations, 3D models may be effective in presenting instructions for these types of tasks as well, so long as users make use of the models. A number of discussion questions are posited as to how this work would transfer to a wider population of users than was included in the studies that are reported.","cites":"1","conferencePercentile":"28"}]}