{"Workshops_on_Object-Oriented_Gr":[{"venue":"Workshops on Object-Oriented Graphics","id":"a6bc8cc1cd100543ae9cba9e92219947ada91121","venue_1":"Workshops on Object-Oriented Graphics","year":"1992","title":"An Interactive 3D Graphics Class Library in EIFFEL","authors":"Russell Turner, Enrico Gobbetti, Jean-Francis Balaguer, Angelo Mangili","author_ids":"1724556, 1708999, 2864515, 3187509","abstract":"An object-oriented design is presented for building interactive 3D graphics applications. The design takes the form of a library of classes written in Eiffel, an object oriented language with multiple inheritance, static typing, dynamic binding, garbage collection, and assertion checking. The classes form a set of reusable components from which a variety of other interactive 3D graphics applications could easily be constructed. A discussion of the overall design goals and philosophy is given. This is followed by a summary description of the purpose and implementation of each of the component class clusters. Finally, the issues are discussed of applying object-oriented techniques to interactive 3D graphics, including encapsulation of existing software and the implementation on a Silicon Graphics Iris workstation.","cites":"0","conferencePercentile":"50"},{"venue":"Workshops on Object-Oriented Graphics","id":"3319cf87b3e803506f0ddb1a3425a546bf66d9ea","venue_1":"Workshops on Object-Oriented Graphics","year":"1992","title":"An Object-Oriented Architecture for Constraint-Based Graphical Editing","authors":"Richard Helm, Tien Huynh, Kim Marriott, John M. Vlissides","author_ids":"2940215, 8014132, 1768695, 1781083","abstract":"Direct-manipulation graphics editors are useful tools for a wide variety of domains such as technical drawing, computer-aided design, application building, and music composition. Constraints can be a powerful mechanism for specifying complex semantics declaratively in these domains. To date, few domain-speciic graphics editors have provided constraint-based speciication and manipulation facilities. Part of the reason is that graphical editors are hard enough to develop without implementing a constraint system as well. Even though graphical editing frameworks can reduce the diiculty of constructing domain speciic graph-ical editors, a fundamental problem remains: there do not exist general constraint solving architectures that are eecient enough to support highly interactive editing, yet suitably exible and extensible to adapt to diierent editing domains. Addressing this problem, we present an object-oriented architecture that integrates the graphical editing framework Unidraw with QOCA, a powerful new constraint solving toolkit. QOCA leverages recent advances in symbolic computation and geometry to support eecient incremental solving of simultaneous equations and inequations, while optimizing convex quadratic objective functions. QOCA also supports new kinds of constraint manipulation that have novel applications to graphical editing. QOCA exploits the implementation language to provide a convenient, object-oriented syntax for expressing constraints in the framework. The result is a generic and easily extended architecture for constraint-based, direct-manipulation graphical editing.","cites":"32","conferencePercentile":"100"}]}