{"Workshop_on_the_Theory_and_Prac":[{"venue":"Workshop on the Theory and Practice of Provenance","id":"5331767d95a4978fdd8929f5733861dbf670cfd8","venue_1":"Workshop on the Theory and Practice of Provenance","year":"2009","title":"Authenticity and Provenance in Long Term Digital Preservation: Modeling and Implementation in Preservation Aware Storage","authors":"Michael Factor, Ealan A. Henis, Dalit Naor, Simona Rabinovici-Cohen, Petra Reshef, Shahar Ronen, Giovanni Michetti, Maria Guercio","author_ids":"3249855, 2080636, 2546772, 2550472, 2669341, 2073151, 2036027, 2997147","abstract":"A growing amount of digital objects is designated for long term preservation-a time scale during which technologies, formats and communities are very likely to change. Specialized approaches, models and technologies are needed to guarantee the long-term understandability of the preserved data. Maintaining the authenticity (trustworthiness) and provenance (history of creation, ownership, accesses and changes) of the preserved objects for the long term is of great importance, since users must be confident that the objects in the changed environment are authentic. We present a novel model for managing authenticity in long term digital preservation systems and a supporting archival storage component. The model and archival storage build on OAIS, the leading standard in the area of long-term digital preservation. The preservation aware storage layer handles provenance data, and documents the relevant events. It collocates provenance data (and other metadata) together with the preserved data in a secure environment, thus enhancing the chances of their co-survival. Handling authenticity and provenance at the storage layer reduces both threats to authenticity and computation times. This work addresses core issues in long-term digital preservation in a novel and practical manner. We present an example of managing authenticity of data objects during data transformation at the storage component. 1. Introduction Long Term Digital Preservation (LTDP) is the set of processes, strategies and tools used to store and access digital data for long periods of time during which technologies, formats, hardware, software and technical communities are very likely to change. The LTDP problem includes aspects of bit preservation","cites":"7","conferencePercentile":"26.92307692"}]}