{"Workshop_on_Human_Motion.csv":[{"venue":"Workshop on Human Motion","id":"63c92a727692a744627a5d1c7c750a129a98a8e7","venue_1":"Workshop on Human Motion","year":"2000","title":"Hand Shape Estimation Using Image Transition Network","authors":"Yasushi Hamada, Nobutaka Shimada, Yoshiaki Shirai","author_ids":"2802642, 1720453, 1700379","abstract":"This paper presents a method of hand posture estimation from silhouette images taken by two cameras. First, we extract the silhouette contour for a pair of images. We construct an eigenspace from images of hands with various postures. For effective matching, we define a shape complexity for each image to see how well the shape feature is represented. For a pair of input images, the total matching error is computed by combining the two matching errors according to the shape complexity. Thus the best-matched image is obtained for a pair of images. For rapid processing, we limit the matching candidate by using the constraint on the shape change. The possible shape transition is represented by a transition network. Because the network is hard to build, we apply offline learning, where nodes and links are automatically created by showing examples of hand shape sequences. We show experiments of building the transition networks and the performance of matching using the network .","cites":"4","conferencePercentile":"18.18181818"},{"venue":"Workshop on Human Motion","id":"74ae9f3e747e2066a50e74bec50346b7d1fd3eab","venue_1":"Workshop on Human Motion","year":"2007","title":"Marker-Less 3D Feature Tracking for Mesh-Based Human Motion Capture","authors":"Edilson de Aguiar, Christian Theobalt, Carsten Stoll, Hans-Peter Seidel","author_ids":"2049341, 1680185, 1835746, 1746884","abstract":"We present a novel algorithm that robustly tracks 3D tra-jectories of features on a moving human who has been recorded with multiple video cameras. Our method does so without special markers in the scene and can be used to track subjects wearing everyday apparel. By using the paths of the 3D points as constraints in a fast mesh deformation approach, we can directly animate a static human body scan such that it performs the same motion as the captured subject. Our method can therefore be used to directly animate high quality geometry models from unaltered video data which opens the door to new applications in motion capture, 3D Video and computer animation. Since our method does not require a kinematic skeleton and only employs a handful of feature trajectories to generate lifelike animations with realistic surface deformations , it can also be used to track subjects wearing wide apparel, and even animals. We demonstrate the performance of our approach using several captured real-world sequences, and also validate its accuracy.","cites":"9","conferencePercentile":"60"},{"venue":"Workshop on Human Motion","id":"c442b8ca539596d5b93dcb88e080b2c3c1e018a7","venue_1":"Workshop on Human Motion","year":"2007","title":"Modeling Human Locomotion with Topologically Constrained Latent Variable Models","authors":"Raquel Urtasun, David J. Fleet, Neil D. Lawrence","author_ids":"2422559, 1793739, 1739851","abstract":"Learned, activity-specific motion models are useful for human pose and motion estimation. Nevertheless, while the use of activity-specific models simplifies monocular tracking, it leaves open the larger issues of how one learns models for multiple activities or stylistic variations , and how such models can be combined with natural transitions between activities. This paper extends the Gaussian process latent variable model (GP-LVM) to address some of these issues. We introduce a new approach to constraining the latent space that we refer to as the locally-linear Gaussian process latent variable model (LL-GPLVM). The LL-GPLVM allows for an explicit prior over the latent configurations that aims to preserve local topological structure in the training data. We reduce the computational complexity of the GPLVM by adapting sparse Gaussian process regression methods to the GP-LVM. By incorporating sparsification, dynamics and back-constraints within the LL-GPLVM we develop a general framework for learning smooth latent models of different activities within a shared latent space, allowing the learning of specific topologies and transitions between different activities.","cites":"16","conferencePercentile":"70"},{"venue":"Workshop on Human Motion","id":"6bca1b57b6e1832a132e308a1ef1c23e30a438d9","venue_1":"Workshop on Human Motion","year":"2000","title":"A Framework for Motion Recognition with Applications to American Sign Language and Gait Recognition","authors":"Christian Vogler, Harold C. Sun, Dimitris N. Metaxas","author_ids":"2467082, 2449762, 1711560","abstract":"Human motion recognition has many important applications , such as improved human-computer interaction and surveillance. A big problem that plagues this research area is that human movements can be very complex. Manging this complexity is difficult. We turn to American Sign Language (ASL) recognition to identify general methods that reduce the complexity of human motion recognition. In this paper we present a framework for continuous 3D ASL recognition based on linguistic principles, especially the phonology of ASL. This framework is based on parallel Hidden Markov Models (HMMs), which are able to capture both the sequential and the simultaneous aspects of the language. Each HMM is based on a single phoneme of ASL. Because the phonemes are limited in number, as opposed to the virtually unlimited number of signs that can be composed from them, we expect this framework to scale well to larger applications. We then demonstrate the general applicability of this framework to other human motion recognition tasks by extending it to gait recognition.","cites":"16","conferencePercentile":"45.45454545"},{"venue":"Workshop on Human Motion","id":"1dd315afec6f35ac3b7f9bd529158a9da500befc","venue_1":"Workshop on Human Motion","year":"2000","title":"Robust Head Motion Computation by Taking Advantage of Physical Properties","authors":"Zicheng Liu, Zhengyou Zhang","author_ids":"1691128, 1732465","abstract":"Head motion determination is an important problem for many applications including face modeling and tracking. We present a new algorithm to compute the head motion between two views from the correspondences of five feature points (eye corners, mouth corners, and nose tip), and zero or more additional image point matches. The algorithm takes advantage of the physical properties of the feature points such as symmetry, and it significantly improves the robustness of head motion estimation. This is achieved by reducing the number of unknowns to estimate, thus increasing information redundancy. This idea can be easily extended to any number of feature point correspondences.","cites":"13","conferencePercentile":"36.36363636"}]}