{"Workshop_on_Information_Integra":[{"venue":"Workshop on Information Integration on the Web","id":"b3b5e21abe874a182d9751db64e658b92b52d6fd","venue_1":"Workshop on Information Integration on the Web","year":"2001","title":"Linking Homogeneous Web-based Repositories","authors":"Maria da Graça Campos Pimentel, Alessandra Alaniz Macedo, Gregory D. Abowd","author_ids":"1806735, 1733246, 1732524","abstract":"The eClass is an instrumented environment that automatically captures details of a lecture experience and provides effective multimedia-enhanced web-based interfaces for users to review the lecture. The CoWeb is a web-based service for collaborative authoring of web-based material. The eClass and CoWeb information repositories, when integrated, provide a persistent medium for collaborative learning. We present in this paper the results from a preliminary service that creates links automatically among those repositories. We experimented with data from a graduate course that had a manual linking service available. Results of an ad hoc evaluation indicate that most links were relevant and complement those created manually.","cites":"7","conferencePercentile":"71.42857143"},{"venue":"Workshop on Information Integration on the Web","id":"2d0b302fbd7b90ae7da7f5c8404bd9e0254870ff","venue_1":"Workshop on Information Integration on the Web","year":"2001","title":"Semantic Query Transformation for the Intelligent Integration of Information Sources over the Web","authors":"Ismail Khalil, Werner Winiwarter, Stéphane Bressan","author_ids":"2822661, 1722212, 1735321","abstract":"With the proliferation of data sources (databases, knowledge bases, and applications providing structured and semi-structured data) over the Internet, a critical problem is how to find, extract, and aggregate relevant information. In this paper, we present and discuss a variant of an existing algorithm for Answering Queries Using Views by extending it to make use of the semantics of the database in the form of integrity constraints to support the intelligent integration of information sources over the Web.","cites":"5","conferencePercentile":"39.28571429"},{"venue":"Workshop on Information Integration on the Web","id":"0d6ea04646662c949c04d5652785e23bf3a92948","venue_1":"Workshop on Information Integration on the Web","year":"2001","title":"On the Design of a Tool for Controlling Privacy in the WWW","authors":"Lucila Ishitani, Gustavo Machado Campagnani Gama, Virgílio A. F. Almeida, Dorgival Olavo Guedes Neto, Wagner Meira","author_ids":"1799656, 2972334, 7360316, 2516013, 1691267","abstract":"Concerns about users' privacy are currently attracting signiicant attention. Users usually do not approve of someone mining their actions and habits while they use the Web. On the other hand, having some information about the user's behavior is essential for providing personalized services. Thus, there is a clear demand for mechanisms that allow users to control their privacy without relying on the visited site's policies. In this paper we propose a tool that tells the user the level of privacy maintained throughout hissher interaction with a given site. By using our tool, the user can become aware of privacy violations and may use privacy preservation mechanisms.","cites":"0","conferencePercentile":"7.142857143"},{"venue":"Workshop on Information Integration on the Web","id":"3fd772b3a06493fd9026a4c5750e29c08c50deb0","venue_1":"Workshop on Information Integration on the Web","year":"2001","title":"RDF-Based Architecture for Semantic Integration of Heterogeneous Information Sources","authors":"Richard Vdovjak, Geert-Jan Houben","author_ids":"1738027, 1703821","abstract":"The proposed integration architecture aims at exploiting data semantics in order to provide a coherent and meaningful (with respect to a given conceptual model) view of the integrated heterogeneous information sources. The architecture is split into five separate layers to assure modularization, providing description, requirements , and interfaces for each. It favors the lazy retrieval paradigm over the data warehousing approach. The novelty of the architecture lies in the combination of semantic and on-demand driven retrieval. This line of attack offers several advantages but brings also challenges, both of which we discuss with respect to RDF, the architecture's underlying model.","cites":"26","conferencePercentile":"89.28571429"},{"venue":"Workshop on Information Integration on the Web","id":"39b576e0cb47b2684558c318a0a68b2bcf91a2c2","venue_1":"Workshop on Information Integration on the Web","year":"2001","title":"Digital Library Services Supporting Information Integration over the Web","authors":"Tarcisio Lima, Amit P. Sheth, Naveen Ashish, Mukesh Guntamadugu, Sriram Lakshminarayan, Narayanan Palsena, Dilpreet Singh","author_ids":"2314029, 1709950, 2178614, 2848002, 2759123, 1846256, 2935836","abstract":"Our research and development activities in digital libraries raised relevant features in supporting Web information integration. Underlain by an in house multi-agent based architecture, the main achievements so far have been prototyped as services: (a) various semantic interoperability niches, by the use of inter-ontological relationships built onto iscapes (a means of specifying information requests using embedded context sensitive information); (b) integrated access to information, by automating metabase (a database of metadata) creation; (c) a framework for creating iscapes and metadata modeling; and (d) information processing, by query planning and cost modeling of Web sources. A real-world application scenario illustrates how geographical and environmental Web-based information systems can benefit from appropriating these facilities. 1 Introduction Most mediation and information brokering (e.g., [1], [2], [3]) systems integrate information from multiple sources and allow end users to pose information requests on their repositories. Some mediation systems also allow use of ontologies and 'is-a' relationship (and corresponding subsumption based reasoning) (e.g., [4], [5]). However, very few systems (e.g., [6]) let users explore more complex and meaningful semantic relationships or support information requests built upon information correlations involving semantic relationships. The overall goal of the Alexandria Digital Earth Prototype Project at the University of Georgia (ADEPT UGA) [7] is to develop digital library sources, which are capable of representing geospatial information and meta-information collections in a Digital Earth metaphor. The","cites":"6","conferencePercentile":"57.14285714"}]}