{"Workshop_Mobile_Commerce.csv":[{"venue":"Workshop Mobile Commerce","id":"08375ec49bd816e6c1b652673f08ec97afcf9c69","venue_1":"Workshop Mobile Commerce","year":"2002","title":"Advertising in a pervasive computing environment","authors":"Anand Ranganathan, Roy H. Campbell","author_ids":"1783727, 1687256","abstract":"The advent of the internet has revolutionized the field of advertising by providing a whole new path for reaching potential customers. Studies show that online advertising is, on the whole, extremely effective and that consumer acceptance of online advertising is comparable to traditional media[7][8]. One of the reasons for the high effectiveness of online advertising is that users interact with the web at a far more personal and intimate level than they interact with other advertising media like the radio or television. Pervasive computing environments deal with users at an even more intimate level; hence such environments are even better advertising platforms than the web. Pervasive environments allow the delivery of relevant advertising in suitable ways to selected consumers. In this paper, we examine some of the possibilities of pervasive advertising as well as some of the issues involved.","cites":"31","conferencePercentile":"86.66666667"},{"venue":"Workshop Mobile Commerce","id":"12f242700c5929d40d337a8466ed7a5f59bc664c","venue_1":"Workshop Mobile Commerce","year":"2002","title":"Allia: alliance-based service discovery for ad-hoc environments","authors":"Olga Ratsimor, Dipanjan Chakraborty, Anupam Joshi, Timothy W. Finin","author_ids":"3170512, 1738028, 1775246, 1770852","abstract":"Static directory based service discovery is unsuitable for m-commerce in ad-hoc environments. In this paper, we present Allia: a peer-to-peer caching based and policy-driven agent-service discovery framework to facilitate cross-platform service discovery in ad-hoc environments for mobile electronic commerce applications. Our approach removes the problems associated with structured compound formation of agent communities in mobile commerce environment and achieves high degree of flexibility in adapting itself to the changes of the ad-hoc environment. Our framework takes into consideration device capabilities and limitations, user preferences regarding usage of the devices, application specifics with respect to mobile commerce and adapts accordingly. We also present an initial implementation of Allia over ThinkPads and iPAQs by extending the LEAP Agent Platform and using Bluetooth as the underlying network protocol.","cites":"67","conferencePercentile":"93.33333333"},{"venue":"Workshop Mobile Commerce","id":"0b607608ba875ee762ef3a2eedbed9c6b2750342","venue_1":"Workshop Mobile Commerce","year":"2002","title":"A case study in pervasive retail","authors":"George Roussos, Juha Tuominen, Leda Koukara, Olli Seppala, Panos E. Kourouthanassis, George M. Giaglis, Jeroen Frissaer","author_ids":"1735411, 8306195, 3259523, 1870332, 3320183, 2152477, 1844101","abstract":"In this paper we discuss the rationale for the development of MyGrocer, a second-generation pervasive retail system, as well as its implications for the fast moving consumer goods (FMCG) sector. We will only touch upon the technology infrastructure and the required technical developments since these have been discussed extensively elsewhere. The focus here is on the one hand, on the analysis of the business forces that dictate the development of pervasive retail and on the other, the implications and the opportunities for innovative business models offered by the dis-intermediation effect of pervasive retail on the supply chain of FMCG. The MyGrocer system has undergone two phases of field-testing and is expected to be fully operational by the end of this year. The development of the MyGrocer architecture is a collaborative effort between industry and academia within Europe.","cites":"10","conferencePercentile":"50"},{"venue":"Workshop Mobile Commerce","id":"5c181276901ce1e71626c63667890af2812241d2","venue_1":"Workshop Mobile Commerce","year":"2004","title":"Mobile Process Landscaping am Beispiel von Vertriebsprozessen in der Assekuranz","authors":"André Köhler, Volker Gruhn","author_ids":"3200819, 1743762","abstract":"Beispielsweise sind die Kunden-und Vertriebsprozesse am Point of Sale (POS) oft nur schwach an die IT-Infrastruktur des Unternehmens angebunden [Gr03], gleichzeitig gehö-ren diese Prozesse zu den Wichtigsten innerhalb der Wertschöpfungskette. Insbesondere die Fokussierung auf die Vermeidung von Medienbrüchen konnte hier vielfach nicht oder nur unzureichend realisiert werden, da eine Anbindung der Prozessteile mit Kundenkon","cites":"11","conferencePercentile":"100"},{"venue":"Workshop Mobile Commerce","id":"586a7b41bbb6a82002325f7b1cbd2656a5498ce4","venue_1":"Workshop Mobile Commerce","year":"2001","title":"Enabling location-based applications","authors":"Chatschik Bisdikian, Jim Christensen, John S. Davis, Maria Ebling, Guerney D. H. Hunt, William F. Jerome, Hui Lei, Stéphane H. Maes, Daby M. Sow","author_ids":"1717717, 2006583, 1806528, 1803046, 2647458, 1780573, 8387734, 2161939, 3189707","abstract":"We identify a number of factors that may hinder the commercial success of location-based applications: the concern of privacy, the need to consider context beyond location, the presence of voluminous resources, and the constrained interfaces available on mobile devices. We describe an end-to-end system architecture with integrated support to address these issues. In particular, the architecture includes a Secure Context Service that provides broad context information to applications and allows people to flexibly control the release of their private information, an Intelligent Service Discovery Service that allows for personalized selection of physical and virtual services, and a multi-modal interaction mechanism that enables users to exploit multiple synchronized access channels to interact with an application and to switch among channels at any time. Our goals are to improve user experience, to reduce user distraction and to facilitate awareness of the physical world.","cites":"17","conferencePercentile":"80"},{"venue":"Workshop Mobile Commerce","id":"eafd08345ffe5d8aa9b738b21f5167111176ba64","venue_1":"Workshop Mobile Commerce","year":"2002","title":"Using GSM to enhance e-commerce security","authors":"Vorapranee Khu-smith, Chris J. Mitchell","author_ids":"1748220, 1723348","abstract":"Today, an e-commerce transaction is typically protected using SSL/TLS@. However, there remain some risks in such use of SSL/TLS@. These include that of information being stored in clear at the end point of the communication link and lack of user authentication. Although SSL/TLS does offer the latter, the security service is optional and usually omitted. This is because of the fact that users typically do not have the necessary asymmetric key pair. Since SSL/TLS protects data only while it is being transmitted, the merchant has access to sensitive information such as the debit/credit card number. The storage of unencrypted debit/credit card information at the merchant server therefore represents a risk that is not currently addressed by the use of SSL/TLS to secure electronic payment transactions.In this paper, we propose a payment protocol in which the risk of having debit/credit card details stored at a merchant server is eliminated. User authentication is also provided. This is achieved by utilising the GSM data confidentiality service to encrypt sensitive information. The GSM security service is also used to provide user identity authentication. The additional security is realised in such a way that no management overhead is imposed on the user.","cites":"5","conferencePercentile":"13.33333333"},{"venue":"Workshop Mobile Commerce","id":"ade4a1b220a4791746363ae152f1d5f37b8840c0","venue_1":"Workshop Mobile Commerce","year":"2001","title":"An approach to providing a seamless end-user experience for location-aware applications","authors":"Sastry Duri, Alan Cole, Jonathan Munson, Jim Christensen","author_ids":"2219247, 2952519, 3271627, 2006583","abstract":"With an increasing number of businesses considering the possibility of launching location-aware, mobile commerce applications, the quality of the end-user experience will become more and more critical. We propose <i>dynamic bookmarks</i> and <i>location domains</i> as mechanisms to give consumers simple and straightforward access to a dynamically changing set of location-based services. Dynamic bookmarks are descriptions of services, which are bound to actual, registered, services as a user's location changes. Location domains provide meaningful location context for location-aware services. We discuss the motivation and background of our work in progress, describe the key concepts involved, and present a system architecture we have adopted.","cites":"14","conferencePercentile":"65"},{"venue":"Workshop Mobile Commerce","id":"86d48b361dbb59b81713d136543b2a18d4cf39b3","venue_1":"Workshop Mobile Commerce","year":"2002","title":"Intelligent pervasive middleware for context-based and localized telematics services","authors":"Chatschik Bisdikian, Isaac Boamah, Paul C. Castro, Archan Misra, Jim Rubas, Nicolas Villoutreix, Danny L. Yeh, Vladimir Rasin, Henry Huang, Craig Simonds","author_ids":"1717717, 1950454, 2171451, 1721672, 2738746, 2779737, 1685210, 3263663, 1712507, 2657693","abstract":"Telematics is arguably the next-wave in mobile computing: with most cars already equipped with multiple embedded computing platforms, we shall witness the development of a variety of mobile services and applications with significant commercial potential. Telematics will only become a commercial reality when the underlying architecture is able to address significant concerns related to the security and privacy of telematics data, and is able to provide context information from and to a large number of mobile data sources in a scalable and device-independent manner. A telematics platform should utilize existing Internet components and technologies but cannot rely exclusively on these, especially since mobile commerce applications in the telematics environment impose specific requirements on the relationships between various services and data providers. In this paper we describe how we are developing an open standards telematics platform based on the ts-PWLAN wireless service environment and the Telematics Resource Manager middleware. Our design employs existing web service interfaces coupled with novel technology for connecting to these through a wireless gateway. Our middleware acts as a common substrate for building and deploying a wide range of telematics applications. We describe how several of these applications are currently being built on our infrastructure.","cites":"20","conferencePercentile":"73.33333333"},{"venue":"Workshop Mobile Commerce","id":"4825f26769b8c9f7948e706255edfe49c3b4b92b","venue_1":"Workshop Mobile Commerce","year":"2002","title":"Framework for security and privacy in automotive telematics","authors":"Sastry Duri, Marco Gruteser, Xuan Liu, Paul Moskowitz, Ronald Perez, Moninder Singh, Jung-Mu Tang","author_ids":"2219247, 1708469, 1730011, 2225253, 2853002, 1684355, 2101355","abstract":"Automotive telematics may be defined as the information-intensive applications that are being enabled for vehicles by a combination of telecommunications and computing technology. Telematics by its nature requires the capture of sensor data, storage and exchange of data to obtain remote services. In order for automotive telematics to grow to its full potential, telematics data must be protected. Data protection must include privacy and security for end-users, service providers and application providers. In this paper, we propose a new framework for data protection that is built on the foundation of privacy and security technologies. The privacy technology enables users and service providers to define flexible data model and policy models. The security technology provides traditional capabilities such as encryption, authentication, non-repudiation. In addition, it provides secure environments for protected execution, which is essential to limiting data access to specific purposes.","cites":"70","conferencePercentile":"100"},{"venue":"Workshop Mobile Commerce","id":"1bb56ae0a70b030e2f2376ed246834bddcabd27b","venue_1":"Workshop Mobile Commerce","year":"2002","title":"Location-based notification as a general-purpose service","authors":"Jonathan P. Munson, Vineet K. Gupta","author_ids":"2197621, 1922172","abstract":"An often-discussed mobile commerce application is proximity-based coupon delivery. In a typical scenario a merchant is notified when a valued customer is within some distance of a retail outlet, upon which the customer is delivered a coupon or some notice of a special promotion. We believe that this basic mechanism of location-based notification has application far beyond commercial promotion, and is also of interest for tourism, traffic information, public service, and public safety. Furthermore, we believe that a general-purpose location-based notification service that can serve all these applications would be highly useful. However, as we will show, current architectures deployed by wireless carriers to service location-aware applications cannot handle the load of positioning requests implied by such a general-purpose service. We motivate the need for such a service, discuss the limitations of current architectures for providing location information, and detail the requirements for an architecture which would make such a service possible.","cites":"26","conferencePercentile":"80"}]}