{"Workshop_on_Wireless_Security.c":[{"venue":"Workshop on Wireless Security","id":"e1b1d1c12ed3e5cb4a110adc70b1091ddb0538c7","venue_1":"Workshop on Wireless Security","year":"2002","title":"Securing IPv6 neighbor and router discovery","authors":"Jari Arkko, Tuomas Aura, James Kempf, Vesa-Matti Mäntylä, Pekka Nikander, Michael Roe","author_ids":"2268532, 1710566, 2951397, 3036883, 1751537, 2398096","abstract":"When IPv6 Neighbor and Router Discovery functions were defined, it was assumed that the local link would consist of mutually trusting nodes. However, the recent developments in public wireless networks, such as WLANs, have radically changed the situation. The nodes on a local link cannot necessarily trust each other any more, but they must become mutually suspicious even when the nodes have completed an authentication exchange with the network. This creates a number of operational difficulties and new security threats. In this paper we provide a taxonomy for the IPv6 Neighbor and Router Discovery threats, describe two new cryptographic methods, Cryptographically Generated Addresses (CGA) and Address Based Keys (ABK), and discuss how these new methods can be used to secure the Neighbor and Router discovery mechanisms.","cites":"15","conferencePercentile":"20"},{"venue":"Workshop on Wireless Security","id":"b12d61f3471758604149c30d2bf8c5e3260d7be6","venue_1":"Workshop on Wireless Security","year":"2004","title":"Analysis of the 802.11i 4-way handshake","authors":"Changhua He, John C. Mitchell","author_ids":"7399545, 1685743","abstract":"802.11i is an IEEE standard designed to provide enhanced MAC security in wireless networks. The authentication process involves three entities: the supplicant (wireless device), the authenticator (access point), and the authentication server (e.g., a backend RADIUS server). A 4-Way Handshake must be executed between the supplicant and the authenticator to derive a fresh pairwise key and/or group key for subsequent data transmissions.We analyze the 4-Way Handshake protocol using a finite-state verification tool and find a Denial-of-Service attack. The attack involves forging initial messages from the authenticator to the supplicant to produce inconsistent keys in peers. Three repairs are proposed; based on various considerations, the third one appears to be the best. The resulting improvement to the standard, adopted by the 802.11 TGi in their final deliberation, involves only a minor change in the algorithm used by the supplicant.","cites":"44","conferencePercentile":"30"},{"venue":"Workshop on Wireless Security","id":"395863684e8dd5617ce7340e090bbb7d42810f37","venue_1":"Workshop on Wireless Security","year":"2006","title":"Proactive security for mobile messaging networks","authors":"Abhijit Bose, Kang G. Shin","author_ids":"2146698, 1730051","abstract":"The interoperability of IM (Instant Messaging) and SMS (Short Messaging Service) networks allows users to seamlessly use a variety of computing devices from desktops to cellular phones and mobile handhelds. However, this increasing convergence has also attracted the attention of malicious software writers. In the past few years, the number of malicious codes that target messaging networks, primarily IM and SMS, has been increasing exponentially. Large message volume and number of users in these networks renders manual mitigation of malicious software nearly impossible. This paper proposes <i>automated</i> and <i>proactive security</i> models to protect messaging networks from mobile worms and viruses. First, we present an algorithm for automated identification of the most vulnerable clients in the presence of a malicious attack, based on interactions among the clients. The simplicity of our approach enables easy integration in most client-server messaging systems. Next, we describe a proactive containment framework that applies two commonly-used mechanisms---rate-limiting and quarantine---to the dynamically-generated list of vulnerable clients in a messaging network whenever a worm or virus attack is suspected. Finally, we evaluate the effectiveness of proactive security in a cellular network using data from a large real-life SMS customer network, and compare it against other existing approaches. Most messaging networks can implement our proposed framework without any major modification of their existing infrastructure.","cites":"20","conferencePercentile":"54.54545455"},{"venue":"Workshop on Wireless Security","id":"1a9cfcadf6cb93620f24af228ad0f679f71bb134","venue_1":"Workshop on Wireless Security","year":"2005","title":"Secure time synchronization service for sensor networks","authors":"Saurabh Ganeriwal, Srdjan Capkun, Chih-Chieh Han, Mani B. Srivastava","author_ids":"1979240, 1791522, 3024752, 1702254","abstract":"In this paper, we analyze attacks on existing time synchronization protocols for wireless sensor networks. We propose a secure time synchronization toolbox to counter these attacks. This toolbox includes protocols for secure pairwise and group synchronization of nodes that lie in each other's power ranges and of nodes that are separated by multiple hops. We provide an in-depth analysis of security and energy overhead of the proposed protocols.","cites":"87","conferencePercentile":"91.66666667"},{"venue":"Workshop on Wireless Security","id":"2cde432f00f1e6977ca833d433b642715dbdf634","venue_1":"Workshop on Wireless Security","year":"2003","title":"BISS: building secure routing out of an incomplete set of security associations","authors":"Srdjan Capkun, Jean-Pierre Hubaux","author_ids":"1791522, 1757221","abstract":"We investigate secure routing in ad hoc networks in which security associations exist only between a subset of all pairs of nodes. We focus on source routing protocols. We show that to establish secure routes, it is in general not necessary that security associations exist between all pairs of nodes; a fraction of security associations is sufficient. We analyze the performance of existing proposals for secure routing in such conditions. We also propose a new protocol, designed specifically for ad hoc networks with an incomplete set of security associations between the nodes. We call this protocol BISS: a protocol for Building Secure Routing out of an Incomplete Set of Security Associations. We present a detailed analysis of this protocol, based on simulations, and show that it can be as secure as the existing proposals that rely on a complete set of security associations.","cites":"35","conferencePercentile":"40"},{"venue":"Workshop on Wireless Security","id":"35477bba11032e273c420e09cc3ff8e7faae450d","venue_1":"Workshop on Wireless Security","year":"2004","title":"Security considerations for IEEE 802.15.4 networks","authors":"Naveen Sastry, David Wagner","author_ids":"2948985, 4073051","abstract":"The IEEE 802.15.4 specification outlines a new class of wireless radios and protocols targeted at low power devices, personal area networks, and sensor nodes. The specification includes a number of security provisions and options. In this paper, we highlight places where application designers and radio designers should exercise care when implementing and using 802.15.4 devices. Specifically, some of the 802.15.4 optional features actually reduce security, so we urge implementors to ignore those extensions. We highlight difficulties in safely using the security API and provide recommendations on how to change the specification to make it less likely that people will deploy devices with poor security configurations.","cites":"91","conferencePercentile":"50"},{"venue":"Workshop on Wireless Security","id":"1ef16c966da70b141b8905625e539b2079273ba9","venue_1":"Workshop on Wireless Security","year":"2006","title":"Modeling Ad-hoc rushing attack in a negligibility-based security framework","authors":"Jiejun Kong, Xiaoyan Hong, Mario Gerla","author_ids":"1779807, 1696277, 8467438","abstract":"In this paper, we propose a formal notion of network security for ad hoc networks. We adopt a probabilistic security framework, that is, security is defined by a polynomially bounded adversary model, the cost of attack and the cost of defense. In a complex and probabilistic system, we speak of the \"infeasibility\" of breaking the security system rather than the \"impossibility\" of breaking the same system. Security is defined on the concept of \"negligible\", which is asymptotically sub-polynomial with respect to a pre-defined system parameter <i>x</i>. Intuitively, the parameter <i>x</i> in cryptography is the key length <i>n</i>. We apply the same bounds in ad hoc network security research, but in regard to <i>scalability</i> from now on. We propose an <i>RP</i> (<i>n</i>-runs) complexity class with a global virtual god oracle (<i>GVG</i>) to model a general class of network protocols. In <i>GVG-RP</i> (<i>n</i>-runs) class, the network scale (i.e., number of network members) <i>N</i> replaces the role of key length <i>n</i> in cryptography. From our formal rigorous treatment, we show that \"rushing attack\" is a severe attack that can reduce the success probability of common ad hoc routing schemes to negligible.Fortunately, countermeasures can be devised to answer this challenge. (1) Common network protocols are <i>not</i> designed to ensure that probability of security failure is negligible. In such designs, the system's security is not related to scalability. There is no asymptotic security guarantee in the network design; (2) We seek to devise security schemes to ensure that the probability of security failure is <i>negligible</i> in regard to network <i>scale</i>. In Theorem 2, we present an asymptotic invariant for scalable networks: \"a polynomial-time network algorithm that ensures negligible probability of security failure at each step would stay in the state of ensuring negligible probability of security failure globally\". This invariant demonstrates the existence of asymptotic security guarantee in ad hoc networks. It leads to the design of community-based secure routing to defend against rushing attacks. Nevertheless, it is unknown to us whether the ideal invariant can be practically implemented.","cites":"4","conferencePercentile":"18.18181818"},{"venue":"Workshop on Wireless Security","id":"109166baff68f0c6fb0f72f3a69ff3f354cc9a7e","venue_1":"Workshop on Wireless Security","year":"2005","title":"The security of vehicular networks","authors":"Jean-Pierre Hubaux","author_ids":"1757221","abstract":"Vehicular networks are likely to become the most relevant form of mobile ad hoc networks (see e.g. http://ivc.epfl.ch). In this talk, we address the security of these networks, a topic that has been (surprisingly) overlooked by the research community. We provide a detailed threat analysis and devise appropriate security architecture. We also describe some major design decisions still to be made, which in some cases have more than mere technical implications. We provide a set of security protocols; we show that they protect privacy and we analyze their robustness. We also carry out a quantitative assessment of the proposed solution.This work has been carried out in collaboration with Maxim Raya and Imad Aad.","cites":"15","conferencePercentile":"41.66666667"},{"venue":"Workshop on Wireless Security","id":"6f638345350f8ea590e77612dbbb74fa8d05aa40","venue_1":"Workshop on Wireless Security","year":"2005","title":"Strengthening EPC tags against cloning","authors":"Ari Juels","author_ids":"1687161","abstract":"The EPC (Electronic Product Code) tag is a form of RFID (Radio-Frequency IDentification) device that is emerging as a successor to the printed barcode. Like barcodes, EPC tags emit static codes that serve to identify and track shipping containers and individual objects. EPC tags, though, have a powerful benefit: they communicate in an automated, wireless manner.Some commercial segments, like the pharmaceutical industry, are coming to view EPC tags as a tool to combat counterfeiting. EPC tags are a potent mechanism for object identification, and can facilitate the compilation of detailed object histories and pedigrees. They are poor authenticators, though. EPC tags are vulnerable to elementary cloning and counterfeiting attacks.In this paper, we present simple techniques to strengthen the resistance of EPC tags against elementary cloning attacks. Our proposals are compliant with the EPCglobal Class-1 Generation-2 UHF standard for EPC tags, which is likely to predominate in supply chains. Such EPC tags contain PIN-based access-control and privacy enhancement mechanisms that are meant to enable tag authentication of readers during the transmission of sensitive commands (like the \"kill\" command). We show how to leverage such PINs to achieve the opposite goal, namely reader authentication of tags. We describe what may be viewed as crude challenge-response authentication protocols. These protocols do not defend against a full range of attacks, but still have significant practical application. Our techniques can strengthen EPC tags against cloning even in environments with untrusted reading devices.","cites":"75","conferencePercentile":"83.33333333"},{"venue":"Workshop on Wireless Security","id":"a6a4823339457f9c7e82a0f15a1c9e2cd76e0a50","venue_1":"Workshop on Wireless Security","year":"2004","title":"A framework for wireless LAN monitoring and its applications","authors":"Jihwang Yeo, Moustafa Youssef, Ashok K. Agrawala","author_ids":"2769855, 1780388, 1770467","abstract":"Many studies on measurement and characterization of wireless LANs (WLANs) have been performed recently. Most of these measurements have been conducted from the wired portion of the network based on wired monitoring (e.g. sniffer at some wired point) or SNMP statistics. More recently, <i>wireless monitoring</i>, the traffic measurement from a wireless vantage point, is also widely adopted in both wireless research and commercial WLAN management product development. Wireless monitoring technique can provide detailed PHY/MAC information on wireless medium. For the network diagnosis purpose (e.g. anomaly detection and security monitoring) such detailed wireless information is more useful than the information provided by SNMP or wired monitoring. In this paper we have explored various issues in implementing the wireless monitoring system for an IEEE 802.11 based wireless network. We identify the pitfalls that such system needs to be aware of, and then provide feasible solutions to avoid those pitfalls. We implement an actual wireless monitoring system and demonstrate its effectiveness by characterizing a typical computer science department WLAN traffic. Our characterization reveals rich information about the PHY/MAC layers of the IEEE 802.11 protocol such as the typical traffic mix of different frame types, their temporal characteristics and correlation with the user activities. Moreover, we identify various anomalies in protocol and security of the IEEE 802.11 MAC. Regarding the security, we identify malicious usages of WLAN, such as email worm and network scanning. Our results also show excessive retransmissions of some management frame types reducing the useful throughput of the wireless network.","cites":"93","conferencePercentile":"60"},{"venue":"Workshop on Wireless Security","id":"604d868b4b8c7c9e95a62f40b15657c290b84633","venue_1":"Workshop on Wireless Security","year":"2005","title":"Low-cost attacks against packet delivery, localization and time synchronization services in under-water sensor networks","authors":"Jiejun Kong, Zhengrong Ji, Weichao Wang, Mario Gerla, Rajive L. Bagrodia, Bharat K. Bhargava","author_ids":"1779807, 2913532, 1686859, 8467438, 1722527, 1712275","abstract":"Under-Water Sensor Networking (UWSN) is a novel network paradigm that is being proposed to explore, monitor and protect the oceans. The unique characteristics of the aquatic environment, namely huge propagation delay, absence of GPS signaling, floating node mobility, and limited (acoustic) link capacity, are very different from those of ground sensor networks. Since underwater networks are mostly autonomous and very difficult to directly monitor by humans, a very important requirement is the built-in protection from automated malicious attacks. In this paper we show that the aquatic environment is particularly vulnerable to attacks and security must be integrated into the UWSN architecture to protect its localization, synchronization and packet delivery services.","cites":"21","conferencePercentile":"50"},{"venue":"Workshop on Wireless Security","id":"f4538e156b443e03435d64af1838b55e454cb581","venue_1":"Workshop on Wireless Security","year":"2004","title":"A man-in-the-middle attack on UMTS","authors":"Ulrike Meyer, Susanne Wetzel","author_ids":"1716985, 1739446","abstract":"In this paper we present a man-in-the-middle attack on the Universal Mobile Telecommunication Standard (UMTS), one of the newly emerging 3G mobile technologies. The attack allows an intruder to impersonate a valid GSM base station to a UMTS subscriber regardless of the fact that UMTS authentication and key agreement are used. As a result, an intruder can eavesdrop on all mobile-station-initiated traffic.Since the UMTS standard requires mutual authentication between the mobile station and the network, so far UMTS networks were considered to be secure against man-in-the-middle attacks. The network authentication defined in the UMTS standard depends on both the validity of the authentication token and the integrity protection of the subsequent security mode command.We show that both of these mechanisms are necessary in order to prevent a man-in-the middle attack. As a consequence we show that an attacker can mount an impersonation attack since GSM base stations do not support integrity protection. Possible victims to our attack are all mobile stations that support the UTRAN and the GSM air interface simultaneously. In particular, this is the case for most of the equipment used during the transition phase from 2G (GSM) to 3G (UMTS) technology.","cites":"72","conferencePercentile":"40"},{"venue":"Workshop on Wireless Security","id":"06302a033e9d58f4eabb9c47dc5262ed313bafe3","venue_1":"Workshop on Wireless Security","year":"2003","title":"Wireless LAN location-sensing for security applications","authors":"Ping Tao, Algis Rudys, Andrew M. Ladd, Dan S. Wallach","author_ids":"1913184, 2308886, 2867688, 1798983","abstract":"This paper considers the problem of using wireless LAN location-sensing for security applications. Recently, Bayesian methods have been successfully used to determine location from wireless LAN signals, but such methods have the drawback that a model must first be built from training data. The introduction of model error can drastically reduce the robustness of the location estimates and such errors can be actively induced by malicious users intent on hiding their location. This paper provides a technique for increasing robustness in the face of model error and experimentally validates this technique by testing against unmodeled hardware, modulation of power levels, and the placement of devices outside the trained workspace. Our results have interesting ramifications for location privacy in wireless networks.","cites":"64","conferencePercentile":"60"},{"venue":"Workshop on Wireless Security","id":"7a755984d9c24c67d74aec0f388a76065f2551c2","venue_1":"Workshop on Wireless Security","year":"2004","title":"RFID: security and privacy for five-cent wireless devices","authors":"Ari Juels","author_ids":"1687161","abstract":"A radio-frequency identification (RFID) tag is a small, inexpensive wireless device that emits an identifier in response to interrogation from a nearby reader. The price of basic RFID tags promises to drop to the range of several cents per unit in the next several years, offering a viable and versatile successor technology to the optical barcode. In this and many other guises, RFID is poised to play an important role in the commercial world. RFID will also increasingly enter the hands of consumers in the form of payment devices and physical access tokens, and at some point as item-specific barcodes.In spreading information about the whereabouts of physical objects, RFID will add a beneficial new layer of awareness to computing networks. The flip side, however, will be a host of new privacy and security problems. With their exceedingly frugal computing resources, basic RFID tags pose an especial challenge to security architects. True cryptographic functionality will likely remain beyond the reach of these devices for some time to come. RFID therefore calls for specially adapted security techniques.Keeping such facts in sight, this talk explores some emerging technical approaches to privacy and security for RFID systems.","cites":"4","conferencePercentile":"10"},{"venue":"Workshop on Wireless Security","id":"53e6a867295e4565269aed8b55a5144a1a312b7b","venue_1":"Workshop on Wireless Security","year":"2004","title":"Channel surfing and spatial retreats: defenses against wireless denial of service","authors":"Wenyuan Xu, Timothy Wood, Wade Trappe, Yanyong Zhang","author_ids":"1737805, 1696812, 1702051, 1813845","abstract":"Wireless networks are built upon a shared medium that makes it easy for adversaries to launch denial of service (DoS) attacks. One form of denial of service is targeted at preventing sources from communicating. These attacks can be easily accomplished by an adversary by either bypassing MAC-layer protocols, or emitting a radio signal targeted at jamming a particular channel. In this paper we present two strategies that may be employed by wireless devices to evade a MAC/PHY-layer jamming-style wireless denial of service attack. The first strategy, channel surfing, is a form of spectral evasion that involves legitimate wireless devices changing the channel that they are operating on. The second strategy, spatial retreats, is a form of spatial evasion whereby legitimate mobile devices move away from the locality of the DoS emitter. We study both of these strategies for three broad wireless communication scenarios: two-party radio communication, an infrastructured wireless network, and an ad hoc wireless network. We evaluate several of our proposed strategies and protocols through ns-2 simulations and experiments on the Berkeley mote platform.","cites":"162","conferencePercentile":"90"},{"venue":"Workshop on Wireless Security","id":"4b38311acafa4ead97778df7ef50561d9ffc801c","venue_1":"Workshop on Wireless Security","year":"2003","title":"Secure verification of location claims","authors":"Naveen Sastry, Umesh Shankar, David Wagner","author_ids":"2948985, 2546965, 4073051","abstract":"With the growing prevalence of sensor and wireless networks comes a new demand for location-based access control mechanisms. We introduce the concept of secure location verification, and we show how it can be used for location-based access control. Then, we present the Echo protocol, a simple method for secure location verification. The Echo protocol is extremely lightweight: it does not require time synchronization, cryptography, or very precise clocks. Hence, we believe that it is well suited for use in small, cheap, mobile devices.","cites":"341","conferencePercentile":"100"},{"venue":"Workshop on Wireless Security","id":"e51761d2de3d134cf8724e1066aa50d9613f3c93","venue_1":"Workshop on Wireless Security","year":"2002","title":"Securing ad hoc routing protocols","authors":"Manel Guerrero Zapata, N. Asokan","author_ids":"2483682, 1735412","abstract":"We consider the problem of incorporating security mechanisms into routing protocols for ad hoc networks. Canned security solutions like IPSec are not applicable. We look at AODV[21] in detail and develop a security mechanism to protect its routing information. We also briefly discuss whether our techniques would also be applicable to other similar routing protocols and about how a key management scheme could be used in conjunction with the solution that we provide.","cites":"350","conferencePercentile":"100"},{"venue":"Workshop on Wireless Security","id":"6a47fd618791551e349dca943760b4608f106ff5","venue_1":"Workshop on Wireless Security","year":"2003","title":"ESCORT: a decentralized and localized access control system for mobile wireless access to secured domains","authors":"Jiejun Kong, Shirshanka Das, Edward Tsai, Mario Gerla","author_ids":"1779807, 2640806, 2825798, 8467438","abstract":"In this work we design and implement ESCORT, a <i>backward compatible</i>, <i>efficient</i>, and <i>secure</i> access control system, to facilitate mobile wireless access to secured wireless LANs. In mobile environments, a mobile guest may frequently roam into foreign domains while demanding critical network services. ESCORT provides instant yet secure access to the mobile guest based on the concept of \"<i>escort</i>\", which refers to a special network object with four distinct properties: (1) The escort is already a trusted permanent or semi-permanent component of the secured wireless LAN; (2) The mobile guest and the escort have established transient but mutual trust; (3) Communication between the escort and its guests is localized. The escort forwards data packets between the mobile guest and the LAN; (4) The implementation of escort can be mobile and tamper-resistant, thus it can roam with the mobile guest without being compromised. Existing network concepts (e.g., router, gateway) and security concepts (e.g., existing access control models and authorities) do not possess at least one of the four essential properties.As a permanent component of wireless LAN, the communication channel between the escort and the LAN can be secured by effective countermeasures like 802.11i TKIP and AES-CCMP. Therefore, ESCORT addresses the challenge of providing <i>efficient</i> mobile privacy support between the escort and its mobile guests. Three aspects of mobile privacy, namely <i>content privacy</i>, <i>identity privacy</i>, and <i>location privacy</i> are covered in ESCORT design to maximize the protection offered to ESCORT's mobile guests. We use actual implementation to demonstrate that ESCORT design is feasible and efficient.","cites":"4","conferencePercentile":"10"}]}