{"Workshop_on_Design_Issues_in_An":[{"venue":"Workshop on Design Issues in Anonymity and Unobservability","id":"119b69cb10b5df1a4dd1b2c52bc21460a533d49d","venue_1":"Workshop on Design Issues in Anonymity and Unobservability","year":"2000","title":"Towards an Analysis of Onion Routing Security","authors":"Paul F. Syverson, Gene Tsudik, Michael G. Reed, Carl E. Landwehr","author_ids":"3213341, 1702391, 3270386, 1774005","abstract":"This paper presents a security analysis of Onion Routing, an application independent infrastructure for traac-analysis-resistant and anonymous Internet connections. It also includes an overview of the current system design, deenitions of security goals and new adversary models.","cites":"197","conferencePercentile":"42.85714286"},{"venue":"Workshop on Design Issues in Anonymity and Unobservability","id":"2ab388542f406d42c06b6aa1514aab90c5020db0","venue_1":"Workshop on Design Issues in Anonymity and Unobservability","year":"2000","title":"Protection Profiles for Remailer Mixes","authors":"Giovanni Iachello, Kai Rannenberg","author_ids":"1684060, 1931672","abstract":"In the past independent IT security evaluation according to published criteria has not realized its potential for the assessment of privacy enhancing technologies (PETs). Main reason for this was, that PETs were not covered appropriately in the evaluation criteria. This situation has changed somewhat, and therefore this paper reports on a case study, in which we developed Protection Profiles for remailer mixes. One reason for the development of these Protection Profiles was to test the privacy related components in the new Evaluation Criteria for IT Security – Common Criteria (International Standard 15408, ECITS/CC) and to develop improvements. Another reason was to contribute to an independent evaluation of privacy enhancing technologies. The experiment shows, that the ECITS/CC enable PPs for remailer mixes, but that there are still improvements necessary. The paper presents the Protection Profiles and the structured threat analysis for mixes, on which the Protection Profiles are based.","cites":"4","conferencePercentile":"14.28571429"},{"venue":"Workshop on Design Issues in Anonymity and Unobservability","id":"51436b99e6da8ed648e27071cfb72a4b21322ac9","venue_1":"Workshop on Design Issues in Anonymity and Unobservability","year":"2000","title":"The Free Haven Project: Distributed Anonymous Storage Service","authors":"Roger Dingledine, Michael J. Freedman, David Molnar","author_ids":"2672153, 3122063, 2804783","abstract":"We present a design for a system of anonymous storage which resists the attempts of powerful adversaries to nd or destroy any stored data. We enumerate distinct notions of anonymity for each party in the system, and suggest a way to classify anonymous systems based on the kinds of anonymity provided. Our design ensures the availability of each document for a publisher-speciied lifetime. A reputation system provides server accountability by limiting the damage caused from misbehaving servers. We identify attacks and defenses against anonymous storage services, and close with a list of problems which are currently unsolved.","cites":"251","conferencePercentile":"57.14285714"}]}