{"Work.csv":[{"venue":"Work","id":"b1fd27093d5419e90ac0c78644eb5b7316bd6d88","venue_1":"Work","year":"2012","title":"Online epistemic communities: theoretical and methodological directions for understanding knowledge co-elaboration in new digital spaces.","authors":"Françoise Détienne, Flore Barcellini, Michael Baker, Jean-Marie Burkhardt, Dominique Fréard","author_ids":"1693932, 2901167, 2659755, 2899899, 3095806","abstract":"This paper presents, illustrates and discusses a generic framework for studying knowledge co-elaboration in online epistemic communities (\"OECs\"). Our approach is characterised by: considering knowledge co-elaboration as a design activity; distinguishing discussion and production spaces in OECs; characterising participation via the notion of role; fine-grained analyses of meaning, content and communicative functions in interactions. On this basis, three key issues for ergonomics research on OECs are discussed and illustrated by results from our previous studies on OSS and Wikipedia. One issue concerns the interrelation between design (task) and regulation. Whereas design task-oriented activity is distributed among participants, we illustrate that OCEs function with specialised emerging roles of group regulation. However, the task-oriented activity also functions at an interpersonal level, as an interplay of knowledge-based discussion with negotiation of competencies. Another issue concerns the foci of activity on the (designed) knowledge object. Based on a generic task model, we illustrate asymmetry and distinctiveness in tasks' foci of participants. The last issue concerns how design-use mediation is ensured by specific forms of mediation roles in OECs. Finally we discuss the degree of generality of our framework and draw some perspectives for extending our framework to other OECs.","cites":"5","conferencePercentile":"99.20634921"},{"venue":"Work","id":"46d6498dd825bbb6100b14555209f5d38a0da438","venue_1":"Work","year":"2013","title":"Wrist and shoulder posture and muscle activity during touch-screen tablet use: effects of usage configuration, tablet type, and interacting hand.","authors":"Justin G Young, Matthieu B Trudeau, Dan Odell, Kim Marinelli, Jack T Dennerlein","author_ids":"1963444, 2156275, 1937718, 3317010, 2967756","abstract":"BACKGROUND\nDue to its rapid growth in popularity, there is an imminent need for ergonomic evaluation of the touch-screen tablet computing form-factor.\n\n\nOBJECTIVE\nThe aim of this study was to assess postures of the shoulders and wrists and their associated muscle activity during touch-screen tablet use.\n\n\nMETHODS\nFifteen experienced adult tablet users completed a set of simulated software tasks on two media tablets in a total of seven user configurations. Configurations consisted of a combination of a support condition (held with one hand, two hands or in a case), a location (on the lap or table surface), and a software task (web browsing, email, and game). Shoulder postures were measured by using an infra-red LED marker based motion analysis system, wrist postures by electro-goniometry, and shoulder (upper trapezius and anterior deltoid) and forearm (flexor carpi radialis, flexor carp ulnaris, and extensor radialis) muscle activity by surface electromyography.\n\n\nRESULTS\nPostures and muscle activity for the wrist significantly varied across configurations and between hands, but not across the two tablets tested. Wrist extension was high for all configurations and particularly for the dominant hand when a tablet was placed on the lap (mean=38°). Software tasks involving the virtual keyboard (e-mailing) corresponded to higher wrist extensor muscle activity (50th percentile=9.5% MVC) and wrist flexion/extension acceleration (mean=322°/s2). High levels of wrist radial deviation were observed for the non-dominant hand when it was used to tilt and hold the tablet (mean=13°). Observed differences in posture and muscle activity of the shoulder were driven by tablet location.\n\n\nCONCLUSION\nTouch-screen tablet users are exposed to extreme wrist postures that are less neutral than other computing technologies and may be at greater risk of developing musculoskeletal symptoms. Tablets should be placed in cases or stands that adjust the tilt of the screen rather than supporting and tilting the tablet with only one hand.","cites":"4","conferencePercentile":"87.5"},{"venue":"Work","id":"01bfe12c77026fd75b76efbce7123220d3a87c6e","venue_1":"Work","year":"2009","title":"Description and clinical studies of a device for the instantaneous detection of office-place stress.","authors":"James A Levine, Ioannis T Pavlidis, Leslie MacBride, Zhen Zhu, Panagiotis Tsiamyrtzis","author_ids":"2615642, 7829766, 4834561, 4669196, 2099144","abstract":"Occupational stress is universally experienced and is emerging as a major risk factor for physical and mental illness and a key factor in poor work performance and low job satisfaction. However, the technology does not currently exist to unobtrusively measure occupational stress in real-time. Here, we describe the design and clinical validation of an automated high-definition thermal imaging system that can be used to quantify human stress, remotely and instantaneously. Healthy human subjects underwent a computer-based version of the Stroop-color conflict test, which is a validated stress provocation test, in an experimental office facility. In separate experiments, the same subjects completed a mental arithmetic challenge. The thermal signal associated with stress provocation is near-instantaneous corrugator warming. The stress response was detected in all subjects for all stress-events compared to the respective baselines. Furthermore, there was remarkable inter-individual preservation of the corrugator signal with stress R(2) = 0.96, P< 0.001). High-definition thermal imaging can be used for real-time detection of stress provocation. This technology may prove to be of help in ameliorating office-place stress.","cites":"3","conferencePercentile":"60"},{"venue":"Work","id":"9f2ad54660419165841ac218a68bf3fee9ae8b34","venue_1":"Work","year":"2012","title":"The added value of virtual reality technology and force feedback for surgical training simulators.","authors":"L Zhang, C Grosdemouge, V S Arikatla, W Ahn, G Sankaranarayanan, S De, D Jones, S Schwaitzberg, C G L Cao","author_ids":"1973986, 2702600, 1751904, 4743814, 1768298, 8026471, 5425675, 1856251, 2792929","abstract":"Laparoscopic surgery requires more specialized training of the surgeons than traditional open surgery. The Virtual Basic Laparoscopic Surgical Trainer (VBLaST) is being developed as a virtual version of the Fundamentals of Laparoscopic Skills (FLS) trainer. This study assessed the current haptic and virtual reality (VR) technology of a virtual peg transfer task of the VBLaST, based on the subjective preference of surgeons and their objective task performance measures. Twenty-one surgical residents, fellows and attendings performed a peg-transfer task in the FLS and the VBLaST. Each subject performed 10 trials on each simulator. Results showed that subjects performed significantly better on the FLS than on the VBLaST. Subjects showed a significant learning effect on both simulators, but with an accelerated improvement on the VBLaST. Even so, 81% of the subjects preferred the FLS over the VBLaST for surgical training which could be attributed to the novelty of the VR technology and existing deficiencies of the haptic interface. Despite the subjective preference for the physical simulator, the performance results indicate an added value of VR and haptics in surgical training, which is expected to be demonstrated in more surgically relevant tasks such as suturing and knot-tying.","cites":"1","conferencePercentile":"76.19047619"},{"venue":"Work","id":"aa27ad6bc50f57b2a81c47efa6c9b5a3c84b8528","venue_1":"Work","year":"2012","title":"Developing a framework for assessing muscle effort and postures during computer work in the field: the effect of computer activities on neck/shoulder muscle effort and postures.","authors":"J L Bruno Garza, B H W Eijckelhof, P W Johnson, S M Raina, P Rynell, M A Huysmans, J H van Dieën, A J van der Beek, B M Blatter, J T Dennerlein","author_ids":"8563935, 7294731, 3023026, 3528985, 7309340, 4098796, 5821020, 2251419, 6533191, 2967756","abstract":"The present study, a part of the PROOF (PRedicting Occupational biomechanics in OFfice workers) study, aimed to determine whether trapezius muscle effort was different across computer activities in a field study of computer workers, and also investigated whether head and shoulder postures were different across computer activities. One hundred twenty participants were measured continuously for two hours each while performing their own computer work. Keyboard activities were associated with the highest intensity of left and right trapezius muscle efforts, and mouse activities were associated with the smallest variability in left and right trapezius muscle efforts. Corresponding trends in head and shoulder postures included that the greatest head flexion and left and right shoulder internal rotation was observed during keyboard activities, and that the smallest variability in head flexion, head lateral tilt, and right shoulder internal rotation was observed during mouse activities. Identifying which muscle efforts and postures are different across computer activities is the first essential step for developing prediction rules for muscle efforts and postures, which can be used to link muscle efforts and postures to musculoskeletal symptoms in epidemiological studies.","cites":"0","conferencePercentile":"32.93650794"},{"venue":"Work","id":"abd8fee5ccf34bf5a85e8ee529fe5d0e6d6e2b00","venue_1":"Work","year":"2011","title":"Does elevating and tilting the input device support surface affect typing force and postural exposures of the wrist?","authors":"Krishna Asundi, Peter W Johnson, Jack T Dennerlein","author_ids":"8085895, 3023026, 2967756","abstract":"OBJECTIVE\nCompare wrist kinematics and typing force during computer work across two workstations, one configured according to recommended guidelines with the keyboard support surface flat and near resting elbow height, the other according to users' actual setup and preference, with an elevated, and positively tilted support surface.\n\n\nPARTICIPANTS\nTwenty participants completed a standard computer task at the two workstation configurations.\n\n\nMETHODS\nA thin profile force plate, placed under the keyboard recorded keyboard reaction forces. Twin axis electro-goniometers (SG65 Biometrics Ltd, London, UK) affixed to the back of the right and left hand of each subject continuously measured wrist extension/flexion and ulnar/radial deviation.\n\n\nRESULTS\nTyping force and wrist kinematics were similar between the two configurations with only 10th percentile ulnar deviation for the right hand showing a borderline significant difference of 1° between the two configurations.\n\n\nCONCLUSION\nElevating and tilting the input device support surface does not necessarily affect typing force and kinematics of the wrist. The combination of the input device support surface and user upper extremities form a complex kinematic system with several degrees of freedom. Wrist postures during computer use are a function of multiple factors other than simply keyboard tilt.","cites":"0","conferencePercentile":"18.75"},{"venue":"Work","id":"37f816120d1e0f92cda7ab1392b36bc9e8caf169","venue_1":"Work","year":"2012","title":"Touch-screen tablet user configurations and case-supported tilt affect head and neck flexion angles.","authors":"Justin G Young, Matthieu Trudeau, Dan Odell, Kim Marinelli, Jack T Dennerlein","author_ids":"1963444, 2156275, 1937718, 3317010, 2967756","abstract":"OBJECTIVE\nThe aim of this study was to determine how head and neck postures vary when using two media tablet (slate) computers in four common user configurations.\n\n\nMETHODS\nFifteen experienced media tablet users completed a set of simulated tasks with two media tablets in four typical user configurations. The four configurations were: on the lap and held with the user's hands, on the lap and in a case, on a table and in a case, and on a table and in a case set at a high angle for watching movies. An infra-red LED marker based motion analysis system measured head/neck postures.\n\n\nRESULTS\nHead and neck flexion significantly varied across the four configurations and across the two tablets tested. Head and neck flexion angles during tablet use were greater, in general, than angles previously reported for desktop and notebook computing. Postural differences between tablets were driven by case designs, which provided significantly different tilt angles, while postural differences between configurations were driven by gaze and viewing angles.\n\n\nCONCLUSION\nHead and neck posture during tablet computing can be improved by placing the tablet higher to avoid low gaze angles (i.e. on a table rather than on the lap) and through the use of a case that provides optimal viewing angles.","cites":"14","conferencePercentile":"100"},{"venue":"Work","id":"e471d73c8d89200e473615cee600968812ced4df","venue_1":"Work","year":"2012","title":"Investigating the effects of physical and cognitive demands on the quality of performance under different pacing levels.","authors":"S Shaikh, S V G Cobb, D Golightly, J I Segal, C M Haslegrave","author_ids":"7677116, 2620948, 1731314, 4176877, 5520707","abstract":"The study was undertaken to investigate the effects of pacing on aspects of performance at an assembly task and on the operators' responses related to work behaviour, perceived workload and perceived stress. A particular objective of the study was to investigate whether physical and cognitive demands may interact in their influences on these effects. An assembly task was simulated in the laboratory and the level of pacing imposed, work height and memory load within the task were all varied. The results showed that the type of pacing commonly imposed (as is common with a lean manufacturing Takt time system in industry) can significantly affect both performance and perceived workload and stress. Physical demands (through work height affecting posture) and mental demand (through memory load) were also found to have significant effects, as would be expected from the many studies of these in the literature. More importantly, some interactions were found between pacing and work height in their effects on quality of assembly and the operator's own rating of performance, and between work height and memory load in their effects on errors. These findings will need to be taken into account by companies when implementing Takt time systems.","cites":"0","conferencePercentile":"32.93650794"},{"venue":"Work","id":"6d9f4e496bdefde765872a3a0a2a8513400d5f92","venue_1":"Work","year":"2012","title":"Examining the impact of age and multitasking on motorcycle conspicuity.","authors":"Jonathan L Ledbetter, Michael W Boyce, Drea K Fekety, Ben Sawyer, Janan A Smither","author_ids":"4352734, 3294546, 3396972, 2776677, 7643100","abstract":"This poster presents a study to assess one's ability to detect motorcycles under different conditions of conspicuity while performing a secondary visual load task. Previous research in which participants were required to detect motorcycles revealed differences in age (young adults/older adult) as well as differences associated with motorcycle conspicuity conditions. Past research has specifically found motorcycles with headlights ON and modulating headlights (flashing) to be more conspicuous than motorcycles with headlights OFF within traffic conditions. The present study seeks to provide more information on the effects of multitasking on motorcycle conspicuity and safety. The current study seeks to determine the degree to which multitasking limits the conspicuity of a motorcycle within traffic. We expect our results will indicate main effects for distraction task, age, gender, motorcycle lighting conditions, and vehicular DRLs on one's ability to effectively detect a motorcycle. The results have implications for motorcycle safety in general and through this research, a better understanding of motorcycle conspicuity can be established so as to minimize the risk involved with motorcycle operation.","cites":"0","conferencePercentile":"32.93650794"},{"venue":"Work","id":"a067dc2c430fad8116c5aa50273b3dc38456b84f","venue_1":"Work","year":"2012","title":"Research on the relationship between the structural properties of bedding layer in spring mattress and sleep quality.","authors":"Liming Shen, Yu-xia Chen, Yong Guo, ShiLu Zhong, Fei Fang, Jing Zhao, Tian-Yi Hu","author_ids":"8290473, 4084071, 8280490, 8037733, 8450192, 5349795, 6285057","abstract":"Mattress, as a sleep platform, its types and physical properties has an important effect on sleep quality and rest efficiency. In this paper, by subjective evaluations, analysis of sleeping behaviors and tests of depth of sleep, the relationship between characteristics of the bedding materials, the structure of mattress, sleep quality and sleep behaviors were studied. The results showed that: (1) Characteristics of the bedding materials and structure of spring mattress had a remarkable effect on sleep behaviors and sleep quality. An optimum combination of the bedding materials, the structure of mattress and its core could improve the overall comfort of mattress, thereby improving the depth of sleep and sleep quality. (2) Sleep behaviors had a close relationship with sleeping postures and sleep habits. The characteristics of sleep behaviors vary from person to person.","cites":"0","conferencePercentile":"32.93650794"},{"venue":"Work","id":"3dc20404a6e010308366e8eddb147be238478b5c","venue_1":"Work","year":"2012","title":"Attention deficit/hyperactivity disorder's effects on individuals' scan paths during a simulated drive.","authors":"J R Michaelis, D S McConnell, J A Smither","author_ids":"8563100, 2366929, 7643100","abstract":"Individuals who have Attention Deficit/Hyperactivity Disorder (ADHD) experience adverse effects relating to driving; additionally, they experience deficits in scanning ability. The present study examined the effects of ADHD on eye tracking while driving. This study consisted of ten participants, of which, five have ADHD. It was hypothesized that individuals who have ADHD will make more saccadic eye movements and thus shorter fixations than individuals without ADHD (Control). Furthermore, it was hypothesized that despite the fact that individuals who have ADHD will make more saccadic eye movements than individuals without ADHD, those individuals with ADHD will commit more traffic violations including collisions compared to the control group. Findings indicated that hypothesis one was not supported by the data, whereas hypothesis two was supported in that ADHD individuals' had more collisions and committed more traffic violations than the control group. Additionally, a significant difference was found in the spatial distributions of the fixations between the ADHD and Control groups. The findings of this study could help better understand the factors involved in ADHD driving and could be used to train individuals with ADHD to become more aware of their surroundings and driving habits and thus become safer drivers.","cites":"1","conferencePercentile":"76.19047619"},{"venue":"Work","id":"c1a7afcdbfc6e4a20b4303c3252882f984965988","venue_1":"Work","year":"2012","title":"What do we mean by Human-Centered Design of Life-Critical Systems?","authors":"Guy A Boy","author_ids":"2042701","abstract":"Human-centered design is not a new approach to design. Aerospace is a good example of a life-critical systems domain where participatory design was fully integrated, involving experimental test pilots and design engineers as well as many other actors of the aerospace engineering community. This paper provides six topics that are currently part of the requirements of the Ph.D. Program in Human-Centered Design of the Florida Institute of Technology (FIT.) This Human-Centered Design program offers principles, methods and tools that support human-centered sustainable products such as mission or process control environments, cockpits and hospital operating rooms. It supports education and training of design thinkers who are natural leaders, and understand complex relationships among technology, organizations and people. We all need to understand what we want to do with technology, how we should organize ourselves to a better life and finally find out whom we are and have become. Human-centered design is being developed for all these reasons and issues.","cites":"1","conferencePercentile":"76.19047619"}]}