{"WORLDS.csv":[{"venue":"WORLDS","id":"31d4c62aaa89bd5991c614023f39646aeb8ab26b","venue_1":"WORLDS","year":"2005","title":"Supporting Network Coordinates on PlanetLab","authors":"Peter R. Pietzuch, Jonathan Ledlie, Margo I. Seltzer","author_ids":"1809586, 1883557, 1745942","abstract":"Large-scale distributed applications need latency information to make network-aware routing decisions. Collecting these measurements, however, can impose a high burden. Network coordinates are a scalable and efficient way to supply nodes with up-to-date latency estimates. We present our experience of maintaining network coordinates on PlanetLab. We present two different APIs for ac-cessing coordinates: a per-application library, which takes advantage of application-level traffic, and a stand-alone service, which is shared across applications. Our results show that statistical filtering of latency samples improves accuracy and stability and that a small number of neighbors is sufficient when updating coordinates.","cites":"28","conferencePercentile":"68.75"},{"venue":"WORLDS","id":"1689edb7bfc3afba35ded470432cf6a04cda642c","venue_1":"WORLDS","year":"2005","title":"MON: On-Demand Overlays for Distributed System Management","authors":"Jin Liang, Steven Y. Ko, Indranil Gupta, Klara Nahrstedt","author_ids":"4056456, 8080421, 1722544, 1688353","abstract":"This paper presents the management overlay network (MON) system that we are building and running on the PlanetLab testbed. MON is a distributed system designed to facilitate the management of large distributed applications. Toward this goal, MON builds on-demand overlay structures that allow users to execute instant management commands, such as query the current status of the application, or push software updates to all the nodes. The on-demand approach enables MON to be lightweight , requiring minimum amount of resources when no commands are executed. It also frees MON from complex failure repair mechanisms, since no overlay structure is maintained for a prolonged time. MON is currently running on more than 300 nodes on the Planet-Lab. Our initial experiments on the PlanetLab show that MON has good performance, both in terms of command response time and achieved bandwidth for software push.","cites":"36","conferencePercentile":"87.5"},{"venue":"WORLDS","id":"0521aa574213e87db92ac52a8b271e1d105cb0dc","venue_1":"WORLDS","year":"2004","title":"Beyond Availability: Towards a Deeper Understanding of Machine Failure Characteristics in Large Distributed Systems","authors":"Praveen Yalagandula, Suman Nath","author_ids":"1743645, 1716368","abstract":"Although many previous research efforts have investigated machine failure characteristics in distributed systems , availability research has reached a point where properties beyond these initial findings become important. In this paper, we analyze traces from three large distributed systems to answer several subtle questions regarding machine failure characteristics. Based on our findings, we derive a set of fundamental principles for designing highly available distributed systems. Using several case studies, we further show that our design principles can significantly influence the availability design choices in existing systems.","cites":"40","conferencePercentile":"100"},{"venue":"WORLDS","id":"508baf5723e0ea5b5cbd653c31100b9afcae8545","venue_1":"WORLDS","year":"2004","title":"Deployment of a Large-scale Peer-to-Peer Social Network","authors":"Mao Yang, Hua Chen, Ben Y. Zhao, Yafei Dai, Zheng Zhang","author_ids":"1715634, 1705331, 1972108, 1692303, 1726441","abstract":"We present the design and architecture of the Maze file-sharing and social network. Maze is one of the first large-scale deployments of an academic research project, with over 210,000 registered users and more than 10,000 users online at any time, sharing over 140 million files. Maze includes an evolving incentive structure, and simple mechanisms for providing network locality. We outline the Maze architecture and describe initial results from a measurement study.","cites":"35","conferencePercentile":"91.66666667"},{"venue":"WORLDS","id":"0f6bb5c98755ab1d923f1b5a22800e9d5bd53108","venue_1":"WORLDS","year":"2006","title":"Resource Management for Global Public Computing: Many Policies Are Better Than (N)one","authors":"Evangelos Kotsovinos, Iulia Ion, Timothy L. Harris","author_ids":"2738344, 2803721, 2894090","abstract":"The federation of authority in global public computing systems poses major resource management challenges, as different stakeholders may have different views on how server resources are to be apportioned. Ultimately, the complexity of declaring and managing potentially overlapping federated policies often leads to the absence of high-level resource management systems from global public computing platforms. In this paper we propose a practical system that allows the different stakehold-ers to independently express federated policies, provides mechanisms for resolving potential constraint overlaps automatically, and reaches decentralised resource allocation decisions. We demonstrate experimentally that the system scales gracefully, introduces only a very low performance overhead, and is suitable for operating in realistically large and complex settings.","cites":"0","conferencePercentile":"12.5"},{"venue":"WORLDS","id":"3daabbbde6d92239bfe6ce52d4c5df6317ed2345","venue_1":"WORLDS","year":"2004","title":"Design Considerations for Information Planes","authors":"Brent N. Chun, Joseph M. Hellerstein","author_ids":"2293758, 1695576","abstract":"— The concept of an information plane has emerged recently as an important part of large, decentralized systems that aspire to be self-managing, ranging from PlanetLab to the Internet itself. In this paper we describe what an information plane is, and report our experiences in developing and deploying an information plane for the Plan-etLab platform using the PIER distributed relational query processor. We recount the lessons we have learned from the experience, and the additional directions we intend to explore in the PHI project, which aims at providing an information plane that can grow to serve a significant portion of the Internet.","cites":"10","conferencePercentile":"50"}]}