{"World_journal_of_hepatology.csv":[{"venue":"World journal of hepatology","id":"c9034770db1c5a72132ab8cec36794e6e8695c83","venue_1":"World journal of hepatology","year":"2016","title":"Redefining Budd-Chiari syndrome: A systematic review.","authors":"Naomi Shin, Young H Kim, Hao Xu, Hai-Bin Shi, Qing-Qiao Zhang, Jean Paul Colon Pons, Ducksoo Kim, Yi Xu, Fei-Yun Wu, Samuel Han, Byung-Boong Lee, Lin-Sun Li","author_ids":"8391503, 7652167, 1742479, 2118717, 8676379, 8691047, 8613803, 1734114, 5089443, 8636118, 8637475, 8447620","abstract":"AIM\nTo re-examine whether hepatic vein thrombosis (HVT) (classical Budd-Chiari syndrome) and hepatic vena cava-Budd Chiari syndrome (HVC-BCS) are the same disorder.\n\n\nMETHODS\nA systematic review of observational studies conducted in adult subjects with primary BCS, hepatic vein outflow tract obstruction, membranous obstruction of the inferior vena cava (IVC), obliterative hepatocavopathy, or HVT during the period of January 2000 until February 2015 was conducted using the following databases: Cochrane Library, CINAHL, MEDLINE, PubMed and Scopus.\n\n\nRESULTS\nOf 1299 articles identified, 26 were included in this study. Classical BCS is more common in women with a pure hepatic vein obstruction (49%-74%). HVC-BCS is more common in men with the obstruction often located in both the inferior vena cava and hepatic veins (14%-84%). Classical BCS presents with acute abdominal pain, ascites, and hepatomegaly. HVC-BCS presents with chronic abdominal pain and abdominal wall varices. Myeloproliferative neoplasms (MPN) are the most common etiology of classical BCS (16%-62%) with the JAK2V617-F mutation found in 26%-52%. In HVC-BCS, MPN are found in 4%-5%, and the JAK2V617-F mutation in 2%-5%. Classical BCS responds well to medical management alone and 1(st) line management of HVC-BCS involves percutaneous recanalization, with few managed with medical management alone.\n\n\nCONCLUSION\nSystematic review of recent data suggests that classical BCS and HVC-BCS may be two clinically different disorders that involve the disruption of hepatic venous outflow.","cites":"0","conferencePercentile":"50"}]}