{"World_psychiatry__official_jour":[{"venue":"World psychiatry : official journal of the World Psychiatric Association","id":"6601f7e2cc01d83db11c31c6633a419628089111","venue_1":"World psychiatry : official journal of the World Psychiatric Association","year":"2015","title":"Pragmatic randomized controlled trial of long-term psychoanalytic psychotherapy for treatment-resistant depression: the Tavistock Adult Depression Study (TADS).","authors":"Peter Fonagy, Felicitas Rost, Jo-Anne Carlyle, Susan McPherson, Rachel Thomas, R M Pasco Fearon, David Goldberg, David Taylor","author_ids":"3177814, 8233159, 7733602, 7836011, 6295074, 8029770, 8410100, 7995514","abstract":"This pragmatic randomized controlled trial tested the effectiveness of long-term psychoanalytic psychotherapy (LTPP) as an adjunct to treatment-as-usual according to UK national guidelines (TAU), compared to TAU alone, in patients with long-standing major depression who had failed at least two different treatments and were considered to have treatment-resistant depression. Patients (N=129) were recruited from primary care and randomly allocated to the two treatment conditions. They were assessed at 6-monthly intervals during the 18 months of treatment and at 24, 30 and 42 months during follow-up. The primary outcome measure was the 17-item version of the Hamilton Depression Rating Scale (HDRS-17), with complete remission defined as a HDRS-17 score ≤8, and partial remission defined as a HDRS-17 score ≤12. Secondary outcome measures included self-reported depression as assessed by the Beck Depression Inventory - II, social functioning as evaluated by the Global Assessment of Functioning, subjective wellbeing as rated by the Clinical Outcomes in Routine Evaluation - Outcome Measure, and satisfaction with general activities as assessed by the Quality of Life Enjoyment and Satisfaction Questionnaire. Complete remission was infrequent in both groups at the end of treatment (9.4% in the LTPP group vs. 6.5% in the control group) as well as at 42-month follow-up (14.9% vs. 4.4%). Partial remission was not significantly more likely in the LTPP than in the control group at the end of treatment (32.1% vs. 23.9%, p=0.37), but significant differences emerged during follow-up (24 months: 38.8% vs. 19.2%, p=0.03; 30 months: 34.7% vs. 12.2%, p=0.008; 42 months: 30.0% vs. 4.4%, p=0.001). Both observer-based and self-reported depression scores showed steeper declines in the LTPP group, alongside greater improvements on measures of social adjustment. These data suggest that LTPP can be useful in improving the long-term outcome of treatment-resistant depression. End-of-treatment evaluations or short follow-ups may miss the emergence of delayed therapeutic benefit.","cites":"1","conferencePercentile":"25"},{"venue":"World psychiatry : official journal of the World Psychiatric Association","id":"3c135680c95b29bb85df60d1b98b6bb7c4b707e3","venue_1":"World psychiatry : official journal of the World Psychiatric Association","year":"2010","title":"Hypomania: a transcultural perspective.","authors":"Jules Angst, Thomas D Meyer, Rolf Adolfsson, Peter Skeppar, Mauro Carta, Franco Benazzi, Ru-Band Lu, Yi-Hsuan Wu, Hai-Chen Yang, Cheng-Mei Yuan, Paolo Morselli, Peter Brieger, Judith Katzmann, Ines Alice Teixeira Leão, José Alberto Del Porto, Doris Hupfeld Moreno, Ricardo A Moreno, Odeilton T Soares, Eduard Vieta, Alex Gamma","author_ids":"7877679, 2531463, 8264123, 5091919, 4901063, 3825697, 5164900, 7860967, 7542878, 3602788, 6005555, 3879593, 7370190, 8430827, 4989381, 4693263, 5532776, 7767305, 2732325, 5742321","abstract":"This study examined the transcultural robustness of a screening instrument for hypomania, the Hypomania Checklist-32, first revised version (HCL-32 R1). It was carried out in 2606 patients from twelve countries in five geographic regions (Northern, Southern and Eastern Europe, South America and East Asia). In addition, GAMIAN Europe contributed data from its members. Exploratory and confirmatory factor analyses were used to examine the transregional stability of the measurement properties of the HCL-32 R1, including the influence of sex and age as covariates. Across cultures, a two-factor structure was confirmed: the first factor (F1) reflected the more positive aspects of hypomania (being more active, elated, self-confident, and cogni-tively enhanced); the second factor (F2) reflected the more negative aspects (being irritable, impulsive, careless, more substance use). The measurement properties of the HCL-32 R1 were largely invariant across cultures. Only few items showed transcultural differences in their relation to hypomania as measured by the test. F2 was higher among men and in more severe manic syndromes; F1 was highest in North and East Europe and lowest in South America. The scores decreased slightly with age. The frequency of the 32 items showed remarkable similarities across geographic areas, with two excep-tions: South Europeans had lower symptom frequencies in general and East Europeans higher rates of substance use. These findings support the interna-tional applicability of the HCL-32 R1 as a screening instrument for hypomania.","cites":"7","conferencePercentile":"30.95238095"},{"venue":"World psychiatry : official journal of the World Psychiatric Association","id":"b3d2f7e093c1fc91ee967e7444159a869cf96ec4","venue_1":"World psychiatry : official journal of the World Psychiatric Association","year":"2013","title":"Personal stigma in schizophrenia spectrum disorders: a systematic review of prevalence rates, correlates, impact and interventions.","authors":"Gabriel Gerlinger, Marta Hauser, Marc De Hert, Kathleen Lacluyse, Martien Wampers, Christoph U Correll","author_ids":"2179818, 3455050, 7248087, 7423838, 4402587, 7991279","abstract":"A systematic electronic PubMed, Medline and Web of Science database search was conducted regarding the prevalence, correlates, and effects of personal stigma (i.e., perceived and experienced stigmatization and self-stigma) in patients with schizophrenia spectrum disorders. Of 54 studies (n=5,871), published from 1994 to 2011, 23 (42.6%) reported on prevalence rates, and 44 (81.5%) reported on correlates and/or consequences of perceived or experienced stigmatization or self-stigma. Only two specific personal stigma intervention studies were found. On average, 64.5% (range: 45.0-80.0%) of patients perceived stigma, 55.9% (range: 22.5-96.0%) actually experienced stigma, and 49.2% (range: 27.9-77.0%) reported alienation (shame) as the most common aspect of self-stigma. While socio-demographic variables were only marginally associated with stigma, psychosocial variables, especially lower quality of life, showed overall significant correlations, and illness-related factors showed heterogeneous associations, except for social anxiety that was unequivocally associated with personal stigma. The prevalence and impact of personal stigma on individual outcomes among schizophrenia spectrum disorder patients are well characterized, yet measures and methods differ significantly. By contrast, research regarding the evolution of personal stigma through the illness course and, particularly, specific intervention studies, which should be conducted utilizing standardized methods and outcomes, are sorely lacking.","cites":"12","conferencePercentile":"87.5"},{"venue":"World psychiatry : official journal of the World Psychiatric Association","id":"d6f9cae67300ea3c0f2f1c95814b0676c28d929f","venue_1":"World psychiatry : official journal of the World Psychiatric Association","year":"2003","title":"Psychiatry and primary care.","authors":"David Goldberg","author_ids":"8410100","abstract":"There is now almost universal recognition that primary care is the place where most mentally distressed people first present for help. However, the pace at which the health system has adapted to this reality varies greatly from country to country, depending on the amount of resource devoted to mental illness services, the way in which primary care physicians have organized their practice, and the inertia of the system. Here we present several models from developed and developing countries and address briefly the issue of training of health workers.","cites":"1","conferencePercentile":"38.23529412"},{"venue":"World psychiatry : official journal of the World Psychiatric Association","id":"9d5ba651977821f0bc3d044ff6cff8446c747e7c","venue_1":"World psychiatry : official journal of the World Psychiatric Association","year":"2010","title":"The detection and treatment of depression in the physically ill.","authors":"David Goldberg","author_ids":"8410100","abstract":"DEPRESSION AND CHRONIC PHYSICAL ILLNESS ARE IN RECIPROCAL RELATIONSHIP WITH ONE ANOTHER: not only do many chronic illnesses cause higher rates of depression, but depression has been shown to antedate some chronic physical illnesses. Depression associated with physical illness is less well detected than depression occurring on its own, and various ways of improving both the detection and treatment of depression accompanying physical illness are described. This paper is in four parts, the first dealing with the evidence for depression having a special relationship with physical disorders, the second dealing with detection of depression in physically ill patients, the third with the treatment of depression, and the fourth describing the advantages of treating depression among physically ill patients.","cites":"7","conferencePercentile":"30.95238095"}]}