{"World_journal_of_urology.csv":[{"venue":"World journal of urology","id":"ed81fad803d57404a8c923354a106a921846cc36","venue_1":"World journal of urology","year":"2013","title":"Exit strategies following percutaneous nephrolithotomy (PCNL): a comparison of surgical outcomes in the Clinical Research Office of the Endourological Society (CROES) PCNL Global Study","authors":"Luigi Cormio, Gaspar Ibarlucea Gonzalez, David Tolley, Mario Sofer, Ahmet Muslumanoglu, Hans-Christoph Klingler, Jens-Uwe Stolzenburg, Jean de la Rosette","author_ids":"3072506, 7868576, 3492593, 6157911, 3894436, 5197479, 2313894, 7405412","abstract":"PURPOSE\nTo compare the characteristics and outcomes of exit strategies following percutaneous nephrolithotomy (PCNL) using the Clinical Research Office of the Endourological Society (CROES) PCNL Global Study database.\n\n\nMATERIALS AND METHODS\nTwo matched data sets were prepared in order to compare stent only versus NT only and TTL versus NT only. Patients were matched on the exit strategy using the following variables: case volume of the center where they underwent PCNL, stone burden, the presence of staghorn stone, size of sheath used at percutaneous access, the presence of bleeding during surgery, and treatment success status. For categorical variables, percentages were calculated and differences between the four groups were tested by the chi-square test.\n\n\nRESULTS\nThe only significant difference reported between the matched pairs was between NT and stent only groups. NT only PCNL was associated with significantly longer operating times (p = 0.029) and longer hospital stay (p < 0.001) than stent only PCNL.\n\n\nCONCLUSIONS\nPatients who undergo PCNL with less invasive exit strategy involving a stent only have shorter hospital stay than those who have postoperative NT. The intraoperative course is the primary driver of complications in PCNL and not necessarily the exit strategy.","cites":"0","conferencePercentile":"27.27272727"},{"venue":"World journal of urology","id":"c5742845504cc05363e2f5af23d952ae638731d4","venue_1":"World journal of urology","year":"2015","title":"AB121. The prognostic impact of squamous and glandular differentiation for upper tract urothelial carcinoma patients after radical nephroureterectomy","authors":"Qi Tang, Gengyan Xiong, Xuesong Li, Dong Fang, Chenguang Xi, Lei Zhang, Kaiwei Yang, Lin Yao, Cuijian Zhang, Wei Yu, Qun He, Kan Gong, Zhisong He, Liqun Zhou","author_ids":"7570680, 7339002, 7824647, 8374428, 7518390, 2887595, 4525383, 1708162, 6906938, 3389395, 3335271, 4124555, 6804332, 5162606","abstract":"PURPOSE\nTo evaluate the association between tumor squamous and/or glandular differentiation and tumor biological characteristics and to validate the impact of these histologic variants on oncologic outcomes of UTUC patients.\n\n\nMETHODS\nWe retrospectively analyzed the data of 687 UTUC patients who underwent radical nephroureterectomy in our institute, from Aug 1, 1999, to Dec 31, 2011. All pathologic sections were reevaluated for histologic differentiation variations (squamous and glandular). The clinicopathological variables of patients were reviewed.\n\n\nRESULTS\nAmong the 687 UTUC patients in our study, 53 (7.7 %) had squamous differentiation, 20 (2.9 %) had glandular differentiation and 8 (1.2 %) had both histologic variants. Patients with mixed histologic variant tended to have significant larger percentage of sessile tumor architecture (58.0 vs 18.2 %), presence of CIS (7.4 vs 2.3 %), advanced T stage, advanced tumor grade and lymph node metastasis (17.3 vs 6.6 %; all p < 0.05). Patients with squamous and/or glandular differentiation had significant worse cancer-specific survival than pure UTUC patients (p < 0.001), while significant difference of recurrence-free survival between two groups was not observed (p = 0.126). Patients with both squamous and glandular differentiation did not show significantly worse CSS than those with single histologic variant. Univariate analyses revealed that tumor squamous and/or glandular differentiation was a significant factor on survival (p < 0.001). However, the influence did not remain significant after adjusted for other factors in the multivariate analyses (p = 0.076, HR 1.42).\n\n\nCONCLUSIONS\nUTUC patients with squamous and/or glandular differentiation are more likely to have aggressive tumor biological features and tend to have worse postoperative outcomes.","cites":"2","conferencePercentile":"82.35294118"}]}