{"World_journal_of_experimental_m":[{"venue":"World journal of experimental medicine","id":"468e60db3a1b75459c15d6b539ed860525654c61","venue_1":"World journal of experimental medicine","year":"2016","title":"Morphogenesis of human embryonic stem cells into mature neurons under in vitro culture conditions","authors":"Geeta Shroff","author_ids":"3170327","abstract":"AIM\nTo describe the morphogenesis of different neuronal cells from the human embryonic stem cell (hESC) line, SCT-N, under in vitro culture conditions.\n\n\nMETHODS\nThe directed neuronal cell line was produced from a single, spare, pre-implantation stage fertilized ovum that was obtained during a natural in vitro fertilization process. The hESCs were cultured and maintained as per our proprietary in-house technology in a Good Manufacturing Practice, Good Laboratory Practice and Good Tissue Practice compliant laboratory. The cell line was derived and incubated in aerobic conditions. The cells were examined daily under a phase contrast microscope for their growth and differentiation.\n\n\nRESULTS\nDifferent neural progenitor cells (NPCs) and differentiating neurons were observed under the culture conditions. Multipotent NPCs differentiated into all three types of nervous system cells, i.e., neurons, oligodendrocytes and astrocytes. Small projections resembling neurites or dendrites, and protrusion coming out of the cells, were observed. Differentiating cells were observed at day 18 to 20. The differentiating neurons, neuronal bodies, axons, and neuronal tissue were observed on day 21 and day 30 of the culture. On day 25 and day 30, prominent neurons, axons and neuronal tissue were observed under phase contrast microscopy. 4', 6-diamidino-2-phenylindole staining also indicated the pattern of differentiating neurons, axonal structure and neuronal tissue.\n\n\nCONCLUSION\nThis study describes the generation of different neuronal cells from an hESC line derived from biopsy of blastomeres at the two-cell cleavage stage from a discarded embryo.","cites":"0","conferencePercentile":"66.66666667"}]}