{"World_journal_of_transplantatio":[{"venue":"World journal of transplantation","id":"af0c0a2dae64107bf534a1770c7ef0a815bf84fe","venue_1":"World journal of transplantation","year":"2016","title":"Evaluating twenty-years of follow-up after orthotopic liver transplantation, best practice for donor-recipient matching: What can we learn from the past era?","authors":"Niklas Buescher, Daniel Seehofer, Michael Helbig, Andreas Andreou, Marcus Bahra, Andreas Pascher, Johann Pratschke, Wenzel Schoening","author_ids":"7841760, 5558959, 8070639, 2888593, 2793236, 5990123, 7448891, 7853338","abstract":"AIM\nTo characterize major determinants of 20-year survival after liver transplantation (LT).\n\n\nMETHODS\nThis longitudinal single-institution study includes 313 consecutive patients who received a LT between 1988 and 1992. Pretransplant clinical characteristics and laboratory values were assessed and compared between 20-year survivors and non-survivors. Particular attention was paid to the Model for End-Stage Liver Disease (labMELD)-score and the Eurotransplant Donor Risk Index (ET-DRI) to unravel their impact on 20-year survival after LT.\n\n\nRESULTS\nTwenty-year survivors were significantly younger (44 vs 50 years, P = 0.001), more likely to be female (49% vs 36%, P = 0.03) and less likely to be obese at the time of LT (19% vs 32%, P = 0.011). Mean labMELD-score (P = 0.156), rate of high-urgency LT (P = 0.210), cold-ischemia time (P = 0.994), rate of retransplantation (P = 0.12) and average donor age (28 vs 33 years, P = 0.099) were not statistically different. The mean estimated glomerular filtration rate was higher among survivors (P = 0.007). ET-DRI > 1.4 (P = 0.020) and donor age ≥ 30 years (P < 0.022) had significant influence on 20-year survival. The overall survival was not significantly impacted by labMELD-score categories (P = 0.263).\n\n\nCONCLUSION\nLT offers excellent long-term results in case of optimal donor and recipient conditions. However, mainly due to the current organ shortage, these ideal circumstances are rarely given; thus algorithms for donor-recipient matching need to be refined, in order to enable a maximum benefit for the recipients of high quality as well as marginal organs.","cites":"0","conferencePercentile":"51.38888889"},{"venue":"World journal of transplantation","id":"ca4fe0a0a187e3af1d73d22a6a36fdc87b0672db","venue_1":"World journal of transplantation","year":"2016","title":"Underutilization of palliative care services in the liver transplant population","authors":"Priya Kathpalia, Alexander Smith, Jennifer C Lai","author_ids":"5553801, 3229174, 2791073","abstract":"AIM\nTo evaluate use of palliative care services in patients with end-stage liver disease who do not have access to liver transplant.\n\n\nMETHODS\nEvaluated were end-stage liver disease patients who were removed from the liver transplant wait-list or died prior to transplant at a single transplant center over a 2-year period. Those who were removed due to noncompliance or ultimately transplanted elsewhere were excluded from this study. Patient characteristics associated with palliative care consultation were assessed using logistic regression analysis.\n\n\nRESULTS\nSix hundred and eighty-three patients were listed for liver transplant in 2013-2014 with 107 (16%) dying (n = 62) or removed for clinical decompensation prior to liver transplant (n = 45): Median age was 58 years, and the majority were male (66%), Caucasian (53%), had Child C cirrhosis (61%) or hepatocellular carcinoma (52%). The palliative care team was consulted in only 18 of the 107 patients (17%) who died or were removed, 89% of which occurred as inpatients. Half of these consultations occurred within 72 h of death. In univariable analysis, patients of younger age, white race, and higher end-stage liver disease scores at time of listing and delisting were more likely to receive palliative care services. Only younger age [Odds ratio (OR) = 0.92; P = 0.02] and Caucasian race (OR = 4.90; P = 0.02) were still associated with integration of palliative care services through multivariable analysis.\n\n\nCONCLUSION\nPalliative care services are grossly underutilized in older, non-white patients with cirrhosis on the liver transplant wait-list. We encourage early integration of these services into clinical decision-making in the transplant population, with further studies aimed at understanding barriers to consultation.","cites":"0","conferencePercentile":"51.38888889"}]}