{"World_journal_of_surgery.csv":[{"venue":"World journal of surgery","id":"6d2c6a4eb8eae7a45ab279869a2cf8643cddfdea","venue_1":"World journal of surgery","year":"2014","title":"Enhanced Recovery After Surgery Program in Patients Undergoing Pancreaticoduodenectomy","authors":"Junjie Xiong, Peter Szatmary, Wei Huang, Daniel de la Iglesia-Garcia, Quentin M. Nunes, Qing Xia, Weiming Hu, Robert Sutton, Xubao Liu, Michael G. Raraty","author_ids":"7278094, 5077815, 1730584, 4898811, 7647141, 7245533, 7849118, 2244574, 8015814, 4501762","abstract":"BACKGROUND\nEnhanced recovery after surgery (ERAS(®)) pathways have reduced morbidity and length of hospital stay (LOS) in orthopedics, bariatric, and colorectal surgery. New perioperative care protocols have been tested in patients undergoing pancreaticoduodenectomy (PD), with controversial results on morbidity. Incomplete data about ERAS items compliance have been reported. The aim of this study was to assess compliance with an ERAS protocol and its impact on short-term outcome in patients undergoing PD.\n\n\nMETHODS\nA comprehensive ERAS protocol was applied in 115 consecutive patients undergoing PD. Each ERAS patient was matched with one patient who received standard perioperative care. Match criteria were age, gender, malignant/benign disease, and PD-specific prognostic score.\n\n\nRESULTS\nNo adverse effect related to ERAS items occurred. Compliance with postoperative items ranged between 38 and 66 %. The ERAS group had an earlier recovery of mobilization (p < 0.001), oral feeding (p < 0.001), gut motility (p < 0.001), and an earlier suspension of intravenous fluids (p = 0.041). No difference between ERAS and control group was found in mortality, overall morbidity, and major complication rates. Subgroup analysis showed that 43/60 (71 %) patients with early postoperative low compliance with the ERAS pathway had complications. The ERAS pathway significantly shortened LOS in uneventful patients or those with minor complications (11.2 vs. 13.7 days, p = 0.001).\n\n\nCONCLUSION\nThe ERAS pathway was feasible and safe, yielding an earlier postoperative recovery. An ERAS protocol should be implemented in patients undergoing PD; however, patients with early postoperative low compliance should be carefully managed.","cites":"0","conferencePercentile":"35.71428571"}]}