{"World_health__population.csv":[{"venue":"World health & population","id":"22edf6b04e89679e94870418d1cc772bccd9f973","venue_1":"World health & population","year":"2014","title":"Social conditions and disability related to the mortality of older people in rural South Africa","authors":"F Xavier Gómez-Olivé, Margaret Thorogood, Philippe Bocquier, Paul Mee, Kathleen Kahn, Lisa Berkman, Stephen Tollman","author_ids":"8133510, 8210162, 6986322, 2285680, 2338314, 7648134, 5168367","abstract":"BACKGROUND\nSouth Africa is experiencing a health and social transition including an ageing population and an HIV epidemic. We report mortality experience of an older rural South African population.\n\n\nMETHODS\nIndividual survey data and longer-term demographic data were used to describe factors associated with mortality. Individuals aged 50 years and over (n = 4085) answered a health and quality of life questionnaire in 2006 and were followed for 3 years thereafter. Additional vital events and socio-demographic data were extracted from the Agincourt Health and Demographic Surveillance System from 1993 to 2010, to provide longer-term trends in mortality. Cox regression analysis was used to determine factors related to survival.\n\n\nRESULTS\nIn 10 967 person-years of follow-up between August 2006 and August 2009, 377 deaths occurred. Women had lower mortality {hazard ratio [HR] 0.35 [95% confidence interval (CI) 0.28-0.45]}. Higher mortality was associated with being single [HR 1.48 (95% CI 1.16-1.88)], having lower household assets score [HR 1.79 (95% CI 1.28-2.51)], reporting greater disability [HR 2.40 (95% CI 1.68-3.42)] and poorer quality of life [HR 1.59 (95% CI 1.09-2.31)]. There was higher mortality in those aged under 69 as compared with those 70 to 79 years old. Census data and cause specific regression models confirmed that this was due to deaths from HIV/TB in the younger age group.\n\n\nCONCLUSIONS\nMortality due to HIV/TB is increasing in men, and to some extent women, aged over 50. Policy makers and practitioners should consider the needs of this growing and often overlooked group.","cites":"1","conferencePercentile":"100"}]}