{"World_Journal_of_Surgical_Oncol":[{"venue":"World journal of surgical oncology","id":"2842fa91b76cb8d2129c272eb0b4de56f27da680","venue_1":"World journal of surgical oncology","year":"2016","title":"Renal and retroperitoneal metastasis from prostate adenocarcinoma: a case report.","authors":"Chao Chen, Huadong He, Zhijian Yu, Yuansong Qiu, Xuliang Wang","author_ids":"2067320, 6016174, 7822520, 3499890, 2473550","abstract":"BACKGROUND\nDiffuse renal and retroperitoneal metastasis of prostatic origin is an uncommon spread pattern of prostate cancer.\n\n\nCASE PRESENTATION\nWe described a 74-year-old male patient who was admitted because of dysuria and nocturia. Physical examination and imaging study indicated prostate mass, and laboratory analysis revealed elevated prostate specific antigen (PSA). The diagnosis of prostate cancer was established after biopsy. In the further evaluation, diffuse renal and retroperitoneal metastasis of prostate cancer was confirmed. Radiotherapy combined with endocrine therapy was given.\n\n\nCONCLUSIONS\nOur present case emphasized that the routine metastatic work-up was quite necessary, since a small proportion of men with advanced prostate cancer might experience metastases in atypical sites.","cites":"0","conferencePercentile":"47.2"},{"venue":"World journal of surgical oncology","id":"7d882c086d3e4740b80389755391bd8e790c649f","venue_1":"World journal of surgical oncology","year":"2016","title":"Intestinal perforation during chemotherapeutic treatment of intra-abdominal desmoid tumor in patients with Gardner’s syndrome: report of two cases","authors":"Wei Li, Yuhong Zhou, Qian Li, Hanxing Tong, Weiqi Lu","author_ids":"2131354, 2107648, 7137586, 8163683, 7880884","abstract":"BACKGROUND\nA minority of intra-abdominal desmoid tumors is associated with Gardner's syndrome in which desmoid tumors become an important cause of morbidity and mortality if they are surgically unresectable.\n\n\nCASE PRESENTATION\nHere, we report two cases of intestinal perforation during chemotherapy in patients with Gardner's syndrome-associated intra-abdominal desmoids. One female and one male patients who developed inoperable desmoids were given the chemotherapeutic regimen of doxorubicin plus dacarbazine, followed by meloxicam. Significant tumor regression was observed clinically. However, intestinal perforation happened in both patients. They were subjected to emergency surgery, follow-up management, and survived up to now.\n\n\nCONCLUSIONS\nThe doxorubicin plus dacarbazine chemotherapy is an effective treatment for intra-abdominal demoid tumors in patients with Gardner's syndrome. On the other hand, given severe adverse events might occur, clinicians should pay more attention that tumor quick regression may cause intestinal perforation in which urgent surgical intervention is necessary.","cites":"0","conferencePercentile":"47.2"},{"venue":"World journal of surgical oncology","id":"ab5cea333319c77424d5449e335e0ba715d4f248","venue_1":"World journal of surgical oncology","year":"2015","title":"Bursectomy and non-bursectomy D2 gastrectomy for advanced gastric cancer, initial experience from a single institution in China","authors":"Wei-Han Zhang, Xin-Zu Chen, Kun Yang, Kai Liu, Zhi-Xin Chen, Bo Zhang, Zong-Guang Zhou, Jian-Kun Hu","author_ids":"2071920, 8081778, 1744462, 4578021, 8157551, 1696318, 8526011, 1713968","abstract":"BACKGROUND\nThe aim of this study is to evaluate the safety and efficacy of bursectomy of D2 gastrectomy in terms of postoperative complications and short-term survival outcomes.\n\n\nMETHODS\nFrom January 2012 to December 2013, data of 406 gastric cancer patients with advanced tumor stages and who underwent D2 radical gastrectomy and were grouped according to whether bursectomy was performed or not in West China Hospital, Sichuan University, were analyzed.\n\n\nRESULTS\nFinally, 159 patients were in bursectomy group and 247 patients in non-bursectomy group. Surgical duration was 260.1 ± 43.4 min in the bursectomy group, compared to 227.9 ± 48.6 min in the non-bursectomy group (p < 0.001). The intraoperative blood loss was comparable between the bursectomy group and the non-bursectomy group (198.9 ± 63.5 vs. 201.1 ± 53.7 ml, p = 0.729). Postoperative morbidity rate showed no significant difference between the two groups, which were 23.3 % in the bursectomy group and 17.8 % in the non-bursectomy group, p = 0.179. The overall survival outcomes of patients were compared between the two groups of all patients (p = 0.055): patients who underwent distal gastrectomy (p = 0.129) and total gastrectomy (p = 0.016) and pT2-3 stage patients (p = 0.117) and pT4a stage patients (p = 0.128). The multivariate survival analysis identified that bursectomy or not, pT stage and pN stage were independent prognostic risk factors for the overall survival.\n\n\nCONCLUSIONS\nThe bursectomy might increase the surgical duration when the D2 gastrectomy was done. Experienced surgeons can perform it safely. However, for the survival benefits of bursectomy, long-term, large sample sized, and high-quality randomized controlled trials are expected.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"58382bd8a6772aced177ebdb2149e928be65c399","venue_1":"World journal of surgical oncology","year":"2014","title":"The efficacy of molecular subtyping in predicting postoperative recurrence in breast-conserving therapy: a 15-study meta-analysis","authors":"Jing Chen, Peng Jiang, Han-jin Wang, Jia-yi Zhang, Yang Xu, Mu-hong Guo, Bin Zhang, Chong-yin Tang, Hong-yong Cao, Shui Wang","author_ids":"3943100, 1801523, 5534806, 8214856, 1714663, 5440289, 2274522, 6355290, 5558741, 5739805","abstract":"BACKGROUND\nRecent research displays that breast cancer (BC) is a heterogeneous disease and distinct molecular subtypes yield different prognostic outcomes.\n\n\nMETHODS\nWe conducted a meta-analysis to clarify the role of molecular subtypes in recurrence risk after breast-conserving therapy (BCT). Eligible studies of single- (ER, PR, Her-2, and p53) and triple-molecular (Luminal A, Luminal B, Her-2, triple-negative) subtypes were identified through multiple search strategies. Pooled hazard ratios with 95% confidence intervals were calculated to assess this research topic.\n\n\nRESULTS\nFifteen studies involving 21,645 participants were included in the meta-analysis. Her-2 positive patients had a significantly higher recurrence risk in both overall merge (HR = 1.97, 95% CI: 1.41-2.75) and subtotal merge of local recurrence (LR) (HR = 1.93, 95% CI: 1.34-2.78). Significantly higher risk of recurrence was also observed in p53 positive patients by overall merge (HR = 1.78, 95% CI: 1.49 -2.12) and subtotal merge of LR (HR = 1.73, 95% CI: 1.44-2.07). When setting Luminal A as a baseline, Luminal B, Her-2, and triple-negative all showed significantly increased risk for both LR and distant recurrence (DR). Comparing triple-negative and non-triple-negative subtypes showed the biggest risk for overall recurrence (HR = 3.19, 95% CI: 1.91-5.31) and LR (HR = 3.31, 95% CI: 1.69-6.45).\n\n\nCONCLUSIONS\nOur meta-analysis showed significant differences in recurrence risk among various molecular subtypes after BCT. Although Her-2 and p53 positive subtypes can be considered independent prognostic biomarkers for indicating high LR risk, triple-molecular biomarkers showed higher clinical value. Triple-negative subtype showed the highest recurrence risk among all subtypes, and adjuvant chemotherapy should be considered for it.","cites":"0","conferencePercentile":"24.24623116"},{"venue":"World journal of surgical oncology","id":"8b00357be216c7420b537238a3b469c871ae7cc3","venue_1":"World journal of surgical oncology","year":"2012","title":"Primary gastric cancer presenting with a metastatic embolus in the common carotid artery: a case report","authors":"Ying Zhang, Xiu-feng Zhang, Wei-hui Shentu, Guan-gen Yang, Zhong Shen, Pin-tong Huang","author_ids":"1752812, 8744840, 5668973, 8250685, 1745145, 7889033","abstract":"Although about 30% of gastric cancers have distant metastasis at the time of initial diagnosis, metastatic tumor embolus in the main blood vessels is not common, especially in the main artery. The report presents, for the first time, an extremely rare clinical case of a metastatic embolus in the common carotid artery (CCA) from primary gastric cancer. Metastatic embolus from the primary tumor should be considered when patients present with gastric cancer accompanied by intravascular emboli. The patient should be actively examined further so as to allow early detection and treatment.","cites":"0","conferencePercentile":"15.94982079"},{"venue":"World journal of surgical oncology","id":"5e4a125fb0af62186dbbac0db9655f7983039665","venue_1":"World journal of surgical oncology","year":"2013","title":"Blood neutrophil-lymphocyte ratio predicts survival for stages III-IV gastric cancer treated with neoadjuvant chemotherapy","authors":"Hailong Jin, Geer Zhang, Xiaosun Liu, Xiaokun Liu, Chao Chen, Hang Yu, Xiaomei Huang, Qing Zhang, Jiren Yu","author_ids":"4579508, 6306762, 8016398, 8015945, 2067320, 7278775, 8421384, 1681771, 7177356","abstract":"BACKGROUND\nAccurate predictors of survival for patients with advanced gastric cancer treated with neoadjuvant chemotherapy are currently lacking. In this study, we aimed to evaluate the prognostic significance of the neutrophil-lymphocyte ratio (NLR) in patients with stage III-IV gastric cancer who received neoadjuvant chemotherapy.\n\n\nMETHODS\nWe enrolled 46 patients in this study. The NLR was divided into two groups: high (>2.5) and low (≤2.5). Univariate analysis on progression-free survival (PFS) and overall survival(OS) was performed using the Kaplan-Meier and log-rank tests, and multivariate analysis was conducted using the Cox proportional hazards regression model. We analyzed whether chemotherapy normalized high NLR or not, and evaluated the prognostic significance of normalization on survival.\n\n\nRESULTS\nThe univariate analysis showed that PFS and OS were both worse for patients with high NLR than for those with low NLR before chemotherapy (median PFS 16 and 49 months, respectively, P = 0.012; median OS 21 and 52 months, P = 0.113). PFS and OS were also worse for patients with high NLR than for those with low NLR before surgery (median PFS 12 and 35 months, P = 0.019; median OS 21 and 52 months, P = 0.082). Multivariate analysis showed that both NLR before chemotherapy and surgery were independent prognostic factors of PFS. Neoadjuvant chemotherapy normalized high NLR in 11 of 24 patients, and these 11 patients had better median PFS and OS than the 13 patients who had high NLR both before chemotherapy and before surgery (PFS: 35.0 and 10.0 months, P = 0.003; OS: 60 and 16 months, P = 0.042).\n\n\nCONCLUSIONS\nNLR may serve as a potential biomarker for survival prognosis in patients with stage III-IV gastric cancer receiving neoadjuvant chemotherapy.","cites":"5","conferencePercentile":"93.62745098"},{"venue":"World journal of surgical oncology","id":"e14a120b6a58b25f1796b660ed4345af6bdd95a1","venue_1":"World journal of surgical oncology","year":"2012","title":"A rare giant gastrointestinal stromal tumor of the stomach traversing the upper abdomen: a case report and literature review","authors":"Lei Zhou, Chang Liu, Ji-Gang Bai, Ji-Chao Wei, Kai Qu, Feng Tian, Ming-Hui Tai, Rui-Tao Wang, Fan-Di Meng","author_ids":"4760737, 1759234, 7238390, 5712288, 2589128, 1700872, 8187419, 8199350, 4009365","abstract":"We present the case of a 66-year-old woman with a huge gastrointestinal stromal tumor of the stomach that traversed her upper abdomen. The predominant abdominal sign was a huge, palpable mass, but there were no other distinctive findings in her physical examination or her routine blood workup, including biochemical markers. It was difficult to judge the origin of the mass upon imaging. Furthermore, radiological findings revealed that the mass had a complex relationship with many major blood vessels. An exploratory laparotomy revealed a huge tumor protruding from the anterior wall of the stomach fundus, on the lesser curvature of the stomach, measuring approximately 21 × 34 × 11 cm in diameter and weighing 5.5 kg. A complete resection was performed and the tumor was characterized on immunohistochemistry as a gastrointestinal stromal tumor of the stomach. Preoperative diagnosis of gastrointestinal stromal tumors can be difficult, and we hope that the presentation of this rare case and literature review will benefit other diagnosing clinicians having similar problems.","cites":"3","conferencePercentile":"76.70250896"},{"venue":"World journal of surgical oncology","id":"34cac57efc2135da7d6810c6fe87eaae327ee195","venue_1":"World journal of surgical oncology","year":"2015","title":"Clinicopathological characteristics, diagnosis, treatment, and outcomes of primary gastric adenosquamous carcinoma","authors":"Haining Chen, Chaoyong Shen, Rui Yin, Yuan Yin, Jiaju Chen, Luyin Han, Bo Zhang, Zhixin Chen, Jiaping Chen","author_ids":"1787465, 4669973, 5663530, 1765958, 7557455, 3879903, 1696318, 8157774, 7557651","abstract":"BACKGROUND\nPrimary gastric adenosquamous carcinoma (ASC) is a rare subset of ASC. This study aims to investigate the clinicopathological features, diagnosis, treatment, and outcomes of primary gastric ASC.\n\n\nMETHODS\nThe medical records of 13 consecutive patients with primary gastric ASC between January 2010 and July 2014 from a single institutional database were reviewed.\n\n\nRESULTS\nMale predominance was observed (M/F = 10/3) among the patients, and their median age was 62 years (range: 43 to 79 years). The primary lesions were most often found in the upper third of the stomach, with a median tumor size of 5 cm (range: 2.25 cm to 10.5 cm). Ten patients underwent radical resections (R0 resection, 76.9%), while three patients had palliative resections (R1/R2 resection, 23.1%). Twelve patients had lymph node metastasis at the time of surgery. Adenocarcinoma and squamous cell carcinoma components in lymph node were found in eight and two cases, respectively, while two patients had both squamous cell carcinoma and adenocarcinoma components. In terms of the TNM staging system, stages IIB, IIIA, IIIB, IIIC, and IV were detected in 2 (15.4%), 2 (15.4%), 1 (7.7%), 5 (38.5%), and 3 (23.1%) patients, respectively. The median follow-up period was 22 months (range: 5 to 52 months); during which, four patients were still alive and eight patients died because of tumor progression. The 1-, 2-, and 3-year survival rates were 76.9%, 46.2%, and 15.4%, respectively.\n\n\nCONCLUSIONS\nPrimary gastric ASC has a very poor prognosis, and both squamous cell carcinoma and adenocarcinoma components have distant metastasis potential.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"f4933e7c52724ec0da09c086514e2cbd80f251e1","venue_1":"World journal of surgical oncology","year":"2016","title":"The patterns and timing of recurrence after curative resection for gastric cancer in China","authors":"Dan Liu, Ming Lu, Jian Li, Zuyao Yang, Qi Feng, Menglong Zhou, Zhen Zhang, Lin Shen","author_ids":"1745635, 4898850, 1701502, 8387224, , 7307375, 5226883, 8290337","abstract":"BACKGROUND\nThe recurrence of gastric cancer after curative resection had adverse effects on patients' survival. The treatment presence varied from different countries. The aims of this study were to understand the recurrence incidence, patterns, and timing and to explore the risk factors in China.\n\n\nMETHODS\nOne thousand three hundred four patients who undergoing curative resection from more than 100 hospitals between January 1st 1986 and September 1st 2013, were surveyed in detail. Clinical pathological factors were examined as potential risk factors of each recurrence pattern using univariate and multivariate analyses. Recurrence timing was also analyzed based on disease-free survival.\n\n\nRESULTS\nAmong 1304 gastric cancer patients, 793 patients (60.8%) experienced recurrence and 554 patients (42.5%) experienced recurrence within 2 years after operation. The median disease-free survival was 29.00 months (interquartile range [IQR] 12.07, 147.23). Receiving operation in general hospitals was one of independent risk factors of local-regional recurrence (OR = 1.724, 95% CI 1.312 to 2.265) and distant metastasis (OR = 1.496, 95% CI 1.164 to 1.940). Patients would suffer lower risk of distant metastasis if they received no more than 3 cycles adjuvant chemotherapy (OR = 0.640, 95% CI 0.433 to 0.943). Adjuvant radiotherapy could reduce the risk of recurrence (OR 0.259, 95% CI 0.100 to 0.670), especially distant metastasis (OR = 0.260, 95% CI 0.083 to 0.816).\n\n\nCONCLUSIONS\nMore than 60% patients experienced recurrence after curative resection for gastric cancer, especially within 2 years after surgery. Risk factors were clarified between various recurrence patterns. Advanced gastric cancer and undergoing operation in general hospitals contributed to increased recurrence risk and worse survival. Enough number of lymph nodes harvest and standard D2 lymphadenectomy could reduce recurrence. Chinese patients would benefit from adjuvant chemotherapy and radiotherapy.","cites":"0","conferencePercentile":"47.2"},{"venue":"World journal of surgical oncology","id":"de379f06b766d5865710af4f9d44d3f894c331b8","venue_1":"World journal of surgical oncology","year":"2015","title":"Sarcoidosis misdiagnosed as malignant tumors: a case report","authors":"Zuosheng Li, Xin Li, Zuoqing Song, Jinghao Liu, Ming Dong, Tao Shi, Dian Ren, Song Xu, Jun Chen","author_ids":"4415803, 1705796, 5410516, 3619616, 8605880, 1807161, 4422060, 2076123, 3543702","abstract":"BACKGROUND\nSarcoidosis is a rare condition that is often misdiagnosed as malignant tumors due to the similar clinical manifestations and imaging findings.\n\n\nCASE PRESENTATION\nWe encountered a 56-year-old Chinese woman who had a chief complaint of a persistent cough. The chest computer tomography (CT) revealed mediastinal and bilateral hilar lymph node enlargement, and positron emission tomography-computer tomography (PET-CT) revealed abnormal fluorodeoxyglucose (FDG) uptake in the lymph nodes of the chest and abdomen. To further clarify the diagnosis, a lymph node sampling was performed by video-assisted thoracoscopic surgery (VATS) and the histopathologic diagnosis of sarcoidosis was confirmed.\n\n\nCONCLUSIONS\nVATS could be an effective and minimally invasive diagnostic method to discriminate pulmonary sarcoidosis with other malignant tumors.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"ee55726aebd206693601028f15a7c2aeeedc4624","venue_1":"World journal of surgical oncology","year":"2011","title":"Case report of rapidly progressive proliferative verrucous leukoplakia and a proposal for aetiology in mainland China","authors":"Lin Ge, Yun Wu, Lan-yan Wu, Lin Zhang, Bing Xie, Xin Zeng, Mei Lin, Hong-mei Zhou","author_ids":"3687802, 2401202, 4097388, 2752137, 1752678, 7724879, 7828188, 2561915","abstract":"Proliferative verrucous leukoplakia (PVL) is a rare oral leukoplakia and has four features such as chronic proliferation, multiple occurrences, refractoriness to treatment and high rate of malignant transformation. As mentioned above, most PVL cases processed to malignancy over many years, sometimes 20 years. However, this report described a case of rapid progress, which had malignant transformation in a short period. Additionally, the aetiology of PVL was discussed and immunity was proposed as the possible cause.","cites":"1","conferencePercentile":"42.94117647"},{"venue":"World journal of surgical oncology","id":"4c4214329dbbf291d7c73b5afb2a145559f780e2","venue_1":"World journal of surgical oncology","year":"2014","title":"Decreased expression of eukaryotic initiation factor 3f is an adverse prognostic factor for stage I–III gastric cancer","authors":"Guanghua Li, Na Wang, Chuanjin Sun, Bo Li","author_ids":"4844877, 1806730, 5112686, 1713520","abstract":"BACKGROUND\nIt has been demonstrated that eIF3f expression is significantly decreased in many human cancers, a fact which plays an important role in human cancer. However, the expression of eIF3f in gastric cancer (GC) is not well understood to date. Therefore, the aim of this study is to detect the expression of eIF3f in GC.\n\n\nMETHODS\nThe expression of eIF3f was examined by immunohistochemistry in tissues with stage I to III GC and adjacent non-cancerous tissues (ANCT) of 195 gastrectomy specimens; clinicopathological results, including survival, were analyzed.\n\n\nRESULTS\nThe positive expression rate of eIF3f was significantly higher in ANCT tissues than in GC. eIF3f levels were correlated with more advanced tumor stages and likelihood of recurrence (all P<0.05). The Kaplan-Meier survival curves indicated that decreased expression of eIF3f could serve as a prognosis marker for poor outcome of GC patients (P=0.04).\n\n\nCONCLUSIONS\neIF3f may play an important role in recurrence, thus representing a promising predictive marker for the prognosis of GC.","cites":"0","conferencePercentile":"24.24623116"},{"venue":"World journal of surgical oncology","id":"21ca07b70f632cc4482db7b4bf98f01a09517a6e","venue_1":"World journal of surgical oncology","year":"2012","title":"Malignant triton tumor of the retroperitoneum: a case report and review of the literature","authors":"Zhiwei Li, Jie Xiang, Sheng Yan, Feng Gao, Shusen Zheng","author_ids":"2902955, 2406408, 2274178, 1710132, 7149791","abstract":"BACKGROUND\nMalignant triton tumors are relatively rare and highly aggressive tumors in which malignant schwannoma cells coexist with rhabdomyoblasts. Their occurrence in the retroperitoneum is uncommon and has been rarely reported.\n\n\nCASE PRESENTATION\nWe present the case of a patient with a retroperitoneal malignant triton tumor. A 32-year-old male was referred with epigastric pain and an abdominal mass. Computed tomography revealed a huge soft tissue retroperitoneal mass that involved adjacent organs and vessels. Complete resection was undertaken. Pathological examination confirmed the presence of a malignant triton tumor. The patient died two and a half months after surgery, as a result of local recurrence.\n\n\nCONCLUSION\nMalignant triton tumors are uncommon sarcomas that are associated with a high incidence of developing local recurrence and distant metastases. Immunohistochemical staining showing nerve sheath differentiation with rhabdomyoblastic cells confirms the diagnosis. Complete excision of the tumor is the most effective treatment strategy for these retroperitoneal tumors.","cites":"2","conferencePercentile":"62.54480287"},{"venue":"World journal of surgical oncology","id":"009ffa0e086cba2877ee18891801d85f3bb2cd47","venue_1":"World journal of surgical oncology","year":"2012","title":"Calcification of vestibular schwannoma: a case report and literature review","authors":"Yang Zhang, Jinlu Yu, Limei Qu, Yunqian Li","author_ids":"4449904, 7177546, 2958092, 2319195","abstract":"Calcification rarely occurs in vestibular schwannoma (VS), and only seven cases of calcified VS have been reported in the literature. Here, we report a 48-year-old man with VS, who had a history of progressive left-sided hearing loss for 3 years. Neurological examination revealed that he had left-sided hearing loss and left cerebellar ataxia. Magnetic resonance imaging and computerized tomography angiography showed a mass with calcification in the left cerebellopontine angle (CPA). The tumor was successfully removed via suboccipital craniotomy, and postoperative histopathology showed that the tumor was a schwannoma. We reviewed seven cases of calcified VS that were previously reported in the literature, and we analyzed and summarized the characteristics of these tumors, including the calcification, texture, and blood supply. We conclude that calcification in VS is associated with its texture and blood supply, and these characteristics affect the surgical removal of the tumor.","cites":"1","conferencePercentile":"42.65232975"},{"venue":"World journal of surgical oncology","id":"c768438089a8d0030176327f767ca8fbcba4242f","venue_1":"World journal of surgical oncology","year":"2014","title":"Complete remission of diffuse hepatocellular carcinoma in a young adult after GSP-TACE: a case report","authors":"Song Liu, Yuewei Zhang, Guangsheng Zhao, Ying Liu","author_ids":"6216822, 6239610, 1935155, 1718041","abstract":"Hepatocellular carcinoma (HCC) is the most common primary tumor of the liver. It mostly occurs in older age groups (usually those 50 to 60 years old), and rarely in young adults. The survival rate of these young HCC patients is usually very low. The authors report a case of a 22-year old man with diffuse-type HCC who successfully achieved complete remission for 46 months after second transcatheter arterial chemoembolization using gelatin sponge particles (Eric Kang Pharmaceutical Technology Co., Ltd. Hangzhou, China) combined with pirarubicin.","cites":"1","conferencePercentile":"62.68844221"},{"venue":"World journal of surgical oncology","id":"a46b0e1ada57e14b14fb5a6628f34d745c8fb0a2","venue_1":"World journal of surgical oncology","year":"2013","title":"Functional tongue reconstruction with the anterolateral thigh flap","authors":"Xue Wang, Guangqi Yan, Guirong Zhang, Jiqiang Li, Jihui Liu, Yang Zhang","author_ids":"5053992, 4755944, 2302576, 8549880, 4745827, 4449904","abstract":"BACKGROUND\nA retrospective study was conducted to evaluate the advantages of anterolateral thigh (ALT) flap in tongue reconstruction.\n\n\nMETHOD\nFrom September 2008 to February 2012, patients receiving ALT flap tongue reconstruction were included in the study. Patients undergoing ALT flap were compared with those undergoing similar surgery with radial forearm flap (RFF). The medical records of the included patients were reviewed, and a questionnaire was used to assess acceptability of the surgery.\n\n\nRESULTS\nAll flaps (both ALT and RFF) were successful In the ALT group, most patients were satisfied with the appearance of the reconstructed tongue and the intelligibility of their speech, and there were fewer complications with this technique compared with the RFF.\n\n\nCONCLUSION\nThe ALT flap is an ideal method for tongue reconstruction. The thickness and volume of the ALT flap can be adjusted based on the individual extent of the defect, and it can not only provide bulk but also ensure mobility, and it has other advantages also, including a long pedicle and low donor site morbidity.","cites":"1","conferencePercentile":"43.62745098"},{"venue":"World journal of surgical oncology","id":"08abb53e39f1dc3a87b1f5a07de490be3edb9882","venue_1":"World journal of surgical oncology","year":"2015","title":"Common genetic polymorphisms in pre-microRNAs and risk of bladder cancer","authors":"Shi Deng, Wei Wang, Xiang Li, Peng Zhang","author_ids":"4292142, 2428792, 1737850, 1678443","abstract":"BACKGROUND\nAt present, inconsistent association between single nucleotide polymorphism (SNP) in pre-miRNAs (hsa-mir-196a2 rs11614913 C/T, hsa-mir-499 rs3746444 A/G, and hsa-mir-146a rs2910164 C/G) and bladder cancer were obtained in limited studies. We performed a case-control study to test whether these three common polymorphisms are associated with bladder cancer. One hundred fifty-nine patients affected by bladder cancer and 298 unrelated healthy subjects were enrolled in the study.\n\n\nMETHODS\nUsing polymerase chain reaction-restriction fragment length polymorphism assay (PCR-RFLP), genotypes of these three SNPs were determined, and their associations with bladder cancer, as well as with clinic pathological factors, and tumor progression were analyzed.\n\n\nRESULTS\nNo association between bladder cancer risk and variant allele of hsa-mir-196a2 rs11614913 C/T, hsa-mir-499 rs3746444 A/G, or hsa-mir-146a rs2910164 C/G was observed. Heterozygous genotype (CT genotype) of rs11614913 was associated with a significantly decreased bladder cancer risk (P = 0.004, OR = 0.56, 95 % CI = 0.38-0.83). Further stratified analyses showed that rs2910164 is associated with the tumor stage in a recessive model and with metastasis in a dominant model (P = 0.012, OR = 0.20, 95 % CI = 0.05-0.72 and P = 0.04, OR = 2.63, 95 % CI = 1.03-6.67, respectively). No association between hsa-mir-499 rs3746444 A/G and bladder cancer was observed.\n\n\nCONCLUSIONS\nOur results suggested hsa-mir-196a2 rs11614913 C/T is associated with a significantly decreased risk of bladder cancer and hsa-mir-146a rs2910164 GG genotype is associated with clinical stage and metastasis in bladder cancer.","cites":"1","conferencePercentile":"78.2729805"},{"venue":"World journal of surgical oncology","id":"faab6cbb9d8c8a76a1dda05db236af964ccde8be","venue_1":"World journal of surgical oncology","year":"2014","title":"Preoperative thrombocytosis is a significant unfavorable prognostic factor for patients with resectable non-small cell lung cancer","authors":"Miso Kim, Hyun Chang, Hee Chul Yang, Yu Jung Kim, Choon-Taek Lee, Jae-Ho Lee, Sanghoon Jheon, Kwhanmien Kim, Jin-Haeng Chung, Jong Seok Lee","author_ids":"7590918, 5064758, 5714451, 4789219, 6107265, 8667017, 3495685, 7826778, 5046237, 1802953","abstract":"BACKGROUND\nPrevious studies have reported that pretreatment thrombocytosis is associated with poor outcomes in several cancer types. This study was designed to evaluate the prognostic significance of preoperative thrombocytosis in patients with non-small cell lung cancer (NSCLC) who undergo surgery.\n\n\nMETHODS\nWe retrospectively reviewed the records of 199 patients who underwent R0 resection for NSCLC between May 2003 and July 2006 at Seoul National University Bundang Hospital, Seongnam, Korea.\n\n\nRESULTS\nThe frequency of preoperative thrombocytosis was 7.5% (15/199). Patients with preoperative thrombocytosis had shorter overall survival (OS, P = 0.003) and disease-free survival (DFS, P = 0.005) than those without thrombocytosis. In multivariable analysis, patients with preoperative thrombocytosis had a significantly greater risk of death and recurrence than those without preoperative thrombocytosis (risk of death: hazard ratio (HR) 2.98, 95% confidence interval (CI) 1.39 to 6.37, P = 0.005; risk of recurrence: HR 2.47, 95% CI 1.22 to 5.01, P = 0.012). A tendency towards a shorter OS and DFS was observed in three patients with persistent thrombocytosis during the follow-up period when compared with those of patients who recovered from thrombocytosis after surgery.\n\n\nCONCLUSIONS\nPreoperative thrombocytosis was valuable for predicting the prognosis of patients with NSCLC. Special attention should be paid to patients with preoperative and postoperative thrombocytosis.","cites":"3","conferencePercentile":"92.21105528"},{"venue":"World journal of surgical oncology","id":"7394bc0174f4ad4e2dd455f0f962c1572058fb67","venue_1":"World journal of surgical oncology","year":"2014","title":"Desmoplastic small round cell tumor: a case report and review of the literature","authors":"Xiang Li, Jing Yu, Shibao Fang, Xiaoming Xing, Jie Zhao","author_ids":"1737850, 3675090, 4021333, 7024681, 1701907","abstract":"Desmoplastic small round cell tumor is a rare malignant tumor that has a poor prognosis. It affects predominantly young males. In the current report, a 14-year-old male patient was admitted to the hospital for evaluation of abdominal distension, and abdominal pain. Imaging examination revealed a high prevalence of multiple intraperitoneal and liver parenchymal cystic and solid tumors. After an explorative surgery, the pathological findings confirmed the presentation of desmoplastic small round cell tumor. Diagnosis of desmoplastic small round cell tumor could easily have been overlooked since there was no specific evidence for this condition available in the clinical and imaging examinations. In the present study, ultrasound examination detected solid cystic masses, which suggested the presence of necrosis and hemorrhage. Immunohistochemistry and cytogenetic studies confirmed the diagnosis of desmoplastic small round cell tumor in this patient.","cites":"3","conferencePercentile":"92.21105528"},{"venue":"World journal of surgical oncology","id":"413ee0be6219b5b0bfe68017c6ee3fe722f74556","venue_1":"World journal of surgical oncology","year":"2015","title":"Analysis of clinical features, treatment response, and prognosis among 61 elderly newly diagnosed multiple myeloma patients: a single-center report","authors":"Na An, Xin Li, Man Shen, Shilun Chen, Zhongxia Huang","author_ids":"8262434, 1705796, 2934593, 7159777, 7945570","abstract":"BACKGROUND\nWe identified the clinical features of 61 cases of multiple myeloma (MM) patients over 65 years and analyzed the treatment and prognosis of the era of new drugs in elderly patients.\n\n\nMETHODS\nWe identified 61 newly diagnosed symptomatic multiple myeloma (NDMM) among elderly Chinese patients more than 65 years old diagnosed from 2006 to 2012.\n\n\nRESULTS\nOf the 205 consecutive MM patients whom we reviewed, 61 (29.76%) cases were NDMM patients aged more than 65 years and the others were younger than 65 years old. Among them, 40 (65.6%) cases were in end-stage (ISS stage III); meanwhile, 19 (31.2%) cases of them had MM with extramedullary plasmacytoma (EMP), observed in 42.1% patients at diagnosis, and the top three incidence of position were spinal canal, pleural, and soft tissue. In the whole column, the median follow-up was 38 months and median age was 72.5 years. Patients received bortezomib- or thalidomide-containing regimens as initial therapy. Comparing the two treatment groups, the complete remission (CR)/near-complete remission (nCR) rate was significantly higher in the bortezomib-containing regimens (61.5 vs.18.18%, P=0.001), no difference in progression-free survival (PFS) and overall survival (OS). Patients of age over 75 years had shorter OS than those of age over 65 years (49 vs. 24 months, P=0.001). The patients with EMP had shorter OS than those without EMP in two age groups (32 vs. 42 and 15 vs. 24 months, P=0.017 and 0.024, respectively).\n\n\nCONCLUSIONS\nThe results highlight that patients over 75 years and MM with EMP have a poorer outcome. While the CR rate is higher in bortezomib-containing regimens, no significant improvement is noted in respect to the survival outcomes; also, it cannot overcome the negative influence on survival of age and MM with EMP in elderly patients.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"fbec5f1b943b0d67c74886e71637b1b5026cfd24","venue_1":"World journal of surgical oncology","year":"2014","title":"Gastritis cystica profunda recurrence after surgical resection: 2-year follow-up","authors":"Lei Wang, Hua Yan, Da-Chun Cao, Li Huo, Hai-Zhong Huo, Bing Wang, Ying Chen, Hai-Lin Liu","author_ids":"1743559, 3686320, 5479028, 8574092, 3816805, 8627175, 4206226, 4467691","abstract":"BACKGROUND\nGastritis cystica profunda (GCP) is an uncommon disease characterized by multiple cystic gastric glands within the submucosa of the stomach.\n\n\nCASE DESCRIPTION\nHere, we present a case of a 63-year-old man with intermittent epigastric discomfort in whom gastroscopy revealed multiple irregular elevated nodular lesions with smooth surfaces at the anterior of the antrum. Surgical resection of the nodular lesions was performed, and the diagnosis of gastritis cystica profunda (GCP) was confirmed by histological examination. Another elevated nodular lesion approximately 10 mm in diameter with an ulcer was found on the gastric side of the remnant stomach near the resection side from 6 to 24 months after the surgical resection. Endoscopic ultrasonography (EUS) and repeated biopsies of the new elevated lesion were performed. Homogeneous, anechoic masses originating from the submucosa without gastric adenocarcinoma in histological examination showed GCP recurrence may occur.\n\n\nCONCLUSIONS\nWe report a case of GCP recurrence within 6 months after surgical resection. GCP should be considered in the differential diagnosis of elevated lesions in the stomach.","cites":"1","conferencePercentile":"62.68844221"},{"venue":"World journal of surgical oncology","id":"e4684ffc043d1d92939b93d7ffef2cffbd010ac9","venue_1":"World journal of surgical oncology","year":"1999","title":"Evaluation of the benefit of using blue dye in addition to indocyanine green fluorescence for sentinel lymph node biopsy in patients with breast cancer","authors":"Wenbin Guo, Li Zhang, Jun Ji, Wei Gao, Jintao Liu, Meng Tong","author_ids":"3189543, 3043513, 1809874, 1698396, 8191084, 7776444","abstract":"BACKGROUND\nNear infrared-guided indocyanine green (ICG) fluorescence has vast potential for guiding sentinel lymph node biopsy (SLNB) in patients with breast cancer. The purpose of this study was to evaluate any additional clinical benefit for SLNB when blue dye is used in combination with ICG.\n\n\nMETHODS\nBetween November of 2009 and September of 2013, 86 patients diagnosed with breast cancer were investigated by SLNB using a combination of patent blue and ICG. A lymph node was considered as the sentinel lymph node (SLN) when it was stained with blue dye and/or fluorescence. A levelIandIIaxillary dissection was performed for verification of axillary node status after the SLNB.\n\n\nRESULTS\nThe SLN identification rate of SLN for ICG-patent blue combination was comparable to that for ICG alone (98.8% versus 93%; P = 0.054), but the false-negative rate was reduced from 12% (3/25) to 4% (1/25). Twenty-four patients had positive SLNs. In two of those patients, although there were SLNs identified by both tracers, the positive SLNs were identified by blue dye only.\n\n\nCONCLUSION\nAlthough blue dye did not improve the identification rate significantly, there was a definite benefit in improving the false-negative rate. The use of a fluorescence method together with blue dye is an ideal method for hospitals that do not have access to conventional radiation-based detection methods.","cites":"0","conferencePercentile":"100"},{"venue":"World journal of surgical oncology","id":"cf07e874b833ecffa96a8fbfc191a3ddd2b1b251","venue_1":"World journal of surgical oncology","year":"2012","title":"Primary lung lymphoma involving the superior vena cava","authors":"Sen Wei, Xin Li, Xiaomin Qiu, Honglin Zhao, Gang Chen, Jun Chen, Qinghua Zhou","author_ids":"1880530, 1705796, 7712325, 2577626, 1729377, 3543702, 1698479","abstract":"Primary lung lymphoma (PLL) presenting as a primary pulmonary lesion is rare and usually affects elderly people. Here we describe a 25-year-old Chinese man diagnosed with primary lung lymphoma, which presented as a huge lung tumor mimicking a primary lung cancer and involving the superior vena cava. He underwent double-sleeve reconstructions of bronchus and pulmonary arteries with right upper- and middle-lobe lobectomy along with replacement of the superior vena cava with a graft, and was then given standard chemotherapy of CHOP plus Rituximab. The patient has been well, showing no local recurrence or distal metastasis during a 27-month follow-up.","cites":"2","conferencePercentile":"62.54480287"},{"venue":"World journal of surgical oncology","id":"4fd66c50aa3eeff9026ac81093c7cc00ffc4e059","venue_1":"World journal of surgical oncology","year":"2013","title":"Prevention of contamination by biopsy needle track contamination using a novel adriamycin-loaded gelatin sponge","authors":"Zhen-Feng Li, Jian-Min Li, Jun Yan, Zhi-Ping Yang, Xin Li, Qiang Yang","author_ids":"2953578, 8549764, 1712810, 8387549, 1705796, 1733090","abstract":"BACKGROUND\nThe gold standard of tumor diagnosis is histological examination of a biopsy; however, there is concern that tumor cell dissemination along the needle track during percutaneous biopsy can cause local tumor relapse. We aimed to evaluate the value of an adriamycin (ADM)-loaded gelatin sponge in preventing tumor cell contamination along the biopsy needle track.\n\n\nMETHODS\nData were obtained from 40 patients who were diagnosed by core needle biopsy as having osteosarcoma and who were followed up at our hospital between 2008 and 2011. Of the 40 patients, 20 had the needle biopsy tracks filled with ADM-loaded absorbable gelatin sponge immediately after the biopsy specimen was obtained, while the other 20 did not. All 40 patients underwent limb-salvage surgery, and specimens were obtained from the biopsy track for histopathologic examination of multiple sections.\n\n\nRESULTS\nOn histological examination, there was less tumor cell contamination along the biopsy tracks in the ADM group.\n\n\nCONCLUSION\nUse of ADM-loaded absorbable gelatin sponge may prevent tumor cell contamination of a biopsy track, and reduce the possibility of consequent tumor relapse.","cites":"1","conferencePercentile":"43.62745098"},{"venue":"World journal of surgical oncology","id":"e9e22f150a809c20ffa75e8cded5d9b207ed3c1d","venue_1":"World journal of surgical oncology","year":"2013","title":"Papillary carcinoma of the duodenum combined with right renal carcinoma: a case report","authors":"Xuan Zhang, Zhen-hong Zhou, Shou-wang Cai, Jia-hong Dong","author_ids":"1698961, 4425257, 5074961, 7746852","abstract":"We report a case of papillary carcinoma of the duodenum combined with right renal carcinoma. A 58-year-old man underwent a physical examination that revealed intrahepatic and extrahepatic bile duct dilatation on B ultrasound. Intrahepatic bile duct dilatation could be seen on magnetic resonance imaging (MRI), but the head of the pancreas and distal bile duct showed no tumor signals, which led to a diagnosis of periampullary carcinoma and right renal carcinoma. Considering the trauma of pancreaticoduodenectomy combined with renal resection operation is greater, we carried out the laparoscopic right renal radical resection first, and then a pylorus-preserving pancreaticoduodenectomy was performed. However, postoperative intra-abdominal infections and bleeding occurred; our patient improved after vascular interventional microcoil embolization for the treatment of hemostasis. The second operation for celiac necrotic tissue elimination, jejunal fistulization and peritoneal lavage and drainage was performed 14 days latter. Our patient improved gradually and was discharged on the 58th postoperative day. There has been no tumor recurrence after a follow-up of 26 months.","cites":"1","conferencePercentile":"43.62745098"},{"venue":"World journal of surgical oncology","id":"9cc0ac542e509d838579f1d0650d97fc3e724c0d","venue_1":"World journal of surgical oncology","year":"2014","title":"Light chain multiple myeloma, clinic features, responses to therapy and survival in a long-term study","authors":"Jia-jia Zhang, Wan-jun Sun, Zhong-xia Huang, Shi-lun Chen, Yu-ping Zhong, Ying Hu, Na An, Men Shen, Xin Li","author_ids":"8214703, 6502094, 7945687, 5634756, 7911609, 5514915, 8262434, 3954263, 1705796","abstract":"BACKGROUND\nWe intended to investigate the long-term clinical characteristics, responses to therapy and survival in patients with lightchain multiple myeloma (MM).\n\n\nMETHODS\nNinety-six patients were enrolled into the study. There were 42 κ-chain MM patients and 54 λ-chain MM patients. All the patients werestage III in the Durie-Salmonstaging system. Among them, 66 patients received Velcade (bortezomib) treatment and the other 30 did not.\n\n\nRESULTS\nThe main symptoms of these patients included bone pain (77.1%), weakness and fatigue (12.5%), foamy urine (8.3%) and extramedullaryplasmocytomas (33.3%). The overall response rate (ORR) was 95.5% in patients treated with Velcade and 60%in the patients without. The median survival times were 23 months in patients treated with Velcade and 12 months in patients without. The median time of progression-free survival (PFS) was nine months in patients treated with Velcade and five months in patients without. The one-year PFS and two-year PFS were 37% and 25%, 27% and 9% for patients treated with Velcade, or without, respectively. The three-year overall survival (OS) and five-year OS were 33% and 24%, 28% and 9% for patients treated with Velcade, or without, respectively. There was no significance in OS between the two groups (P = 0.335). But there was significant difference in PFS between the two groups (P = 0.036).\n\n\nCONCLUSIONS\nOur long-term study demonstrated that patients with lightchain myeloma appeared to have more aggressive disease courses and poor outcomes, which could be improved by treatment with Velcade.","cites":"0","conferencePercentile":"24.24623116"},{"venue":"World journal of surgical oncology","id":"9684b1f2f8c0d6b12587c649ffed988d6278a2aa","venue_1":"World journal of surgical oncology","year":"2013","title":"Prognostic analysis of esophageal cancer in elderly patients: metastatic lymph node ratio versus 2010 AJCC classification by lymph nodes","authors":"Ji-Feng Feng, Ying Huang, Lu Chen, Qiang Zhao","author_ids":"5315060, 1743853, 1745299, 4840309","abstract":"BACKGROUND\nRecent studies have proposed a new prognostic factor (metastatic lymph node ratio, or MLNR) for patients with esophageal cancer (EC). However, to the best of our knowledge, there have been no studies conducted to date regarding MLNR in elderly patients. The aim of this study was to determine the prognostic value of MLNR staging compared with the 2010 American Joint Committee on Cancer (AJCC) N staging in elderly patients with EC.\n\n\nMETHODS\nFrom January 2001 to December 2009, a retrospective analysis of 132 consecutive patients older than 70 years of age with esophageal squamous cell carcinoma (ESCC) was conducted. Prognostic factors for disease-specific survival were analyzed. Receiver operating characteristic curves were also plotted to verify the accuracy of MLNR staging and N staging for survival prediction.\n\n\nRESULTS\nThe disease-specific survival rates of N0, N1, N2 and N3 patients according to the AJCC Cancer Staging Manual Seventh Edition N staging were 65.5%, 42.9%, 22.2% and 0, respectively (N0 vs N1, P = 0.017; N1 vsN2, = 0.050; N2 vs N3, P < 0.001). The disease-specific survival rates of MLNR0, MLNR1, MLNR2 and MLNR3 patients were 65.5%, 45.0%, 21.1% and 0, respectively (MLNR0 vsMLNR1, P = 0.026; MLNR1 vs MLNR2, P = 0.033; MLNR2 vs MLNR3, P = 0.015). The areas under the curve were 0.731 for the 2010 AJCC N staging and 0.737 for the MLNR staging.\n\n\nCONCLUSION\nMLNR is an independent predictor of survival in elderly patients with ESCC. MLNR staging predicts survival after EC similarly to the 2010 AJCC N classifications and should be considered an alternative to current N staging.","cites":"3","conferencePercentile":"80.55555556"},{"venue":"World journal of surgical oncology","id":"10c2a22a96651517fb35cf8ade492dcb7b40ddc4","venue_1":"World journal of surgical oncology","year":"2015","title":"Body mass index is associated with higher Gleason score and biochemical recurrence risk following radical prostatectomy in Chinese men: a retrospective cohort study and meta-analysis","authors":"Pei-De Bai, Meng-Bo Hu, Hua Xu, Wen-Hui Zhu, Ji-Meng Hu, Tian Yang, Hao-Wen Jiang, Qiang Ding","author_ids":"8005482, 8367730, 1718800, 8480559, 8520603, 8168327, 7566740, 1786449","abstract":"BACKGROUND\nThe aim of the study is to investigate whether body mass index (BMI) affected pathological characteristics and biochemical recurrence (BCR) of prostate cancer after radical prostatectomy in Chinese men.\n\n\nMETHODS\nMedical records of 211 Chinese patients who underwent radical prostatectomy between 2006 and 2014 were retrospectively reviewed, with follow-up time of 24.5 ± 27.0 months. Multivariate logistic and Cox regression analyses were applied to address the impact of BMI on adverse pathological outcomes and BCR following prostatectomy. A meta-analysis of published studies from MEDLINE or EMBASE was conducted to determine the relationship between BMI and BCR following prostatectomy among Asian populations.\n\n\nRESULTS\nHigher BMI was positively correlated with higher biopsy Gleason score (odds ratios (OR) 1.163, 95 % confidence interval (CI) 1.023-1.322, P = 0.021) and pathological Gleason score (OR 1.220, 95 % CI 1.056-1.410, P = 0.007) in multivariate analysis. BCR was detected in 48 patients (22.7 %). Multivariate Cox proportional hazards analysis revealed that higher BMI (hazard ratio (HR) 1.145, 95 % CI 1.029-1.273, P = 0.013) and prostate-specific antigen (HR 1.659, 95 % CI 1.102-2.497, P = 0.015) levels were independent predictors of BCR. The meta-analysis enrolled eight Asian studies of 4145 patients treated by radical prostatectomy. Based on random-effects approach, a 5 kg/m(2) increase in BMI was correlated with 28 % higher risk of BCR (HR 1.22, 95 % CI 0.86-1.72) without statistical significance.\n\n\nCONCLUSIONS\nThe present study suggested that higher BMI was an independent risk factor for a higher Gleason score, as well as an independent predictor of BCR after radical prostatectomy in Chinese patients. Meta-analysis of Asian studies also indicated that obese patients, although without statistical significance, might be more likely to suffer from BCR.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"3f36376cd06ec0e9b929d0ff22e8432e0dd5b037","venue_1":"World journal of surgical oncology","year":"2013","title":"Palatine tonsillar metastasis of rectal adenocarcinoma: a case report and literature review","authors":"Hao Wang, Ping Chen","author_ids":"1728073, 1711641","abstract":"Cases of primary colorectal adenocarcinoma metastasized to the palatine tonsil are extremely rare. To the best of our knowledge, only 10 cases have thus far been previously documented in the English literature. A 37-year-old Chinese woman presented with a right palatine tonsil swelling and odynophagia 5 months after a surgical resection of rectal adenocarcinoma was performed. The patient underwent a tonsillectomy, and a metastatic poorly differentiated adenocarcinoma from a colorectal origin was revealed by immunohistochemical analysis. The manner in which tonsillar metastases are involved remains unknown and should be further studied. Here, we report a new case, briefly summarize these 10 cases and review the literature.","cites":"1","conferencePercentile":"43.62745098"},{"venue":"World journal of surgical oncology","id":"b3dd377306bc693d0ca7e38b8b7fa9994b0b5bbf","venue_1":"World journal of surgical oncology","year":"2015","title":"Retraction Note: Meta-analysis of the efficacy of pancreatoduodenectomy with extended lymphadenectomy in the treatment of pancreatic cancer","authors":"Xinbao Xu, Hui Zhang, Ping Zhou, Lei Chen","author_ids":"6011231, 1688592, 1703090, 1690673","abstract":"Retraction Note: Meta-analysis of the efficacy of pancreatoduodenectomy with extended lymphadenectomy in the treatment of pancreatic cancer The Publisher and Editor regretfully retract this article [1] because the peer-review process was inappropriately influenced and compromised. As a result, the scientific integrity of the article cannot be guaranteed. A systematic and detailed investigation suggests that a third party was involved in supplying fabricated details of potential peer reviewers for a large number of manuscripts submitted to different journals. In accordance with recommendations from COPE we have retracted all affected published articles, including this one. It was not possible to determine beyond doubt that the authors of this particular article were aware of any third party attempts to manipulate peer review of their manuscript.analysis of the efficacy of pancreatoduodenectomy with extended lymphadenectomy in the treatment of pancreatic cancer.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"da59ccad19026c59554dc8382147d15d6bd2983c","venue_1":"World journal of surgical oncology","year":"2007","title":"Mucin-hypersecreting bile duct neoplasm characterized by clinicopathological resemblance to intraductal papillary mucinous neoplasm (IPMN) of the pancreas","authors":"Yo-ichi Yamashita, Kengo Fukuzawa, Akinobu Taketomi, Shinichi Aishima, Tomoharu Yoshizumi, Hideaki Uchiyama, Eiji Tsujita, Norifumi Harimoto, Noboru Harada, Kenzo Wakasugi, Yoshihiko Maehara","author_ids":"7371896, 6563562, 5839769, 7701790, 5865027, 2025248, 5626248, 3545944, 4322111, 6039859, 3104046","abstract":"BACKGROUND\nAlthough intraductal papillary mucinous neoplasm (IPMN) of the pancreas is acceptable as a distinct disease entity, the concept of mucin-secreting biliary tumors has not been fully established.\n\n\nCASE PRESENTATION\nWe describe herein a case of mucin secreting biliary neoplasm. Imaging revealed a cystic lesion 2 cm in diameter at the left lateral segment of the liver. Duodenal endoscopy revealed mucin secretion through an enlarged papilla of Vater. On the cholangiogram, the cystic lesion communicated with bile duct, and large filling defects caused by mucin were observed in the dilated common bile duct. This lesion was diagnosed as a mucin-secreting bile duct tumor. Left and caudate lobectomy of the liver with extrahepatic bile duct resection and reconstruction was performed according to the possibility of the tumor's malignant behavior. Histological examination of the specimen revealed biliary cystic wall was covered by micropapillary neoplastic epithelium with mucin secretion lacking stromal invasion nor ovarian-like stroma. The patient has remained well with no evidence of recurrence for 38 months since her operation.\n\n\nCONCLUSION\nIt is only recently that the term \"intraductal papillary mucinous neoplasm (IPMN),\" which is accepted as a distinct disease entity of the pancreas, has begun to be used for mucin-secreting bile duct tumor. This case also seemed to be intraductal papillary neoplasm with prominent cystic dilatation of the bile duct.","cites":"2","conferencePercentile":"55.94405594"},{"venue":"World journal of surgical oncology","id":"7ab7140b1ed0b70d2c90cc6fb5f8971381e3a2ac","venue_1":"World journal of surgical oncology","year":"2016","title":"Thoracolumbar paravertebral giant ganglioneuroma and scoliosis: a case report and literature review","authors":"Yihao Yang, Mingyan Ren, Zhongqin Yuan, Kun Li, Zhiping Zhang, Jing Zhang, Lin Xie, Zuozhang Yang","author_ids":"5756919, 6520996, 4805323, 7137324, 3099110, 1685347, 1782466, 5799182","abstract":"Paravertebral ganglioneuroma and scoliosis is a rare clinical benign disease. The case we reported is about a 12-year-old girl who was hospitalized due to neoplasm with spinal deformity in the right abdomen for 1 month. Based on a careful preoperative evaluation and found no obvious surgery contraindications, the patient was treated with surgical resection of the tumor and correction of the deformity by surgery. Postoperative pathologic examination confirmed it was a ganglioneuroma. After the operation, the patient recovered well. Her spinal deformity was corrected, and she was 5 cm taller. Complete resection of ganglioneuroma following with a low recurrence rate and a good prognosis, patient does not need further chemotherapy, radiation therapy, or other treatments. All follow-up radiographic studies demonstrated no relapse of the tumor in the following 18 months. Combining this case with similar cases at home and aboard and reviewing related literature, we formed conclusions based on the manifestations, diagnosis, treatment, and prognosis of this disease and provided treatments for similar cases.","cites":"0","conferencePercentile":"47.2"},{"venue":"World journal of surgical oncology","id":"63d07359395ddc1b183345f8914ebff10d0222dc","venue_1":"World journal of surgical oncology","year":"2013","title":"Meta-analysis of the efficacy of pancreatoduodenectomy with extended lymphadenectomy in the treatment of pancreatic cancer","authors":"Xinbao Xu, Hui Zhang, Ping Zhou, Lei Chen","author_ids":"6011231, 1688592, 1703090, 1690673","abstract":"BACKGROUND\nThe purpose of this meta-analysis is to compare the efficacy of pancreatoduodenectomy (PD) with extended lymphadenectomy (PD/ELND) versus standard PD in the treatment of pancreatic cancer, with the hope of providing evidence for clinical practice.\n\n\nMETHODS\nThe retrieval of relevant literature published before September 2012 was carried out on PubMed, Medline, Embase, and Cochrane Central Register of Controlled Trials (CENTRAL) by computer. Information was extracted according to Cochrane systematic review methods, and analyzed using software Stata 11.0.\n\n\nRESULTS\nFive prospective randomized controlled trials (RCTs) were included in this meta-analysis of 555 cases (278 in the PD/ELND group and 277 in the standard PD group). The PD/ELND group showed a significantly lower 3-year survival rate (relative risk (RR) = 1.46, 95% confidence interval (CI) 1.03 to approximately 2.06, P = 0.034), prolonged operative time (weighted mean difference WMD = -1.03, 95% CI -1.96 to approximately -0.10, P = 0.029) and higher incidence of postoperative complications (RR = 0.56, 95% CI 0.42 to approximately 0.77, P = 0.000) by comparing with standard PD group. Besides, no significant difference was observed in the 1-year survival rate (RR = 0.87, 95% CI 0.60 to approximately 1.25, P = 0.69), 5-year survival rate (RR = 1.04, 95% CI 0.68 to approximately 1.58, P = 0.854), postoperative mortality (RR = 1.14, 95% CI 0.43 to approximately 3.00, P = 0.789), length of stay (WMD = -0.32, 95% CI -2.57 to approximately 1.94 , P = 0.784) and the amount of blood transfusions (WMD = -0.14, 95% CI -0.36 to approximately 0.08, P = 0.213).\n\n\nCONCLUSIONS\nPD/ELND does not have an advantage over standard PD in the survival rate for patients with pancreatic cancer, but does increase operative time and incidences of postoperative complications.","cites":"0","conferencePercentile":"15.03267974"},{"venue":"World journal of surgical oncology","id":"2721cae4cb974f5b2b6024f8e1fef9cb855832bf","venue_1":"World journal of surgical oncology","year":"2014","title":"Clinical evaluation of cetuximab combined with an S-1 and oxaliplatin regimen for Chinese patients with advanced gastric cancer","authors":"Zhan-Dong Zhang, Ye Kong, Wei Yang, Bin Zhang, Yong-Lei Zhang, Er-Min Ma, Hong-Xing Liu, Xiao-Bin Chen, Ya-Wei Hua","author_ids":"4858198, 7218829, 1742383, 1731735, 5051639, 3901179, 2372445, 4826538, 4442881","abstract":"BACKGROUND\nThe prognosis of patients with advanced gastric cancer is poor. The goal of this study was to evaluate the efficacy and safety of combination therapy of cetuximab and S-1 combined with oxaliplatin (SOX) in Chinese patients with advanced gastric cancer.\n\n\nMETHODS\nFor patients in the experimental group (cetuximab in combination with SOX (Ce-SOX), 30 patients), once-weekly cetuximab (400 mg/m2 at the first infusion then 250 mg/m2 every week) was administered. For patients in both the control (SOX alone, 26 patients) and experimental groups, oxaliplatin (100 mg/m2) was administered intravenously on day 1, while S-1 (80 mg/m2/day) was given orally twice daily for 14 days. The endpoints of this study included progression-free survival, response rate, and disease-control rate.\n\n\nRESULTS\nThere was no statistically significant difference in response rate between the Ce-SOX and SOX groups (54.8% versus 44%, P=0.225). The difference in disease-control rate was also statistically insignificant between the two groups (87.1% versus 76%, P=0.162). Median progression-free survival in the Ce-SOX group was significantly higher than that in the SOX group (12.8 versus 10.1 months, P=0.007). The median overall survival of the Ce-SOX group and SOX group was 14.0 and 12.2 months, respectively (P=0.043). The one-year survival rate for the Ce-SOX group was 57% compared to 40% in the SOX group. There was no statistical difference in the grade 3 or 4 adverse effects between the two groups.\n\n\nCONCLUSIONS\nThese findings suggest that the cetuximab combined with SOX regimen is feasible and shows promising efficacy with tolerable adverse effects in Chinese patients with advanced gastric cancer.","cites":"0","conferencePercentile":"24.24623116"},{"venue":"World journal of surgical oncology","id":"392ef36193230630d820df12686dcc430edb95cc","venue_1":"World journal of surgical oncology","year":"2012","title":"u-PA inhibitor amiloride suppresses peritoneal metastasis in gastric cancer","authors":"Youcheng Ding, Hui Zhang, Zhuqing Zhou, Mingan Zhong, Qiliang Chen, Xujing Wang, Zhenggang Zhu","author_ids":"5200488, 1688592, 8526031, 3853311, 8560087, 5879731, 5595744","abstract":"BACKGROUND\nPeritoneal metastasis in gastric cancer represents a ubiquitous human health problem but effective therapies with limited side effects are still lacking. Although previous research suggested that u-PA was involved in some tumor metastasis such as lung-specific metastasis, the role of u-PA for peritoneal metastasis in gastric cancer is still unclear. The aim of this study was to explore whether selective pharmacological blockade of u-PA is able to affect the peritoneal metastasis of gastric cancer both in vivo and in vitro.\n\n\nMETHODS\nIn the present study, we evaluated the effects and explored the anti-tumor mechanisms of amiloride, a selective u-PA inhibitor, on a panel of gastric cancer cell lines and in a murine model of human gastric cancer MKN45.\n\n\nRESULTS\nThe study showed that amiloride significantly inhibited the tumor growth and prolonged the survival of the tumor-bearing mice. In vitro, compared with controls, amiloride could not only significantly down-regulate the mRNA expression and protein level of u-PA from MKN45 cells with dose dependence but also inhibit the adhesion of HMrSV5 cells, migration and invasion of MKN45 cells.\n\n\nCONCLUSIONS\nThe findings in our current report provide evidence that selective u-PA inhibitor amiloride has potent effects against peritoneal metastasis in gastric cancer, suggesting its possible therapeutic value for the treatment of gastric cancer.","cites":"2","conferencePercentile":"62.54480287"},{"venue":"World journal of surgical oncology","id":"f00ae7328e489c9c492916be5eb8f797e0f53639","venue_1":"World journal of surgical oncology","year":"2013","title":"Preventive effect of ulinastatin on postoperative complications, immunosuppression, and recurrence in esophagectomy patients","authors":"Lingmin Zhang, Ning Wang, Suna Zhou, Wenguang Ye, Qinglin Yao, Guixia Jing, Mingxin Zhang","author_ids":"5373774, 1692369, 4199435, 6141443, 6046105, 2499265, 2469479","abstract":"BACKGROUND\nTo evaluate the potential efficacy of preventive effect of ulinastatin in esophagectomy patients.\n\n\nMETHODS\nEighty patients with esophageal cancer were preoperatively allocated at random into two equal groups. Ulinastatin was administered to the treatment group (U) whereas the control group (C) received a placebo. The arterial oxygen tension and carbon dioxide tension were measured and the respiratory index (RI) was calculated. Plasma levels of circulating T lymphocyte subsets and interleukin 6 (IL-6) were measured and clinical courses of patients in the two groups were compared.\n\n\nRESULTS\nRI in the U group was significantly lower than that in the C group. The rate of postoperative complications and the duration of ICU stay were significantly lower in the U group. Ulinastatin significantly increased the rate of CD3+ and CD4+ cells, and ratio of CD4+/CD8+, but decreased the rate of CD8+ cells and release of IL-6 compared to the C group on postoperative days 1 and 3. Patients within the C group showed worse recurrence free survival. Multivariate analysis revealed that ulinastatin administration significantly decreased the incidence of recurrence.\n\n\nCONCLUSIONS\nUlinastatin had a preventive effect on postoperative complications and immunosuppression in esophagectomy patients, thereby prolongingrecurrence free survival.","cites":"0","conferencePercentile":"15.03267974"},{"venue":"World journal of surgical oncology","id":"f831ef74fa9c93bc4e7815f53c3b0793fc20c0d3","venue_1":"World journal of surgical oncology","year":"2012","title":"Primary synovial sarcoma of the parapharyngeal space: a clinicopathologic study of five cases","authors":"Ming Zhu, Jun Li, Ke-Jing Wang, Jin-Biao Shang","author_ids":"4398422, 1681426, 7200378, 4914941","abstract":"We report five cases of primary synovial sarcomas arising in the parapharyngeal space. The patients were all men with a median age of 35 years (range 22 to 41 years). The tumors were non-encapsulated solid masses ranging from 2.0 to 6.6 cm in size. Histologically, three cases were biphasic subtype, and the other two cases were monophasic subtype. Immunohistochemically, the tumor cells were strongly positive for bcl-2 and CD99, partly positive for CK and EMA, and negative for CD117, CD34, SMA and desmin in all five cases. S-100 protein was detected in one case. The presence of an SYT-SSX1 and/or SYT-SSX2 gene fusion resulting from t(X;18) was demonstrated from paraffin blocks by reverse transcriptase polymerase chain reaction in five cases. All five patients received tumor radical excision and postoperative radiotherapy, and two patients with pulmonary metastasis received additional chemotherapy. Follow-up data revealed that two patients with tumor size <5 cm were alive without disease for 54 and 57 months, one patient with tumor size <5 cm was alive with pulmonary metastasis for 78 months, and two patients with tumor size >5 cm died of disease 26 and 37 months after the diagnosis, respectively. Primary parapharyngeal synovial sarcoma is a rare variant that occurs more frequently in males than females. Accurate diagnosis depends on morphologic and immunohistochemical examination and proper molecular analysis. The prognosis is relatively good in those patients whose tumor size is less than 5 cm.","cites":"1","conferencePercentile":"42.65232975"},{"venue":"World journal of surgical oncology","id":"16ad8540f444a3279bdc702c35d20e00b816a414","venue_1":"World journal of surgical oncology","year":"2012","title":"Peritumoral lymphangiogenesis induced by vascular endothelial growth factor C and D promotes lymph node metastasis in breast cancer patients","authors":"Ying-Chun Zhao, Xiao-Jian Ni, Yong Li, Min Dai, Zhong-Xu Yuan, Yong-Yun Zhu, Chuan-Yu Luo","author_ids":"5596401, 5829186, 1689181, 1791378, 4621296, 6715977, 5731780","abstract":"BACKGROUND\nMounting clinical and experimental data suggest that the migration of tumor cells into lymph nodes is greatly facilitated by lymphangiogenesis. Vascular endothelial growth factor (VEGF)-C and D have been identified as lymphangiogenic growth factors and play an important role in tumor lymphangiogenesis. The purpose of this study was to investigate the location of lymphangiogenesis driven by tumor-derived VEGF-C/D in breast cancer, and to determine the role of intratumoral and peritumoral lymphatic vessel density (LVD) in lymphangiogenesis in breast cancer.\n\n\nMETHODS\nThe expression levels of VEGF-C/D were determined by immunohistochemistry, and intratumoral LVD and peritumoral LVD were assessed using immunohistochemistry and the D2-40 antibody in 73 patients with primary breast cancer. The associations of intratumoral LVD and peritumoral LVD with VEGF-C/D expression, clinicopathological features and prognosis were assessed.\n\n\nRESULTS\nVEGF-C and D expression were significantly higher in breast cancer than benign disease (P < 0.01). VEGF-C (P < 0.001) and VEGF-D (P = 0.005) expression were significantly associated with peritumoral LVD, but not intratumoral LVD. Intratumoral LVD was associated with tumor size (P = 0.01). Peritumoral LVD was significantly associated with lymph node metastasis (LNM; P = 0.005), lymphatic vessel invasion (LVI; P = 0.017) and late tumor,node, metastasis (TNM) stage (P = 0.011). Moreover, peritumoral LVD was an independent risk factor for axillary lymph node metastasis, overall survival and disease-free survival in multivariate analysis.\n\n\nCONCLUSIONS\nThis study suggests that tumor-derived VEGF-C/D induce peritumoral lymphangiogenesis, which may be one mechanism that leads to lymphatic invasion and metastatic spread. Peritumoral LVD has potential as an independent prognostic factor in breast cancer patients.","cites":"6","conferencePercentile":"93.18996416"},{"venue":"World journal of surgical oncology","id":"9aae635f13e587fa5cc285a507efdb5ba92a111f","venue_1":"World journal of surgical oncology","year":"2012","title":"Malignant epithelioid angiomyolipoma of the kidney with pulmonary metastases and p53 gene mutation","authors":"Jun Li, Ming Zhu, Yan-Li Wang","author_ids":"1681426, 4398422, 7709478","abstract":"Angiomyolipoma (AML) is a rare tumor mainly arising in the kidney. Here we report the case of a 55-year-old woman with malignant epithelioid angiomyolipoma with p53 gene mutation. After 7 years from radical nephrectomy of the left kidney, the patient developed multiple lung metastases that showed morphologic features overlapping those of the previously lesion, which was misdiagnosed as renal cell carcinoma. Both renal and pulmonary tumors were reevaluated by immunohistochemical assay, which were showed positive for HMB-45 and p53 protein (95%), but negative for epithelial markers and S-100 protein. A correct diagnosis of malignant epithelioid angiomyolipoma was made on the basis of those results. Meanwhile exon 8 mutation of p53 gene was detected in the renal tumor by microdissection-PCR-SSCP and sequencing technique indicating that p53 gene mutation may play an important role in malignant transformation. The patient was died of respiratory failure after 15 years' follow-up. This is the second report of renal malignant angiomyolipoma with p53 gene mutation.","cites":"9","conferencePercentile":"97.6702509"},{"venue":"World journal of surgical oncology","id":"b6de6f2de590d3a5594fce5defd27c73b4f5e6e4","venue_1":"World journal of surgical oncology","year":"2015","title":"Laparoscopic surgery contributes more to nutritional and immunologic recovery than fast-track care in colorectal cancer","authors":"Dong Xu, Jun Li, Yongmao Song, Jiaojiao Zhou, Fangfang Sun, Jianwei Wang, Yin Duan, Yeting Hu, Yue Liu, Xiaochen Wang, Lifeng Sun, Linshan Wu, Kefeng Ding","author_ids":"1714390, 1681426, 4586485, 3676515, 7448098, 1993470, 7418968, 7741782, 1694101, 8417304, 8223346, 6257859, 6203242","abstract":"BACKGROUND\nMany clinical trials had repeatedly shown that fast-track perioperative care and laparoscopic surgery are both preferred in the treatment of colorectal cancer. But few studies were designed to explore the diverse biochemical impacts of the two counterparts on human immunologic and nutritional status.\n\n\nMETHODS\nNinety-two cases of colorectal cancer patients meeting the inclusion criteria were randomized to four groups: laparoscopy with fast-track treatment (LAFT); open surgery with fast-track treatment (OSFT); laparoscopy with conventional treatment (LAC); open surgery with conventional treatment (OSC). Peripheral blood tests including nutritional factors (albumin, prealbumin, and transferrin), humoral immunologic factors (IgG, IgM, and IgA), and cellular immunologic factors (T and NK cells) were evaluated. Blood samples were collected preoperatively (baseline) and 12 and 96 h after surgery (indicated as POH12 and POH96, respectively).\n\n\nRESULTS\nAlbumin, transferrin, prealbumin, and IgG levels were the highest in the LAFT group for both POH12 and POH96 time intervals. Repeated measures (two-way ANOVA) indicated that the difference of albumin, transferrin, and IgG level were attributed to surgery type (P < 0.05) and not perioperative treatment (P > 0.05). Only in the laparoscopy-included groups, the relative albumin and IgG levels of POH96 were obviously higher than that of POH12.\n\n\nCONCLUSION\nLaparoscopic surgery accelerated postoperative nutrition and immune levels rising again while fast-track treatment retarded the drop of postoperative nutrition and immune levels. Laparoscopic surgery might play a more important role than fast-track treatment in the earlier postoperative recovery of nutritional and immunologic status. Combined laparoscopic surgery with fast-track treatment provided best postoperative recovery of nutrition and immune status. These results should be further compared with the clinical outcomes of our FTMDT trial (clinicaltrials.gov: NCT01080547).","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"01fd372fe2de0369f0dff678896670ad25ef41c1","venue_1":"World journal of surgical oncology","year":"2015","title":"Primary pancreatic paraganglioma: a case report and literature review","authors":"Shengrong Lin, Long Peng, Song Huang, Yong Li, Weidong Xiao","author_ids":"2338156, 7795609, 7650053, 1689181, 2679438","abstract":"BACKGROUD\nPrimary pancreatic paraganglioma is an extremely rare extra-adrenal paraganglioma.\n\n\nCASE PRESENTATION\nWe report a case of primary pancreatic paraganglioma undergoing middle segment pancreatectomy in a 42-year-old woman. Histological examination showed that the tumor was composed of well-defined nests of cuboidal cells separated by vascular fibrous septa, forming the classic Zellballen pattern. The chief cells showed positive staining to neuron-specific enolase, chromogranin A, synaptophysin, and the chief cells were surrounded by S-100 protein-positive sustentacular cells. The patient has remained tumor free for 12 months after surgery. A brief discussion about the histopathological features, clinical behavior, and treatment of primary pancreatic paraganglioma, and review of the relevant literature is presented.\n\n\nCONCLUSIONS\nPrimary pancreatic paraganglioma is a rare clinical entity, its diagnosis mainly depends on histopathological and immunohistochemical examinations. Complete surgical resection is the first choice of treatment and close postoperative follow-up is necessnary.","cites":"2","conferencePercentile":"92.47910864"},{"venue":"World journal of surgical oncology","id":"cae0dfdef6c4cf28fb27ec72072ec73d58fdba2a","venue_1":"World journal of surgical oncology","year":"2013","title":"S100A7 enhances invasion of human breast cancer MDA-MB-468 cells through activation of nuclear factor-κB signaling","authors":"Huamin Liu, Lei Wang, Xingang Wang, Zhiwei Cao, Qifeng Yang, Kejun Zhang","author_ids":"2040260, 1743559, 1998150, 8687865, 1713553, 1710905","abstract":"BACKGROUND\nS100A7 signaling plays a critical role in the pathogenesis and progression of human breast cancers but the precise role and mechanism of S100A7 for tumor invasion remains unclear. in the present study, we investigated whether S100A7 overexpression could be mechanistically associated with the up-regulation of NF-κB, VEGF and MMP-9, resulting in the promotion of breast cancer cell invasion and growth, and vice versa.\n\n\nMETHODS\npcDNA3.1-S100A7 cDNA plasmid was constructed and transfected into the MDA-MB-468 cells. 4,5-dimethythiazol-2-yl)-2,5-diphenyl tetrazolium bromide (MTT) assay was used to detect cell proliferation, Matrigel was used to detect cell mobility and invasion in vitro.The MMP-9 and VEGF expression and levels was detected by western blot and ELISA assay. NF-κB DNA binding activity was detected by Electrophoretic mobility shift assay.\n\n\nRESULTS\nUp-regulation of S100A7 by stable S100A7 cDNA transfection increased cell invasion and proliferation, whereas downregulation of S100A7 by small interfering RNA in S100A7 cDNA-transfected MDA-MB-468 cells decreased cell invasion and proliferation. Consistent with these results, we found that the up-regulation of S100A7 increased NF-κB DNA-binding activity and MMP-9 and VEGF expression. Down-regulation of S100A7 in S100A7 cDNA -transfected decreased NF-κB DNA-binding activity and MMP-9 and VEGF expression.\n\n\nCONCLUSIONS\nOur data demonstrate that the S100A7 gene controls the proliferation and invasive potential of human MDA-MB-468 cells through regulation of NF-κB activity and its target genes, such as MMP-9 and VEGF expression. Down-regulation of S100A7 could be an effective approach for the down-regulation and inactivation of NF-κB and its target genes, such as MMP-9 and VEGF expression, resulting in the inhibition of invasion and growth.","cites":"2","conferencePercentile":"66.0130719"},{"venue":"World journal of surgical oncology","id":"f67f2506ce751a439f61be93c1b698d18f5206c7","venue_1":"World journal of surgical oncology","year":"2016","title":"Neoadjuvant imatinib treatment and laparoscopic anus-preserving surgery for a large gastrointestinal stromal tumor of the rectum","authors":"Kennoki Kyo, Masaki Azuma, Kazuya Okamoto, Motohiro Nishiyama, Takahiro Shimamura, Atsushi Maema, Hitoshi Kanamaru, Motoaki Shirakawa, Toshio Nakamura, Kazuya Shinmura, Kenji Koda, Hidetaro Yokoyama","author_ids":"4268916, 2275889, 8041938, 6226119, 5135018, 6849974, 4795038, 7003953, 7759244, 5817041, 5032614, 4557548","abstract":"BACKGROUND\nResection of a gastrointestinal stromal tumor (GIST) of the rectum can be difficult because of the particular location in the pelvis, and a large rectal GIST often requires abdominoperineal resection. Recent reports demonstrate that neoadjuvant imatinib treatment improves surgical outcomes in patients with a rectal GIST, and there are only a few reports of the effectiveness of laparoscopic surgery for a rectal GIST.\n\n\nCASE PRESENTATION\nA 46-year-old man was found to have a rectal GIST that measured 80 mm and was located on the anterior wall of the lower rectum. After 6 months treatment with imatinib, the tumor decreased in size to 37 mm, and laparoscopic low anterior resection was performed. The patient is currently alive without any evidence of recurrence 37 months after surgery.\n\n\nCONCLUSIONS\nNeoadjuvant imatinib should be a treatment of choice for a large rectal GIST. When marked tumor shrinkage is achieved, laparoscopic surgery may be the preferred procedure.","cites":"0","conferencePercentile":"47.2"},{"venue":"World journal of surgical oncology","id":"ecc7b948eee7856a01ba6d8ce9d8709c966e2c8a","venue_1":"World journal of surgical oncology","year":"2015","title":"Overexpression of G6PD is associated with high risks of recurrent metastasis and poor progression-free survival in primary breast carcinoma","authors":"Haihong Pu, Qingyuan Zhang, Chunbo Zhao, Lei Shi, Yan Wang, Jingxuan Wang, Minghui Zhang","author_ids":"5400743, 1758780, 2711335, 4608232, 1678691, 5938760, 7979438","abstract":"BACKGROUND\nThe present study aimed to investigate the expression of CYP27A1, CYP7B1, insulin-like growth factor-1 (IGF-1), glucose-6-phosphate-dehydrogenase (G6PD), glutathione S-transferase P1 (GSTP1), and pyruvate kinase isoform M2 (PKM2) in breast carcinoma tissue and evaluate their prognostic value for progression-free survival (PFS) and overall survival (OS).\n\n\nMETHODS\nA total of 20 patients treated with surgery for primary breast carcinoma were enrolled: 10 cases diagnosed with recurrent metastasis (A), along with their corresponding metastases specimen (AM) and 10 cases with no evidence of recurrence or metastasis (B). Baseline characteristics of patients including age, lymph node metastasis, molecular subtypes, tumor staging and size, and pathological classification were all collected. Immunohistochemistry was performed to detect the protein expression in tumor specimens.\n\n\nRESULTS\nElevated G6PD protein levels were noted in group A compared with group AM and B (both P < 0.05), and PKM2 expression was also higher in group A when compared to group AM (P = 0.019), but similar with group B (P > 0.05). No association between clinicopathological parameters and the two proteins expression was observed. The G6PD protein expression was strongly associated with PFS of breast carcinoma patients (P = 0.021) but not for OS. According to the Kaplan-Meier analysis, mean PFS time of patients with G6PD-negative and G6PD-positive expression tumor were 71.36 ± 6.53 and 32.25 ± 5.67 months, respectively (P = 0.002).\n\n\nCONCLUSIONS\nThe G6PD protein could be served as a potential prognostic biomarker for primary breast carcinoma, and overexpression of G6PD protein predicted a high risk of recurrent metastasis and poor PFS during follow-up.","cites":"1","conferencePercentile":"78.2729805"},{"venue":"World journal of surgical oncology","id":"29460a753c34f73c66f6c75c5d179cbca932e52a","venue_1":"World journal of surgical oncology","year":"2012","title":"Tumor-derived hepatocyte growth factor is associated with poor prognosis of patients with glioma and influences the chemosensitivity of glioma cell line to cisplatin in vitro","authors":"You-feng Guo, Xiao-bing Wang, Xiao-ying Tian, Yang Li, Bin Li, Quan Huang, Meng Zhang, Zhi Li","author_ids":"8280554, 8416212, 3503712, 1678662, 7480452, 2365173, 1726578, 1791685","abstract":"BACKGROUND\nWe examined the association of tumor-derived hepatocyte growth factor (HGF) with the clinicopathological features of gliomas and investigated the effect of HGF inhibition on the biological behavior of tumor cells in vitro in order to determine whether HGF is a valuable prognostic predictor for glioma patients.\n\n\nMETHODS\nSeventy-six cases of glioma were collected. The tumor-derived HGF expression, cell proliferation index (PI) and intratumoral microvessels were evaluated by immunohistochemistry. Correlation between immunostaining and clinicopathological parameters, as well as the follow-up data of patients, was analyzed statistically. U87MG glioma cells were transfected with short interference (si)-RNA for HGF, and the cell viability, migratory ability and chemosensitivity to cisplatin were evaluated in vitro.\n\n\nRESULTS\nBoth high HGF expression in tumor cells (59.2%, 45/76) and high PI were significantly associated with high-grade glioma and increased microvessels in tumors (P < 0.05). However, only histological grading (P = 0.004) and high-expression of HGF (P = 0.008) emerged as independent prognostic factors for the overall survival of glioma patients. The tumor-derived HGF mRNA and protein expressions were significantly decreased in vitro after transfection of HGF siRNA. HGF siRNA inhibited the cell growth and reduced cell migratory ability. Moreover, HGF siRNA transfection enhanced the chemosensitivity of U87MG glioma cells to cisplatin.\n\n\nCONCLUSION\nThis study indicated that there was significant correlation among tumor cell-derived HGF, cell proliferation and microvessel proliferation in gliomas. HGF might influence tumor progression by modulating the cell growth, migration and chemoresistance to drugs. Increased expression of HGF may be a valuable predictor for prognostic evaluation of glioma patients.","cites":"1","conferencePercentile":"42.65232975"},{"venue":"World journal of surgical oncology","id":"1fb8df9634c986b1fe9239e4dddd55d8f3f958d8","venue_1":"World journal of surgical oncology","year":"2014","title":"DJ-1 is activated in medulloblastoma and is associated with cell proliferation and differentiation","authors":"Jia-ping Lin, Bin-cai Pan, Bin Li, Yang Li, Xiao-ying Tian, Zhi Li","author_ids":"8188402, 5454585, 7480452, 1678662, 3503712, 1791685","abstract":"BACKGROUND\nDJ-1 is a key regulator in human tumorigenesis, including brain malignancies. The mechanisms by which DJ-1 contributes to the pathogenesis of medulloblastoma (MB) remain unclear, and its impact on the prognosis for patients with MB has not been identified. The aim of this study was to determine whether the DJ-1 protein is associated with tumorigenesis of MBs, and whether DJ-1 is a valuable factor for predicting the prognosis of patients with MB.\n\n\nMETHODS\nWe collected 66 pairs of MB and adjacent normal cerebellum samples. Expression of DJ-1, Ser 473-phosphorylated-Akt (p-Akt), PTEN, and Ki-67 (MIB-1) was detected by immunohistochemical staining, and the correlation of these immunostaining results with the clinicopathological features of patients with MB was determined.\n\n\nRESULTS\nHigh DJ-1 expression (48.5%, 32/66) in tumor cells of MBs was significantly associated with the classic MB variant (P = 0.003), high proliferative activity (P = 0.002) and undifferentiated tumor (P = 0.001), whereas high p-Akt expression (56.1%, 37/66) was associated with tumor metastasis stage (P = 0.007), undifferentiated tumor (P = 0.007), and high-risk tumor (P = 0.002). High DJ-1 expression also correlated with high p-Akt expression and high MIB-1 index. However, only high levels of DJ-1(P = 0.009) and high MIB-1 index (P = 0.001) were strong independent prognostic factors associated with worse overall survival.\n\n\nCONCLUSIONS\nAlthough the validity of the preliminary data in this study needs to be confirmed by a larger number of cases, our study indicates that DJ-1, PTEN, and p-Akt might play important roles in cell proliferation and differentiation of MBs. The evaluation of expression of DJ-1 and related proteins might be useful for predicting the prognosis of patients with MB.","cites":"1","conferencePercentile":"62.68844221"},{"venue":"World journal of surgical oncology","id":"5cf328e5e8b97f54ca5af1d6b68dc69798c2c165","venue_1":"World journal of surgical oncology","year":"2015","title":"Giant cell tumor of axial vertebra: surgical experience of five cases and a review of the literature","authors":"Guojing Chen, Jing Li, Xiangdong Li, Hongbin Fan, Zheng Guo, Zhen Wang","author_ids":"6770885, 1742253, 3520755, 8415807, 1695562, 1692748","abstract":"BACKGROUND\nDue to the complex anatomy of the upper cervical spinal column region and the variable aggressiveness of giant cell tumors (GCTs), there exists no standard treatment for GCTs of axial vertebra. To the best of our knowledge, there are only a few case reports in the literature and no large sum numbers of clinical trials about the treatment of, or research into, axial vertebra GCTs.\n\n\nMETHODS\nBetween 2009 and 2013, five patients pathologically diagnosed with axial vertebra GCTs were treated at our hospital. We performed intralesional excision and odontoid process reconstructive surgery to preserve the odontoid process, followed with adjuvant radiation therapy after surgery.\n\n\nRESULTS\nFor those with an intact bone shell, part of the β-TCP (beta tricalcium phosphate) artificial bone could be seen clearly after surgery and became blurred three months after surgery, as seen on a radiograph. One year later, the part of β-TCP artificial bone was fused as a block. Subsequently, autogenous bone regenerated successfully and artificial bone degraded thoroughly. For those with a defective cortical bone, partial fusion of the odontoid process, autograft ilium and third vertebra body could be seen three months after surgery, and complete fusion was seen nine months later. The odontoid process was preserved successfully, and the upper cervical spine was reconstructed effectively, without implant failure or infection.\n\n\nCONCLUSIONS\nIn this study, the odontoid process and function of upper cervical vertebra was preserved successfully through lesion curettage, combined with reconstruction with bone grafting, and adjuvant radiation therapy after surgery. During the follow-up periods, no recurrence or complications was observed.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"a1516b3f8f3e115117d79d55a5a082b4006f0ebc","venue_1":"World journal of surgical oncology","year":"2013","title":"Double-positive expression of high-mobility group box 1 and vascular endothelial growth factor C indicates a poorer prognosis in gastric cancer patients","authors":"Weiling He, Bing Tang, Dongjie Yang, Yuhuang Li, Wu Song, Tuckyun Cheang, Xinlin Chen, Yin Li, Lianzhou Chen, Wenhua Zhan, Wen Li, Yulong He","author_ids":"4648168, 7577945, 7396496, 5110071, 8209263, 4385173, 4263642, 1738814, 3562712, 7566970, 1807382, 7737470","abstract":"BACKGROUND\nAlthough many studies have indicated that high-mobility group box 1 protein (HMGB1) is associated with oncogenesis and a worse prognosis, the prognostic value of HMGB1 in gastric cancer (GC) remains unclear. In the present work, we aimed to evaluate the role of HMGB1 in GC and examined whether aberrant expression of both HMGB1 and vascular endothelial growth factor C (VEGF-C) increased the malignant potential of GC.\n\n\nMETHODS\nA total of 166 GC patients and 32 normal subjects were enrolled. HMGB1 and VEGF-C expression was detected by tissue microarrays (TMAs) and immunohistochemical staining. The correlation between HMGB1 and VEGF-C expression and their relationships with clinicopathological GC variables were examined. Univariate and multivariate analyses were performed using the Cox proportional hazard model to predict the factors related to the patients' overall survival rates.\n\n\nRESULTS\nHMGB1 and VEGF-C expression were observed in 81 (48.80%) and 88 (53.01%) tumors, respectively, significantly higher than the rates among the corresponding controls. In addition, HMGB1 and VEGF-C expression were positively correlated (R2 = 0.972). HMGB1 expression was also closely associated with tumor size, pT stage, nodal status, metastasis status, TNM stage, and poor prognosis. Multivariate survival analysis indicated that patients with HMGB1 and VEGF-C coexpression had the worst prognoses and survival rates (hazard ratio, 2.78; log rank P<0.001).\n\n\nCONCLUSIONS\nHMGB1 is commonly expressed in GC. Combined evaluation of HMGB1 and VEGF-C may serve as a valuable independent prognostic factor for GC patients.","cites":"4","conferencePercentile":"89.21568627"},{"venue":"World journal of surgical oncology","id":"e1ec5ab1aa3a78cff3546edba1833acb80a46c16","venue_1":"World journal of surgical oncology","year":"2012","title":"Novel cancerization marker, TP53, and its role in distinguishing normal tissue adjacent to cancerous tissue from normal tissue adjacent to benign tissue","authors":"Guo-Yan Liu, Kun-Hong Liu, Yin Li, Chao Pan, Ji-Qin Su, Hong-Feng Liao, Ren-Xiang Yv, Zhao-Hui Li, Li Yuan, Huan-Jing Zhang, Chi-Meng Tzeng, Bing Xiong","author_ids":"1847001, 3300756, 1738814, , 8606262, 8532170, 8241185, 7719446, 2391614, 3490265, 2219076, 8661579","abstract":"BACKGROUND\nThe histopathological and molecular heterogeneity of normal tissue adjacent to cancerous tissue (NTAC) and normal tissue adjacent to benign tissue (NTAB), and the availability of limited specimens make deciphering the mechanisms of carcinogenesis challenging. Our goal was to identify histogenetic biomarkers that could be reliably used to define a transforming fingerprint using RNA in situ hybridization.\n\n\nMETHODS\nWe evaluated 15 tumor-related RNA in situ hybridization biomarkers using tumor microarray and samples of seven tumor-adjacent normal tissues from 314 patients. Biomarkers were determined using comprehensive statistical methods (significance of support vector machine-based artificial intelligence and area under curve scoring of classification distribution).\n\n\nRESULTS\nTP53 was found to be a most reliable index (P <10(-7); area under curve >87%) for distinguishing NTAC from NTAB, according to the results of a significance panel (BCL10, BECN1, BRCA2, FITH, PTCH11 and TP53).\n\n\nCONCLUSIONS\nThe genetic alterations in TP53 between NTAC and NTAB may provide new insight into the field of cancerization and tumor transformation.","cites":"0","conferencePercentile":"15.94982079"},{"venue":"World journal of surgical oncology","id":"dad6b7e4f0b46fe2249505e6716fbc9bfbebc851","venue_1":"World journal of surgical oncology","year":"2015","title":"Clinical and oncological outcomes in Chinese patients with renal cell carcinoma and venous tumor thrombus extension: single-center experience","authors":"Xiaonan Chen, Shijie Li, Zhenqun Xu, Kefeng Wang, Donghui Fu, Qiang Liu, Xia Wang, Bin Wu","author_ids":"8082326, 8087190, 7814623, 7200881, 7338390, 1726270, 3517895, 6023931","abstract":"BACKGROUND\nTo evaluate the clinical and oncological outcomes and to identify prognostic factors for survival in Chinese patients with renal cell carcinoma (RCC) and venous tumor thrombus (VTT).\n\n\nMETHODS\nA total of 86 patients who underwent nephrectomy and tumor thrombectomy for RCC and venous tumor thrombus extension from 2003 to 2013 were included in this retrospective study. The records of these patients were reviewed. Kaplan-Meier analysis was used to determine cancer-specific survival (CSS). Prognostic factors for CSS were identified by univariate and multivariate analyses using the Cox proportional hazards regression mode.\n\n\nRESULTS\nAll patients in this cohort received radical nephrectomy and tumor thrombectomy. Median follow-up period was 27.0 months (range 3-111). No patients died intraoperatively, and the complication rate was 36.0%. The 1-, 3-, and 5-year CSS rates for all patients were 93.0%, 70.9%, and 58.1%, respectively, and those for patients without distant metastasis at presentation were 95.3%, 82.6%, and 68.6%, respectively. Multivariate Cox regression analysis showed that lymph node invasion, distant metastasis at presentation, and invasion of the inferior vena cava (IVC) wall were the independent prognostic factors for CSS in all patients. For patients without distant metastasis, tumor grade, lymph node invasion, and perinephric fat invasion were significantly associated with CSS on multivariate analysis.\n\n\nCONCLUSIONS\nSurvival rates for patients with RCC and VTT were still poor. Our results indicated that lymph node invasion, distant metastasis at presentation, and invasion of the IVC wall were independent negative prognostic factors.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"876c5d7f66a3bd6b74afa1b4ea394203fda55a19","venue_1":"World journal of surgical oncology","year":"2016","title":"Clinicopathologic analysis of lymph node status in superficial esophageal squamous carcinoma","authors":"Yue Zhou, Junjie Du, Hai Li, Jinhua Luo, Liang Chen, Wei Wang","author_ids":"2333571, 3611446, 4611779, 8277746, 1692551, 1706612","abstract":"BACKGROUND\nEndoscopic approaches are gradually considered as a reliable treatment of intramucosal esophageal squamous carcinoma. However, endoscopic resection (ER) is limited by the potential lymph node metastasis (LNM) at various depths of mucosal and submucosal invasion.\n\n\nMETHODS\nWe conducted a retrospective review of 498 patients with pT1 superficial esophageal squamous carcinoma (SESC) who underwent surgical resection from January 2008 to August 2015. Pathological characteristics of tumors including location, size, appearance, differentiation, invasion depth, and nodal status were reviewed, and risk factors were analyzed.\n\n\nRESULTS\nLNM was found in 0.0, 2.7, 6.3, 18.2, 15.9, and 34.3 % of the m1, m2, m3, sm1, sm2, and sm3 lesions, respectively. Univariate logistic regression identified the presence of the tumor size > 2 cm (p < 0.05), the presence of the poor tumor differentiation (p < 0.05), and the depth of tumor invasion (p < 0.05) and angiolymphatic invasion (p < 0.05) to be the important risk factors associated with the prevalence of tumor-positive lymph nodes. These findings were confirmed in multivariate logistic regression as independent predictors for LNM.\n\n\nCONCLUSIONS\nER is considered as a reliable treatment of m1 to m2 lesions. Radical surgical resection (SR) is the standard and irreplaceable therapy of sm1 to sm3 lesions. Patients with m3 lesions should undergo ER as the initial procedure for diagnosis. And this treatment is supported only by a successful description of the tumor's characteristics, including (1) only muscularis mucosa invasion and without invasion of the resection margins and (2) without any risk predictors for LNM. Otherwise, SR is recommended.","cites":"0","conferencePercentile":"47.2"},{"venue":"World journal of surgical oncology","id":"cecfa4b7ebc0db0737cc54e62bc961cc1636a2bf","venue_1":"World journal of surgical oncology","year":"2015","title":"Predictive value of pre-transplant platelet to lymphocyte ratio for hepatocellular carcinoma recurrence after liver transplantation","authors":"Weiliang Xia, Qinghong Ke, Ye Wang, Weilin Wang, Min Zhang, Yan Shen, Jian Wu, Xiao Xu, Shusen Zheng","author_ids":"8013301, 4991572, 1681196, 3137005, 1770849, 2044879, 1734550, 1993318, 7149791","abstract":"BACKGROUND\nPlatelet to lymphocyte ratio (PLR) is a prognostic factor for various tumors, but the current opinion on the prognostic value of PLR in liver transplantation (LT) for hepatocellular carcinoma (HCC) is still controversial. The aim of this study was to investigate the value of pre-transplant PLR for predicting post-LT HCC recurrence and further evaluate the correlation of PLR with tumor-related characteristics.\n\n\nMETHODS\nThe clinical data of 343 LT for HCC was retrospectively analyzed. The receiver operating characteristic (ROC) curve was used to determine the optimal PLR cut-off value to predict HCC recurrence after LT. The tumor-free survival rates were compared between high and low PLR groups divided by different pre-transplant PLR cut-off values. The relationship of elevated PLR and tumor-related characteristics were also analyzed. Additionally, the tumor-free survival was compared according to different platelet and lymphocyte counts.\n\n\nRESULTS\nPLR 125 was the most significant cut-off value in predicting tumor-free survival after LT, with the sensitivity and specificity of 61.6% and 62.7%, respectively. PLR ≥125 was associated with significantly higher proportion of multiple tumors, large tumor size, and micro- and macro-vascular invasion than PLR <125. Of patient with PLR <125, 46.9%, 54.2%, and 61.5% were within Milan, UCSF, and Hangzhou criteria, respectively, significantly higher than 16.4%, 18.2%, and 29.1% in the PLR ≥125 group, respectively. There was no relationship between tumor-free survival and platelet or lymphocyte count independently.\n\n\nCONCLUSIONS\nPre-transplant PLR ≥125 was associated with advanced tumor stage and aggressive tumor behavior, and it can be used as a prognostic factor for post-transplant HCC recurrence.","cites":"3","conferencePercentile":"97.35376045"},{"venue":"World journal of surgical oncology","id":"72b76e16e7800fd7b4cfb2a3d048e57017b28781","venue_1":"World journal of surgical oncology","year":"2014","title":"Correlation of survival and EGFR mutation with predominant histologic subtype according to the new lung adenocarcinoma classification in stage IB patients","authors":"Yan Sun, Xinmin Yu, Xun Shi, Wei Hong, Jun Zhao, Lei Shi","author_ids":"6083084, 2506553, , 1789462, 1760149, 4608232","abstract":"BACKGROUND\nA new lung adenocarcinoma classification proposed by the International Association for the Study of Lung Cancer, American Thoracic Society, and European Respiratory Society (IASLC/ATS/ERS) has recently been published. This study aimed to investigate the utility of the new histological classification for identifying the prognostic subtypes of adenocarcinomas in stage IB patients.Correlations between the classification and the presence of epidermal growth factor receptor (EGFR) mutation status was also studied.\n\n\nMETHODS\nOne hundred and thirty-six patients with stage IB lung adenocarcinoma operated on in Zhejiang Cancer Hospital were identified between 2002 and 2011. Patients overall survival and disease-free survival were calculated using Kaplan-Meier and Cox regression analyses. EGFR mutations were detected using the amplification refractory mutation system.\n\n\nRESULTS\nA total of 136 cases were included in current study, of which 38 were papillary predominant, 39 were acinar predominant, 22 were micropapillary predominant, 21 were lepidic predominant subtypes, 14 were solid predominant, and 2 were variants of invasive adenocarcinoma. Patients with micropapillary- and solid-predominant tumors had the lowest five-year disease-free survival (28.4 and 36.7%, respectively). Univariate and multivariate analysis showed that the micropapillary-predominant subtype was an independent predictor of disease-free survival (P = 0.0041 and 0.048, respectively), but not overall survival (P = 0.175 and 0.214, respectively). EGFR mutations were significantly associated with the micropapillary-predominant subtype patients (P = 0.0026). The EGFR mutation frequency is lower in the solid-predominant subtype than other subtypes (P = 0.0508).\n\n\nCONCLUSIONS\nThe predominant subtype in the primary tumor was associated with prognosis in resected stage IB lung adenocarcinoma. The EGFR mutation frequency of micropapillary-predominant subtype is higher than other subtypes.","cites":"7","conferencePercentile":"98.99497487"},{"venue":"World journal of surgical oncology","id":"605e924b1594c1ab66f357be2825063e9f190499","venue_1":"World journal of surgical oncology","year":"2014","title":"Bile duct adenoma: a case report and literature review","authors":"Lei Chen, Mai Yu Xu, Feng Chen","author_ids":"1685847, 8489658, 1692998","abstract":"BACKGROUND\nBile duct adenoma (BDA) is a comparatively rare disease clinically, therefore, there are relatively few reported cases about it both in China and abroad.\n\n\nCASE PRESENTATION\nHerein, we present a 51-year-old man, diagnosed preoperatively with enhanced-contrast abdominal computed tomography, as having a nodule in the left hepatic. The patient underwent a liver tumor resection, and the histological examination revealed bile duct adenoma (BDA).\n\n\nCONCLUSIONS\nBDA is an extremely rare benign tumor, which is difficult to distinguish BDA from hepatocellular carcinoma definitely preoperatively, surgical resection is needed as a way of treatment.","cites":"1","conferencePercentile":"62.68844221"},{"venue":"World journal of surgical oncology","id":"8daeacb6ad7cb9ec52b1dd27306013fb6f3bec10","venue_1":"World journal of surgical oncology","year":"2015","title":"Neo-adjuvant hormone therapy for non-metastatic prostate cancer: a systematic review and meta-analysis of 5,194 patients","authors":"Jimeng Hu, Hua Xu, Wenhui Zhu, Fei Wu, Jianqing Wang, Qiang Ding, Haowen Jiang","author_ids":"4903507, 1718800, 4736017, 1695826, 5429800, 1786449, 3444430","abstract":"BACKGROUND\nNeo-adjuvant hormone therapy (NHT) following radical prostatectomy (RP) or radiotherapy has been utilized in the multimodal approach to patients with intermediate- to high-risk prostate cancer (PCa). Herein, we performed a systematic review and meta-analysis of published randomized trials to evaluate the clinical efficacy of NHT.\n\n\nMETHODS\nLiteratures were searched from PubMed, EMBASE, Web of Science, and Cochrane Library for comparing neo-adjuvant therapy group (NHT plus radiotherapy or radical prostatectomy) with traditional therapy (radiotherapy or prostatectomy) alone. Quality of the research was assessed on the basis of the Cochrane's risk of bias of randomized controlled trial. Comparable information were obtained from eligible trials and assembled for meta-analysis up to 31 August 2014. RevMan 5.2 software was used for statistical analysis.\n\n\nRESULTS\nFifteen randomized controlled trials (RCTs) (total 5,194 patients) were included in this study. Meta-analysis showed there was a significant improvement in overall survival (OS) (Odds ratio (OR) = 1.51, 95% confidence interval (CI) 1.22 to 1.87, P = 0.0002), positive surgical margin (PSM) rate (OR = 0.30, 95% CI 0.24 to 0.38, P < 0.00001), and biochemical disease-free survival (bDFS) (OR = 1.95, 95% CI 1.13 to 3.39, P = 0.02), but no significant difference in disease-free survival (OR = 1.52, 95% CI 0.90 to 2.59, P = 0.12) and clinical disease-free survival (cDFS) (OR = 0.96, 95% CI 0.22 to 4.18, P = 0.95). Heterogeneity and risk of bias were observed between different studies.\n\n\nCONCLUSIONS\nPatients with aggressive prostate cancer would better benefit from the receipt of neo-adjuvant therapy. Physicians should make individualized treatment strategies according to adverse reactions, financial capacities, and personal wishes.","cites":"1","conferencePercentile":"78.2729805"},{"venue":"World journal of surgical oncology","id":"db42a19ad094951d8cb0d9d85ca5c471c320e013","venue_1":"World journal of surgical oncology","year":"2015","title":"Molecular biomarkers screened by next-generation RNA sequencing for non-sentinel lymph node status prediction in breast cancer patients with metastatic sentinel lymph nodes","authors":"Feng Liang, Hongzhu Qu, Qiang Lin, Yadong Yang, Xiuyan Ruan, Bo Zhang, Yi Liu, Chengze Yu, Hongyan Zhang, Xiangdong Fang, Xiaopeng Hao","author_ids":"1710875, 2858774, 2089644, 7607581, 3201234, 1696318, 1691635, 7530708, 1783407, 2136124, 8480683","abstract":"BACKGROUND\nNon-sentinel lymph node (NSLN) status prediction with molecular biomarkers may make some sentinel lymph node (SLN) positive breast cancer patients avoid the axillary lymph node dissection, but the available markers remain limited.\n\n\nMETHODS\nSLN positive patients with and without NSLN invasion were selected, and genes differentially expressed or fused in SLN metastasis were screened by next-generation RNA sequencing.\n\n\nRESULTS\nSix candidates (all ER/PR+, HER2-, Ki-67 <20%) with metastatic SLNs selected from 305 patients were equally categorized as NSLN negative and positive. We identified 103 specifically expressed genes in the NSLN negative group and 47 in the NSLN positive group. Among them, FABP1 (negative group) and CYP2A13 (positive group) were the only 2 protein-encoding genes with expression levels in the 8th to 10th deciles. Using a false discovery rate threshold of <0.05, 62 up-regulated genes and 98 down-regulated genes were discovered in the NSLN positive group. Furthermore, 10 gene fusions were identified in this group with the most frequently fused gene being IGLL5.\n\n\nCONCLUSIONS\nThe biomarkers screened in present study may broaden our understanding of the mechanisms of breast cancer metastasis to the lymph nodes and contribute to the axillary surgery selection for SLN positive patients.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"b6128b1ed2f511036fcbdf38ac8f736df750b8fb","venue_1":"World journal of surgical oncology","year":"2015","title":"Expression of ezrin, CD44, and VEGF in giant cell tumor of bone and its significance","authors":"Jing Zhang, Jian Dong, Zuozhang Yang, Xiang Ma, Jinlei Zhang, Mei Li, Yun Chen, Yingying Ding, Kun Li, Zhiping Zhang","author_ids":"1685347, 7746711, 5799182, 4060983, 5661596, 3953236, 3951959, 7625502, 7137324, 3099110","abstract":"BACKGROUND\nThis research aimed to study the role of ezrin, CD44, and VEGF in invasion, metastasis, recurrence, and prognosis of giant cell tumor of bone (GCTB) and its association with the clinical and pathological features of GCTB.\n\n\nMETHODS\nExpression status of ezrin, CD44, and VEGF in 80 GCTB tissues and its adjacent noncancerous tissue samples were measured with immunohistochemical and Elivison staining. Their correlation with the clinical and pathologic factors was statistically analyzed by chi-square test.\n\n\nRESULTS\nThe expression status of ezrin, CD44, and VEGF were significantly higher in GCTB tissue samples than in its adjacent noncancerous tissue samples and in GCTB at Campanacci stage III than in Campanacci stages I and II (P < 0.05). No significant difference was found in age and sex of the patients and locations of the tumor (P > 0.05). Survival analysis showed that the expression status of ezrin, CD44, VEGF, and Campanacci clinical stages of GCTB were positively associated with the survival rate of GCTB patients and negatively associated with ezrin and Campanacci stages of GCTB, indicating that ezrin, CD44, VEGF, and Campanacci clinical stages of GCTB are the independent factors for GCTB.\n\n\nCONCLUSIONS\nEzrin, CD44, and VEGF are over-expressed in GCTB tissue and its adjacent noncancerous tissue samples and may play an important role in the occurrence, invasion, metastasis, and recurrence of GCTB. Measurement of ezrin, CD44, and VEGF expression status may contribute to the judgment of prognosis of GCTB patients.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"1309865290a16678c26adb2e2971523284ed0ef5","venue_1":"World journal of surgical oncology","year":"2014","title":"Prognostic role of microRNA-145 in\nvarious human malignant neoplasms: a meta-analysis of 18 related\nstudies","authors":"Jie Yang, Jia-yi Zhang, Jing Chen, Chen Chen, Xiao-meng Song, Yang Xu, Jie Li","author_ids":"8647202, 8214856, 3943100, 1732874, 2626200, 1714663, 1684133","abstract":"BACKGROUND\nRecent studies show that microRNA-145 (miR-145) might be an attractive tumor biomarker of considerable prognostic value. To clarify the preliminary predictive value of miR-145 for prognosis in various malignant neoplasms, we conducted a meta-analysis of 18 relevant studies.\n\n\nMETHODS\nEligible studies were identified by searching the online databases PubMed, EMBASE, and Web of Science up to March 2014. Pooled hazard ratios (HRs) with 95% confidence intervals (CIs) for patient survival and disease progress were calculated to investigate the association with miR-145 expression.\n\n\nRESULTS\nIn total, 18 eligible studies were included in this meta-analysis. Our results showed that upregulated miR-145 significantly predicted a favorable overall survival (OS) (HR = 0.47, 95% CI 0.31 to 0.72), but failed to show a significant relation with disease prognosis. In stratified analyses, high miR-145 expression predicted favorable OS in both Whites and Asians but the intensity of the association in Whites (HR = 0.67, 95% CI 0.47 to 0.95) was not as strong as in Asians (HR = 0.35, 95% CI 0.19 to 0.64). High miR-145 expression also predicted better progression-free survival (PFS) in Asians (HR = 0.43, 95% CI 0.21 to 0.89), but not in Whites. In addition, a significantly favorable OS associated with upregulated miR-145 expression was observed in both squamous cell (SCC) (HR = 0.34, 95% CI 0.13 to 0.93) and glioblastoma (HR = 0.72, 95% CI 0.52 to 0.99).\n\n\nCONCLUSIONS\nOur findings indicate that high miR-145 expression is better at predicting patient survival rather than disease progression for malignant tumors, especially for SCC and glioblastoma in Asians. Considering the insufficient evidence, further investigations and more studies are needed.","cites":"0","conferencePercentile":"24.24623116"},{"venue":"World journal of surgical oncology","id":"d28eded99a7e818371645badf534b66cc20e8d67","venue_1":"World journal of surgical oncology","year":"2014","title":"Radiation-induced malignant fibrous histiocytoma of the occipital: a case report","authors":"Guo-Bin Zhang, Jian Li, Peng-Fei Zhang, Li-Jiang Han, Jun-Ting Zhang","author_ids":"8274049, 2716583, 2881429, 6627138, 4335975","abstract":"Malignant fibrous histiocytoma (MFH) is a rare neoplasm exhibiting a propensity for aggressive clinical behavior. Effective treatment modality is surgical resection with wide margins, but its rate of recurrence and metastasis is still high. Early detection and complete excision of the tumor is necessary. A MFH of the occipital developed in a 51-year-old woman eight years after surgery and radiation for medulloblastoma of the cerebellar vermis. The secondary neoplasm arose at the site of tumor resection within the irradiated field, and was resected. The development of sarcomas is a recognized complication of radiation therapy. The final diagnosis after the operation was MFH. Radiation-induced sarcoma (RIS) is well known, but radiation-induced MFH is relatively rare in the head and neck region, especially in the occipital. The imaging findings are not diagnosis specific, but strict follow-up within the radiation field by computerized tomography (CT) and magnetic resonance imaging (MRI) and appreciation of the expected latency period may help in providing the diagnosis of RIS.","cites":"0","conferencePercentile":"24.24623116"},{"venue":"World journal of surgical oncology","id":"00323f2b5a0a3d012bdd1c13c5ca0c7973987e5d","venue_1":"World journal of surgical oncology","year":"2012","title":"Percutaneous microwave coagulation for eradication of VX2 tumors subcutaneously in rabbits","authors":"Wenbin Zhou, Qiang Ding, Xiaoan Liu, Yanni Jiang, Ling Chen, Yifen Zhang, Tiansong Xia, Shui Wang","author_ids":"4709826, 1786449, 5778844, 6227626, 1717165, 7549295, 2945896, 5739805","abstract":"BACKGROUND\nPercutaneous microwave coagulation (PMC) has been accepted as a promising modality in the treatment of tumors in well-vascularized tissues such as liver tumors and hysteromyoma. However, PMC for treatment of tumors in low blood-flow tissues has been seldom reported. The aim of this study was to determine the feasibility and safety of PMC for the treatment of tumors in low blood-flow tissues in a rabbit model.\n\n\nMETHODS\nFifteen rabbits with VX2 tumors implanted subcutaneously underneath the right second nipple were divided into a PMC group (n = 9) and a control group (n = 6). PMC was performed with output power of 40 W for one to two minutes. The therapeutic efficacy was evaluated by magnetic resonance imaging (MRI), physical examinations, survival rate, and histology. The cosmetic outcome after PMC was also assessed.\n\n\nRESULTS\nIn the PMC group, tumor eradication was achieved in six rabbits (66.7%) without any evidence of tumor recurrence and metastasis as proven by MRI and histological examinations. The mean greatest and shortest tumor diameters of these six rabbits were 1.83 and 1.33 cm, respectively. Slight epidermal burns, which proved reversible, were found in seven rabbits (77.8%). The PMC group had a significantly longer survival than those in the control group (P = 0.0097). The four rabbits with coagulated tumors survived more than three months with their tumors becoming nonpalpable and undetectable by MRI and histological examinations.\n\n\nCONCLUSIONS\nPMC is feasible and safe in the treatment of tumors in low blood-flow tissues in a rabbit model. Attention should be paid to avoid skin burns with PMC.","cites":"2","conferencePercentile":"62.54480287"},{"venue":"World journal of surgical oncology","id":"60eee23caeedbaf216fa514d3c36ace40543450a","venue_1":"World journal of surgical oncology","year":"2013","title":"Pancreaticoduodenectomy versus local resection in the treatment of gastrointestinal stromal tumors of the duodenum","authors":"Bo Zhou, Min Zhang, Jian Wu, Sheng Yan, Jie Zhou, Shusen Zheng","author_ids":"3738572, 1770849, 1734550, 2274178, 1743129, 7149791","abstract":"BACKGROUND\nGastrointestinal stromal tumors (GISTs) are the most common mesenchymal neoplasms. However, duodenal GISTs compromise a small and rare subset and few studies have focused on them. We evaluated the surgical management of patients with duodenal GISTs treated by pancreaticoduodenectomy (PD) versus local resection (LR) in our institution and analyzed the postoperative outcomes.\n\n\nMETHODS\nThis was a retrospective review of patients with duodenal GISTs managed in our institution from January 2006 to January 2012. Clinicopathologic findings and disease-free survival (DFS) of duodenal GIST patients were analyzed.\n\n\nRESULTS\nA total of 48 patients were selected. The most common presentation was bleeding (60.4%), and the second portion of the duodenum (35.4%) was the most common dominant site. Of the patients, 34 (70.8%) underwent LR while 14 (29.2%) underwent PD. The surgical margins for all studied patients were free. Patients who ultimately underwent PD were more likely to present with a larger tumor (median size: PD, 6.3 cm vs LR, 4.0 cm; P = 0.02) and more commonly presented with a tumor in the second portion of the duodenum (second portion: PD, 64.3% vs LR, 23.5%; P = 0.007). The tumors treated by PD had a higher grade of risk compared with LR as defined by National Institutes of Health (NIH) criteria (P = 0.019). PD was significantly associated with a longer operation time and a longer hospital stay compared to LR (P < 0.001 and P = 0.001, respectively). In our study, the median follow-up period was 36 months (range: 0 to 81 months). The 1- and 3-year DFS was 100% and 88%, respectively. From multivariable analysis, the only significant factor associated with a worse DFS was an NIH high risk classification (hazard ratio = 4.24).\n\n\nCONCLUSIONS\nThe recurrence of duodenal GIST was correlated to tumor biology rather than type of operation. PD was associated with a longer hospital stay and longer operation time. Therefore, LR with clear surgical margins should be considered a reliable and curative option for duodenal GIST and PD should be reserved for lesions not amenable to LR.","cites":"2","conferencePercentile":"66.0130719"},{"venue":"World journal of surgical oncology","id":"6bbd7e58a6bcdab6d93dcb34bd11fe9c4e6d9c6e","venue_1":"World journal of surgical oncology","year":"2013","title":"Marjolin’s ulcer: a preventable malignancy arising from scars","authors":"Nanze Yu, Xiao Long, Jorge R Lujan-Hernandez, Kazi Z Hassan, Ming Bai, Yang Wang, Xiaojun Wang, Ru Zhao","author_ids":"8446299, 6681776, 4713425, 8041393, 3048692, 1803489, 1714962, 3379824","abstract":"BACKGROUND\nMarjolin's ulcer (MU) is a rare malignancy arising from various forms of scars. This potentially fatal complication typically occurs after a certain latency period. This article attempts to reveal the importance of the latency period in the prevention and early treatment of the malignancy.\n\n\nMETHODS\nA retrospective review of 17 MU patients who underwent surgical procedures between June of 2005 and December 2011 was conducted. Etiology of injuries, latency period, repeated ulceration, and outcomes were recorded. This observational report reveals characteristics of patients who develop MU.\n\n\nRESULTS\nAn incidence of 0.7% of MU was found amongst patients complaining of existing scars in our study; burns and trauma were the most common etiology of MU. The mean latency period was 29 years (SD = 19) and the mean post-ulceration period was 7 years (SD = 9). Statistical analysis revealed a negative correlation between the age of patients at injury and the length of latency period (r = -0.8, P <0.01), as well as the lengths of pre-ulceration and post-ulceration periods (r = -0.7, P <0.01).\n\n\nCONCLUSIONS\nPatients experience different lengths of pre- and post-ulceration periods during the latency period. Younger patients tend to have a longer latency period. Skin breakdown on chronic scars and chronic unhealed ulcers are two main sources of MU. MU may be preventable with a close surveillance of the ulcer during the latency period.","cites":"1","conferencePercentile":"43.62745098"},{"venue":"World journal of surgical oncology","id":"212f3f0d520b7cddc1fb568e574d6341f18a7de3","venue_1":"World journal of surgical oncology","year":"2013","title":"Colon angiolipoma with intussusception: a case report and literature review","authors":"Lei Wang, Ping Chen, Liang Zong, Guang-Yao Wang, Hao Wang","author_ids":"1743559, 1711641, 2526693, 5857351, 1728073","abstract":"Angiolipomas are frequently observed benign tumors. They have a typical vascular component and are often located in subcutaneous tissues, and more rarely, in the gastrointestinal tract. We present the case of a 58-year-old man who complained of abdominal discomfort in the left lower quadrant and two to three bloody stools a day without any obvious etiology. These symptom became more severe in the next three days, due to a large angiolipoma located in the descending colon, which was diagnosed intraoperatively. In a literature review, we found only 22 cases of angiolipomas involving the gastrointestinal tract which are reported in the literature from 1960 to 2012 in PubMed; the key words used in the search are gastrointestinal tract angiolipoma, esophagus, stomach, duodenum, intestine, ileocecal junction, colon, rectum angiolipomas. Colon angiolipoma with intussusception, as seen in this case, is rare and may require emergent surgical intervention.","cites":"3","conferencePercentile":"80.55555556"},{"venue":"World journal of surgical oncology","id":"d9b5b7841f8da7e9453510597fdb9855577ef51d","venue_1":"World journal of surgical oncology","year":"2014","title":"Prognostic impact of gastrointestinal bleeding and expression of PTEN and Ki-67 on primary gastrointestinal stromal tumors","authors":"Hao Wang, Ping Chen, Xin-Xin Liu, Wei Zhao, Lei Shi, Xue-Wen Gu, Chang-Ren Zhu, Hai-Hang Zhu, Liang Zong","author_ids":"1728073, 1711641, 1884207, 8634865, 4608232, 7787827, 7883801, 4289217, 2526693","abstract":"BACKGROUND\nPrognostic indicators for gastrointestinal stromal tumors (GISTs) are under investigation. The latest risk classification criteria may still have room for improvement. This study aims to investigate prognostic factors for primary GISTs from three aspects, including clinicopathological parameters, immunohistochemical (IHC) expression of PTEN, and Ki-67 labeling index (LI), and attempts to find valuable predictors for the malignancy potential of primary GISTs.\n\n\nMETHODS\nTumor samples and clinicopathological data from 84 patients with primary GISTs after R0 resection were obtained. Immunohistochemical analysis was performed based on tissue microarray (TMA) to estimate expression of PTEN and Ki-67 in tumor cells.\n\n\nRESULTS\nThe cut-off point of Ki-67 LI was determined as 1%, using a receiver operator characteristic test with a sensitivity of 71.7% and a specificity of 64.5%. Univariate analysis demonstrated the following factors as poor prognostic indicators for relapse-free survival (RFS) against a median follow-up of 40.25 months: gastrointestinal (GI) bleeding (P = 0.009), non-gastric tumor location (P = 0.001), large tumor size (P = 0.022), high mitotic index (P < 0.001), high cellularity (P = 0.012), tumor rupture (P = 0.013), absent or low expression of PTEN (P = 0.036), and Ki-67 LI >1% (P = 0.043). Gastrointestinal bleeding (hazard ratio, 3.85; 95% confidence interval, 1.63 to 9.10; P = 0.002) was a negative independent risk predictor in multivariate analysis, in addition to tumor size (P = 0.023), and mitotic index (P = 0.002). In addition, GI bleeding showed a good ability to predict recurrence potential, when included in our re-modified risk stratification criteria.\n\n\nCONCLUSIONS\nThis study suggests that GI bleeding is an independent predictor of poor prognosis for RFS in primary GISTs. Expression of PTEN and Ki-67 are correlated with high risk potential and may predict early recurrence in univariate analysis.","cites":"2","conferencePercentile":"83.04020101"},{"venue":"World journal of surgical oncology","id":"26446e97821cbbefa3f8b3256a2be3b9688c9af4","venue_1":"World journal of surgical oncology","year":"2012","title":"Leiomyosarcoma of the inferior vena cava level II involvement: curative resection and reconstruction of renal veins","authors":"Quan Wang, Jing Jiang, Chao Wang, Guodong Lian, Mei-Shan Jin, Xueyuan Cao","author_ids":"3972148, 1746594, 6250419, 5922380, 7357352, 7300023","abstract":"Leiomyosarcoma of the inferior vena cava (IVCL) is a rare retroperitoneal tumor. We report two cases of level II (middle level, renal veins to hepatic veins) IVCL, who underwent en bloc resection with reconstruction of bilateral or left renal venous return using prosthetic grafts. In our cases, IVCL is documented to be occluded preoperatively, therefore, radical resection of tumor and/or right kidney was performed and the distal end of inferior vena cava was resected and without caval reconstruction. None of the patients developed edema or acute renal failure postoperatively. After surgical resection, adjuvant radiation therapy was administrated. The patients have been free of recurrence 2 years and 3 months, 9 months after surgery, respectively, indicating the complete surgical resection and radiotherapy contribute to the better survival. The reconstruction of inferior vena cava was not considered mandatory in level II IVCL, if the retroperitoneal venous collateral pathways have been established. In addition to the curative resection of IVCL, the renal vascular reconstruction minimized the risks of procedure-related acute renal failure, and was more physiologically preferable. This concept was reflected in the treatment of the two patients reported on.","cites":"0","conferencePercentile":"15.94982079"},{"venue":"World journal of surgical oncology","id":"30f670d15ae48db9c44534a872a386cfdcce8f50","venue_1":"World journal of surgical oncology","year":"2011","title":"Twelve-year survival after multiple recurrences and repeated metastasectomies for renal cell Carcinoma","authors":"Jue Wang, Geoffrey A Talmon, Michael Feloney, Michael C Morris","author_ids":"1718812, 6618951, 3649980, 4970021","abstract":"BACKGROUND\nMetastatic renal cell carcinoma (RCC) presents a therapeutic challenge for clinicians because of the unpredictable clinical course, resistance to chemotherapy or radiotherapy and the limited response to immunotherapy.\n\n\nPATIENTS AND METHODS\nWe report a case of a 62-year-old woman who underwent nephrectomy for T4N0 RCC, clear cell type, Fuhrman grade 3/4 in 1999. The patient subsequently had multiple tumor recurrences.\n\n\nRESULTS\nThe patient underwent eight metastasectomies, including multiple partial left nephrectomies, right adrenalectomy, a complete left nephrectomy, and distal pancreatectomy. She remains well and tumor free 12 years after initial diagnosis.\n\n\nCONCLUSION\nRepeated resections after initial metastasectomy can be carried out safely and provide long-term survival in selected patients with recurrent metastasis from RCC. The findings from our case indicate that close follow-up for the early detection of recurrence and complete resection of metastases can improve the results after repeated resection.","cites":"1","conferencePercentile":"42.94117647"},{"venue":"World journal of surgical oncology","id":"7594038e1bad90ff70afd239e5b2debf2e7424ad","venue_1":"World journal of surgical oncology","year":"2015","title":"Methylation of RASSF1A gene promoter and the correlation with DNMT1 expression that may contribute to esophageal squamous cell carcinoma","authors":"Zhenzong Du, Kui Ma, Xiaolin Sun, Angui Li, Haiyong Wang, Lifei Zhang, Feng Lin, Xiaoyan Feng, Jianfei Song","author_ids":"4675270, 7007326, 4244596, 3845188, 7644486, 2109287, 3673120, 2561356, 6600228","abstract":"BACKGROUND\nEsophageal squamous cell carcinoma is one of the most common malignancies in the world. Studies have confirmed that there are many genes abnormally hypermethylated in esophageal squamous cell carcinoma. The objective is to detect methylation of the RASSF1A gene promoter and the expression of the DNA methyltransferase 1 (DNMT1) protein in esophageal cancer tissue and discuss their relationship with esophageal squamous cell carcinoma.\n\n\nMETHODS\nThe CpG island methylation status of RASSF1A genes were analyzed in 100 cases of tumor specimens as well as their adjacent tissues which was used for methylation-specific polymerase chain reaction (MSP). The expression of DNMT1 protein was determined by immunohistochemistry. Difference between measurement data and categorical data was compared through analysis of t test and chi-square test. All the statistics were taken with a bilateral test. The difference was statistically significant (P < 0.05).\n\n\nRESULTS\nThe promoter methylation of the RASSF1A gene promoter has been detected in 45 out of 100 (45%) esophageal squamous carcinoma cases, while methylation of RASSF1A gene has been detected in 2 out of 100 adjacent normal tissues (2%). The RASSF1A gene promoter was highly methylated in cancer tissues, and there were significant differences between normal esophagus tissues and esophageal squamous carcinoma (P < 0.05). The expression of DNMT1 protein has been detected in 61 out of 100 (61%) esophageal squamous carcinoma cases, including 41 cases in the above 45 methylated samples of RASSF1A gene promoter, and none in adjacent tissues. DNMT1 proteins are highly expressed in cancer tissues, and there were significant differences (P < 0.05). In positive cases for methylation of RASSF1A, the DNMT1 protein had been detected in 41 out of 45 (91%), while in non-methylated cancer cases, 20 out of 55(36.3%), and the difference is significant (P < 0.05).\n\n\nCONCLUSIONS\nEsophageal squamous carcinoma tumorigenesis may be related with hypermethylation of DNMT1 and RASSF1A promoter CpG island due to their high expression and also their hypermethylation.","cites":"2","conferencePercentile":"92.47910864"},{"venue":"World journal of surgical oncology","id":"6c90e5782f4adf079b0484999d9301743801162b","venue_1":"World journal of surgical oncology","year":"2016","title":"Two-port laparoscopic anterior resection through a self-made glove device versus conventional laparoscopic anterior resection for rectal cancer: a comparison of short-term surgical results","authors":"Hong Zhang, Yunzhi Ling, Jinchun Cong, Mingming Cui, Dingsheng Liu, Chunsheng Chen","author_ids":"1734058, 7224720, 7801927, 7271119, 1753869, 7863174","abstract":"BACKGROUND\nThe laparoscopic approach has become increasingly incorporated into the development of new surgical procedures. An ever-increasing number of surgeons desire methods that minimize surgical trauma and provide improved cosmetic outcomes. Since 2014, we have performed two-port laparoscopic surgery using a transumbilical multichannel glove port and a 12-mm port. The aim of this study was to compare the short-term surgical results of two-port laparoscopic anterior resection (TPLAR) with those of conventional laparoscopic anterior resection (CLAR) for rectal cancer.\n\n\nMETHODS\nBetween January 2014 and May 2014, a total of 27 patients underwent TPLAR and 30 patients underwent CLAR for the treatment of rectal cancer. The short-term surgical results of these two groups of patients were analyzed retrospectively.\n\n\nRESULTS\nThe differences in operative time, blood loss, conversion rate, complication rate, distal resection margin, number of harvested lymph nodes, duration until ambulation, duration until first flatus, length of postoperative hospital stay, and overall hospital costs between the two groups were not significant. The median (range) length of the abdominal incisions of the TPLAR patients was shorter than the length of the CLAR patients (5.1 (4.5-16.3) cm vs 8.2 (7.0-10.0) cm, respectively; p < 0.001). The respective median (range) postoperative pain scores were lower in the TPLAR than in the CLAR patients at 24 h (4 (1-6) h vs 5 (2-8) h; p = 0.045), 48 h (3 (1-4) h vs 4 (range 1-8) h; P = 0.004) and 72 h (1 (0-3) h vs 2 (1-5) h; p = 0.010). The median overall score on the satisfaction-with-abdominal-incision questionnaire of the TPLAR patients was significantly higher (better) than the score of the CLAR patients.\n\n\nCONCLUSIONS\nTPLAR for rectal cancer is safe and feasible, with short-term perioperative and oncological outcomes similar to those of CLAR. TPLAR provides less postoperative pain and better cosmetic outcomes.","cites":"0","conferencePercentile":"47.2"},{"venue":"World journal of surgical oncology","id":"5bd27d95f22ba48d0d7842f2ea75a5e714089bc4","venue_1":"World journal of surgical oncology","year":"2016","title":"The SphKs/S1P/S1PR1 axis in immunity and cancer: more ore to be mined","authors":"Lei Jin, Wei-Ren Liu, Meng-Xin Tian, Jia Fan, Ying-Hong Shi","author_ids":"1747636, 5207341, 3586290, 2100589, 6580886","abstract":"Over the past two decades, huge amounts of research were launched to understand the functions of sphingosine. Many pathways were uncovered that convey the relative functions of biomacromolecules. In this review, we discuss the recent advances of the role of the SphKs/S1P/S1PR1 axis in immunity and cancer. Finally, we investigate the therapeutic potential of new drugs that target S1P signaling in cancer therapy.","cites":"0","conferencePercentile":"47.2"},{"venue":"World journal of surgical oncology","id":"5482a2c383a31f28c4df4ca57680f8e63d1e333d","venue_1":"World journal of surgical oncology","year":"2012","title":"Expression of AQP5 and AQP8 in human colorectal carcinoma and their clinical significance","authors":"Wei Wang, Qing Li, Tao Yang, Guang Bai, Dongsheng Li, Qiang Li, Hongzhi Sun","author_ids":"2593479, 6440058, 1720792, 7584034, 7379433, 1732461, 7218836","abstract":"BACKGROUND\nThe aquaporins (AQPs) are a family of small membrane transport proteins whose overexpression has been implicated in tumorigenesis. However, the expression of AQP5 and AQP8 in colorectal cancer and the clinical significance remain unexplored. This study aimed to detect the expression of AQP5 and AQP8 in clinical samples of colorectal cancer and analyze the correlations of their expression with the clinicopathological features of colorectal cancer.\n\n\nMETHODS\nForty pairs of colorectal cancer tissue and paraneoplastic normal tissue were obtained at the time of surgery from patients with colorectal cancer. The expression of AQP5 and AQP8 was detected by immunohistochemical staining and reverse transcriptase polymerase chain reaction.\n\n\nRESULTS\nAQP5 was mainly expressed in colorectal carcinoma cells and barely expressed in paraneoplastic normal tissues. By contrast, AQP8 was mainly expressed in paraneoplastic normal tissues and barely expressed in colorectal carcinoma cells. AQP5 expression was not significantly associated with the sex or age of the patient with colorectal cancer (P>0.05), but was closely associated with the differentiation, tumor-nodes-metastasis stage and distant lymph node metastasis of colorectal carcinoma (P<0.05).\n\n\nCONCLUSIONS\nAQP5 might be a novel prognostic biomarker for patients with colorectal cancer.","cites":"7","conferencePercentile":"95.34050179"},{"venue":"World journal of surgical oncology","id":"ba6f043402909586090430055ac063d4e692a8eb","venue_1":"World journal of surgical oncology","year":"2014","title":"Fewer complications after laparoscopic nephrectomy as compared to the open procedure with the modified Clavien classification system - a retrospective analysis from Southern China","authors":"Hua Xu, Qiang Ding, Hao-wen Jiang","author_ids":"1718800, 1786449, 7566507","abstract":"BACKGROUND\nThe objective of the study is to compare complication rates of laparoscopic nephrectomy and open nephrectomy using a standardized classification method.\n\n\nMETHODS\nWe retrospectively included 843 patients from March 2006 to November 2012, of whom 88 had laparoscopic radical nephrectomy (LRN), 526 had open radical nephrectomy (ORN), 42 had laparoscopic partial nephrectomy (LPN), and 187 had open partial nephrectomy (OPN). A modified Clavien classification system was applied to quantify complications of nephrectomy. Fisher's exact or chi-square test were used to compare complication rates between laparoscopic and open approaches.\n\n\nRESULTS\nThe overall complication rate was 19.31%, 30.04%, 35.71%, and 36.36% in LRN, ORN, LPN, and OPN, respectively. More Grade II complications (odds ratio = 2.593, 95% CI 1.172 to 5.737, P = 0.010) and longer postoperation hospital stay (9.2 days and 7.6 days, P < 0.001) were observed in ORN compared with LRN. In multivariable analysis, surgical approach (LRN/ORN) (P = 0.036), age (P = 0.044), height (P = 0.020), systolic pressure (P = 0.012), fasting blood glucose level (P = 0.032), and blood loss during operation (P = 0.011) were significant predictors for grade II complications in radical nephrectomy. LPN had similar complication rates compared with OPN.\n\n\nCONCLUSIONS\nIn conclusion, LRN had the advantages of less grade II complications and shorter postoperation hospital stay than ORN. Older age and more blood loss during operation would also contribute to more grade II complications in radical nephrectomy.","cites":"1","conferencePercentile":"62.68844221"},{"venue":"World journal of surgical oncology","id":"298f2738493aade33b957034cadd8798a4b0b632","venue_1":"World journal of surgical oncology","year":"2015","title":"Giant peritoneal loose body in the pelvic cavity confirmed by laparoscopic exploration: a case report and review of the literature","authors":"Hong Zhang, Yun-zhi Ling, Ming-ming Cui, Zhi-xiu Xia, Yong Feng, Chun-sheng Chen","author_ids":"1734058, 4013717, 4393718, 5319479, 6601251, 3211237","abstract":"A 51-year-old previously healthy male underwent a routine medical examination. Computed tomography and ultrasonography showed an oval-shaped mass that was about 50 × 40 mm in size in the left iliac fossa. Prior to surgery, the lesion was suspected to be a teratoma with core calcification or stromal tumor derived from the rectosigmoid colon. During the procedure, a yellow-white, egg-shaped mass was discovered that was completely free from the pelvic cavity in front of the rectum. The giant, peritoneal loose body was taken out through the enlarged port site. Histological examination showed that the mass consisted of well-circumscribed, unencapsulated, paucicellular tissue, with an obviously hyalinized fibrosclerotic center. A giant peritoneal body is extremely rare. We report such a case and review previously published literature.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"296276f1dfbc335988ef617a1c854866d1601023","venue_1":"World journal of surgical oncology","year":"2012","title":"In vitro and in vivo double-enhanced suicide gene therapy mediated by generation 5 polyamidoamine dendrimers for PC-3 cell line","authors":"Yue Chen, Gang Wang, Deling Kong, Zhihong Zhang, Kuo Yang, Ranlu Liu, Weiming Zhao, Yong Xu","author_ids":"1990636, 4148672, 8475463, 1724496, 2362275, 6078827, 4854143, 2022180","abstract":"BACKGROUND\nOne of the most frequently used and efficient suicide gene therapies for prostate cancer is HSV-TK/GCV system, but its application has been limited due to lack of favorable gene vector and the reduction of \"bystander effect\". We investigated the effect of a novel combination of HSV-TK/GCV fused with Cx43 and gemcitabine using non-viral vector generation 5 polyamidoamine dendrimers (G5-PAMAM-D) on PC-3 cells.\n\n\nMETHODS\nRT-PCR and Western blot were used to detect TK and Cx43 expression. Cell viability and proliferation were measured by using MTT assay. Cell apoptosis was detected with double-staining of Annexin V-FITC and propidium iodide (PI) by flow cytometry. Nude mice models were established to evaluate the therapeutic effect in vivo.\n\n\nRESULTS\nG5-PAMAM-D efficiently delivered recombinant plasmids into PC-3 cells and HSV-TK and Cx43 could be expressed successfully. With gemcitabine, G5-PAMAM-D mediated HSV-TK and Cx43 expression effectively inhibited prostate cancer PC-3 cell proliferation, leading to more cellular apoptosis and inhibiting PC-3 tumor growth in nude mice models.\n\n\nCONCLUSIONS\nThis study illustrates that this new suicide gene system mediated by G5-PAMAM-D is effective in decreasing PC-3 cell proliferation and inducing cell apoptosis, and inhibiting tumor growth in vivo. In a word, our study could provide a potential approach for gene therapy of prostate cancer.","cites":"2","conferencePercentile":"62.54480287"},{"venue":"World journal of surgical oncology","id":"e797ab9e6c15ebf159084a40080f944c0a563fed","venue_1":"World journal of surgical oncology","year":"2012","title":"Study of treatment using percutaneous acetabuloplasty and interstitial implantation of 125I seeds for patients with metastatic periacetabular tumors","authors":"Jinlei Zhang, Zuozhang Yang, Jiaping Wang, Jinde Wang, Pengjie Liu, Hongpu Sun, Kun Li, Yunshan Yang","author_ids":"5661596, 5799182, 1743214, 2406563, 5279523, 4685486, 7137324, 7607510","abstract":"BACKGROUND\nThe periacetabular area is one of the primary sites of metastatic tumors, which often present as osteolytic bone destruction. Bone destruction in the acetabulum caused by metastatic tumors will cause hip pain and joint dysfunction. It results in decreased quality of life for patients. The aim of our study was to explore the clinical effect of metastatic periacetabular tumors treated with percutaneous cementoplasty and interstitial implantation of (125)I seeds.\n\n\nMETHODS\nA retrospective analysis was performed on 24 patients with metastatic periacetabular tumors who underwent combined therapy of percutaneous acetabuloplasty and interstitial implantation of (125)I seeds between February 2003 and June 2011. There were 13 males and 11 females aged 19-80 years with a mean age of 57.3. The primary tumor site was the lung in eight cases, the breast in six, the prostate cancer in eight, and the liver in two. The amount of implanted (125)I seeds was 12-20 seeds/person, with a mean of 16.5 seeds/person, and the matching peripheral dosage (MPD) was 80~100Gy. Routine postoperative chemotherapy and other combined treatments were applied to patients after the surgical operation. Changes in the Karnofsky Score(KPS), Harris Hip Score(Harris), and Visual Analog Scale(VAS) were observed during the follow-up period.\n\n\nRESULTS\nThe 24 patients' operations were all successful. No major complications occurred. Complete pain relief was achieved in 58% (14 of 24) of patients, and pain reduction was achieved in the 42% remaining (10) patients. The mean duration of pain relief was 8.3 months. Pain recurred in one patient 3 months after surgery. Six patients had died and 18 patients were alive at the time of the 1-year follow-up. Comparing the KPS, Harris and VAS scores pre- and postoperativelyat 1, 6, and 12 months, the combined therapy method was significantly effective in metastatic periacetabular tumor patients (P<0.05).\n\n\nCONCLUSIONS\nPercutaneous cementoplasty with interstitial implantation of (125)I seeds is an effective treatment method for metastatic periacetabular tumor patients, providing tumor resistance, pain relief, increased bone stability, and improved quality of life for patients.","cites":"0","conferencePercentile":"15.94982079"},{"venue":"World journal of surgical oncology","id":"495ab1d41f7f09858f2d7b76de31a50183a86793","venue_1":"World journal of surgical oncology","year":"2015","title":"Deciphering the anti-angiogenic effect of endostatin/cyclophosphamide to normalize tumor micrangium through notch signaling pathway in colon cancer","authors":"Jin-Yan Lv, Tai-Yuan Hu, Ruo-Yu Wang, Jin-Ming Zhu, Gang Wang","author_ids":"4992209, 6022296, 8199032, 8535945, 4148672","abstract":"BACKGROUND\nThe invasion of colon cancer is associated with the tumor angiogenesis. Endostatin is an important anti-angiogenic agent, and the additive effect of endostatin with a chemotherapeutic agent, cyclophosphamide, on micrangium has not been established.\n\n\nMETHODS\nMale BALB/c strain nude mice were injected with human colorectal carcinoma cells (HCT-116). The mice were divided into four groups (n=15, each group) and were treated with different concentrations of endostatin (15, 10, and 5 mg/kg/day), cyclophosphamide (20, 10, and 5 mg/kg/day), and combination of endostatin/cyclophosphamide (15+20, 15+10, and 15+5 mg/kg/day). The tumor inhibition rate was evaluated, followed by the quantification of messenger ribonucleic acid (mRNA) and protein expression of notch signaling components NOTCH-1, NOTCH-3, NOTCH-4, JAG-1, DLL-4, Hes-1, and Hey-1 using quantitative polymerase chain reaction (qPCR). The protein expression of NOTCH-3, JAG-1, and DLL-4 was confirmed using western blotting. Microvessel density (MVD) was evaluated to detect micrangium following the treatment.\n\n\nRESULTS\nThe endostatin/cyclophosphamide-treated samples exhibited an additive effect on the tumor inhibition rate and the microvessel count. NOTCH-1, NOTCH-3, NOTCH-4, JAG-1, Hes-1, and Hey-1 expression levels were highly correlated and downregulated in the treated samples, whereas DLL-4 expression was upregulated that accounted for its anti-angiogenic property.\n\n\nCONCLUSIONS\nThe combination treatment of colon cancer with endostatin and a chemotherapeutic agent, cyclophosphamide proves to be an efficient therapeutic strategy to inhibit the rapid vasculature formation confirmed by the differential expression of notch signaling components.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"b6c3815f1b65a9c340479469d13b0b82aa5d0247","venue_1":"World journal of surgical oncology","year":"2013","title":"Induction chemotherapy in patients with resectable head and neck squamous cell carcinoma: a meta-analysis","authors":"Jie Ma, Ying Liu, Xi Yang, Chen-ping Zhang, Zhi-yuan Zhang, Lai-ping Zhong","author_ids":"1686247, 1718041, 2895421, 7924020, 1949845, 5375877","abstract":"BACKGROUND\nInduction chemotherapy has been investigated as a possible strategy to shrink or downstage locally advanced head and neck cancers, providing opportunity to remove the lesions completely after induction chemotherapy, especially in the patients with resectable advanced disease. The aim of this study was to investigate the definitive effect of induction chemotherapy in patients with resectable head and neck squamous cell carcinoma.\n\n\nMETHODS\nA meta-analysis of randomized trials (1965-2011) was performed on the impact of induction chemotherapy on survival, disease control, and toxicity in this population of patients. Kaplan-Meier curves were read by Engauge-Digitizer. Data combining was performed using RevMan.\n\n\nRESULTS\nFourteen trials (2099 patients) were involved in this analysis. There was no significant difference on overall survival, disease free survival, or locoregional recurrence between the patients treated with and without induction chemotherapy (P >0.05). However, the patients treated with induction chemotherapy had a lower rate of distant metastasis by 8% (95% confidence interval 1%-16%, P = 0.02) than those treated without induction chemotherapy. In patients with laryngeal cancer, comparing to radical surgery, the larynx could be preserved in responders to induction chemotherapy without survival decease (P >0.05). Induction chemotherapy-associated death was 0%-5%.\n\n\nCONCLUSIONS\nBased on the results above, there is a significant benefit of induction chemotherapy on decreasing distant metastasis in patients with resectable head and neck squamous cell carcinoma. In patients with laryngeal cancer, induction chemotherapy provides larynx preservation in responders to induction chemotherapy.","cites":"2","conferencePercentile":"66.0130719"},{"venue":"World journal of surgical oncology","id":"aa538d0c3d1c2e38a2c670537d8345f45e9a8f99","venue_1":"World journal of surgical oncology","year":"2015","title":"Image-guided percutaneous renal cryoablation for stage 1 renal cell carcinoma with high surgical risk","authors":"Xiang Yan, Mingxin Zhang, Xiaoxiang Chen, Wang Wei, Rong Yang, Yang Yang, Weidong Gan, Hongqian Guo, Yang Wang, Guo-Ping Shi","author_ids":"8073043, 7979332, 8082725, 7736768, 1797063, 1708973, 8360716, 5786554, 1747927, 7235680","abstract":"BACKGROUND\nThis study was undertaken to evaluate the feasibility, safety, and therapeutic effects of percutaneous renal cryoablation under local anesthesia with conscious sedation for patients who have unresectable stage 1 (T1NoMo) renal cell carcinoma (RCC) in high surgical risk.\n\n\nMETHODS\nEighteen patients who were not candidates for surgery underwent primary cryosurgery guided by gray-scale ultrasound. Contrast-enhanced ultrasonography (CEUS) and contrast-enhanced computed tomography (CT) were performed to evaluate treatment at completion.\n\n\nRESULTS\nThe mean follow-up period was 26.8 months (range, 12-56 months). All tumors were biopsied before cryosurgery. Seventeen tumors remained free of enhancement during follow-up period. No major complications associated with cryoablation procedures were found though two instances of subcapsular hematomas, one of retroperitoneal errhysis and one of nausea, were seen after cryoablation. One patient had a local recurrence of tumor and received additional cryoablation. Local tumor control rate was 100 % of T1NoMo tumors including the recurrence case who underwent additional cryoablation.\n\n\nCONCLUSIONS\nPercutaneous cryoablation can be recommended as a feasible, safe, and promising therapy for the treatment of renal tumor, especially those unresectable stage 1 RCC, with a low risk of complications.","cites":"1","conferencePercentile":"78.2729805"},{"venue":"World journal of surgical oncology","id":"93c31b179e5cc4d9a0616e773d3594669f64cd16","venue_1":"World journal of surgical oncology","year":"2013","title":"Therapeutic effect and tolerability of gelatin sponge particle-mediated chemoembolization for colorectal liver metastases: a retrospective study","authors":"Chuang Li, Yuewei Zhang, Jun Zhou, Guangsheng Zhao, Shunxiong Tang","author_ids":"7431011, 6239610, 1728391, 1935155, 6347784","abstract":"BACKGROUND\nColorectal cancer (CRC) is one of the most common cancers worldwide. The majority (approximately 60%) of patients with CRC will eventually develop liver metastases, which remain the most common cause of mortality in these patients. This study aimed to evaluate the therapeutic effect and tolerability of gelatin sponge particle (GSP)-mediated chemoembolization in the treatment of colorectal liver metastases after systemic chemotherapy failure.\n\n\nMETHODS\nThis was a single-center retrospective study of 15 patients with colorectal liver metastases, who underwent GSP-mediated chemoembolization with 50 mg of lobaplatin during the period December 2009 to December 2010 in the Department of Interventional Radiology, Affiliated Zhongshan Hospital of Dalian University. Clinical data were retrieved, and the therapeutic effect and tolerability of the treatment were evaluated.\n\n\nRESULTS\nAll 15 patients with colorectal liver metastases completed the GSP-mediated chemoembolization. The therapeutic effect and tolerability were evaluated 3 months after the initial procedure. The tumor lesions in all patients showed various levels of necrosis and shrinkage. According to the Response Evaluation Criteria in Solid Tumors (RECIST), one patient achieved complete response (CR), eleven patients achieved partial response (PR), and three patients achieved stable disease (SD). The overall response rate (CR + PR) was 80%.\n\n\nCONCLUSIONS\nGSP-mediated chemoembolization is well tolerated and has a good short-term response rate (80%) in the treatment of colorectal liver metastases after systemic chemotherapy failure. Collectively, further study of the long-term effect of GSP-mediated chemoembolization in colorectal liver metastasis in a large cohort is warranted.","cites":"3","conferencePercentile":"80.55555556"},{"venue":"World journal of surgical oncology","id":"8dbde3bb7d5900ef4091eec7c90e97adc9932a42","venue_1":"World journal of surgical oncology","year":"2013","title":"Contemporary adjuvant polymethyl methacrylate cementation optimally limits recurrence in primary giant cell tumor of bone patients compared to bone grafting: a systematic review and meta-analysis","authors":"Dongqing Zuo, Longpo Zheng, Wei Sun, Dong Fu, Yingqi Hua, Zhengdong Cai","author_ids":"4703212, 6089982, 1712625, 3071800, 8511064, 8537173","abstract":"BACKGROUND\nReports of recurrence following restructuring of primary giant cell tumor (GCT) defects using polymethyl methacrylate (PMMA) bone cementation or allogeneic bone graft with and without adjuvants for intralesional curettage vary widely. Systematic review and meta-analysis were conducted to investigate efficacy of PMMA bone cementation and allogeneic bone grafting following intralesional curettage for GCT.\n\n\nMETHODS\nMedline, EMBASE, Google Scholar, and Cochrane databases were searched for studies reporting GCT of bone treatment with PMMA cementation and/or bone grafting with or without adjuvant therapy following intralesional curettage of primary GCTs. Pooled risk ratios and 95% confidence intervals (CIs) for local recurrence risks were calculated by fixed-effects methods.\n\n\nRESULTS\nOf 1,690 relevant titles, 6 eligible studies (1,293 patients) spanning March 2008 to December 2011 were identified in published data. Treatment outcomes of PMMA-only (n = 374), bone graft-only (n = 436), PMMA with or without adjuvant (PMMA + adjuvant; n = 594), and bone graft filling with or without adjuvant (bone graft + adjuvant; n = 699) were compared. Bone graft-only patients exhibited higher recurrence rates than PMMA-treated patients (RR 2.09, 95% CI (1.64, 2.66), Overall effect: Z = 6.00; P <0.001), and bone graft + adjuvant patients exhibited higher recurrence rates than PMMA + adjuvant patients (RR 1.66, 95% CI (1.21, 2.28), Overall effect: Z = 3.15, P = 0.002).\n\n\nCONCLUSIONS\nLocal recurrence was minimal in PMMA cementation patients, suggesting that PMMA is preferable for routine clinical restructuring in eligible GCT patients. Relationships between tumor characteristics, other modern adjuvants, and recurrence require further exploration.","cites":"3","conferencePercentile":"80.55555556"},{"venue":"World journal of surgical oncology","id":"c6a11ad79687dc6567f7af7e6299854c4a40412c","venue_1":"World journal of surgical oncology","year":"2012","title":"Synovial sarcoma of the buttocks presenting with a non-healing wound and rapid progression after local resection: a case report","authors":"Hai-Yan Zhang, Ye Feng, Zhuo Zhang, Ge Gao, Ji-Sheng Zhao","author_ids":"7214551, 1799421, 5119903, 1781117, 6655619","abstract":"Synovial sarcoma is a malignant mesenchymal neoplasm that is frequently misdiagnosed as a benign condition because of its small size, slow growth, and well-delineated appearance. Rapid spread and early death occur rarely. Here we report a case of synovial sarcoma of the buttocks presenting with a non-healing wound and rapid progression after local resection in a 23-year-old woman. She initially found a slightly painful subcutaneous mass in the left buttock and underwent local excision. Postoperatively, she developed a non-healing wound that did not respond to conventional antibiotic therapy and local wound care, and pitting edema of the lower extremities. A magnetic resonance imaging scan revealed a large heterogeneous, irregular mass in the buttocks with regional lymph node involvement. Histological and immunohistochemical analyses suggested the diagnosis of a poorly differentiated synovial sarcoma. Her condition deteriorated dramatically shortly thereafter; she developed systemic edema and died of respiratory failure. This case suggests that synovial sarcoma may be fatal within months of recognition if improperly managed and stresses the importance of adequate pre-surgical evaluation and postoperative pathological analysis in the management of a subcutaneous mass.","cites":"0","conferencePercentile":"15.94982079"},{"venue":"World journal of surgical oncology","id":"80ad044bbb828d4f2558a1e29625eb7a7490e771","venue_1":"World journal of surgical oncology","year":"2011","title":"Video-assisted thoracoscopic surgery is more favorable than thoracotomy for administration of adjuvant chemotherapy after lobectomy for non-small cell lung cancer","authors":"Guanchao Jiang, Fan Yang, Xiao Li, Jun Liu, Jianfeng Li, Hui Zhao, Yun Li, Jun Wang","author_ids":"3766799, 1752128, 1723588, 1843598, 8549636, 3525831, 1724845, 2054174","abstract":"BACKGROUND\nVideo-assisted thoracoscopic surgery (VATS) lobectomy is a newly developed type of surgery for lung cancer and has been demonstrated obvious minimally-invasive advantages compared with traditional thoracotomy. Theoretically, that less trauma leads to quicker recovery and may facilitate administration of adjuvant chemotherapy. We tested this hypothesis in this study.\n\n\nMETHODS\nOne hundred and ten NSCLC patients underwent lobectomy and adjuvant chemotherapy from June 2004 to June 2010 was analyzed. The baseline characteristic criteria, variables related to surgery and accomplishing status of chemotherapy were analyzed.\n\n\nRESULTS\nAll 110 patients underwent lobectomy through VATS (n = 54) or thracotomy (n = 56) and adjuvant chemotherapy. There was no significant difference in patients' age, preoperative pulmonary function, co-morbidity, pathologic staging between the two groups, whereas, blood loss, operation time and postoperative complications, chest tube duration and length of stay were less in VATS group. There were no significant differences in time to initiation chemotherapy. Cases in VATS group received more cycles of chemotherapy (3.6 vs. 3.0, p = 0.002). A higher proportion of patients received full dose on schedule in VATS group (57.4% vs. 33.9%, p = 0.013) and a higher proportion of patients completed ≥75% planed dose, (88.9% vs. 71.4%, p = 0.022); slightly higher proportion of patients in thoracotomy group had grade 3 or more toxicity (20.4% vs. 35.7%, p = 0.074).\n\n\nCONCLUSIONS\nPatients underwent lobectomy by VATS have better compliance and fewer delayed or reduced dose on adjuvant chemotherapy than those by thoracotomy.","cites":"2","conferencePercentile":"65"},{"venue":"World journal of surgical oncology","id":"e327bf141a087cda0595c90baf3493d6a775c173","venue_1":"World journal of surgical oncology","year":"2015","title":"Laparoscopic total pelvic exenteration for pelvic malignancies: the technique and short-time outcome of 11 cases","authors":"Kunlin Yang, Lin Cai, Lin Yao, Zheng Zhang, Cuijian Zhang, Xin Wang, Jianqiang Tang, Xuesong Li, Zhisong He, Liqun Zhou","author_ids":"5348121, 1809875, 1708162, 1726441, 6906938, 1736408, 2215178, 7824647, 6804332, 5162606","abstract":"BACKGROUND\nPrevious reports about laparoscopic total pelvic exenteration (LTPE) are still limited. In the present study, we described our single-center experience of the initial 11 cases.\n\n\nMETHODS\nBetween April 2011 and September 2015, eight males and three females diagnosed as pelvic malignancies underwent LTPE by the same operation team. We retrospectively collected all cases' parameters about surgical technique. Thirty-seven patients who received open surgery were also retrospectively collected. A comparison between LTPE and open surgery was performed to evaluate the feasibility and safety of LTPE.\n\n\nRESULTS\nEleven cases successfully underwent the LTPE without any intraoperative complication. No open conversion was required. Eight patients underwent Bricker's procedure. Three patients were performed with the cutaneous ureterostomy. Anus preservation operation was performed in three patients. Compared with open surgery, LTPE had longer mean operative time (565.2 vs 468.2 min, p = 0.004) but less mean blood loss (547.3 vs 1033.0 ml, p < 0.001) and shorter postoperative hospitalization time (15.3 vs 22.4 days, p = 0.004). One patient died of pulmonary embolism in the 7th month of follow-up time. One patient died of recurrence in the 12th month of follow-up time. Nine patients are still alive without recurrence and metastasis. The mean follow-up time was 11.1 months.\n\n\nCONCLUSIONS\nThe technique of LTPE seems to be feasible and safe in the treatment of carefully selected patients of pelvic malignancies. LTPE can also decrease the blood loss, the recovery time, and the hospital stay. But the oncological safety and long-term outcome of LTPE still need to be explored.","cites":"1","conferencePercentile":"78.2729805"},{"venue":"World journal of surgical oncology","id":"a7d60761bfbfd369dd7976992e1bd56228b4644b","venue_1":"World journal of surgical oncology","year":"2016","title":"Comparison between completely and traditionally retroperitoneoscopic nephroureterectomy for upper tract urothelial cancer","authors":"Lin Yao, Kunlin Yang, Xuesong Li, Zheng Zhang, Cuijian Zhang, Kan Gong, Zhijun Xi, Zhisong He, Liqun Zhou","author_ids":"1708162, 5348121, 7824647, 1726441, 6906938, 4124555, 3683450, 6804332, 5162606","abstract":"BACKGROUND\nTo evaluate the safety and efficacy of the completely retroperitoneoscopic nephroureterectomy (CRNU), a retrospectively comparative study between completely and traditionally retroperitoneoscopic nephroureterectomy (TRNU) was done in a single center.\n\n\nMETHODS\nFrom January 2014 to December 2014, 107 patients with upper tract urothelial cancer (UTUC) underwent CRNU. The kidney was retroperitoneoscopically dissected and the bladder cuff was cut by endoscopic gastrointestinal automatic stapler, and the specimen was removed from a 6-cm incision by posterior axillary line. Demographic, perioperative, and follow-up data were collected and compared retrospectively with 110 patients undergoing TRNU.\n\n\nRESULTS\nThe patients' characteristics between the two groups were not statistically different (p > 0.05), and all patients successfully received the procedure. The mean operative time (106 ± 37.9 versus 199 ± 69.1 min, p < 0.0001), the mean estimated blood loss (47.2 ± 82.4 versus 166.9 ± 250.9 ml, p = 0.002), and the mean hospital stay (6.1 ± 3.5 versus 8.1 ± 3.3 days, p = 0.03) of the CRNU group decreased significantly compared to the traditional group. The operative time was not affected by gender. No open conversion and major complications occurred. The surgical margin of the ureter was all negative. The mean follow-up time was 13.4 months for the CRNU group and 37.5 months for the TRNU group. All follow-up patients in the CRNU group were alive without local recurrence. No cases of port site metastasis and local recurrence were observed in both groups. Bladder tumor recurrence occurred in 4 patients of the CRNU group and 21 patients of the TRNU group.\n\n\nCONCLUSIONS\nThe CRNU using an endoscopic gastrointestinal automatic stapler to manage the bladder cuff is feasible and advantageous in decreasing the operative time, the blood loss, and the hospital stay. However, a larger sample and longer follow-up time will be still required.","cites":"0","conferencePercentile":"47.2"},{"venue":"World journal of surgical oncology","id":"d9a70108a69f9016af9fe1dc1aea8d341775e4cd","venue_1":"World journal of surgical oncology","year":"2014","title":"Is laparoscopic colorectal cancer surgery associated with an increased risk in obese patients? A retrospective study from China","authors":"Xiang Xia, Chen Huang, Tao Jiang, Gang Cen, Jun Cao, Kejian Huang, Zhengjun Qiu","author_ids":"4893825, 2484006, 1729545, 6117753, 5625152, 6329980, 3019685","abstract":"BACKGROUND\nThe impact of obesity on surgical outcomes after laparoscopic colorectal cancer resection in Chinese patients is still unclear.\n\n\nMETHODS\nWe retrospectively reviewed the prospectively collected data from 527 consecutive colorectal cancer patients who under went laparoscopic resection from January 2008 to September 2013. Patients were categorized into three groups: nonobese (body mass index (BMI) <25.0 kg/m2), obese I (BMI 25.0 = to 29.9 kg/m2) and obese II (BMI ≥30.0 kg/m2). Clinical characteristics, surgical outcomes and postoperative complications were compared between nonobese, obese I and obese II patients.\n\n\nRESULTS\nFrom among the 527 patients, there were 371 patients with in the nonobese group, 142 patients in the obese I group and 14 patients in the obese II group. The patients were well-matched for age, sex and American Society of Anesthesiologists class, except for BMI (P = 0.001). The median operative time correlated highly significantly with increasing weight (median: nonobese = 135 minutes, obese I = 145 minutes, obese II = 162.5 minutes; P = 0.001). There appeared to be a slight tendency toward grade III complications (rated according to the Clavien-Dindo Classification of Surgical Complications) in the obese II group, but this difference was not significant (nonobese = 5.1%, obese I = 3.5% and obese II = 14.3%; P = 0.178). None of the grade III complications which occurred in the obese II group were wound dehiscences that required a stitch. Other aspects, such as estimated blood loss, harvested lymph nodes, operation type, pathological results, conversion rate and overall postoperative complications, were not statistically significant.\n\n\nCONCLUSION\nWith sufficient experience, laparoscopic colorectal cancer surgery is feasible and safe in obese Chinese patients.","cites":"0","conferencePercentile":"24.24623116"},{"venue":"World journal of surgical oncology","id":"d2828c7a018c696bfef5c1a57069b5000d8d9cbf","venue_1":"World journal of surgical oncology","year":"2015","title":"Hepatitis C virus infection and the risk of intrahepatic cholangiocarcinoma and extrahepatic cholangiocarcinoma: evidence from a systematic review and meta-analysis of 16 case-control studies","authors":"Hao Li, Bin Hu, Zun-Qiang Zhou, Jiao Guan, Zheng-Yun Zhang, Guang-Wen Zhou","author_ids":"1706574, 1702845, 8525927, 7444076, 5040837, 8383873","abstract":"BACKGROUND\nStudies investigating the association between hepatitis C virus (HCV) infections and the occurrence of cholangiocarcinoma (CCA), especially intrahepatic cholangiocarcinoma (ICC), have shown inconsistent findings. Although previous meta-analyses referred to HCV and CCA, they mainly focused on ICC rather than CCA or extrahepatic cholangiocarcinoma (ECC). Since then, relevant new studies have been published on the association between HCV and ICC. Since the different anatomic locations of CCA have distinct epidemiologic features and different risk factors, it is necessary to evaluate the relationship between HCV infection and ICC, ECC, and CCA.\n\n\nMETHODS\nRelevant studies were identified by searching PUBMED, EMBASE, and MEDLINE databases prior to 1 August 2013. Pooled risk estimates were calculated with random-effects models using STATA 11.0.\n\n\nRESULTS\nA total of 16 case-control studies were included in the final analysis. Pooled risk estimates showed a statistically significant increasing risk of CCA (odds ratio (OR) = 5.44, 95% CI, 2.72 to 10.89). The pooled risk estimate of ICC (OR = 3.38, 95% CI, 2.72 to 4.21) was higher than that of ECC (OR = 1.75, 95% CI, 1.00 to 3.05). In a subgroup analysis, the pooled risk estimate of ICC in studies from North America was obviously higher than in Asia (6.48 versus 2.01). The Begg funnel plot and Egger test showed no evidence of publication bias.\n\n\nCONCLUSIONS\nHCV infection is associated with the increasing risk of CCA, especially ICC.","cites":"1","conferencePercentile":"78.2729805"},{"venue":"World journal of surgical oncology","id":"6e99554e706ccab51670441cc761a43e5681e443","venue_1":"World journal of surgical oncology","year":"2013","title":"A retrospective study: platinum-based induction chemotherapy combined with gemcitabine or paclitaxel for stage IIB-IIIA central non-small-cell lung cancer","authors":"Chao Lv, Yuanyuan Ma, Nan Wu, Shi Yan, Qingfeng Zheng, Yu Sun, Shaolei Li, Jian Fang, Yue Yang","author_ids":"6095779, 1815662, 2189977, 1747216, 7791092, 1742506, 3936695, 7295296, 1983143","abstract":"BACKGROUND\nSeveral encouraging phase III clinical trials have evaluated platinum-based induction chemotherapy against stage IIB-IIIA non-small-cell lung cancer (NSCLC). Chemotherapy efficacy was assessed using common regimens in this retrospective analysis.\n\n\nMETHODS\nFrom 2007 to 2011, the clinical records of stage IIB-IIIA NSCLC patients undergoing surgery after neoadjuvant chemotherapy were reviewed. Gathered data were tested for significance and variables impacting survival were assessed by univariate and Cox regression analyses.\n\n\nRESULTS\nOverall, 84% of patients were male and 93% had central disease. Platinum-based chemotherapy protocols with gemcitabine or paclitaxel gave an overall response rate of 55% (45/82) and 6.1% pathological complete response (5/82). Clinical response was unassociated with regimen or histology, while more pneumonectomies were performed in the stable compared to partial response disease group (P =0.040). Postoperative mortality was 1.2% (1/82), and complications, unassociated with regimen or histology, were atelectasis (26.8%) and supraventricular arrhythmias (13.4%). Right-sided procedures appeared to increase the incidence of bronchopleural fistula (P =0.073). The median disease-free survival time was 18 months and median overall survival time was not reached. Disease-free survival rates at one, two, and three years were 54%, 47%, and 33%, while the overall survival rate was 73%, 69%, and 59%, respectively. Disease-free survival predictors were radiographic response and mediastinal lymphadenopathy before chemotherapy (P =0.012 and 0.002, respectively).\n\n\nCONCLUSIONS\nTwo cycles of platinum-based chemotherapy with gemcitabine or paclitaxel is efficacious for patients with stage IIB-IIIA central disease. Patients achieving clinical response had improved disease-free survival times, while those with mediastinal lymphadenopathy had a higher postoperative recurrence risk.","cites":"0","conferencePercentile":"15.03267974"},{"venue":"World journal of surgical oncology","id":"8382f7289850230a03de61c07b84df9d5ae0f84b","venue_1":"World journal of surgical oncology","year":"2005","title":"Surgical management of abdominal and retroperitoneal Castleman's disease","authors":"Pascal Bucher, Gilles Chassot, Guillaume Zufferey, Frederic Ris, Olivier Huber, Philippe Morel","author_ids":"8405688, 3798913, 2285445, 2327905, 2893133, 4811475","abstract":"BACKGROUND\nAbdominal and retroperitoneal Castleman's disease could present either as a localized disease or as a systemic disease. Castleman's disease is a lymphoid hyperplasia related to human Herpes virus type 8, which could have an aggressive behavior, similar to that of malignant lymphoid neoplasm mainly with the systemic type, or a benign one in its localized form.\n\n\nMETHODS\nThe authors report two cases of localized Castleman's disease in the retroperitoneal space and review the current and recent progress in the knowledge of this atypical disease.\n\n\nCASES PRESENTATION\nThe two patients were young healthy women presenting with a hyper vascular peri-renal mass suggestive of malignant tumor. Both have been resected in-toto. One of them had an extensive resection with nephrectomy, while the second had a kidney preserving surgery. Pathological examination revealed localized Castleman's disease and surgical margins were free of disease. Postoperative course was uneventful, and after more than 5-years of follow-up no recurrences have been observed.\n\n\nCONCLUSION\nLocalized Castleman's disease should be considered when facing a solid hypervascular abdominal or retroperitoneal mass. A better knowledge of this disorder and its characteristic would help surgeon to avoid unnecessarily extensive resection for this benign disorder when dealing with abdominal or retroperitoneal tumors. Surgical resection is curative for the localized form, when complete, while splenectomy could be indicated for the systemic form.","cites":"8","conferencePercentile":"91.54929577"},{"venue":"World journal of surgical oncology","id":"b5dc2dd008389616ecd0caf688b81ee3150a5608","venue_1":"World journal of surgical oncology","year":"2015","title":"Intracranial amelanotic melanoma: a case report with literature review","authors":"Jun Ma, Zhong Zhang, Shu Li, Xiaolin Chen, Shuo Wang","author_ids":"1683601, 3933060, 1809292, 2670823, 5994097","abstract":"BACKGROUND\nThe incidence of primary central nervous system (CNS) melanocytic neoplasms is relatively low comparing to systemic ones. The performance of the tumor is variable. With poor clinical experience, the diagnosis and treatment of such tumors present to be a challenge. Amelanotic melanoma is an especially rare subtype. Only several cases have been reported.\n\n\nCASE PRESENTATION\nWe report a case of intracranial amelanotic melanoma. Preoperative assessment revealed progressive right frontal mass. The patient underwent tumor resection. The pathologic analysis reported amelanotic melanoma of intermediate grade. The further examination of the whole brain and body was negative. The familial history was also negative. The patient recovered uneventfully and went on for radiotherapy and chemotherapy. After a follow-up period of 5 months, the patient was tumor-free.\n\n\nCONCLUSIONS\nThis is the second report about primary CNS amelanotic melanoma. We summarized characteristics of the primary CNS melanocytic lesions and amelanotic melanoma with review of the literature and review of cases of our department.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"b7beb518542d2b8dabfe497660d087b63354fdfe","venue_1":"World journal of surgical oncology","year":"2015","title":"Effect of the CCND1 A870G polymorphism on prostate cancer risk: a meta-analysis of 3,820 cases and 3,825 controls","authors":"Min Zheng, Lijun Wan, Xiang He, Xiaolong Qi, Feng Liu, Da-Hong Zhang","author_ids":"2250608, 7533403, 7792224, 7864869, 1734409, 8335452","abstract":"BACKGROUND\nCyclin D1 (CCND1) is critical in the transition of the cell cycle from the G1 to S phases, and unbalanced cell cycle regulation is a hallmark of carcinogenesis. Numerous epidemiological studies have evaluated the association between the CCND1 A870G polymorphism and the risk of prostate cancer (PCa). However, these studies have yielded conflicting results.\n\n\nMETHODS\nIn the present study, the possible association above was assessed by a meta-analysis. Eligible articles were identified for the period up to July 2014. Pooled odds ratios (ORs) with 95% confidence intervals (95% CI) were appropriately derived from fixed effects or random effects models.\n\n\nRESULTS\nA total of ten case-control studies, which included 3,820 cases and 3,825 controls, were identified. Overall, the allelic/genotypic association between the G870A polymorphism and prostate cancer was nonsignificant (OR = 1.045, 95% CI = 0.947 to 1.153 for A versus G, P = 0.380; OR = 1.088, 95% CI = 0.896 to 1.321 for AA versus GG, P = 0.393; OR = 1.044, 95% CI = 0.941 to 1.158 for GA versus GG, P = 0.414; OR = 1.053, 95% CI = 0.955 to 1.161 for the dominant model AA + GA versus GG, P = 0.303; OR = 1.072, 95% CI = 0.881 to 1.306 for the recessive model AA versus AA + GA, P = 0.486). Moreover, subgroup analyses according to ethnicity failed to demonstrate a significant association between this polymorphism and prostate cancer. In addition, we also performed a stratified analysis of cases with PCa metastasis, and the results supported the findings of no significant association between CCND1 A870G polymorphism and metastasis risk of PCa.\n\n\nCONCLUSIONS\nOur results suggest that the CCND1 A870G polymorphism might not be a potential candidate for predicting prostate cancer risk, including metastasis risk.","cites":"1","conferencePercentile":"78.2729805"},{"venue":"World journal of surgical oncology","id":"39d3e550a377f67b3e9ba23ec82d4f586e86658b","venue_1":"World journal of surgical oncology","year":"2013","title":"Correlation of bevacizumab-induced hypertension and outcomes of metastatic colorectal cancer patients treated with bevacizumab: a systematic review and meta-analysis","authors":"Jun Cai, Hong Ma, Fang Huang, Dichao Zhu, Jianping Bi, Yang Ke, Tao Zhang","author_ids":"5374726, 4204734, 3585972, 5801809, 5366957, 7760516, 1743147","abstract":"BACKGROUND\nWith the wide application of targeted drug therapies, the relevance of prognostic and predictive markers in patient selection has become increasingly important. Bevacizumab is commonly used in combination with chemotherapy in the treatment of metastatic colorectal cancer. However, there are currently no predictive or prognostic biomarkers for bevacizumab. Several clinical studies have evaluated bevacizumab-induced hypertension in patients with metastatic colorectal cancer. This meta-analysis was performed to better determine the association of bevacizumab-induced hypertension with outcome in patients with metastatic colorectal cancer, and to assess whether bevacizumab-induced hypertension can be used as a prognostic factor in these patients.\n\n\nMETHODS\nWe performed a systematic review and meta-analysis on seven published studies to investigate the relationship between hypertension and outcome of patients with metastatic colorectal cancer treated with bevacizumab. Our primary endpoint was progression-free survival (PFS). Secondary endpoints were overall survival (OS) and overall response rate (ORR). Hazard ratios (HRs) for PFS and OS were extracted from each trial, and the log of the relative risk ratio (RR) was estimated for ORR.\n\n\nRESULTS\nThe occurrence of bevacizumab-induced hypertension in patients was highly associated with improvements in PFS (HR = 0.57, 95% CI: 0.46-0.72; P <0.001), OS (HR = 0.50; 95% CI: 0.37-0.68; P <0.001), and ORR (RR = 1.57, 95% CI: 1.07-2.30, P <0.05), as compared to patients without hypertension.\n\n\nCONCLUSIONS\nBevacizumab-induced hypertension may represent a prognostic factor in patients with metastatic colorectal cancer.","cites":"5","conferencePercentile":"93.62745098"},{"venue":"World journal of surgical oncology","id":"da5f63a668f2bacb3b08adbfbc8671f476f1f245","venue_1":"World journal of surgical oncology","year":"2014","title":"Primary synovial sarcoma of the prostate metastatic to the liver and lung: a case report","authors":"Qi Zhang, Huiju Wang, Ligang Ren, Xiaolong Qi, Feng Liu, Dahong Zhang","author_ids":"4672028, 4656502, 6199770, 7864869, 1734409, 8335639","abstract":"Primary synovial sarcoma of the prostate is an uncommon malignant tumor. There are few cases reported in the English medical literature to date. Here, we present a case of 22-year-old man with primary synovial sarcoma of the prostate metastatic to the liver and lung. To our knowledge, only six reports of synovial sarcoma involving the prostate have been previously published. We also reviewed the previous treatments and prognoses in previous case reports and evaluate the proper treatment for this disease.","cites":"1","conferencePercentile":"62.68844221"},{"venue":"World journal of surgical oncology","id":"bdd7d6f53ac50b481c5afb427abb00c0ec2982e7","venue_1":"World journal of surgical oncology","year":"2015","title":"Outcome using selective hemihepatic vascular occlusion and Pringle maneuver for hepatic resection of liver cavernous hemangioma","authors":"Minghao Li, Chunyan Zhang, Tao Zhang, Liyun Wang, Yang Ding, Zhanxue Niu, Saiwu He, Zhiqi Yang","author_ids":"8392632, 7923766, 1743147, 7974575, 7625474, 3747462, 3775915, 2891554","abstract":"BACKGROUND\nThough accumulated evidence proved the advantages of laparoscopic hepatectomy, bleeding still remains the most important challenge in clinical practice. Our study aimed to compare the outcomes of Pringle maneuver (PM) and selective hemihepatic vascular occlusion (SHVO) surgeries for patients with liver cavernous hemangioma (LCH).\n\n\nMETHODS\nThe SHVO (n = 26; mean age, 42) and PM (n = 78; mean age, 43) surgeries were performed in 104 LCH patients from January 2006 to January 2015. The intraoperative (bleeding, arterial pressure, oxyhemoglobin saturation, etc.) and postoperative parameters (anal exhaust time, complications, blood cell numbers, etc.) were measured and compared between the two groups. Liver function of all these patients was detected by blood test at 1-day preoperation, and at 1, 3, and 5 days postoperation.\n\n\nRESULTS\nBoth of the two surgeries were successfully performed without any mortality. The intraoperative systolic arterial pressure and pulse in PM group were much higher than that in SHVO group (P < 0.01). The postoperative liver function parameters such as alanine transaminase (ALT), aspartate transaminase (AST), and total bilirubin (TBIL) increased much more in the PM group than that in the SHVO group compared with preoperation results (P < 0.05). However, there were no statistical differences in intraoperative bleeding, blood transfusion, hepatic inflow occlusion time, oxygen saturation occlusion, anal exhaust time and incidence of complications between the two groups (P > 0.05).\n\n\nCONCLUSIONS\nSHVO is safer with less ischemia reperfusion injury than PM surgery for hemangioma resection on patients with LCH.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"9913270f31111deae0f233bc03db6a077403ba13","venue_1":"World journal of surgical oncology","year":"2014","title":"MicroRNA expression profiling and Notch1 and Notch2 expression in minimal deviation adenocarcinoma of uterine cervix","authors":"Heejeong Lee, Kyu Rae Kim, Nam Hoon Cho, Sung Ran Hong, Hoiseon Jeong, Sun Young Kwon, Kwang Hwa Park, Hee Jung An, Tae Heon Kim, Insun Kim, Hye Kyoung Yoon, Kwang Sun Suh, Ki Ouk Min, Hyun Joo Choi, Ji Young Park, Chong Woo Yoo, Youn Soo Lee, Hee Jin Lee, Weon Sun Lee, Chul Soo Park, Yonghee Lee","author_ids":"8385450, 5716899, 5066142, 6020172, 3836816, 3582843, 4675904, 4373592, 8248982, 5092512, 3725420, 3560723, 4315226, 7386933, 8289188, 6394262, 4360747, 4384340, 4059819, 5055148, 7856615","abstract":"BACKGROUND\nMicroRNA (miRNA) expression is known to be deregulated in cervical carcinomas. However, no data is available about the miRNA expression pattern for the minimal deviation adenocarcinoma (MDA) of uterine cervix. We sought to detect deregulated miRNAs in MDA in an attempt to find the most dependable miRNA or their combinations to understand their tumorigenesis pathway and to identify diagnostic or prognostic biomarkers. We also investigated the association between those miRNAs and their target genes, especially Notch1 and Notch2.\n\n\nMETHODS\nWe evaluated miRNA expression profiles via miRNA microarray and validated them using.real-time PCR assays with 24 formalin-fixed, paraffin-embedded tissue blocks of MDA and 11 normal proliferative endocervical tissues as control. Expression for Notch1 and 2 was assessed by immunohistochemistry.\n\n\nRESULTS\nMiRNA-135a-3p, 192-5p, 194-5p, and 494 were up-regulated, whereas miR-34b-5p, 204-5p, 299-5p, 424-5p, and 136-3p were down-regulated in MDA compared with normal proliferative endocervical tissues (all P<0.05). Considering the second-order Akaike Information Criterion consisting of likelihood ratio and number of parameters, miR-34b-5p showed the best discrimination power among the nine candidate miRNAs. A combined panel of miR-34b-5p and 194-5p was the best fit model to discriminate between MDA and control, revealing 100% sensitivity and specificity. Notch1 and Notch2, respective target genes of miR-34b-5p and miR-204-5p, were more frequently expressed in MDA than in control (63% vs. 18%; 52% vs. 18%, respectively, P<0.05). MiR-34b-5p expression level was higher in Notch1-negative samples compared with Notch1-positive ones (P<0.05). Down-regulated miR-494 was associated with poor patient survival (P=0.036).\n\n\nCONCLUSIONS\nMDA showed distinctive expression profiles of miRNAs, Notch1, and Notch2 from normal proliferative endocervical tissues. In particular, miR-34b-5p and 194-5p might be used as diagnostic biomarkers and miR-494 as a prognostic predictor for MDA. The miR-34b-5p/Notch1 pathway as well as Notch2 might be important oncogenic contributors to MDA.","cites":"1","conferencePercentile":"62.68844221"},{"venue":"World journal of surgical oncology","id":"fc8fcf23c7634f2c066ae87727e2caa8921394d7","venue_1":"World journal of surgical oncology","year":"2012","title":"Castleman disease mimicked pancreatic carcinoma: report of two cases","authors":"Hua Guo, Yan Shen, Wei-Lin Wang, Min Zhang, Hong Li, Ying-Sheng Wu, Sheng Yan, Xiao Xu, Jian Wu, Shu-Sen Zheng","author_ids":"2163229, 2044879, 7634785, 1770849, 4117903, 6725510, 2274178, 1993318, 1734550, 7149791","abstract":"Castleman disease (CD) is an uncommon benign lymphoproliferative disorder, which usually presents as solitary or multiple masses in the mediastinum. Peripancreatic CD was rarely reported. Herein, we report two cases of unicentric peripancreatic CD from our center. A 43-year-old man and a 58-year-old woman were detected to have a pancreatic mass in the routine medical examinations. Both of them were asymptomatic. The computed tomography and ultrasonographic examination revealed a mild enhancing solitary mass at the pancreatic head/neck. No definite preoperative diagnosis was established and Whipple operations were originally planned. The intraoperative frozen section diagnosis of both patients revealed lymphoproliferation. Then the local excisions of mass were performed. Histological examination revealed features of CD of hyaline-vascular type. No recurrence was found during the follow-up period. CD should be included in the differential diagnosis of pancreatic tumors. Local excision is a suitable surgical choice.","cites":"2","conferencePercentile":"62.54480287"},{"venue":"World journal of surgical oncology","id":"e26912398bddd543120fa4bb43e316513e043d2e","venue_1":"World journal of surgical oncology","year":"2016","title":"Reconstruction with double pedicel fibular graft and ankle arthrodesis for aggressive chondroblastoma in the distal tibia","authors":"Jian Fan, Shan-zhu Li, Jiong Mei, Guang-rong Yu","author_ids":"1762999, 4209614, 4399160, 7329438","abstract":"BACKGROUND\nAggressive chondroblastoma of the distal tibia is rare, and below-knee amputation had been the standard surgical procedure.\n\n\nCASE PRESENTATION\nWe reported an additional case and reviewed the existing literature. A 20-year-old man with a 2-month history of right ankle pain and swelling underwent distal tibia wide resection, double pedicle fibular, autogenous iliac bone graft, and ankle arthrodesis. He had no pain, no limitation in daily activities, and no evidence of local recurrence and infection; the Musculoskeletal Tumour Society Score (MSTS) is 86% at the final follow-up.\n\n\nCONCLUSIONS\nDouble pedicel fibular graft and ankle arthrodesis may be an effective and economical alternative method for aggressive chondroblastoma in the distal tibia.","cites":"0","conferencePercentile":"47.2"},{"venue":"World journal of surgical oncology","id":"bbc03ec8c698d23cb00ab5605b952b5fe1386815","venue_1":"World journal of surgical oncology","year":"2012","title":"Prognostic significance of solitary lymph node metastasis in patients with squamous cell carcinoma of middle thoracic esophagus","authors":"Jie Wu, Qi-Xun Chen, Xing-Ming Zhou, Wei-Ming Mao, Mark J Krasna, Li-Song Teng","author_ids":"1717209, 8560017, 8454262, 8306019, 3686999, 4777253","abstract":"BACKGROUND\nThe aim of this study is to compare clinical outcomes between patients with solitary lymph node metastasis and node-negative (N0) patients in squamous cell carcinoma of the middle thoracic esophagus.\n\n\nMETHODS\nA series of 135 patients with squamous cell carcinoma of the middle thoracic esophagus were retrospectively investigated. There were 33 patients with solitary lymph node metastasis and 102 N0 patients. Skip metastasis in 33 patients with solitary lymph node metastasis was defined according to three criteria: Japanese Society for Esophageal Disease (JSED), American Joint Commission on Cancer (AJCC), and the anatomical compartment.\n\n\nRESULTS\nIn 33 patients with solitary lymph node metastasis, skip metastasis was shown in 13, 23, and 8 patients according JSED, AJCC and anatomical compartment respectively. The 5-year survival rates for N0 patients and patients with solitary lymph node metastasis were 58% and 32% respectively (P =0.008). Multivariate analysis revealed that skip metastasis was not an independent prognostic factor.\n\n\nCONCLUSIONS\nFor patients with middle thoracic esophageal squamous cell carcinoma, solitary lymph node metastasis has a negative impact on survival compared with N0 disease; skip metastasis, however, is comparable to N0 diseases in predicting prognosis.","cites":"0","conferencePercentile":"15.94982079"},{"venue":"World journal of surgical oncology","id":"f8c0f7a9fb38c15ef7b2dad80636f03037602cdc","venue_1":"World journal of surgical oncology","year":"2014","title":"Assessment of quality of life in giant ameloblastoma adolescent patients who have had mandible defects reconstructed with a free fibula flap","authors":"Xiangru Li, Kuicheng Zhu, Fei Liu, Hongwen Li","author_ids":"1752449, 8419611, 1742065, 7179086","abstract":"BACKGROUND\nThe reconstruction of mandibular defects after giant ameloblastoma resection is one of the most challenging problems facing reconstructive surgeons. Mandibular resection has been associated with a poor quality of life (QOL), particularly in adolescent patients reconstructed with a free fibula flap. This study aims to evaluate QOL outcomes in adolescent patients who have had mandibular resections of giant ameloblastoma and reconstruction with a free fibula flap and to collect information about their socio-cultural situation.\n\n\nMETHODS\nThe present study assessed 45 adolescent patients who had undergone immediate mandible reconstruction with a free fibula flap for faint ameloblastoma using University of Washington Quality of Life (UW-QOL) and 14-item Oral Health Impact Profile (OHIP-14) questionnaires.\n\n\nRESULTS\nThirty-five of the 54 questionnaires were returned (64.81%). In the UW-QOL, of the twelve disease-specific domains, the best three scores from the patients related to pain, shoulder and appearance and the worst three scores related to chewing, anxiety and saliva. In the OHIP-14, the lowest-scoring domain was handicap, followed by physical pain and social disability.\n\n\nCONCLUSIONS\nMandibular reconstruction with a free fibular flap significantly influenced the adolescent patients' QOL. Adolescent patients pay more attention to postoperative facial appearance; this should be considered in surgical planning.","cites":"0","conferencePercentile":"24.24623116"},{"venue":"World journal of surgical oncology","id":"da44a45c089f5d682eea097b9ba6bc27fcde7506","venue_1":"World journal of surgical oncology","year":"2014","title":"Inflammatory myofibroblastic tumor of the thigh without bone involvement: a case report","authors":"Jun Lin, Hao Liu, Yin Zhuang, Peng Yang, Yifei Zheng, Yan Yang, Huilin Yang","author_ids":"1689752, 4087368, 4690310, 1683829, 1832277, 5870360, 5977946","abstract":"Inflammatory myofibroblastic tumors are rare, and those located in the extremities without bone involvement are even rarer. We present the case of a 61-year-old Chinese male patient with an inflammatory myofibroblastic tumor of the right thigh. It was excised and a histopathologic examination revealed an inflammatory myofibroblastic tumor. This case is presented by virtue of its rare location.","cites":"1","conferencePercentile":"62.68844221"},{"venue":"World journal of surgical oncology","id":"48ed959118f8dd9f22765e32a6710284751db7e2","venue_1":"World journal of surgical oncology","year":"2015","title":"An automatically contamination-avoiding technique for intracorporeal esophagojejunostomy using a transorally inserted anvil during laparoscopic total gastrectomy for gastric cancer","authors":"Yan-Feng Hu, Da Wang, Tian Lin, Ting-Yu Mou, Hao Liu, Tao Chen, Zhen-Wei Deng, Xin Lu, Jiang Yu, Guo-Xin Li","author_ids":"7741403, 5493661, 2528206, 6469575, 4087368, 4725884, 5062290, 1706990, 6195151, 7230047","abstract":"BACKGROUND\nIntracorporeal Roux-en-Y esophagojejunostomy during laparoscopic total gastrectomy for gastric cancer remains a challenging manipulation due to the uncontrolled direction of the jejunal side or unintended embedded tissues, although several methods have been introduced. In this study, we simplified the procedure based on a surgical string fixing technique using a transorally inserted anvil (OrVil™; Covidien Ltd., Mansfield, MA, USA).\n\n\nMETHODS\nFrom March 2012 to September 2013, 14 consecutive patients underwent simplified intracorporeal Roux-en-Y esophagojejunostomy using OrVil™ during laparoscopic total gastrectomy for gastric cancer at our hospital. Clinicopathologic characteristics and surgical outcomes of these patients were retrospectively analyzed.\n\n\nRESULTS\nAll of the procedures were successful completed with no complication or conversion to open surgery. The mean overall operative time was 193.8 ± 41.8 min, whereas the mean reconstruction time was 32.6 ± 4.6 min. The mean estimated blood loss was 105.7 ± 65.4 ml. The mean diameter of anastomosis measured by upper gastrointestinal contrast X-ray test at 1 month after operation was 2.3 cm. During a median follow-up period of 12 months, neither local recurrence nor anastomosis-related morbidity was observed.\n\n\nCONCLUSIONS\nOur preliminary results suggested that this automatically contamination-avoiding technique based on a surgical-string-fixing strategy using OrVil™ during laparoscopic total gastrectomy for gastric cancer might be feasible and safe and provide a simple solution for intracorporeal Roux-en-Y esophagojejunostomy.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"8977f782b6da1ef337c490536da671eb0b9cee6c","venue_1":"World journal of surgical oncology","year":"2013","title":"A retrospective analysis on the diagnostic value of ultrasound-guided percutaneous biopsy for peritoneal lesions","authors":"Jianhong Wang, Liucun Gao, Shanhong Tang, Tao Li, Yiming Lei, Huahong Xie, Jie Liang, Baojun Chen, Xian Wang, Daiming Fan","author_ids":"1726898, 4743413, 6717748, 1726351, 3782243, 5011166, 1805696, 3040609, 1715536, 5476384","abstract":"BACKGROUND\nRoutine examinations have a low specificity and a low positive rate for the diagnosis of peritoneal lesions. This study aimed to evaluate the diagnostic value and safety of ultrasound-guided percutaneous peritoneal lesion biopsies in patients with ascites and/or abdominal distension with unclear causes.\n\n\nMETHODS\nA retrospective analysis was performed in 153 consecutive patients with ascites and/or abdominal distension with unclear causes. All of the patients showed abnormalities of the peritoneum or greater omentum after ultrasonography, and underwent ultrasound-guided percutaneous biopsies using a Bard auto-biopsy gun with 18- or 16-gauge biopsy needles.\n\n\nRESULTS\nThe success rate of the procedures was 100% (153/153) and the satisfaction rate of the tissue specimens in the biopsy was 91.5% (140/153). A specific histopathological diagnosis was made in 142 out of 153 patients, with an overall diagnostic accuracy of 92.8%. Among the diagnosed patients, 62 were peritoneal metastatic adenocarcinoma, 49 were peritoneal tuberculosis, 11 were peritoneal malignant mesothelioma, 8 were chronic peritoneal infections, 7 were pseudomyxoma peritonei, and 5 were primary peritoneal lymphoma. Only 11 patients did not get a pathologic diagnosis due to the lack of sufficient tissue specimen. No serious complications occurred.\n\n\nCONCLUSIONS\nUltrasound-guided percutaneous biopsy could be a simple, safe and accurate diagnostic method in patients with ascites and/or abdominal distension with unclear causes.","cites":"1","conferencePercentile":"43.62745098"},{"venue":"World journal of surgical oncology","id":"85e6790076b8bb94b18a679d1aa7abde98627932","venue_1":"World journal of surgical oncology","year":"2015","title":"Surgical outcomes in patients with locally advanced gastric cancer treated with S-1 and oxaliplatin as neoadjuvant chemotherapy","authors":"Daofu Feng, Meiha Leong, Ting Li, Lin Chen, Tao Li","author_ids":"6853633, 6617743, 8711202, 3408572, 1726351","abstract":"BACKGROUND\nWe wished to evaluate the impact of S-1 combined with oxaliplatin (SOX regimen) as neoadjuvant chemotherapy on surgical outcomes after gastrectomy with D2 lymphadenectomy.\n\n\nMETHODS\nFrom February 2012 to September 2013, 170 patients with American Joint Committee on Cancer (AJCC) stage II-III gastric cancer were assessed retrospectively. Eighty patients underwent neoadjuvant chemotherapy before radical gastrectomy, and 90 patients received surgical treatment with adjuvant chemotherapy. Patients received S-1 (80 mg/m(2)/day; days 1-14) and oxaliplatin (130 mg/m(2); day 1) as neoadjuvant or adjuvant chemotherapy, and this schedule was repeated every 3 weeks. Gastrectomy with D2 lymphadenectomy was standard therapy for each patient. Surgical outcomes between the two groups were analyzed statistically.\n\n\nRESULTS\nThere was no significant difference in the total prevalence of complications between neoadjuvant and adjuvant groups (18.8% vs. 22.2%, P = 0.704). The most common postoperative complications were surgical site infection (6.5%) and gastrointestinal motility disorders (3.5%). The clinical response rate was 68.8%, and ten patients (12.5%) had a pathological complete response after neoadjuvant chemotherapy. The SOX regimen as neoadjuvant chemotherapy for AJCC stage II/III gastric cancer can be effective without increasing the risk of postoperative complications.\n\n\nCONCLUSIONS\nThe SOX regimen could be a neoadjuvant chemotherapy for advanced gastric cancer worldwide in the future.","cites":"1","conferencePercentile":"78.2729805"},{"venue":"World journal of surgical oncology","id":"49c84ba17dd2a60f50bb3453d12f0ff1b51c4059","venue_1":"World journal of surgical oncology","year":"2014","title":"Diagnosis and treatment of pancreatic metastases in 22 patients: a retrospective study","authors":"Shao-Wei Song, Jun-Feng Cheng, Ning Liu, Ting-Han Zhao","author_ids":"6446982, 7437958, 1680152, 5889811","abstract":"BACKGROUND\nPancreatic metastases (PMs) are rare and lack of guidelines for diagnosis and treatments .The aim of this study is to explore the diagnosis, treatment, and prognosis of pancreatic metastases.\n\n\nMETHODS\nTwenty-two patients with pancreatic metastases who had been hospitalized at the First Affiliated Hospital of China Medical University from October 1980 to October 2012 were included in the present retrospective study. Seven patients had gastric cancer, five had colon cancer, two each had lung and liver cancer, and one each had bladder cancer, gallbladder cancer, breast cancer, nasopharyngeal cancer, renal cell carcinoma, and carcinoid.\n\n\nRESULTS\nNo specific syndrome or imageological change was found for the pancreatic metastases. The most common symptoms were abdominal pain and jaundice. Hypo-echoic lesions with well-defined margins were found on ultrasonic examinations, and low-density lesions with heterogeneous enhancement were identified in CT images. Nineteen of the 22 received treatment. Three of the 8 patients (34.1%) that had undergone operation experienced complications, but all patients recovered after conventional treatment. Follow-up studies were performed for 17 patients (77.3%), and the median survival time from the diagnosis of pancreatic metastases was 13.2 months (range, 2 to 68 months). Of the five patients who underwent radical resection, one was lost to follow-up, one died at fifteen months postoperation, and the other three are still alive and free from disease (disease-free survival ranging from five to thirty-three months from the diagnosis of the pancreatic metastases).\n\n\nCONCLUSION\nPancreatic metastases are rare lesions with no specific symptoms. Radical resection should be performed if possible; however, aggressive treatment should be performed for unresectable pancreatic metastases.","cites":"0","conferencePercentile":"24.24623116"},{"venue":"World journal of surgical oncology","id":"e2ba2c633103a5ea28ded4b5d04dbe5551c8a399","venue_1":"World journal of surgical oncology","year":"2014","title":"Free posterior tibial flap reconstruction for hypopharyngeal squamous cell carcinoma","authors":"Fei Chen, Jun Liu, Lihong Wang, Dan Lv, Yuanzhi Zhu, Qi Wu, Guojun Li, Hongliang Zheng, Xiaofeng Tao","author_ids":"2861400, 1843598, 7974418, 5342076, 4914912, 4524248, 2493736, 2270946, 5366667","abstract":"OBJECTIVES\nThe aim of this article was to determine outcomes in patients with squamous cell carcinoma of the hypopharynx (SCCHP) in whom the free posterior tibial flap was used for primary reconstruction of hypopharynx defects after cancer resection.\n\n\nSUBJECTS AND METHODS\nBetween August 2009 and February 2012, 10 patients with SCCHP underwent posterior tibial flap reconstruction for hypopharynx defects. The corresponding clinical data were retrospectively collected and analyzed.\n\n\nRESULTS\nDespite the multistep and time-consuming procedure, the posterior tibial flap survival rate was 100%. Operation-induced complications did not occur in four patients. Six patients developed postoperative hypoproteinemia, four patients developed postoperative pulmonary infections, and four patients developed pharyngeal fistula. The pharyngeal and laryngeal functions of all patients were preserved.\n\n\nCONCLUSION\nOur experience demonstrates that the posterior tibial flap is a safe and reliable choice for the reconstruction of hypopharynx defects.","cites":"0","conferencePercentile":"24.24623116"},{"venue":"World journal of surgical oncology","id":"209c62979e2347f03c5ee7d63008dd80fd50837a","venue_1":"World journal of surgical oncology","year":"2014","title":"Partial hepatectomy for primary hepatic melanoma: a report of two cases and review of the literature","authors":"Yuhua Zhang, Zhiming Hu, Weiding Wu, Jie Liu, Defei Hong, Chengwu Zhang","author_ids":"7549071, 2612034, 5203832, 1699746, 7156376, 7923754","abstract":"Malignant melanoma is an extremely aggressive cancer arising from melanocytes, associated with the development of metastases in up to 20% of patients. Although the liver is a frequent metastatic site of malignant melanoma, primary hepatic melanoma (PHM) is rare. The treatment of PHM is controversial, and the prognosis for affected patients remains poor. We present two PHM patients who underwent partial hepatectomy at our institution and review the clinical and pathological data from these cases. Our results suggest that it is difficult to make a preoperative diagnosis of PHM without pathological results. For patients with resectable PHM, surgical resection is a potentially curative treatment.","cites":"0","conferencePercentile":"24.24623116"},{"venue":"World journal of surgical oncology","id":"eac9343a3d39b10f2f52cb034c5aea5106518480","venue_1":"World journal of surgical oncology","year":"2013","title":"CDK-associated Cullin 1 can promote cell proliferation and inhibit cisplatin-induced apoptosis in the AGS gastric cancer cell line","authors":"Qi Zheng, Ling-Yu Zhao, Ying Kong, Ke-Jun Nan, Yu Yao, Zi-Jun Liao","author_ids":"3838610, 7900652, 7218852, 4471120, 1770435, 7901786","abstract":"BACKGROUND\nGastric cancer is a common and highly lethal malignancy in the world, but its pathogenesis remains elusive. In this study, we focus on the biological functions of CDK-associated Cullin1 (CAC1), a novel gene of the cullin family, in gastric cancer, which may help us to further understand the origin of this malignancy.\n\n\nMETHODS\nThe AGS and MGC803 gastric cancer cell lines and the GES-1 gastric mucosa cell line were selected for study. At first, CAC1 expressions of those cell lines were examined by quantitative real-time reverse transcription polymerase chain reaction (qRT-PCR) and western blot examinations, then CAC1 small interfering RNA (CAC1-siRNA) were designed and transfected into the AGS cell line with a relatively high level of CAC1. Once CAC1 was silenced, a series of biological characteristics of AGS cells such as cell proliferation, cell cycle, apoptosis, and expressions of apoptosis-related genes (P53, BCL2 and BAX) were determined by MTT, flow cytometry, qRT-PCR and western blot, respectively.\n\n\nRESULTS\nCAC1 expression of AGS or MGC803 was much higher than that of GES-1. After CAC1 expression was effectively depressed by RNA interference in AGS cells, significant cell growth inhibition occurred. Furthermore, the proportion of cells treated with CAC1-siRNA increased in the G1 phase and decreased in the S phase, indicative of G1 cell cycle arrest. More importantly, the proportions of early/late apoptosis in AGS cells were enhanced with cis-diaminedichloroplatinum (cisplatin, CDDP) treatment, but to a higher extent with cisplatin plus CAC1-siRNA. Interestingly, BCL2 mRNA copies showed about a 30% decrease in the cisplatin group, but dropped by around 60% in the cisplatin plus CAC1-siRNA group. Conversely, the P53 mRNA expressions obtained nearly a two-fold increase in the cisplatin group, in addition to a five-fold increase in the cisplatin plus CAC1-siRNA group, and the BAX mRNA levels had almost a two- and four-fold augmentation, respectively. Meanwhile, P53, BAX and BCL2 showed the same alteration patterns in western blot examinations.\n\n\nCONCLUSIONS\nCAC1 can promote cell proliferation in the AGS gastric cancer cell line. Moreover, it can prevent AGS cells from experiencing cisplatin-induced apoptosis via modulating expressions of P53, BCL2 and BAX.","cites":"3","conferencePercentile":"80.55555556"},{"venue":"World journal of surgical oncology","id":"2a1401a3b3087f4e8e0d5c0e183263c3f87797a6","venue_1":"World journal of surgical oncology","year":"2015","title":"Phytoestrogens and risk of prostate cancer: a meta-analysis of observational studies","authors":"Jinjing He, Shuai Wang, Mi Zhou, Weiwen Yu, Yuelong Zhang, Xiang He","author_ids":"3913329, 3804894, 6739484, 5758197, 5416226, 7792224","abstract":"BACKGROUND\nEpidemiologic studies have reported various results relating phytoestrogens to prostate cancer (PCa). The aim of this study was to provide a comprehensive meta-analysis on the extent of the possible association between phytoestrogens (including consumption and serum concentration) and the risk of PCa.\n\n\nMETHODS\nEligible studies were retrieved via both computer searches and review of references. The summary relative risk ratio (RR) or odds ratio (OR) and 95% confidence interval (CI) were calculated with random effects models.\n\n\nRESULTS\nA total of 11 studies (2 cohort and 9 case-control studies) on phytoestrogen intake and 8 studies on serum concentration were included in the meta-analysis. The pooled odds ratio (OR) showed a significant influence of the highest phytoestrogens consumption (OR 0.80, 95% CI 0.70-0.91) and serum concentration (OR 0.83, 95% CI 0.70-0.99) on the risk of PCa. In stratified analysis, high genistein and daidzein intake and increased serum concentration of enterolactone were associated with a significant reduced risk of PCa. However, no significant associations were observed for isoflavone intake, lignans intake, or serum concentrations of genistein, daidzein, or equol.\n\n\nCONCLUSIONS\nThe overall current literature suggests that phytoestrogen intake is associated with a decreased risk of PCa, especially genistein and daidzein intake. Increased serum concentration of enterolactone was also associated with a significant reduced risk of PCa. Further efforts should be made to clarify the underlying biological mechanisms.","cites":"2","conferencePercentile":"92.47910864"},{"venue":"World journal of surgical oncology","id":"6551187d443ea93959a77aefa0ceeca05a42f213","venue_1":"World journal of surgical oncology","year":"2015","title":"Clinicopathological characteristics of unicentric retroperitoneal Castleman’s disease: a study of 14 cases","authors":"Shuai Wang, Shanwen Chen, Jiangfeng Xu, Songliang Cai","author_ids":"3804894, 7159646, 7169659, 7884659","abstract":"BACKGROUND\nThe objectives of this study are to investigate the clinicopathological characteristics and prognosis analysis of unicentric retroperitoneal Castleman's disease (CD), and to improve the level of diagnosis and treatment of unicentric retroperitoneal CD.\n\n\nMETHODS\nThe clinical data of 14 patients with unicentric retroperitoneal CD undergoing surgery from September 2007 to March 2014 were retrospectively reviewed.\n\n\nRESULTS\nThere were six males and eight females with a median age of 39 years old (range 15-58). Only three patients had a clinical manifestation of abdominal pain, and one patient associated with myasthenia gravis. All patients underwent surgical resection. The mean operation time was 137 min with a range of 72-472 min. The mean blood loss was 143 ml (range 50-500 ml). The CD was confirmed by histopathology. There were hyaline vascular (HV) type of CD in 13 cases, and mixed type of CD in one case. The mean hospital stay was 17.9 days with a mean postoperation hospital stay of 9.2 days. The duration of follow-up ranged from 21 to 99 months for 14 cases. All the 14 patients were alive without recurrence.\n\n\nCONCLUSIONS\nUnicentric retroperitoneal CD is a rare disease that is often misdiagnosed due to the absence of specific clinical manifestations. The final diagnosis depends on pathologic examination. Complete surgical resection of the tumor is the best therapeutic alternative for unicentric CD.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"70f2e4085350d97e28bba1addb63ff4212f158f1","venue_1":"World journal of surgical oncology","year":"2014","title":"A case report of retroperitoneal pararenal Castleman’s disease associated with myasthenia gravis","authors":"Shuai Wang, Shan-Wen Chen, Song-Liang Cai, Bai-Yan Jin","author_ids":"3804894, 7159646, 7884825, 4431804","abstract":"BACKGROUND\nCastleman's disease (CD) is a relatively rare disorder characterized by the benign proliferation of lymphoid tissue. The combination of an occurrence of retroperitoneal pararenal CD with myasthenia gravis (MG) is extremely rare.\n\n\nCASE PRESENTATION\nThe patient was admitted to our hospital for investigation of a retroperitoneal pararenal tumor which had been coincidentally diagnosed at a local hospital where he was admitted because of MG. The patient subsequently underwent an exploratory laparotomy and suffered from postoperative myasthenic crisis. Pathological examination revealed a left retroperitoneal mass of CD (hyaline vascular type). There was no recurrence of disease found after 7 months.\n\n\nCONCLUSIONS\nCD with MG is a rare condition. Postoperative myasthenic crisis is a severe complication. The possibility of its occurrence must be in physicians' minds and the risk of postoperative myasthenic crisis must be carefully considered when evaluating MG patients undergoing surgery.","cites":"0","conferencePercentile":"24.24623116"},{"venue":"World journal of surgical oncology","id":"c0e906b63bbb6dec350c009c4fe8ed2f51aa89a8","venue_1":"World journal of surgical oncology","year":"2011","title":"Metachronous pulmonary and adrenal metastases after liver transplantation for hepatocarcinoma","authors":"Shan-Wen Chen, Shuo Wang, Bo Wang, Wei-Dong Li, Sheng Yan, Li-Ping Xie","author_ids":"7159646, 5994097, 1693029, 7878417, 2274178, 1728875","abstract":"BACKGROUND\nThe worldwide experience of surgical resection for isolated metastasis following liver transplantation (LT) for hepatocellular carcinoma (HCC) is limited.\n\n\nMETHODS\nThe case of a 60-year-old patient performed successful surgical management for metachronous pulmonary and adrenal metastases from HCC after LT.\n\n\nRESULTS\nEighty months after LT, he was presently alive and disease-free with a normal AFP value.\n\n\nCONCLUSION\nThe case is an interesting report on a somehow indolent metastatic spread of HCC after LT. It should be considered that metachronous metastatic resectable disease, with no data of recurrence at the primary site in an operable patient, is an indication to perform a surgical resection.","cites":"1","conferencePercentile":"42.94117647"},{"venue":"World journal of surgical oncology","id":"cadbe3b63bbae4bbb745b4db8863f90c8e4cbbda","venue_1":"World journal of surgical oncology","year":"2014","title":"Laparoscopic partial nephrectomy for multilocular cystic renal cell carcinoma: a potential gold standard treatment with excellent perioperative outcomes","authors":"Ben Xu, Yue Mi, Li-qun Zhou, Jie Jin, Qian Zhang, Guang-fu Chen","author_ids":"2961636, 6803897, 8710641, 3214783, 1737486, 8018161","abstract":"BACKGROUND\nTo report on the perioperative outcomes of laparoscopic partial nephrectomy (LPN) for multilocular cystic renal cell carcinoma (MCRCC) and evaluate the feasibility of this minimally invasive technique as a potential gold standard treatment for MCRCC.\n\n\nMETHODS\nWe retrospectively reviewed the database of surgically pathological findings of patients who were diagnosed with MCRCC at Peking University First Hospital and Chinese PLA General Hospital (Beijing, China) between May 2009 and January 2013. A total of 42 patients with an average age of 48.3 years who were treated with LPN were collected. The patients' perioperative outcomes were reported and analyzed.\n\n\nRESULTS\nAll operations were performed successfully without massive hemorrhage or open conversion. None of patients received lymph node dissection or metastasectomy. Two patients required postoperative transfusion with a mean amount of 175 cc packed red blood cells. Only three patients experienced mild postoperative complications. The mean operative time was 2.4 ± 1.2 hours, including the mean warm ischemia time (WIT) of 23.2 ± 5.7 minutes. The mean estimated blood loss was 72.0 ± 49.6 ml. The mean retroperitoneal drainage was 4.4 ± 1.7 days. The mean postoperative hospital stay was 6.1 ± 1.9 days. Pathologically, 40 (95.2%) of the tumors presented as stage pT1abN0M0, while the remaining two (4.8%) presented as stage pT2aN0M0. No recurrences or new lesions occurred in these patients at a mean follow-up time of 30.0 months.\n\n\nCONCLUSIONS\nAlthough the effective option of LPN is not yet the gold standard treatment for conventional renal cell carcinoma, it should be strongly recommended as a potential gold standard treatment for MCRCC due to the benign nature of MCRCC and the excellent perioperative outcomes provided by LPN.","cites":"0","conferencePercentile":"24.24623116"},{"venue":"World journal of surgical oncology","id":"e7b055b79716086feecdc9a95881ac49607e600c","venue_1":"World journal of surgical oncology","year":"2013","title":"Measures of health-related quality of life and socio-cultural aspects in young patients who after mandible primary reconstruction with free fibula flap","authors":"Juanfang Zhu, Yan Xiao, Fei Liu, Jing Wang, Wenli Yang, Weihong Xie","author_ids":"8535921, , 1742065, 1804918, 7536258, 2028027","abstract":"BACKGROUND\nThe reconstruction of mandibular defects after trauma or tumor resection is one of the most challenging problems facing reconstructive surgeons. Although the primary intended outcome of surgery to treat head-and-neck malignancies is still the disease-free survival of the patient, health-related quality of life (HRQOL) is now seen as an essential secondary outcome. This study aims to evaluate HRQOL outcomes in young patients undergoing primary mandible reconstruction with free fibula flap and to collect information about their socio-cultural situation.\n\n\nMETHODS\nThe HRQOL outcomes of 25 young patients after primary mandible reconstruction with free fibula flap for mandible malignancies were assessed using the Medical Outcomes Study-Short Form-36 (MOS SF-36) and University of Washington Quality of Life (UW-QOL) questionnaires 12 months postoperatively.\n\n\nRESULTS\nUsing the UW-QOL questionnaire, the best-scoring domain was 'pain', whereas 'chewing' and 'anxiety' were given the lowest scores. Using the MOS SF-36 questionnaire, the best-scoring domain was 'physical functioning', while 'bodily pain' and 'general health' also scored well.\n\n\nCONCLUSIONS\nMandible reconstruction with fibula flap will significantly influence a young patient's HRQOL. Young patients pay more attention to postoperative facial appearance; this should be considered in surgical planning. The socio-cultural data show a fairly low level of education for the majority of patients.","cites":"2","conferencePercentile":"66.0130719"},{"venue":"World journal of surgical oncology","id":"8e7eb534f96a598f11929edd9773b76b7501af7c","venue_1":"World journal of surgical oncology","year":"2016","title":"Cytoreductive surgery plus hyperthermic intraperitoneal chemotherapy with lobaplatin and docetaxel improves survival for patients with peritoneal carcinomatosis from abdominal and pelvic malignancies","authors":"Hai-Tao Wu, Xiao-Jun Yang, Chao-Qun Huang, Jian-Hua Sun, Zhong-He Ji, Kai-Wen Peng, Qian Zhang, Yan Li","author_ids":"7263913, 1809910, 7901279, 8456663, 7702133, 8501963, 1737486, 1723002","abstract":"BACKGROUND\nThis work was to evaluate the perioperative safety and efficacy of cytoreductive surgery (CRS) plus hyperthermic intraperitoneal chemotherapy (HIPEC) with lobaplatin and docetaxel in patients with peritoneal carcinomatosis (PC) from gastrointestinal and gynecological cancers.\n\n\nMETHODS\nPatients were treated by CRS + HIPEC with lobaplatin 50 mg/m(2) and docetaxel 60 mg/m(2) in 6000 mL of normal saline at 43 ± 0.5 °C for 60 min. Vital signs were recorded for 6 days after CRS + HIPEC procedures. Perioperative serious adverse events (SAE), hematological, hepatic, renal, and electrolytes parameters, the changes in serum tumor markers (TM) before and after operation, patient recovery, and overall survival (OS) were analyzed.\n\n\nRESULTS\nOne hundred consecutive PC patients underwent 105 CRS + HIPEC procedures and postoperative chemotherapy. The median CRS + HIPEC duration was 463 (range, 245-820) min, and the highest temperature and heart rate during six postoperative days were 38.6 °C (median 37.5 °C) and 124 bpm (median 100 bpm), respectively. The 30-day perioperative SAE occurred in 16 (15.2 %) and mortality occurred in 2 (1.9 %) patients. Most routine blood laboratory tests at 1 week after surgery turned normal. Among 82 cases with increased preoperative TM CEA, CA125, and CA199, 71 cases had TM levels reduced or turned normal. Median time to nasogastric tube removal was 5 (range, 3-23) days, to liquid food intake 6 (range, 4-24) days, and to abdominal suture removal 15 (range, 10-30) days. At the median follow-up of 19.7 (range, 7.5-89.2) months, the median OS was 24.2 (95 % CI, 15.0-33.4) months, and the 1-, 3-, and 5-year OS rates were 77.5, 32.5, and 19.8 %, respectively. Univariate analysis identified five independent prognostic factors on OS: the origin of PC, peritoneal cancer index, completeness of CRS, cycles of adjuvant chemotherapy, and SAE.\n\n\nCONCLUSIONS\nCRS + HIPEC with lobaplatin and docetaxel to treat PC is a feasible procedure with acceptable safety and can prolong the survival in selected patients with PC.\n\n\nTRIAL REGISTRATION\nClinicalTrials.gov, NCT00454519.","cites":"0","conferencePercentile":"47.2"},{"venue":"World journal of surgical oncology","id":"d5fec289b048f21957306a7d3b546e1ab9db0d84","venue_1":"World journal of surgical oncology","year":"2016","title":"Clinical, radiological, and pathological features of 33 adult unilateral thalamic gliomas","authors":"Peng Zhang, Xingchao Wang, Nan Ji, Jian Xie, Jinsong Han, Xiaohui Ren, Guidong Song, Ruofei Wu, Liwei Zhang, Zhixian Gao","author_ids":"7914297, 8416011, 8327731, 8069362, 1783892, 7924772, 5596841, 5596961, 3033210, 8011248","abstract":"BACKGROUND\nUnilateral adult thalamic gliomas are rarely reported. In this study, the authors aimed to analyze the clinical, radiological, and pathological features of adult primary unilateral thalamus gliomas (UTGs).\n\n\nMETHODS\nClinical data of 33 UTGs in adults who underwent surgical treatment between 2005 and 2014 at the Beijing Tiantan Hospital were collected and retrospectively studied. Follow-up evaluation was performed.\n\n\nRESULTS\nThis study included 21 males and 12 females with a mean age of 43.1 years. The most common symptoms were headache (75.8%, 25/33 patients) and motor deficits (42.4%, 14/33 patients). Radiological results showed that enhancement was common (90.9%, 30/33 patients) and included cystic appearances in 9 cases (27.3%). All patients underwent maximal safe tumor resection. Gross total resection (GTR) was achieved in 19 cases, subtotal resection (≥80%) in 9 cases, and partial resection (<80%) in 5 cases. Molecular pathology results were available in 15 cases. After surgery, 25 patients received postoperative adjuvant therapy based on the remaining pathology. The median follow-up period of all 33 patients with UTGs was 17 months (1 week~49 months). Twenty-four patients experienced tumor recurrence. The 1-year and 2-year progression-free survival (PFS) rates were 49.0 and 10.2%, respectively. The 1-year and 2-year overall survival (OS) rates were 68.1 and 25.9%, respectively. Survival analyses revealed that several predictive factors were correlated with better prognosis, among which, GTR and tumor with cystic appearances were significantly associated with a longer survival.\n\n\nCONCLUSIONS\nAdult UTGs displayed a wide spectrum of clinical features. GTR can be achieved in adult UTGs with acceptable complications and conferred a better prognosis. Tumor with cystic appearance may indicate better prognosis. More patients and longer follow-up periods are needed to further elucidate the biological features of adult UTGs.","cites":"0","conferencePercentile":"47.2"},{"venue":"World journal of surgical oncology","id":"3871e802adb24e664a18417e92e0659bd82e0ec4","venue_1":"World journal of surgical oncology","year":"2014","title":"Endoscopic mucosal resection with circumferential incision for treatment of rectal carcinoid tumours","authors":"Jin Huang, Zhong-Sheng Lu, Yun-sheng Yang, Jing Yuan, Xiang-dong Wang, Jiang-yun Meng, Hong Du, Hong-bin Wang","author_ids":"8192803, 2544345, 3070451, 1698556, 8681209, 6595247, 1845417, 7643759","abstract":"BACKGROUND\nEndoscopic mucosal resection (EMR) is simple and quick and has low complication rates. However, the disadvantage of local recurrence or remnant rate limits the use of this technique. We aimed to analyse the outcomes of conventional EMR and EMR with circumferential incision (CIEMR), a simplified modification of EMR, in the endoscopic treatment of rectal carcinoid tumours.\n\n\nMETHODS\nA total of 59 consecutive patients with rectal carcinoid tumours without regional lymph node enlargement confirmed by endoscopic ultrasonography were included in the study. These patients underwent endoscopic treatment from January 2009 to September 2011 and were randomly designated into CIEMR (n = 31) or EMR group (n = 28). En bloc resection rate, pathological complete resection rate, procedure time, complications and follow-up outcomes were analysed.\n\n\nRESULTS\nThe en bloc resection rate was not significantly different between the CIEMR and EMR groups (100% versus 96.55%, P > 0.05). The pathological complete resection rate was higher in the CIEMR group than in the EMR group (96.7% versus 82.14%, P < 0.05). The overall complication rate, delayed bleeding and procedure time were not significantly different between the two groups. No recurrence was observed in either the EMR or CIEMR group.\n\n\nCONCLUSIONS\nCIEMR optimises the procedure of EMR and simplifies the technique of endoscopic submucosal dissection; thus, it has a better histologically complete resection rate and more acceptable complication rate than EMR. Thus, CIEMR may be preferable to conventional EMR for resection of rectal carcinoid tumours less than 15 mm.","cites":"0","conferencePercentile":"24.24623116"},{"venue":"World journal of surgical oncology","id":"adf9180374009cbd686e118d661d57f0610d68d0","venue_1":"World journal of surgical oncology","year":"2014","title":"Case report: living donor liver transplantation for giant hepatic hemangioma using a right lobe graft without the middle hepatic vein","authors":"Lin Zhong, Tong-Yi Men, Gao-di Yang, Yan Gu, Guoqing Chen, Tong-Hai Xing, Jun-Wei Fan, Zhi-Hai Peng","author_ids":"5581056, 7216334, 3605392, 1791118, 1805182, 7158563, 8183588, 8320384","abstract":"Hepatic hemangioma patients with Kasabach-Merritt syndrome have reportedly been cured by liver transplantation. However, liver transplantation as a potential cure for a stable patient without Kasabach-Merritt syndrome remains debatable. We report the case of a 27-year-old female patient with a giant hepatic hemangioma. The hemangioma measured 50×40×25 cm in size and weighed 15 kg, which is the largest and heaviest hemangioma reported in the literature. The patient showed jaundice, ascites, anemia, and appetite loss; but no disseminated intravascular coagulation was observed through laboratory findings. We successfully operated using a right lobe graft without the middle hepatic vein from a 55-year-old donor. At the long-term follow-up, the patient experienced two acute rejections, which were confirmed by biopsy. However, the patient still survives with good graft function after 50 months.","cites":"1","conferencePercentile":"62.68844221"},{"venue":"World journal of surgical oncology","id":"20a0c062481dd516589304774cac2b1c5f2e016d","venue_1":"World journal of surgical oncology","year":"2016","title":"Minimally invasive oesophagectomy versus open esophagectomy for resectable esophageal cancer: a meta-analysis","authors":"Waresijiang Yibulayin, Sikandaer Abulizi, Hongbo Lv, Wei Sun","author_ids":"7181122, 7844636, 2488480, 1712625","abstract":"BACKGROUND\nOpen esophagectomy (OE) is associated with significant morbidity and mortality. Minimally invasive oesophagectomy (MIO) reduces complications in resectable esophageal cancer. The aim of this study is to explore the superiority of MIO in reducing complications and in-hospital mortality than OE.\n\n\nMETHODS\nMEDLINE, Embase, Science Citation Index, Wanfang, and Wiley Online Library were thoroughly searched. Odds ratio (OR)/weighted mean difference (WMD) with a 95% confidence interval (CI) was used to assess the strength of association.\n\n\nRESULTS\nFifty-seven studies containing 15,790 cases of resectable esophageal cancer were included. MIO had less intraoperative blood loss, short hospital stay, and high operative time (P < 0.05) than OE. MIO also had reduced incidence of total complications; (OR = 0.700, 95% CI = 0.626 ~ 0.781, P V  < 0.05), pulmonary complications (OR = 0.527, 95% CI = 0431 ~ 0.645, P V  < 0.05), cardiovascular complications (OR = 0.770, 95% CI = 0.681 ~ 0.872, P V  < 0.05), and surgical technology related (STR) complications (OR = 0.639, 95% CI = 0.522 ~ 0.781, P V  < 0.05), as well as lower in-hospital mortality (OR = 0.668, 95% CI = 0.539 ~ 0.827, P V  < 0.05). However, the number of harvested lymph nodes, intensive care unit (ICU) stay, gastrointestinal complications, anastomotic leak (AL), and recurrent laryngeal nerve palsy (RLNP) had no significant difference.\n\n\nCONCLUSIONS\nMIO is superior to OE in terms of perioperative complications and in-hospital mortality.","cites":"0","conferencePercentile":"47.2"},{"venue":"World journal of surgical oncology","id":"40a0e1b7557be17d6c5c368f97b638696b051a5c","venue_1":"World journal of surgical oncology","year":"2013","title":"Pathologic fracture does not influence prognosis in stage IIB osteosarcoma: a case–control study","authors":"Dongqing Zuo, Longpo Zheng, Wei Sun, Yingqi Hua, Zhengdong Cai","author_ids":"4703212, 6089982, 1712625, 8511064, 8537173","abstract":"OBJECTIVE\nThis study tested the implication of pathologic fractures on the prognosis in stage IIb osteosarcoma.\n\n\nMETHODS\nA single center retrospective evaluation of clinical management and oncologic outcome was conducted with 15 pathological fracture patients (M:F = 10:5; age: mean 23.2, range 12-42) and 50 non-fracture patients between April 2002 and December 2010. These stage IIB osteosarcoma patients were matched for age, tumor site (femur, tibia, and humerus), and osteosarcoma subtype (i.e., control patients with osteosarcoma in the same sites as the fracture patients). All osteosarcoma patients with pathological fractures underwent brace or cast immobilization, adjuvant chemotherapy, and limb salvage surgery or amputation. Musculoskeletal Tumor Society (MSTS) functional scores were assessed. The mean follow-up time was 34.7 months (range, 8-47 months).\n\n\nRESULTS\nFollowing limb salvage surgery, no statistical differences were observed in major complications (fracture = 20.0%, control = 12.0%, P = 0.43) or local recurrence complications (fracture = 26.7%, control = 14.0%, P = 0.25). Overall 3-year survival rates of the fracture and control groups (66.7% and 75.3%, respectively) were not statistically different (P = 0.5190). Three-year disease-free survival rates of the fracture and control groups were 53.3% and 66.5%, respectively (P = 0.25).\n\n\nCONCLUSIONS\nPathologic fracture was not a prognostic indicator of recurrence or overall survival in localized osteosarcoma patients. Limb salvage can be achieved by and maintaining adequate surgical margins and applying adjuvant chemotherapy.","cites":"0","conferencePercentile":"15.03267974"},{"venue":"World journal of surgical oncology","id":"5264d4d1996bbd980e05a37ea3047c9b6c09d965","venue_1":"World journal of surgical oncology","year":"2016","title":"Double primary hepatic cancer (hepatocellular carcinoma and intrahepatic cholangiocarcinoma) originating from hepatic progenitor cell: a case report and review of the literature","authors":"Junwen Hu, Rongfa Yuan, Changwen Huang, Jianghua Shao, Shubing Zou, Kai Wang","author_ids":"8520554, 3686060, 7900755, 8187714, 7523727, 3751236","abstract":"BACKGROUND\nSynchronous development of primary hepatocellular carcinoma (HCC) and intrahepatic cholangiocarcinoma (ICC) in different sites of the liver have rarely been reported before. The purpose of this study is to investigate the clinicopathological characteristics of synchronous double cancer of HCC and ICC.\n\n\nCASE PRESENTATION\nA 56-year-old Chinese man without obvious liver cirrhosis was preoperation diagnosed with multiple HCC in segments VI (SVI) and VII (SVII) by the abdominal computed tomography (CT) and contrast-enhanced ultrasonography (CEUS). We performed hepatic resection of both segments. The tumors in SVI and SVII were pathologically diagnosed as ICC and HCC, respectively. Immunohistochemically, the HCC in SVII was positive for HepPar-1 and negative for CK19, while the ICC in SVI tumor was positive for CK19 and negative for HepPar-1. Interestingly, the immunohistochemical results also showed that the classic hepatic progenitor cell (HPCs) markers CD34 and CD117 were both positive of the two tumors. The patient still survived and at a 1-year follow-up did not show evidence of metastasis or new recurrent lesions. We speculate that the two masses may have originated from HPCs based on the findings of this patient.\n\n\nCONCLUSIONS\nSynchronous development of HCC and ICC is very rare with unique clinical and pathological features. The correct preoperative diagnosis of double hepatic cancer of HCC and ICC is difficult. Hepatitis B virus (HBV) and hepatitis C virus (HCV) infection were both the independent risk factor to the development of double liver cancer. Hepatic resection is the preferred and most effective treatment choice. The prognosis of synchronous occurrence of double hepatic cancer was poorer than for either HCC or ICC, and the origin of it needs further study.","cites":"0","conferencePercentile":"47.2"},{"venue":"World journal of surgical oncology","id":"baf055d0cd3a3e03e41dfb1a11ad1f1d58e33072","venue_1":"World journal of surgical oncology","year":"2014","title":"Three-step method for systematic lymphadenectomy in gastric cancer surgery using the ‘curettage and aspiration dissection technique’ with Peng’s multifunctional operative dissector","authors":"Wenguang Wu, Ping Dong, Xiangsong Wu, Maolan Li, Qichen Ding, Lin Zhang, Jiahua Yang, Hao Weng, Qian Ding, Zhujun Tan, Jianhua Lu, Jun Gu, Yingbin Liu","author_ids":"3358754, 5056569, 6466450, 5334915, 2973306, 1708615, 7788318, 5137874, 3036544, 8132689, 1694070, 1742782, 2040126","abstract":"BACKGROUND\nGastric cancer is one of the most common malignancies and is a leading cause of cancer death worldwide. Surgery is the most effective and successful method of treatment for gastric cancer, and systematic lymph node (LN) dissection is unquestionably the most effective procedure for treating LN metastases of gastric cancer. Systematic lymphadenectomy is the most important part of curative resection, but lymphadenectomy is also the most difficult procedure in gastric cancer surgery. The aim of this study is to report our three-step method for lymphadenectomy in gastric cancer.\n\n\nMETHODS\nIn this study, the lymph node stations and groups were defined according to the 13th edition of the Japanese Classification for Gastric Carcinoma. The authors' novel, simplified method consists of three steps: (1) the Kocher maneuver and dissection of the greater omentum together with the anterior sheet of the mesocolon, (2) dissection of the lesser omentum, and (3) lymphadenectomy following the main vessels. We primarily used Peng's multifunctional operative dissector, which combines four different functions (cutting, separating, aspirating and coagulating). Our systematic lymphadenectomy included three steps, and the main procedure started from right to left and in the caudal to cranial direction.\n\n\nRESULTS\nA total of 830 consecutive patients underwent our three-step-method systematic lymphadenectomy in advanced gastric cancer surgery. The mean operation time was 146 minutes, and the mean blood loss was 248 ml. The median postoperative hospital stay was 10.9±4.8 days. The median number of examined LN was 31.6 (range 17 to 72) per patient, and the median number of metastatic LN was 5.6 (range 0 to 42) per patient. The overall incidence of postoperative complications was 10.6%, and the rate of hospital death was 0.9%. The overall three-year survival rate was 52.6%.\n\n\nCONCLUSIONS\nOur three-step method for lymphadenectomy is easy to perform and is a useful procedure for gastric cancer surgery.","cites":"0","conferencePercentile":"24.24623116"},{"venue":"World journal of surgical oncology","id":"d0bc1b357039835460408d256dc5c18ac9909a89","venue_1":"World journal of surgical oncology","year":"2015","title":"Expression and clinical significance of long non-coding RNA HNF1A-AS1 in human gastric cancer","authors":"Yuan Dang, Fenghua Lan, Xiaojuan Ouyang, Kai Wang, Youdong Lin, Yinghao Yu, Lie Wang, Yu Wang, Qiaojia Huang","author_ids":"7221202, 6940802, 6766440, 3751236, 1802312, 3744001, 6027485, 1696013, 8304995","abstract":"BACKGROUND\nIncreasing evidence has demonstrated that long non-coding RNAs (lncRNAs) play essential roles in the occurrence and development of human cancers, including gastric cancer (GC). However, the functional and clinical significance of lncRNAs are still poorly understood.\n\n\nMETHODS\nIn this study, the expression of LncRNA HNF1A antisense RNA 1 (HNF1A-AS1) was first examined by lncRNAs microarray analysis in 6 GC tissues, and was then further verified by real-time quantitative reverse transcription PCR (qRT-PCR) both in 3 GC cell lines and 161 cases of GC tissues. We also evaluated the association between HNF1A-AS1 expression and clinicopathological features of patients with GC.\n\n\nRESULTS\nLncRNAs microarray analysis results exhibited that HNF1A-AS1 was downregulated in GCs tissues (mean fold change 2.06, p < 0.05), which was further confirmed by qRT-PCR. The results from qRT-PCR showed that the expression of HNF1A-AS1 was not only downregulated in three GC cell lines (AGS, BGC-823, and MKN-45) relative to that in a normal gastric mucosal epithelial cell line (GES-1), but also decreased in GC tissues relative to that in paired adjacent non-neoplastic tissues (low expression, 94 of 161; low expression rate, 58.38%). Furthermore, low HNF1A-AS1 expression was associated with tumor size/diameter (p = 0.005, multivariate analysis), levels of serum carcinoembryonic antigen (CEA), and carbohydrate antigen 19-9 (CA19-9), and RRM1 expression in tissue samples (p = 0.028, p = 0.009, and p = 0.006, respectively).\n\n\nCONCLUSIONS\nTaken together, our data indicate that lncRNA HNF1A-AS1 may be a regulator of GC, and thus, it may have potential as a novel biomarker and treatment target for this type of cancer.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"cc916d7f1e7106d7195b161aeb00346b8507d70e","venue_1":"World journal of surgical oncology","year":"2015","title":"Inflammatory pseudotumor around metal-on-polyethylene total hip arthroplasty in patients with ankylosing spondylitis: description of two cases and review of literature","authors":"Dong Fu, Wei Sun, Jiakang Shen, Xiaojun Ma, Zhengdong Cai, Yingqi Hua","author_ids":"3071800, 1712625, 4771672, 7832532, 8537173, 8511064","abstract":"Inflammatory pseudotumor has been commonly reported in patients undertaking total hip replacement (THR) for different reasons. The precise etiology of this biological reaction and whether the primary disease has an influence on pseudotumor formation remain unclear. There seems to be a consensus that metal ions and debris do play an important role during this process. Recently, however, compared to metal particles along, immune response induced by metal particles attracts more attention. We present two cases of pseudotumor who have accepted THR for ankylosing spondylitis (AS) and later required revision surgery and hindquarter amputation, respectively. By thorough literature review, we tried to investigate the association between inflammatory pseudotumors and immunology.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"339cb99d0b37c1f6902c817c28e33b236d0346d5","venue_1":"World journal of surgical oncology","year":"2014","title":"Prognostic value of poorly differentiated clusters in invasive breast cancer","authors":"Ying Sun, Fenli Liang, Wei Cao, Kai Wang, Jianjun He, Hongyan Wang, Yili Wang","author_ids":"1707882, 7985419, 6825329, 3751236, 3287135, 1830463, 2758775","abstract":"BACKGROUND\nOur study aimed to assess the prognostic value of poorly differentiated clusters (PDCs) in invasive breast cancer.\n\n\nMETHODS\nA total of 146 cases of operable invasive ductal carcinoma that was not otherwise specified (IDC-NOS), from 2002 to 2009, were pathologically reviewed. Cancer clusters with five or more cancer cells and lacking gland-like structures were counted from a field containing maximum clusters in H & E slides under a×20 objective lens (0.950 mm2 field of vision).\n\n\nRESULTS\nTumors with <5, 5 to 9, and ≥10 clusters were graded as G1, G2, and G3, respectively (n=41, 60, and 45 tumors, respectively). An interobserver test showed good reproducibility, with a Cohen's kappa coefficient of 0.739. The PDC grade was significantly associated with N stage (P<0.001), lymphovascular invasion (P=0.007), tumor budding grade (P<0.001), relapse rate (P<0.001), and death rate (P<0.001). Survival analyses revealed that the PDC grade was a significant prognostic factor for disease-free survival (hazard ratio 3.811; P<0.001) and overall survival (hazard ratio 3.730; P=0.001), independent of T stage, N stage, or tumor budding grade.\n\n\nCONCLUSIONS\nThe PDC grade is an independent prognostic factor of IDC-NOS. Considering the simplicity and availability of this method relative to conventional clinical pathology, PDCs may serve as a novel prognostic histological characteristic in IDC-NOS.","cites":"3","conferencePercentile":"92.21105528"},{"venue":"World journal of surgical oncology","id":"c27ecaf325eced869a550d0c3c0bf68fb85dc688","venue_1":"World journal of surgical oncology","year":"2014","title":"Glucose-regulated protein 78 and heparanase expression in oral squamous cell carcinoma: correlations and prognostic significance","authors":"Fei Xia, Jin Cheng Xu, Pei Zhang, Yuan Yuan Zhang, Qian Wen Zhang, Zhen Hua Chao, Fang Wang","author_ids":"8687798, 7169414, 1678979, 7549044, 1737486, 5111167, 8635140","abstract":"BACKGROUND\nThe aim of the present study was to investigate the expression of glucose-related protein 78 (GRP78) and heparanase (HPA) in oral squamous cell carcinoma (OSCC) and their relationship with clinicopathological parameters and potential implications for survival.\n\n\nMETHODS\nA total of 46 patients with OSCC and 10 normal individuals were recruited for the study. GRP78 and HPA expression were determined in the lesion tissues using immunohistochemical analysis. The correlation between GRP78 and HPA was assessed using the Spearman correlation analysis. The associations of GRP78 and HPA with clinicopathological characteristics and survival were examined using the x2-test, Kaplan-Meier, or Cox regression.\n\n\nRESULTS\nPatients with OSCC showed a statistically significant higher prevalence of GRP78 and HPA expression than normal oral tissues. GRP78 and HPA expression was positively correlated with size, TNM stage, histological grade, lymphatic metastasis, and distant metastasis in OSCC patients. GRP78 expression was also positively correlated with HPA expression. Positive GRP78 and HPA expression was inversely correlated with survival in OSCC patients.\n\n\nCONCLUSIONS\nHPA expression was found to be positively correlated with GRP78 expression. GRP78 and HPA are biomarkers that may have the potential to guide the treatment of oral cancer patients.","cites":"2","conferencePercentile":"83.04020101"},{"venue":"World journal of surgical oncology","id":"d4b1219922ec05288049a10a501e9c4873dd899c","venue_1":"World journal of surgical oncology","year":"2015","title":"Reconstruction of segmental bone defect of long bones after tumor resection by devitalized tumor-bearing bone","authors":"Huayi Qu, Wei Guo, Rongli Yang, Dasen Li, Shun Tang, Yi Yang, Sen Dong, Jie Zang","author_ids":"4251853, 3617959, 5660392, 6311144, 3838539, 1698559, 2508343, 4389913","abstract":"BACKGROUND\nThe reconstruction of an intercalary bone defect after a tumor resection of a long bone remains a challenge to orthopedic surgeons. Though several methods have been adopted to enhance the union of long segmental allografts or retrieved segmental autografts to the host bones, still more progresses are required to achieve a better union rate. Several methods have been adopted to devitalize tumor bone for recycling usage, and the results varied. We describe our experiences of using devitalized tumor-bearing bones for the repairing of segmental defects after tumor resection.\n\n\nMETHODS\nTwenty-seven eligible patients treated from February 2004 to May 2012 were included. The segmental tumor bone (mean length, 14 cm) was resected, and then devitalized in 20% sterile saline at 65 °C for 30 min after the tumor tissue was removed. The devitalized bone was implanted back into the defect by using nails or plates.\n\n\nRESULTS\nComplete healing of 50 osteotomy ends was achieved at a median time of 11 months (interquartile range (IQR) 9-13 months). Major complications included bone nonunion in four bone junctions (7.4%), devitalized bone fracture in one patient (3.7%), deep infection in three patients (11.1%), and fixation failure in two patients (7.4%). The bone union rates at 1 and 2 years were 74.1 and 92.6%, respectively. The average functional score according to the Musculoskeletal Tumor Society (MSTS) 93 scoring system was 93 % (IQR 80-96.7%).\n\n\nCONCLUSIONS\nIncubation in 20% sterile saline at 65 °C for 30 min is an effective method of devitalization of tumor-bearing bone. The retrieved bone graft may provide as a less expensive alternative for limb salvage. The structural bone and the preserved osteoinductivity of protein may improve bone union.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"f3ad73395030ec4e322b79b4f356c48140ac707e","venue_1":"World journal of surgical oncology","year":"2015","title":"Dysregulation of over-expressed IL-32 in colorectal cancer induces metastasis","authors":"Yi Yang, Zihao Wang, Yiming Zhou, Xiaoxiao Wang, Jianbin Xiang, Zongyou Chen","author_ids":"1698559, 8491888, 8644576, 8415828, 3502636, 1839860","abstract":"BACKGROUND\nInterleukin (IL)-32 is a described intracellular pluripotent pro-inflammatory mediator, characterized by the signaling of NF-κB and STAT3.\n\n\nMETHODS\nOur study investigated whether IL-32 expression has clinical significance in the metastases of colorectal cancer (CRC). A total of 70 CRC patients were enrolled, 47 cases of which were single CRC organic metastasis lesions while the rest of which were primary CRC lesions (T4NxM0). IL-32 expression was detected by immunohistochemistry, and the correlation between IL-32 expression and CRC metastases was analyzed.\n\n\nRESULTS\nThe positive rates of IL-32 in the CRC organic metastasis group were more severe than those in the primary CRC group (P < 0.05). The positive rate of IL-32 in primary CRC with lymph node metastasis was more severe than that of IL-32 in primary CRC without lymph node metastasis (P < 0.05).\n\n\nCONCLUSIONS\nThe level of IL-32 expression could influence the N grade of CRC. Thus, IL-32 expression may stimulate the organic metastasis and the lymph node metastasis of CRC.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"a43fb0b47b90cf940324379467da25fee123a956","venue_1":"World journal of surgical oncology","year":"2014","title":"Malawer limb salvage surgery for the treatment of scapular chondrosarcoma","authors":"Fei Chang, Guang-Yao Liu, Qiao Zhang, Gang Lin, Hong Huang, De-Sheng Duan, Jin-Cheng Wang","author_ids":"1995942, 8539930, 5564743, 8537909, 7192690, 6081035, 7898428","abstract":"Chondrosarcoma is a common malignant bone tumor, which accounts for 20% of all malignant bone tumors. It often occurs in the long bones, but the incidence of scapular chondrosarcoma is rare. Here, we describe a case of a large chondrosarcoma occurring in the scapula which was treated with Malawer limb salvage surgery. The patient retained considerable limb function after complete removal of the tumor tissue as assessed at the follow-up visit two years and ten months following surgery.","cites":"0","conferencePercentile":"24.24623116"},{"venue":"World journal of surgical oncology","id":"c096e279ef0cae79d13e2a4fb6edbe016251b2d6","venue_1":"World journal of surgical oncology","year":"2013","title":"Isolated complete caudate lobectomy for hepatic tumor of the anterior transhepatic approach: surgical approaches and perioperative outcomes","authors":"Jia-Hua Yang, Jun Gu, Ping Dong, Lei Chen, Wen-Guang Wu, Jia-Sheng Mu, Mao-Lan Li, Xiang-Song Wu, Yang-Lu Zhao, Lin Zhang, Hao Weng, Qian Ding, Qi-Chen Ding, Ying-Bin Liu","author_ids":"4408574, 1742782, 5056569, 1685354, 7970528, 8560389, 5334915, 6466450, 6004575, 1708615, 5137874, 3036544, 7335485, 2040126","abstract":"BACKGROUND\nHow to resect the caudate lobe safely is a major challenge to current liver surgery which requires further study.\n\n\nMETHODS\nNine cases (6 hepatic cell carcinoma, 2 cavernous hemangioma and 1 intrahepatic cholangiocacinoma) were performed using the anterior transhepatic approach in the isolated complete caudate lobe resection. During the operation, we used the following techniques: the intraoperative routine use of Peng's multifunction operative dissector (PMOD), inflow and outflow of hepatic blood control, low central venous pressure and selective use of liver hanging maneuver.\n\n\nRESULTS\nThere were no perioperative deaths observed after the operation. The median operating time was 230 ± 43.6 minutes, the median intraoperative blood loss was 606.6 ± 266.3 ml and the median length of postoperative hospital stay was 12.6 ± 2.9 days. The incidence of complications was 22.22% (2/9).\n\n\nCONCLUSION\nPMOD and \"curettage and aspiration\" technique can be of great help of in the dissection of vessels and parenchyma, clearly making caudate lobe resection safer, easier and faster.","cites":"2","conferencePercentile":"66.0130719"},{"venue":"World journal of surgical oncology","id":"12399f2f3ad73a7bfe5af5a4fc342fd0b1fd3a1d","venue_1":"World journal of surgical oncology","year":"2015","title":"Single-center study of familial papillary thyroid cancer in China: surgical considerations","authors":"Shangtong Lei, Da Wang, Junna Ge, Hao Liu, Donghui Zhao, Guoxin Li, Zihai Ding","author_ids":"4981952, 5493661, 6375394, 4087368, 7427329, 4307535, 8405278","abstract":"BACKGROUND\nWhether familial papillary thyroid cancer (FPTC) is more aggressive than sporadic counterpart remains elusive, and the optimal clinical approach for FPTC is yet to be established. In this study, we investigated familial occurrence of PTC in China and reviewed our experience of its surgical treatment.\n\n\nMETHODS\nThe clinical records of 248 consecutive patients with an established diagnosis of PTC who were admitted to Nanfang Hospital for thyroidectomy between January 2011 and June 2013 were analyzed in this study. Patients included 66 males and 182 females, aged 11 to 76 years.\n\n\nRESULTS\nTwenty-two patients (8.9%) with a positive family history were confirmed. Patients with FPTC had a predilection for female subjects and tended to be younger than other patients, but the difference was not significant (P = 0.0514 and P = 0.168). They were more likely to present large tumors (P = 0.0024), multifocality (familial vs. sporadic: 54.50% vs. 26.50%; P < 0.006), local invasion (81.8% vs. 23.9%; P < 0.001), and malignant lymph nodes (63.6% vs. 33.6%; P = 0.005). Univariate and multivariate analyses identified that a positive family history was an independent risk factor for local invasion (OR: 5.683; 95% CI: 2.056 to 15.707; P = 0.001), malignant lymph nodes (OR: 3.005; 95% CI: 1.046 to 8.630; P = 0.041) in FPTC patients. Kaplan-Meier survival curves revealed that an aggressive surgical strategy was associated with a better relapse-free survival than conventional one (P = 0.032).\n\n\nCONCLUSIONS\nFPTC is more likely to possess aggressive features than sporadic counterparts. Thus, screening of at-risk families is essential to aid in earlier recognition. An aggressive surgical strategy appeared to be the more effective therapy. However, sufficient detailed interrogation and long-term follow-up of the patients and their family are necessary for providing individualized recommendations for clinical management.","cites":"0","conferencePercentile":"33.98328691"},{"venue":"World journal of surgical oncology","id":"3921383239f1b7458e591adc9668017ef79d1793","venue_1":"World journal of surgical oncology","year":"2016","title":"Palliative treatment of pelvic bone tumors using radioiodine (125I) brachytherapy","authors":"Chongren Wang, Zhengqi Chen, Wei Sun, Yisilamu Yasin, Chuanyin Zhang, Xiaojun Ma, Jian Chen, Jiakang Shen, Yingqi Hua, Zhengdong Cai","author_ids":"8205777, 2010380, 1712625, 7816072, 7923290, 7832532, 8730511, 4771672, 8511064, 8537173","abstract":"BACKGROUND\nComplete resection of pelvic bone tumors, especially recurrent and metastatic ones, is often impossible to achieve using conventional surgery. This study aimed to assess the benefits and adverse effects of computed tomography (CT)-guided radioiodine (125I) brachytherapy for inoperable recurrent and metastatic bone tumors of the pelvis.\n\n\nMETHODS\nThis was a retrospective study of 22 patients with confirmed pelvic bone tumors (10 females and 12 males; 15-84 years; 21 with primary pelvic tumor and one with pelvic metastasis). CT-guided 125I brachytherapy was performed using 9-21 125I seeds (radioactivity of 0.5-0.7 mCi). Seed implantation was validated by postoperative CT scanning. Complications, pain, survival, and CT-estimated tumor size were carried out to evaluate the therapeutic benefits.\n\n\nRESULTS\nPostoperative CT scans revealed satisfactory 125I seed implantation, and the radiation dose delivered to 90% of the target area (D90) was higher than the prescription dose (PD). No obvious complications were observed. Pain was reported by 19 of 22 patients, but 17 reported pain relief after implantation. Follow-up ranged 8-27 (median, 19) months. Tumor size was reduced in 11 patients within 1 month after surgery, nine patients showed no change, and tumor size increased in two patients. Finally, 1- and 2-year survival was 81.8 and 45.5%, respectively; 1- and 2-year local tumor control rates were 59.1 and 36.4%, respectively.\n\n\nCONCLUSIONS\n125I seed implantation significantly reduced bone tumor size and relieved pain, with a low complication rate. These findings suggest that 125I brachytherapy treatment could be a useful palliative approach for pelvic bone tumor treatment.","cites":"0","conferencePercentile":"47.2"}]}