{"World_Conference_on_Information":[{"venue":"World Conference on Information Security Education","id":"7f0fdac2d8adc206f3cd46c0f227e83448531416","venue_1":"World Conference on Information Security Education","year":"2009","title":"Two Case Studies in Using Chatbots for Security Training","authors":"Stewart Kowalski, Katarina Pavlovska, Mikael Goldstein","author_ids":"3179434, 2075429, 2621899","abstract":"This paper discusses the result of two case studies performed in a large international company to test the use of chatbots for internal security training. The first study targeted 26 end users in the company while the second study examined 80 security specialists. From a quantitative analytical perspective there does not appears to be any significant findings when chatbots are used for security training. However there does appear to be qualitative data that suggest that the attitudes of the respondents appear to be more positive to security when chatbots are used than with the current traditional e-learning security training courses at the company.","cites":"3","conferencePercentile":"100"},{"venue":"World Conference on Information Security Education","id":"dc96106e47def356bd804be3aa7960296169632b","venue_1":"World Conference on Information Security Education","year":"2003","title":"Design of a Laboratory for Information Security Education","authors":"Vikram Anantapadmanabhan, Phyllis G. Frankl, Nasir D. Memon, Gleb Naumovich","author_ids":"1766417, 1678770, 1719861, 1714833","abstract":"It has been recognized for some time now that education in information security is better served by a laboratory component that reinforces principle and theoretical analysis learnt in the class room with a follow-up hands-on component performed in an appropriate laboratory. In this paper we present the design of a highly reconfigurable laboratory for information security education. The design has been implemented successfully in ISIS-The Information Systems and Internet Security Laboratory at Polytechnic University. We also describe the rationale for our design and give examples of a few typical assignments that the laboratory facilitates. 1. Introduction The recent focus on security education, kindled by the NSA Center of Excellence in Education program [3] has seen a variety of universities add a security component to their computer science and engineering curriculum. As a result, we now have 36 universities that have been designated as Centers of Excellence in education. However, a significant number of programs continue to teach information security in the decades old traditional framework, focusing solely on theoretical principles and their analysis. Although theoretical concepts are essential and need to be taught, it is very important to also show students how to apply the theory they have learnt in very different and important practical situations. Hence, a good part of an information security course should 1","cites":"1","conferencePercentile":"37.5"},{"venue":"World Conference on Information Security Education","id":"f370653e5d29dc552b40e92c768091484939bd3d","venue_1":"World Conference on Information Security Education","year":"2003","title":"A Tutoring System for IT Security","authors":"Ji Hu, Michael Schmitt, Christian Willems, Christoph Meinel","author_ids":"2024718, 3261375, 2836891, 1708312","abstract":"Due to the many vulnerabilities of today's computer systems, IT security education has become an important topic. For that reason, a new tutoring system is developed at the Institute for Telematics, Trier, that allows users to gain knowledge about security technologies and tools via a web browser interface. Unlike other systems, this tutoring system does not provide a restricted simulation environment. Instead, guided exercises are performed on a real system (Linux). In this paper, the user interface and architecture of the tutoring system as well as some implementation aspects and future enhancements are described .","cites":"7","conferencePercentile":"87.5"}]}