{"WorldCIST.csv":[{"venue":"WorldCIST","id":"5dc4d3bda64506122f20c95daf1598e1af9fc75b","venue_1":"WorldCIST","year":"2014","title":"Integrating Public Transportation Data: Creation and Editing of GTFS Data","authors":"Mário Braga, Maribel Yasmina Santos, Adriano J. C. Moreira","author_ids":"1842068, 1693987, 2453271","abstract":"The current state of standardization related to representation and exchange of data about public transportation systems is still at its infancy, which leads to severe interoperability issues in projects that depend on the data from several diverse sources. In many cases, the interoperability issues arise from the use of rudimentary information systems, or even paper-based procedures, to manage operational data such as schedules and tariffs. In these cases, exchanging data with external systems is very difficult. This paper describes the development of a web-based application aiming to simplify the creation and editing of public transportation data that could be easily exchanged in a normalized format. This description is preceded by a discussion about a data model that could ease data interoperability. Here, the GTFS reference, with some adjustments, is used as a guideline for the definition of such transportation data model.","cites":"0","conferencePercentile":"31.81818182"},{"venue":"WorldCIST","id":"3ee15d5cd57c00580b755d5350a5d208976cf341","venue_1":"WorldCIST","year":"2015","title":"Maximize System Reliability for Long Lasting and Continuous Applications","authors":"Chunhui Guo, Hao Wu, Xiayu Hua, Shangping Ren, Jerzy Nogiec","author_ids":"2244452, 1739602, 2679834, 3147500, 1958103","abstract":"In this paper, we use software rejuvenation as a preventive and proactive fault-tolerance technique to maximize the level of reliability for continuous and safety critical systems. We take both transient faults caused by software aging effects and network transmission faults into consideration and mathematically analyze the optimal software rejuvenation period that maximizes system's reliability. The theoretical result is verified through empirical studies.","cites":"2","conferencePercentile":"100"},{"venue":"WorldCIST","id":"215a6190ec84a99bbf618cfe1d5ca01c38f9ef08","venue_1":"WorldCIST","year":"2014","title":"A Web System Based on a Sports Injuries Model towards Global Athletes Monitoring","authors":"Patrícia Macedo, Rui Neves Madeira, André Correia, Marco Jardim","author_ids":"2067932, 3093756, 3358341, 2252076","abstract":"This paper presents the project iReport SportsInjuries, which is a system with a focus on a Web application directed to sport health professionals, supporting the acquisition, analysis and dissemination of sports injuries information. This software will allow health professionals register and analyze sports injuries among sports populations. The application provides a reporting module that includes tables and charts to individually analyze injuries of a specific sports organization, a specific sport across organizations or a specific athlete, independently of where s/he practices. The system also offers a module for a global analysis, which allows the iReport SportsInjuries to obtain the incidence and prevalence values, besides the socioeconomics costs, regarding sports injuries at a national level. In order to offer these features, it is based on a global sports injuries model with the goal of standardizing data related to the sports injuries subject.","cites":"0","conferencePercentile":"31.81818182"}]}