{"World_neurosurgery.csv":[{"venue":"World neurosurgery","id":"606a02f0d1929c57294f4e731fccd5f975940e47","venue_1":"World neurosurgery","year":"2016","title":"Dual-image videoangiography during intracranial microvascular surgery.","authors":"Alberto Feletti, Xiangdong Wang, Riki Tanaka, Yasuhiro Yamada, Daisuke Suyama, Tsukasa Kawase, Hirotoshi Sano, Yoko Kato","author_ids":"6946398, 7137794, 7448274, 8485877, 4014460, 5633561, 4018128, 2300308","abstract":"OBJECTIVE\nIndocyanine-green videoangiography (ICG-VA) is a precious tool to assess vessels and aneurysm patency during neurovascular surgical procedures. However, ICG-VA highlights vascular structures, which appear white over a black background. Therefore, anatomical relations are sometimes not easy to understand at first glance. The recently developed dual-image videoangiography (DIVA) enables the simultaneous visualization of both light and near-infrared (NIR) fluorescence images of ICG-VA.\n\n\nMETHODS\nThe DIVA system was mounted on OPMI Pentero Flow 800 intraoperative microscope (Carl Zeiss Meditec, Jena, Germany). DIVA was used during microsurgical procedures on 5 patients, who were operated for aneurysm clipping and STA-MCA bypass.\n\n\nRESULTS\nDIVA provides real time simultaneous visualization of both aneurysm and vessels and surrounding structures, as brain, nerves, and surgical clips. Although visual contrast between vessels and background is higher with the standard black-and-white imaging, DIVA makes it easier to understand anatomical relations between intracranial structures. Moreover, it gives a better vision of the depth of field.\n\n\nCONCLUSIONS\nDIVA has the potentials to become a widely used intraoperative tool to check the patency of intracranial vessels. It should be considered an adjunct to standard ICG-VA for a better understanding of vascular anatomy in relation to surrounding structures, and can have an impact in decision-making during surgery.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"2772b1c72286c14224e16979c5b6f1e16c73a3f7","venue_1":"World neurosurgery","year":"2016","title":"Traumatic Spinal Perimedullary Arteriovenous Fistula Induced by a Cervical Glass Stab Injury.","authors":"Shogo Ogita, Toshiki Endo, Tomoo Inoue, Kenichi Sato, Hidenori Endo, Teiji Tominaga","author_ids":"8011811, 7756103, 1703928, 4871464, 5439152, 2457478","abstract":"BACKGROUND\nIn the literature, perimedullary arteriovenous fistula (AVF) is an uncommon spinal vascular malformation that is generally regarded as a congenital lesion. To our knowledge, only a few cases of traumatic perimedullary AVF have been reported in the literature so far.\n\n\nCASE DESCRIPTION\nA 58-year-old man presented with subarachnoid hemorrhage (SAH) resulting from a secondary perimedullary arteriovenous fistula (AVF) induced by a glass stab injury to his right posterior neck. The glass had been removed, and the lacerated dura mater was closed. Hydrocephalus was diagnosed 2 months later, and the patient underwent ventriculoperitoneal shunt placement. Magnetic resonance imaging and digital subtraction angiography subsequently revealed dissection of the extradural right vertebral artery. However, there were no signs of perimedullary AVF. The patient presented 9 months after injury with sudden onset of severe headache, and SAH was diagnosed. Repeat digital subtraction angiography showed that the right vertebral artery dissection remained unchanged and was unlikely to be the underlying cause of SAH. However, a new diagnosis of perimedullary AVF at the craniocervical junction was made, and this was considered as a potential cause of SAH. The lesion was surgically obliterated. The hemosiderin deposits on the surface of the spinal cord confirmed that perimedullary AVF was the origin of SAH.\n\n\nCONCLUSIONS\nCervical trauma should be considered as a possible cause of de novo perimedullary AVF. Recognition of this phenomenon is important.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"92d8d57fd2bfbf9ac9fad87cbdd698058b7b7b6e","venue_1":"World neurosurgery","year":"2016","title":"Posterior Open Reduction and Interlaminae Compression Fusion for Os Odontoideum with Atlantoaxial Dislocation.","authors":"Bin Ni, Lecheng Wu, Qunfeng Guo, Xuhua Lu, Fei Chen, Xiang Guo","author_ids":"7494664, 8531759, 6014505, 7828987, 2861400, 3255489","abstract":"OBJECTIVE\nTo evaluate the outcome of posterior open reduction and interlaminae compression fusion using a screw-rod system combined with a structural iliac bone graft in the treatment of atlantoaxial dislocation (AAD) secondary to os odontoideum.\n\n\nMETHODS\nA retrospective study was performed on 24 patients with AAD secondary to os odontoideum. All cases were with partial reduction after skeletal traction. Intraoperative open reduction and fixation were performed with a posterior screw-rod system, followed by interlaminae compression of an autologous iliac bone graft for fusion. The modified atlanto-dental interval (MADI) was measured to assess the degree of dislocation before traction, after traction, and postoperatively. Japanese Orthopaedic Association (JOA) score, Nurick scale score, visual analog scale score for neck pain (VASSNP), Neck Disability Index (NDI) score, and neck stiffness were used to evaluate functional outcomes.\n\n\nRESULTS\nThe mean duration of follow-up was 43.0 ± 24.0 months. All patients achieved relief of symptoms and solid bone fusion. There were no complications associated with instrumentation and operation. At the final follow-up, the average MADI was reduced to 2.0 ± 0.8 mm (pretraction: 9.2 ± 1.1 mm; post-traction: 6.6 ± 0.7 mm; P < 0.001). The neck stiffness was significantly relieved (P < 0.001), and function of the spinal cord manifested by the JOA score and Nurick scale score significantly improved (all P < 0.001). The NDI score and VASSNP markedly decreased (all P < 0.001).\n\n\nCONCLUSIONS\nIntraoperative open reduction and interlaminae compression fusion using a posterior screw-rod system combined with a structural iliac bone graft is a safe and effective procedure for AAD secondary to os odontoideum.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"6aab19d9a3a8b2ce6224be8cebfdea0d874f2bb0","venue_1":"World neurosurgery","year":"2016","title":"Biomechanical Evaluation of a Novel Integrated C1 Laminar Hook Combined with C1-C2 Transarticular Screws for Atlantoaxial Fusion: An In Vitro Human Cadaveric Study.","authors":"Tianming Xu, Qunfeng Guo, Qi Liu, Peng Zhang, Ming Lu, Xuhua Lu, Fei Chen, Xiang Guo, Bin Ni","author_ids":"8132289, 6014505, 1728293, 1678443, 4898850, 7828987, 2861400, 3255489, 7494664","abstract":"OBJECTIVE\nTo evaluate the acute stability of a novel integrated C1 laminar hook (H) combined with a C1-C2 transarticular screw (TAS) with established techniques.\n\n\nMETHODS\nA novel integrated C1 laminar hook was tested. Seven human cadaveric cervical spines (C0-C3) were used. The range of motion (ROM) of C1-C2 during flexion-extension, lateral bending, and axial rotation were recorded. The specimens were tested under the following conditions: intact, destabilized (using a type II odontoid fracture model), and destabilized but with internal fixation. The following screw systems were used: bilateral C1-C2 TAS combined with the Gallie (G) technique (TAS+G), C1-C2 TAS combined with a novel integrated C1 laminar hook (TAS+H), C1 lateral mass screw and C2 pedicle screws (C2PS+C1LMS), and novel integrated C1 laminar hook combined with C2 pedicle screws (C2PS+H). The TASs were always inserted after the C2PSs. The C2PS+C1LMS and C2PS+H tests were performed alternatively, as were the TAS+G and TAS+H tests.\n\n\nRESULTS\nAll fixation constructs greatly improved acute atlantoaxial stability, with no significant difference among TAS+H, TAS+G, and C2PS+C1LMS (all P > 0.05). C2PS+H showed the greatest C1-C2 ROM in axial rotation, significantly different from TAS+G, C2PS+C1LMS, and TAS+H fixation models (all P < 0.05). However, there were no significant differences between C2PS+H and the other 3 models in flexion-extension and lateral bending (all P > 0.05).\n\n\nCONCLUSIONS\nThe TAS+H technique can achieve acute stability comparable to that with the TAS+G technique for treating C1-C2 instability. The C2PS+H is a promising alternative, although it provides less stability in axial rotation than TAS+G, TAS+H, or C2PS+C1LMS.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"800c041615cfde504b4312689ebd7a8f9ca02a00","venue_1":"World neurosurgery","year":"2014","title":"Conservative management or intervention for unruptured brain arteriovenous malformations.","authors":"Robert M Starke, Jason P Sheehan, Dale Ding, Kenneth C Liu, Douglas Kondziolka, Richard W Crowley, L Dade Lunsford, Neal F Kassell","author_ids":"8639020, 5091811, 4617557, 6993590, 2051069, 7785344, 3850562, 7846847","abstract":"IMPORTANCE\nWhether conservative management is superior to interventional treatment for unruptured brain arteriovenous malformations (bAVMs) is uncertain because of the shortage of long-term comparative data.\n\n\nOBJECTIVE\nTo compare the long-term outcomes of conservative management vs intervention for unruptured bAVM.\n\n\nDESIGN, SETTING, AND POPULATION\nPopulation-based inception cohort study of 204 residents of Scotland aged 16 years or older who were first diagnosed as having an unruptured bAVM during 1999-2003 or 2006-2010 and followed up prospectively for 12 years.\n\n\nEXPOSURES\nConservative management (no intervention) vs intervention (any endovascular embolization, neurosurgical excision, or stereotactic radiosurgery alone or in combination).\n\n\nMAIN OUTCOMES AND MEASURES\nCox regression analyses, with multivariable adjustment for prognostic factors and baseline imbalances if hazards were proportional, to compare rates of the primary outcome (death or sustained morbidity of any cause by Oxford Handicap Scale [OHS] score ≥2 for ≥2 successive years [0 = no symptoms and 6 = death]) and the secondary outcome (nonfatal symptomatic stroke or death due to bAVM, associated arterial aneurysm, or intervention).\n\n\nRESULTS\nOf 204 patients, 103 underwent intervention. Those who underwent intervention were younger, more likely to have presented with seizure, and less likely to have large bAVMs than patients managed conservatively. During a median follow-up of 6.9 years (94% completeness), the rate of progression to the primary outcome was lower with conservative management during the first 4 years of follow-up (36 vs 39 events; 9.5 vs 9.8 per 100 person-years; adjusted hazard ratio, 0.59; 95% CI, 0.35-0.99), but rates were similar thereafter. The rate of the secondary outcome was lower with conservative management during 12 years of follow-up (14 vs 38 events; 1.6 vs 3.3 per 100 person-years; adjusted hazard ratio, 0.37; 95% CI, 0.19-0.72).\n\n\nCONCLUSIONS AND RELEVANCE\nAmong patients aged 16 years or older diagnosed as having unruptured bAVM, use of conservative management compared with intervention was associated with better clinical outcomes for up to 12 years. Longer follow-up is required to understand whether this association persists.","cites":"2","conferencePercentile":"85.42857143"},{"venue":"World neurosurgery","id":"1f185c1d6ce1242e61aa45be7fa025e4303cd5ba","venue_1":"World neurosurgery","year":"2016","title":"Testing the Reliability of BOLD-fMRI Motor Mapping in Patients with Cerebral Arteriovenous Malformations by Electric Cortical Stimulation and Surgery Outcomes.","authors":"Li Jun Wang, Fu Xin Lin, Bing Zhao, Jun Wu, Yong Cao, Shuo Wang","author_ids":"8709877, 7185155, 2115618, 1714535, 7185872, 5994097","abstract":"OBJECTIVE\nTo test the reliability of blood oxygenation level-dependent functional magnetic resonance imaging (fMRI) in the primary hand motor cortex (M1) among patients with arteriovenous malformations (AVMs) by electric cortical stimulation (ECS) and surgery outcomes.\n\n\nMETHODS\nForty-three patients with AVMs involving/adjacent to M1 underwent blood oxygen level-dependent fMRI (BOLD-fMRI) with repetitive finger-to-thumb opposition movements. The generated image sets were processed on the iPlan 3.0 workstation. A site-by-site comparison between the fMRI and ECS maps was performed with the aid of neuronavigation. Surgical outcomes were analyzed as the change between preoperative and postoperative muscle strength (MS). Finally, fMRI sensitivity was calculated, and correlations of lesion-to-activation distances (LAD) and surgery outcomes were analyzed.\n\n\nRESULTS\nThe highest activation location was found in the ipsilateral M1in 40 patients (93%). The highest activation relocated in the contralateral M1area in one patient (2.3%). No motor activation was found in the other 2 (4.7%) patients. ECS results were positive in 34 patients (85%, 34/40). The fMRI sensitivity was calculated as 85%. In total, 18 patients (41.9%) had worsened MS 1 week after surgery. Eight patients (18.6%) suffered from permanent muscle strength deterioration 6 months later. Moreover, an LAD ≤5 mm was significantly associated with permanent MS deterioration (P = 0.039).\n\n\nCONCLUSION\nBOLD-fMRI exhibits high sensitivity in motor mapping in patients with AVMs. LAD ≤5 mm may be associated with permanent MS deterioration in patients with AVM close to the motor cortex.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"ffc2b7d80a5f5917613396a880c77a589ae0704f","venue_1":"World neurosurgery","year":"2016","title":"Spinal Intramedullary Syphilitic Gumma: An Unusual Presentation of Neurosyphilis.","authors":"Chenlong Yang, Guang Li, Jingyi Fang, Hai Liu, Bao Yang, Yulun Xu","author_ids":"3784287, 5003981, 3074464, 4204183, 7324529, 7870132","abstract":"BACKGROUND\nSpinal syphilitic gumma is an unusual presentation of neurosyphilis, with a limited number of cases reported in the literature. Owing to its extreme rarity, the diagnosis and treatment of spinal syphilitic gumma and the relevant prognosis have not been outlined.\n\n\nCASE DESCRIPTION\nA 65-year-old woman with a history of neck, shoulder, and back pain presented with progressive sensorimotor disturbance of the extremities. Serologic tests revealed the presence of syphilis. Magnetic resonance imaging demonstrated an intramedullary nodule at the C5 level. A suspected diagnosis of spinal intramedullary tumor was made, and surgical resection of the nodule was performed. Histologic and immunohistochemical findings revealed a syphilitic gumma. We also conducted a comprehensive review of the published literature in all languages regarding spinal syphilitic gumma. The clinical and radiologic features, laboratory findings, therapeutic strategies, and follow-up data were analyzed.\n\n\nCONCLUSIONS\nSpinal syphilitic gumma can occur in the intramedullary region, and clinicians should be aware of this extremely rare entity, as it can be easily mistaken for more common neoplasms occurring at this site. The magnetic resonance imaging appearance of this entity has some suggestive characteristics, and a confident diagnosis depends on the pathology. Surgical resection can help to relieve acute spinal cord compression, and systemic antibiotic treatment for syphilis should be emphasized for long-term control.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"c965a095cc39a3d17d7b77068a3a8ef53f771bc0","venue_1":"World neurosurgery","year":"2015","title":"Cost of Surgery for Symptomatic Spinal Metastases in the United Kingdom.","authors":"Isobel Turner, Zulfiqar Minhas, Joanne Kennedy, Stephen Morris, Alan Crockard, David Choi","author_ids":"5659219, 7957351, 3068032, 4971894, 5408366, 3257330","abstract":"BACKGROUND\nSpinal metastases represent a significant health and economic burden. The average cost of surgical management varies between institutions and countries, partially a result of differences in health care system billing. This study assessed hospital costs from a single institute in the United Kingdom National Healthcare Service and identified patient factors associated with these costs.\n\n\nMETHODS\nThis prospective study recruited patients with confirmed symptomatic spinal metastases who presented for surgical treatment. The primary outcome was cost of inpatient treatment collected using the Patient Level Costing and Information System; preoperative details collected included patient demographics, primary tumor type, Tomita and Tokuhashi scores, pain level, EuroQol 5 dimension score, Frankel, Karnofsky, and American Society of Anesthesiologists' physical status classification system scores, and operative details.\n\n\nRESULTS\nCosts were analyzed for 74 patients. The mean cost of treatment (standard deviation, SD) per patient was £ 16,885 (£ 10,687); which was mainly comprised of operating theater (25% of the total) and ward costs (27%). Better health status at presentation significantly increased total and ward costs (Frankel score P = 0.006, and EuroQol 5 dimension index P = 0.014 respectively); male sex also increased total and ward costs (P < 0.01 and P = 0.06). Operation cost showed a trend to increased costs with less impairment on American Society of Anesthesiologists' physical status classification system scores.\n\n\nCONCLUSION\nThe cost of surgical management of spinal metastases is associated with several factors but is greater in patients presenting with better health status, probably because of their suitability for larger operations, whereas those with poor health status undergo smaller, palliative operations, resulting in shorter inpatient postoperative recovery.","cites":"0","conferencePercentile":"34.52970297"},{"venue":"World neurosurgery","id":"9e95564c795c7a3b4ff83e129d3e37ed829ae3b6","venue_1":"World neurosurgery","year":"2016","title":"Microsurgical Resection for Persistent Arteriovenous Malformations Following Gamma Knife Radiosurgery: A Case-Control Study.","authors":"Xianzeng Tong, Jun Wu, Jian Pan, Fuxin Lin, Yong Cao, Yuanli Zhao, Shuo Wang, Jizong Zhao","author_ids":"7450090, 1714535, 7589185, 4633240, 7185872, 3485720, 5994097, 7817852","abstract":"OBJECTIVE\nTo explore outcomes after microsurgery of brain arteriovenous malformations (AVMs) that failed to be obliterated by Gamma Knife radiosurgery (GKRS).\n\n\nMETHODS\nFrom January 2000 to January 2014, 42 consecutive patients underwent surgical resection of persistent AVMs after GKRS. These 42 patients with AVMs who underwent radiosurgery (radiosurgery group) were individually matched with 42 patients with AVMs who did not undergo radiosurgery (no radiosurgery group) based on patient and AVM characteristics. The modified Rankin Scale was used to assess neurologic status of patients. The effects of GKRS on AVM resection and surgical outcomes were analyzed.\n\n\nRESULTS\nAfter GKRS, the mean AVM volume was significantly reduced by 76.8% (P < 0.01), the size was reduced by 41% (P < 0.01), and the Spetzler-Martin grade was reduced in 61.9% of the patients (P < 0.01). During the time interval from radiosurgery to surgical resection, subsequent hemorrhages led to significant neurologic deterioration (P = 0.046). Compared with the control group, the frequency of preoperative embolization, operative time, and blood loss were significantly lower in the radiosurgery group (all P < 0.05). The no radiosurgery group had a significantly higher rate of worsening in mRS scores at 6 months after surgery (40.5% vs. 16.7%, P = 0.029). Good neurologic status (mRS score <3) was achieved in 81% of the radiosurgery group and 83% of the no radiosurgery group at the final follow-up evaluation.\n\n\nCONCLUSIONS\nGKRS performed several years before microsurgical resection can facilitate resectability of AVMs and decrease the rate of postoperative neurologic deterioration. For patients with persistent AVMs several years after GKRS, microsurgical resection is recommended to achieve good clinical outcomes.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"cc4ff57cd25d4a8dfdf81f35578552c9c009992e","venue_1":"World neurosurgery","year":"2016","title":"Evacuating Hypertensive Intracerebral Hematoma with a Cortical Sulcus Approach.","authors":"Zhibo Gao, Lingtao Qian, Chaoshi Niu, Bin Chen, Hongjun Guo, Pengju Sun, Yongzhi Wang, Liang Ning, Qi Li, Xianming Fu","author_ids":"2922356, 8597327, 8010668, 3671409, 7330428, 2750597, 7709292, 6417646, 1682467, 7780724","abstract":"OBJECTIVE\nTo study the curative effect and prognosis of patients with basal ganglia cerebral hemorrhages treated using a transcortical-sulcus approach and compare with results obtained using the traditional cerebral cortex approach.\n\n\nMETHODS\nClinical data were collected from 106 patients with hypertensive hemorrhage in the basal ganglia who were treated using either a transcortical-sulcus approach or traditional cerebral cortex approach. The rate of rehemorrhage, incidence of epilepsy, and 3-month efficacy (defined by an activities of daily living score) rate between the 2 groups were compared.\n\n\nRESULTS\nThe 3-month efficacy rates of patients treated using the transcortical-sulcus and traditional cerebral cortex surgical approaches were 78.4% and 60%, respectively (P < 0.05). The incidence of epilepsy was lower in the transcortical-sulcus approach group compared with the traditional approach group, and significant differences were detected between the 2 groups (P < 0.05).\n\n\nCONCLUSIONS\nThe transcortical-sulcus approach can significantly improve the prognosis of patients with intracerebral hemorrhages in the basal ganglia and reduce the incidence of postoperative seizures.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"326e6f40e8f98fda7cd9c929e80d13b3bf68cde6","venue_1":"World neurosurgery","year":"2016","title":"Combination Therapy of Salvianolic Acid and Fluoxetine Improves the Cognitive Function of Rats with Chronic Stress-induced Depression.","authors":"Lulu Yu, Cuixia An, Lina Jia, Yunpeng Li, Qianqian Chen, Fengya Zhen, Shuo Wang, Mingwei Wang","author_ids":"8548287, 4049288, 7469172, 2469811, 8559915, 7527777, 5994097, 7272059","abstract":"OBJECTIVE\nTo establish the beneficial effects of salvianolic acid and fluoxetine on the improvement of cognitive function and amelioration of depression-like symptoms of rats with chronic stress-induced depression.\n\n\nMETHODS\nNinety-nine male Sprague-Dawley rats were randomly divided into 5 groups--a control group with no stress challenge and 4 chronic stress groups. Rats assigned to chronic stress groups were exposed to stress for 3 weeks, and then were given placebo, fluoxetine (20 mg/kg), salvianolic acid (40 mg/kg), or combined fluoxetine and salvianolic acid. Body weight of each rat was recorded throughout the study. Sucrose preference test and water maze experiment were performed after chronic stress challenge and after drug treatment to assess the effect of drug treatments on depressive-like symptoms and cognitive function. The sucrose preference test was also performed before chronic stress exposure for baseline measurement.\n\n\nRESULTS\nExposure of rats to chronic stress for 3 weeks significantly reduced body weight and sucrose preference values compared with the no stress control. The water maze experiment showed that chronic stress impaired the spatial learning of rats as well. Treatment of stress-challenged rats with fluoxetine and fluoxetine combined with salvianolic acid resulted in shorter training latency and longer time spent in the target quadrant during the exploration stage of the water maze experiment compared with placebo treatment. Effect of the combined regimen was found more obvious.\n\n\nCONCLUSIONS\nCombination therapy of salvianolic acid and fluoxetine could alleviate depression-like symptoms and cognitive deficit induced by chronic stress.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"2e287d72127451ef05fcbfe7fa312c7056a1f757","venue_1":"World neurosurgery","year":"2016","title":"Ectopic Suprasellar Thyrotropin-Secreting Pituitary Adenoma: Case Report and Literature Review.","authors":"Qing Wang, Xiao-Jie Lu, Jun Sun, Jing Wang, Ci You Huang, Zhi Feng Wu","author_ids":"7135234, 3429929, 1680412, 3218415, 7900969, 7806572","abstract":"BACKGROUND\nEctopic thyroid-stimulating hormone (TSH)-secreting pituitary adenomas are rare and can often be misdiagnosed as primary hyperthyroidism. We present a case of an ectopic suprasellar TSH-secreting pituitary adenoma. A literature review of previously reported ectopic TSH-secreting and suprasellar pituitary adenomas is included to illustrate the clinical characteristics of this disease entity and the diversity of operative approaches to treating ectopic suprasellar pituitary adenomas.\n\n\nCASE DESCRIPTION\nA 46-year-old man presented with typical clinical signs of hyperthyroidism and a history of progressive visual field impairment and vision loss. Laboratory investigations revealed that the patient had elevated levels of free thyroxine and free triiodothyronine and a normal level of TSH. Neuro-ophthalmologic examination showed right eye/left eye = 1.0/0.6 and left temporal hemianopia. Magnetic resonance imaging revealed a mass located in the suprasellar space. The patient underwent preoperative short-term octreotide treatment followed by gross total resection of the tumor via the extended endoscopic endonasal transtuberculum sellar approach. At 6-month follow-up evaluation, the patient's endocrinologic function tests met the criteria for cure, and magnetic resonance imaging revealed a normal pituitary gland and stalk with no tumor recurrence. Histologic diagnosis confirmed the presence of a TSH-secreting pituitary adenoma.\n\n\nCONCLUSIONS\nTo the best of our knowledge, this is the first reported case of an ectopic suprasellar TSH-secreting pituitary adenoma. Preoperative preparation and complete resection are the keys to a cure. The extended endoscopic endonasal transtuberculum sellar approach is an alternative minimally invasive method for the removal of an ectopic suprasellar pituitary adenoma.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"cd3aa7036871ed7afc2f52c60b0daec1b1eca3c8","venue_1":"World neurosurgery","year":"2016","title":"Coiling is not superior to clipping in patients with high-grade aneurysmal subarachnoid hemorrhage: a systematic review and meta-analysis.","authors":"Zhi-Wei Xia, Xiao-Ming Liu, Jun-Yu Wang, Hui Cao, Feng-Hua Chen, Jun Huang, Qi-Zhuang Li, Shuang-Shi Fan, Bing Jiang, Zi-Gui Chen, Quan Cheng","author_ids":"7653423, 8016513, 7897969, 7699332, 7243302, 1691901, 8194604, 8596551, 3350151, 8157409, 7551952","abstract":"BACKGROUND\nOutcomes of coiling embolization versus clipping for patients with high-grade aneurysmal subarachnoid hemorrhage (aSAH) have not been previously compared. We reviewed the current evidence regarding the safety and efficacy of clipping versus coiling for high-grade aSAH.\n\n\nMETHODS\nWe conducted a meta-analysis of studies that comparring clipping with coiling in patients with high-grade aSAH published from January 1999-February 2016 in Medline, Embase, and Cochrane databases based on PRISMA inclusion and exclusion criteria. Binary outcomes comparisons between clipping and coiling were described using odds ratios (ORs).\n\n\nRESULTS\nThree randomized controlled trials (RCTs) and 16 observational studies were included. There was no statistical difference in good outcome rates between the clipping and coiling groups (OR, 1.44; 95% confidence interval [CI], 0.97-2.13). Subgroup analysis showed no significant difference between the two treatments in non-RCTs (OR, 1.49; 95% CI, 0.95-2.36) and RCTs (OR, 1.15; 95% CI, 0.59-2.25). Coiling was associated with higher mortality (OR, 0.55; 95% CI, 0.41-0.75). Lower mortality was associated with clipping in non-RCTs (OR, 0.54; 95% CI, 0.40-0.74), but there was no difference in the RCTs (OR, 0.79; 95% CI, 0.19-3.39). Coiling was not associated with lower rates of complications including rebleeding (OR, 0.62; 95% CI, 0.30-1.29), ischemic infarct (OR, 0.89; 95% CI, 0.53-1.49), symptomatic vasospasm (OR, 0.76; 95% CI, 0.45-1.29), or shunt-dependent hydrocephalus (OR, 1.33; 95% CI, 0.52-3.40).\n\n\nCONCLUSIONS\nThe outcome with coiling is not superior to clipping in patients with high-grade aSAH, moreover, coiling has a greater risk of mortality.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"ccd5dfcc9c6c52307e5e0677424a1b388593a621","venue_1":"World neurosurgery","year":"2016","title":"Increased peri-operative crystalloid transfusion is associated with better outcomes after spontaneous hypertensive putamen hemorrhage: A retrospective study.","authors":"Li-Min Zhang, Xiao-Chun Zhao, Qian Zhang, Luo-Xing Liao","author_ids":"7559430, 8343928, 1737486, 7375330","abstract":"BACKGROUND\nThe appropriate amount of transfused fluids, as well as which types of fluids should be transfused during the peri-operative period is a matter of controversy amongst neurosurgeons. Thus, a retrospective study was conducted to assess whether or not crystalloid transfusion is associated with better outcomes after spontaneous hypertensive putamen hemorrhage (HPH).\n\n\nMETHOD\nData from acute spontaneous HPH surgeries which were performed between December 2013 and June 2016 were collected in a multi-center chart. The primary outcome was prognosis, with better outcome defined as a Glasgow Outcome Score (GOS) ≥4. The secondary outcome was survival, with survival defined as a GOS ≥2. Univariate analysis and bivariate logistic regression were performed to account for the association between peri-operative HPH and different outcomes. We also used Spearman's rank correlation and linear regression to determine the correlation between length of hospital stay (LOS) and the univariate analysis significant factors in patients with a GOS ≥4.\n\n\nRESULTS\nBivariate logistic regression showed a marked correlation between better outcome and age (odds ratio [OR], 0.927; 95% confidence interval [CI], 0.851-0.995), Glasgow Coma Scale (GCS; OR, 1.162; 95% CI, 1.049-1.356), and crystalloid transfusion (OR, 1.083; 95% CI, 1.005-1.142). Additionally, bivariate logistic regression was also revealed a significant correlation between survival and GSC (OR, 1.097; 95% CI, 1.056-1.199). In patients with a GOS≥4, Spearman's rank correlation and linear regression suggested that a higher GCS was more likely to prolong the LOS.\n\n\nCONCLUSION\nIncreased peri-operative crystalloid transfusion was independently associated with better outcome across a spectrum of surgical risk profiles after spontaneous HPH.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"3090a86a3a7a8664be6260ab7c300e86e063eb90","venue_1":"World neurosurgery","year":"2015","title":"Functional Neuronavigation-Guided Transparieto-Occipital Cortical Resection of Meningiomas in Trigone of Lateral Ventricle.","authors":"Guo-chen Sun, Xiao-lei Chen, Xin-guang Yu, Meng Zhang, Gang Liu, Bao-ke Hou, Xiao-dong Ma","author_ids":"7332940, 8082366, 7933074, 1726578, 1697913, 8231533, 7832678","abstract":"BACKGROUND\nThis study investigated whether functional neuronavigation can be used to remove lesions in the lateral ventricle while preserving patients' neurologic functionality.\n\n\nMETHODS\nA total of 60 patients with lateral ventricular meningiomas were divided into study and control groups (n = 30 each). Diffusion tensor and blood oxygenation level-dependent functional magnetic resonance imaging were used for fiber tracking and eloquent cortex localization, respectively, in the study group. The surgical approach was based on coregistered data sets from 3-D lesion and brain structure reconstructions. Patients in the control group underwent anatomic neuronavigation-guided surgery. The patients' demographics, degree of resection, visual field, language score, movement, preoperative and postoperative Karnofsky Performance Status (KPS) scores, and surgical complications were recorded.\n\n\nRESULTS\nTumors were completely removed in both groups. Patients in the study group had a higher rate of visual field preservation than controls (P = 0.01). The two groups had similar motor and language functions after surgery, except that fewer cases of transient aphasia were observed in the former (P < 0.05). KPS scores for the study and control groups were 80 (70-80) and 70 (60-70), respectively (P < 0.01), at 2 weeks and 90 (80-100) and 85 (70-90), respectively (P = 0.022), at 3 months after surgery.\n\n\nCONCLUSIONS\nFunctional neuronavigation preserved neurologic functionality and was especially beneficial for protecting optical functionality and for the rapid recovery of patients.","cites":"0","conferencePercentile":"34.52970297"},{"venue":"World neurosurgery","id":"6cde85fe1b265290de3a84a3ee24f187a39c1576","venue_1":"World neurosurgery","year":"2016","title":"The Feasibility Analysis for Treatment of Infancy Giant Intracranial Benign Tumor by Delayed-Operation.","authors":"Wanchun Zhu, Xiang Li, Jintao He, Fei Di, Wei Liu, Lei Wang, Yongji Tian, Chunde Li, Jian Gong","author_ids":"8480825, 1737850, 8516297, 6883124, 3406396, 1787810, 8193388, 5063841, 4513457","abstract":"OBJECTIVE\nThe survival rate and prognosis in infants with giant intracranial tumors is significantly worse than in older children. This study aimed to analyze the feasibility of delayed-operation for infants with giant intracranial benign tumor by evaluating the initial clinical presentations, expectant treatment measures, perioperative vital signs, and recuperation after surgery.\n\n\nPATIENTS AND DATA\nWe collected 3 infant patients aged 9.33 months (aged<1 year, ranged 5 to 12 months) on average with giant intracranial benign tumors during January 2015 and April 2016. The maximum sections of tumors were 38×50 mm, 57×39 mm, and 55×67 mm, respectively. All clinical presentation, neuroimaging, and laboratory examinations were recorded.\n\n\nRESULT\nObstructive hydrocephalus was observed in 2 infants and both had ventriculo-peritoneal (V-P) shunts prior to the delayed tumor resection. The disease progressed rapidly in the infant with teratoma and surgery was performed 4 months after the V-P shunt. The other 2 patients had experienced 12 months growth and developmental phase and later received operations. Gross total resection (GTR) had been achieved in all patients. The pathological results were consistent with the preoperative diagnosis. During a period of time with high-quality postoperative care, they were remained stable and were discharged without any complication or neurological deficits, continuing to improve towards their baseline.\n\n\nCONCLUSION\nThe delayed-operative for patients this age enabled infant cases to gain a better physical state with a stage of full preoperative preparation that may reduce the intra-/postoperative morbidity and mortality.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"a4f43bdd4ec7a6154703e040acc0aeff1dc15947","venue_1":"World neurosurgery","year":"2016","title":"More Precise Imaging Analysis and Diagnosis of Moyamoya Disease and Moyamoya Syndrome Using High-Resolution Magnetic Resonance Imaging.","authors":"Le-Bao Yu, Huan He, Ji-Zong Zhao, Rong Wang, Qian Zhang, Zhi-Yong Shi, Jun-Shi Shao, Dong Zhang","author_ids":"4875760, , 7817852, 1698066, 1737486, 7947703, 8187417, 4944112","abstract":"BACKGROUND\nThe diagnosis of moyamoya disease (MMD) is often uncertain. Moyamoya syndrome (MMS) is often misdiagnosed as MMD. High-resolution magnetic resonance imaging (HR-MRI) enables vessel wall assessment to obtain more precise diagnoses. The aim of this study was to determine the true etiologies of arterial steno-occlusion in patients with an angiographic diagnosis of MMD or MMS using HR-MRI.\n\n\nMETHODS\nHR-MRI was performed in 21 adult patients with angiographically proven MMD or MMS. A definite diagnosis was based on the HR-MRI findings. The diagnoses made via the 2 different imaging technologies were compared, and significant findings were analyzed.\n\n\nRESULTS\nA total of 21 patients were enrolled, including 7 patients with angiographically proven MMD and 14 patients with angiographically proven MMS. Among the 7 patients with MMD, HR-MRI confirmed the diagnosis of MMD in 6; the remaining patient was considered to have atherosclerosis in the bilateral distal internal carotid arteries (ICAs) and the left middle cerebral artery. Among the 14 patients with MMS, HR-MRI confirmed MMD in 6 patients (including 2 patients with unilateral MMD), atherosclerosis in 5 patients (including 3 patients with bilateral atherosclerosis and 2 with unilateral atherosclerosis), arterial dissection of the left ICA in 1 patient, and MMD in the left cerebral hemisphere with atherosclerosis in the right hemisphere in 2 patients.\n\n\nCONCLUSIONS\nDifferentiating MMD from MMS is difficult in certain situations, and HR-MRI may help provide a more in-depth understanding of MMD and MMS, thereby achieving a more reliable diagnosis.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"f08cc934f9e1ddaba2e85666d56a3c2e77d33c57","venue_1":"World neurosurgery","year":"2016","title":"Endoscopic Endonasal Anterior Skull Base Surgery: A Systematic Review of Complications During the Past 65 Years.","authors":"Anouk Borg, Matthew A Kirkman, David Choi","author_ids":"8119766, 4421827, 3257330","abstract":"BACKGROUND\nEndoscopic skull base surgery is becoming more popular as an approach to the anterior skull base for tumors and cerebrospinal fluid (CSF) fistulae. It offers the advantages of better cosmesis and improved quality of life after surgery. We reviewed the complication rates reported in the literature.\n\n\nMETHODS\nA literature search was performed in the electronic database Ovid MEDLINE (1950 to August 25, 2015) with the search item \"([Anterior] AND Skull base surgery) AND endoscopic.\"\n\n\nRESULTS\nWe identified 82 relevant studies that included 7460 cases. An average overall complication rate of 17.1% (range 0%-68.0%) and a mortality rate of 0.4% (0%-10.0%) were demonstrated in a total of 82 studies that included 7460 cases. The average CSF leak rate for all studies was 8.9% (0%-40.0%) with meningiomas and clival lesions having the greatest CSF leak rates. The most frequent benign pathology encountered was pituitary adenomas (n = 3720, 49.8% of all cases) and the most frequent malignant tumor was esthesioneuroblastoma (n = 120, 1.6% of all cases). Studies that included only CSF fistula repairs had a lower average total complication rate (12.9%) but a greater rate of meningitis compared with studies that reported mixed pathology (2.4% vs. 1.3%). A trend towards a lower total complication rate with increasing study size was observed.\n\n\nCONCLUSIONS\nThe endoscopic approach is an increasingly accepted technique for anterior skull base tumor surgery and is associated with acceptable complication rates. Increasing experience with this technique can decrease rates of complications.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"f9e72bf6332d3e965fafab868c44a89b482a2f30","venue_1":"World neurosurgery","year":"2016","title":"Endovascular treatment of spontaneous intracranial fusiform and dissecting aneurysms: outcomes related to imaging classification of 309 cases.","authors":"Yisen Zhang, Zhongbin Tian, Binbin Sui, Yang Wang, Jian Liu, Miao Li, Youxiang Li, Chuhan Jiang, Xinjian Yang","author_ids":"7549144, 5776601, 6097441, 1747927, 2106964, 1766929, 4829241, 6622728, 8314095","abstract":"OBJECTIVE\nThis study aimed to propose a modified classification of spontaneous intracranial dissecting aneurysms (IDAs) and to guide the treatment for IDAs.\n\n\nMETHODS\nBetween January 2010 and December 2015, 3183 consecutive patients were referred to our department for endovascular treatment of a cerebral aneurysm and 309 patients harboring 323 spontaneous IDAs were identified from them. Based on a modified imaging classification, spontaneous IDAs were classified into four subtypes: classic dissecting aneurysm, segmental ectasia, dolichoectatic dissecting aneurysm, and large mural bleeding ectasia. The logistic regression analysis was performed to find predictors of clinical outcome of patients.\n\n\nRESULTS\nOf the 323 IDAs, 216 (66.87%) were treated with stent-assisted coiling, 47 (14.55%) with internal trapping, and 60 (18.58%) with sole stenting. Of the 309 patients, 8 (2.59%) suffered intraoperative complications and 40 (12.94%) had postoperative complications; 9 patients (2.79%) died and 1 (0.32%) had severe disability. The mean duration of clinical follow-up of the 309 patients was 10.40 months (range, 3-72 months). Imaging follow-up was available for 262 patients (274 IDAs) with a mean duration 7.10 months (range, 3-60 months), and 24 (9.16%) aneurysm recurrences was noted. Aneurysm type was the only independent predictor of different outcome by logistic regression analysis (P=0.004).\n\n\nCONCLUSIONS\nThere was a strong relationship between the subtypes of the spontaneous IDAs and their clinical course. This classification was confirmed as helpful in assessing the prognosis of patients and guiding their treatment.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"585801e076573b8527aa15128afdc99287ef96a1","venue_1":"World neurosurgery","year":"2016","title":"Transforaminal Endoscopic Solution to a Kyphoplasty Complication: Technical Note.","authors":"Ralf Wagner, Albert E Telfeian, Menno Iprenburg, Guntram Krzok, Ziya Gokaslan, David B Choi, Francesco G Pucci, Adetkumbo Oyelese","author_ids":", 4186848, 4758607, 8066869, 5325973, 3257330, 2076487, 8264226","abstract":"Kyphoplasty is a minimally invasive spine surgical procedure performed to stabilize and treat the pain caused by a spine compression fracture. Complications are rare with kyphoplasty and include cement extrusion into the vertebral canal leading to spinal cord or nerve root compression. Herein, the authors present a case of a 72-year-old woman who presented with symptoms of a right L2 radiculopathy after a kyphoplasty procedure. Computed tomography imaging showed leakage of the kyphoplasty cement into the neural foramen above and medial to the right L2 pedicle. A transforaminal endoscopic surgical approach was used to remove the cement and decompress the L2 nerve. The patient's postoperative clinical course was uneventful. Clinicians should be aware that for the treatment of complications to vertebroplasty and kyphoplasty procedures, minimally invasive transforaminal endoscopic surgery is one option to avoid the destabilizing effects of laminectomy and facetectomy.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"86dff310f40a4b4895ce4f35c5248e342b322ec9","venue_1":"World neurosurgery","year":"2016","title":"Spinal Cervical Meningiomas: The Challenge Posed by Ventral Location.","authors":"Nicolas Lonjon, Vittorio Russo, Manlio Barbarisi, David Choi, James Allibone, Adrian Casey","author_ids":"5847904, 3180809, 7442903, 3257330, 5151457, 6841204","abstract":"OBJECTIVE\nTo evaluate the incidence, clinical presentation, operative techniques, and long-term outcome of spinal cervical meningiomas after surgery.\n\n\nMETHODS\nTwenty-two patients harboring spinal meningiomas on cervical region were treated between 2004 and 2014 in our department. Diagnosis was made via magnetic resonance imaging and confirmed histologically. Microsurgical resection was performed through different surgical approaches according to location of the tumor. To remove the tumor, the posterior, far-lateral, and combined approaches were used, respectively, in 13 patients (56%), 8 patients (35%), and 2 patients (9%).\n\n\nRESULTS\nThe mean follow-up was 40 ± 26.5 months. The most common site of dural attachment of meningioma was ventral or ventrolateral to the spinal cord. Macroscopic resection was considered complete in 55% of cases. Neurologic improvement was observed in 60% of cases. The rate of operative mortality and morbidity was high (26.5%). Five patients underwent postoperative radiotherapy according to the actual recommendation, and the overall recurrence rate was 9%.\n\n\nCONCLUSIONS\nSpinal meningiomas are benign tumors for which advances in imaging tools and microsurgical techniques have yielded better results. The goal of surgery should be the total resection, which significantly decreases the risk of recurrence with an acceptable morbidity. Cervical locations represent a challenge particularly for ventro and ventrolaterally located tumors. Despite the difficulty of performing a complete resection, the results obtained in this work advocate for the use of the far-lateral approach to manage meningiomas locate anterior to the neural axis.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"491a3460dc316fed3376994e4e50cf8f2c6bdfec","venue_1":"World neurosurgery","year":"2015","title":"Assessing Microneurosurgical Skill with Medico-Engineering Technology.","authors":"Kanako Harada, Akio Morita, Yoshiaki Minakawa, Young Min Baek, Shigeo Sora, Naohiko Sugita, Toshikazu Kimura, Rokuya Tanikawa, Tatsuya Ishikawa, Mamoru Mitsuishi","author_ids":"3344956, 3216347, 8040232, 7254936, 2706036, 2587275, 1759113, 3549432, 2915669, 1699784","abstract":"OBJECTIVES\nMost methods currently used to assess surgical skill are rather subjective or not adequate for microneurosurgery. Objective and quantitative microneurosurgical skill assessment systems that are capable of accurate measurements are necessary for the further development of microneurosurgery.\n\n\nMETHODS\nInfrared optical motion tracking markers, an inertial measurement unit, and strain gauges were mounted on tweezers to measure many parameters related to instrument manipulation. We then recorded the activity of 23 neurosurgeons. The task completion time, tool path, and needle-gripping force were evaluated for three stitches made in an anastomosis of 0.7-mm artificial blood vessels. Videos of the activity were evaluated by three blinded expert surgeons.\n\n\nRESULTS\nSurgeons who had recently done many bypass procedures demonstrated better skills. These skilled surgeons performed the anastomosis with in a shorter time, with a shorter tool path, and with a lesser force when extracting the needle.\n\n\nCONCLUSIONS\nThese results show the potential contribution of the system to microsurgical skill assessment. Quantitative and detailed analysis of surgical tasks helps surgeons better understand the key features of the required skills.","cites":"0","conferencePercentile":"34.52970297"},{"venue":"World neurosurgery","id":"4473640d48fd582cfe38bc2a369984c5699fedb6","venue_1":"World neurosurgery","year":"2013","title":"Nucleus accumbens surgery for addiction.","authors":"Nan Li, Jing Wang, Xue-lian Wang, Chong-wang Chang, Shun-nan Ge, Li Gao, He-ming Wu, Hai-kang Zhao, Ning Geng, Guo-dong Gao","author_ids":"1736069, 3282575, 3144834, 6281756, 5327849, 3644655, 7263522, 4232488, 8337823, 2172147","abstract":"BACKGROUND\nOpiate addiction remains intractable in a large percentage of patients, and relapse is the biggest hurdle to recovery because of psychological dependence. Multiple studies identify a central role of the nucleus accumbens (NAc) in addiction; several studies note decreased addictive behavior after interventions in this area.\n\n\nMETHODS\nBased on animal experiments, our institute started the clinical trial for the treatment of drug addicts' psychological dependence by making lesions in the bilateral NAc with stereotactic surgery from July 2000.\n\n\nRESULTS\nThe short-term outcomes were encouraging and triggered rapid application of this treatment in China from 2003 to 2004. However, lack of long-term outcomes and controversy eventually led to halting the surgery for addiction by the Ministry of Health of China in November 2004 and a nationwide survey about it later. Our institute had performed this surgery in 272 patients with severe heroin addiction. The follow-up study showed that the 5-year nonrelapse rate was 58% and the quality of life was significantly improved. Patients had several kinds of side effects, but the incidence rate was relatively low. The patients gradually recovered more than 5 years after the surgery. The side effects did not severely influence an individual's life or work. Nationwide surgery showed that the nonrelapse rate was 50% in the sample of 150 cases, from 1167 patients overall who underwent stereotactic surgery in China.\n\n\nCONCLUSIONS\nAlthough sometimes accompanied by neuropsychological adverse events, stereotactic ablation of NAc may effectively treat opiate addiction. Lesion location has a significant impact on treatment efficacy and requires further study. Because ablation is irreversible, the NAc surgery for addiction should be performed with cautiousness, and deep brain stimulation (DBS) is an ideal alternative.","cites":"0","conferencePercentile":"19.52554745"},{"venue":"World neurosurgery","id":"bce5a7b2b17bb8dfa0b4205162e88f8b5aedb6f1","venue_1":"World neurosurgery","year":"2016","title":"Standalone Anterior Cervical Discectomy and Fusion Versus Combination with Foraminotomy for the Treatment of Cervical Spondylotic Radiculopathy Secondary to Bony Foraminal Stenosis.","authors":"Qunfeng Guo, Liang Wang, Bangke Zhang, Jiayao Jiang, Xiang Guo, Xuhua Lu, Bin Ni","author_ids":"6014505, 1745316, 7504581, 8571387, 3255489, 7828987, 7494664","abstract":"OBJECTIVE\nTo compare the results of anterior cervical discectomy and fusion (ACDF) combined with anterior cervical foraminotomy (ACF) and standalone ACDF for the treatment of cervical spondylotic radiculopathy (CSR).\n\n\nMETHODS\nThe data of 24 consecutive patients who underwent ACDF combined with ACF for significant bony foraminal stenosis were reviewed. The clinical outcomes, including visual analog scale (VAS) scores for neck pain and arm pain and Neck Disability Index, were evaluated by questionnaires. Radiologic outcomes as manifested by C2-7 angle and surgical segmental angle were recorded. The outcomes were compared with outcomes of standalone ACDF for CSR secondary to posterolateral spurs.\n\n\nRESULTS\nAt the final follow-up evaluation, all patients obtained bone fusion. No patient developed adjacent segment disease. Operative time was longer and blood loss was more in the ACDF combined with ACF group than in the ACDF group (all P < 0.05). However, in both groups, the neck VAS score, arm VAS score, and Neck Disability Index were significantly reduced postoperatively (all P < 0.05). The segmental curve and C2-7 lordosis were significantly improved postoperatively (all P < 0.05). There was no significant difference between the 2 groups in clinical and radiologic outcomes (P > 0.05).\n\n\nCONCLUSIONS\nFor CSR with foraminal stenosis secondary to significant bony pathology that cannot be managed with standalone ACDF, ACDF combined with ACF is an effective and safe treatment strategy.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"33553f955a36ce4b1f7cbe5bab48f196ef1ef39f","venue_1":"World neurosurgery","year":"2016","title":"Surgical Treatment of Cavernous Malformations Involving the Posterior Limb of the Internal Capsule: Utility and Predictive Value of Preoperative Diffusion Tensor Imaging.","authors":"Fuxin Lin, Jun Wu, Lijun Wang, Bing Zhao, Xianzeng Tong, Zhen Jin, Shuo Wang, Yong Cao","author_ids":"4633240, 1714535, 1733333, 2115618, 7450090, 6253281, 5994097, 7185872","abstract":"OBJECTIVE\nThe surgical treatment of cavernous malformations involving the posterior limb of the internal capsule (PLIC-CMs) is challenging. The aim of this study was to determine the utility and predictive value of preoperative diffusion tensor imaging (DTI) in the surgical treatment of PLIC-CMs.\n\n\nMETHODS\nPatients with PLIC-CMs who were surgically treated between September 2012 and June 2015 were reviewed. All patients underwent preoperative DTI. Three major fiber tracts were selected for evaluation: 1) corticospinal tract (CST); 2) arcuate fasciculus (AF); and 3) optic radiation (OR). The utility of preoperative DTI for surgical approach selection and intraoperative navigation was documented. An involvement grading system of the major fibers was applied to determine the predictive value of preoperative DTI. A last modified Rankin Scale (mRS) score of 0-2 was considered a good outcome, and a last mRS >2 was considered a poor outcome.\n\n\nRESULTS\nThirteen patients with 13 PLIC-CMs were reviewed in this study. All the lesions were radically resected via the corridor formed by CST, AF, and OR. None of the patents suffered from mRS >3, and 7 patients (53.8%) got good outcomes at the last clinic visit. The difference between the preoperative mRS scores and last mRS scores was not significant (P = 0.673). The involvement grade of the fiber tracts was significantly associated with the surgical outcome (P = 0.011).\n\n\nCONCLUSIONS\nPreoperative DTI may be a promising tool to determine the surgical approach and predict the surgical outcomes in patients with PLIC-CMs.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"bc970bef88b75c80f8275cbb3dbb21e7a4f7498c","venue_1":"World neurosurgery","year":"2016","title":"Endovascular Mechanical Thrombectomy with the Solitaire Device for the Treatment of Acute Basilar Artery Occlusion.","authors":"Xiaochuan Huo, Feng Gao, Xuan Sun, Ning Ma, Ligang Song, Dapeng Mo, Lian Liu, Bo Wang, Xuelei Zhang, Zhongrong Miao","author_ids":"6885991, 1710132, 5212500, 4476703, 5938572, 2599941, 4158867, 3318138, 8444101, 7844211","abstract":"OBJECTIVE\nTo determine the safety and efficacy of endovascular treatment with the Solitaire device for acute basilar artery occlusion (ABAO) and identify factors affecting clinical outcomes.\n\n\nMETHODS\nWe enrolled 36 consecutive ABAO patients (aged 58.6 ± 8.10 years) who underwent mechanical thrombectomy with the Solitaire device. We analyzed baseline characteristics, mechanical thrombectomy results, and factors predicting clinical outcomes, which were assessed at 90 days.\n\n\nRESULTS\nThe median prethrombectomy National Institutes of Health Stroke Scale (NIHSS) score was 25.50 (interquartile range: 21.00-29.00); the median prethrombectomy Glasgow Coma Scale (GCS) score was 8.00 (5.00-9.75). Thirty patients (83.3%) had atherosclerotic stenosis of the occluded artery, and 25 underwent angioplasty (69.4%). Recanalization was successful (Thrombolysis in Cerebral Infarction grade: 2b-3) in 34 patients (94.4%). Six symptomatic intracranial hemorrhages (16.67%) occurred. Favorable outcomes (modified Rankin scale [mRS] score: 0-2) were achieved in 27.8% patients (10/36). The overall mortality rate was 30.6% (11/36) at 90 days. On univariate analysis, low prethrombectomy GCS and high post-thrombectomy NIHSS scores were associated with poor outcomes (mRS score >2) and mortality. Prethrombectomy unconsciousness, onset-to-recanalization time > 10.5 hours, and severe stenosis were associated with poor outcomes. Age ≥ 60 years was associated with mortality.\n\n\nCONCLUSIONS\nEndovascular treatment with the Solitaire device yielded high recanalization rates in ABAO patients and favorable clinical outcomes in approximately one third of patients. Intracranial stenosis was the main cause of occlusion. Angioplasty was commonly performed during mechanical thrombectomy to improve recanalization and prognosis. Early recanalization and better prethrombectomy status predicted better outcomes.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"3575ec45367de893429fb95926da43143ec45163","venue_1":"World neurosurgery","year":"2016","title":"Effects of Temozolomide and Radiotherapy on Brain Metastatic Tumor: A Systematic Review and Meta-Analysis.","authors":"Wenhua Ma, Na Li, Yonghui An, Changpeng Zhou, Changwen Bo, Guangyu Zhang","author_ids":"7884636, 1748656, 2802485, 8239029, 3865819, 8273903","abstract":"OBJECTIVE\nTo systematically evaluate safety and efficacy of temozolomide plus radiotherapy in the treatment of brain metastasis.\n\n\nMETHODS\nLiterature was searched in the following databases: Cochrane Controlled Trials Register (CENTRAL), PubMed (1994-2015.10), CBM (1978-2015.10), CNKI (1994-2015.10), VIP (1994-2015.10), and WANFANG (1994-2015.10). Randomized clinical trials (RCTs) of temozolomide plus radiotherapy in comparison with radiotherapy alone were included in this review and meta-analysis. The quality of included literatures was assessed by the international Cochrane collaboration method, and meta-analysis was performed using RevMan 5.0 software.\n\n\nRESULTS\nTotal 19 publications of RCTs were included, and there was no allocation concealment or blinding in any of them. Six of the 19 were multicenter RCTs. Overall response rate (ORR) was in favor of radiotherapy plus temozolomide (risk ratio [RR] = 1.35, 95% CI: 1.23-1.47). Subgroup analysis of non-small cell lung cancer (NSCLC) metastasis brain tumor also showed that ORR was in favor of radiotherapy plus temozolomide (RR = 1.38; 95% CI: 1.17-1.63). Progression-free survival (PFS) or overall survival rate, however, was not significantly different between the 2 treatment groups. In addition, incidence of side effect was significantly higher in the group of radiotherapy plus temozolomide than that of radiotherapy alone (HR = 2.03, 95% CI: 1.56-2.64).\n\n\nCONCLUSION\nAddition of temozolomide to radiotherapy could increase ORR in brain metastatic tumors. However, it did not significantly improve PFS or OS in the patients with brain metastases but increased risk of drug-related toxicity.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"0e5d1bbba0a0d7c00e5bca4c38e67357ce06650d","venue_1":"World neurosurgery","year":"2016","title":"Immunohistochemical Analysis of Sox17 Associated Pathway in Brain Arteriovenous Malformations.","authors":"Yulius Hermanto, Yasushi Takagi, Akira Ishii, Kazumichi Yoshida, Takayuki Kikuchi, Takeshi Funaki, Yohei Mineharu, Susumu Miyamoto","author_ids":"8249899, 2668488, 1727896, 6883119, 2040460, 6424870, 7021562, 3309153","abstract":"BACKGROUND\nSox17 has emerged as an important factor in vascular remodeling because of the potential linkage with Wnt/β-catenin, Notch, and the inflammatory pathway. Brain arteriovenous malformation (BAVM), as an angiogenic and inflammatory disorder, might possess an aberrant regulation of the Sox17 associated pathway. We sought to investigate the expression of the Sox17 associated pathway in BAVMs.\n\n\nMETHODS\nUsing immunohistochemical methods, 16 paraffin specimens of BAVM nidus were analyzed. Specimens were obtained from patients during surgical procedures.\n\n\nRESULTS\nExpression of Sox17, Hey1, and β-catenin was observed in all specimens. Large veins possessed a distinct pattern of expression; thick-walled veins had a stronger intensity, whereas thin-walled veins had a weaker intensity, of Sox17, Hey1, and β-catenin (P < 0.001). Thick-walled veins also had a higher expression of Sox17, Hey1, and β-catenin compared with large arteries (P < 0.05). Hey1 and β-catenin expression was also higher in thick-walled veins compared with brain microvessels (P < 0.01). In addition, the difference in expression of the Sox17 associated pathway (Hey1 and β-catenin) was observed in medium and small arteries compared with large arteries in BAVM nidus and brain microvessels (P < 0.01).\n\n\nCONCLUSIONS\nThe Sox17 associated pathway was activated in the BAVM nidus. Our results indicate that arterial identity is gained in thick-walled veins; this might reflect the process of arterialization of the veins as a result of hemodynamic stress. In addition, high expression of the Sox17 associated pathway in medium and small arteries indicates that BAVM vessels are intrinsically active.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"d4566b8a7d63eca968bb56636534b0e173aad727","venue_1":"World neurosurgery","year":"2016","title":"Cerebral Sparganosis in Children: Epidemiologic and Radiologic Characteristics and Treatment Outcomes: A Report of 9 Cases.","authors":"Yonglin Yu, Jue Shen, Zhefeng Yuan, Zhezhi Xia, Feng Gao, Lihua Jiang, Kewen Jiang","author_ids":"7877287, 2872242, 8591168, 8702819, 1710132, 7921442, 7502182","abstract":"BACKGROUND\nPediatric cerebral sparganosis has been seldom reported. In the current study, we retrospectively reviewed the clinicopathologic records of 9 consecutive pediatric cases of cerebral sparganosis and analyzed their epidemiologic characteristics and clinical outcomes.\n\n\nMETHODS\nOur cases included 6 boys and 3 girls, all from rural areas, and their median age at diagnosis was 9.4 (range, 5.8-12.9) years. The median duration of symptoms from onset to definite diagnosis was 21 months (range, 1 week to 3.7 years).\n\n\nRESULTS\nEnzyme-linked immunosorbent assay revealed that serum anti-sparganosis antibody was positive in 9 of 9 patients and cerebrospinal fluid anti-sparganosis antibody was positive in 4 of 6 patients. Eight patients underwent craniotomy the removal of worms. The patients also received oral praziquantel. They were followed up for 2.2 years to 4.4 years. One patient died, and 8 patients survived. Three cases had poor outcomes whereas the outcome of the remaining 5 cases was satisfactory.\n\n\nCONCLUSIONS\nChildren are more at risk for sparganosis and cerebral sparganosis may be missed because of unclear epidemiologic history and nonspecific manifestations. Cerebrospinal fluid eosinophil counts and enzyme-linked immunosorbent assay for anti-sparganosis antibody and computed tomography/magnetic resonance imaging scans may be relied on for an early and accurate diagnosis before surgery.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"df19e3bc2938375547c8cfba5b9946bacfa22c9d","venue_1":"World neurosurgery","year":"2014","title":"Intraoperative ultrasound guidance for the placement of permanent ventricular cerebrospinal fluid shunt catheters: a single-center historical cohort study.","authors":"R Webster Crowley, Aaron S Dumont, Ashok R Asthagiri, James C Torner, Ricky Medel, John A Jane, John A Jane, Neal F Kassell","author_ids":"7785344, 5468723, 4657398, 2797388, 1833732, 8565020, 8565020, 7846847","abstract":"OBJECTIVE\nDespite the frequency with which ventriculoperitoneal shunts are placed, ventricular catheter revision rates remains as high as 30%-40% at 1 year. Many neurosurgeons place ventricular catheters \"blindly\" depending on anatomical landmarks and personal experience. To determine whether intraoperative ultrasonography is beneficial for ventricular catheter placement, we performed a historical cohort study comparing shunts placed with intraoperative ultrasound (US) guidance to those placed blindly.\n\n\nMETHODS\nWe reviewed all shunts placed by the Department of Neurosurgery at the University of Virginia from January 2005 to January 2007. During that time 211 patients underwent 242 shunts, with US use determined by surgeon's preference. Ninety-two shunts were placed by the use of US guidance, and 150 were placed without US. Adults received 176 shunts, 56 with US. Children received 66 shunts, 36 with US. Mean follow-up was 21.6 months. The primary end points examined were shunt revision, ventricular catheter revision (VCR), and acute VCR (revision within 1 week for an improperly-placed catheter).\n\n\nRESULTS\nThe use of US was associated with a statistically significant decrease in shunt revisions (odds ratio 0.492; 95% confidence interval 0.253-0.958). Of the shunts placed with US guidance, 21.7% required revision, compared with 29.3% without US. VCRs and acute VCRs occurred in 9.8% and 2.2%, respectively, for US shunts, compared with 14% and 5.3% without US. Pediatric revision rates were 30.6% with US versus 53.3% without, whereas adult rates were 16.1% and 23.3%, respectively. The benefit of US was more profound for occipital shunts.\n\n\nCONCLUSIONS\nThe use of US for the placement of permanent cerebrospinal fluid shunt catheters is associated with a decreased risk of shunt revision.","cites":"1","conferencePercentile":"63.57142857"},{"venue":"World neurosurgery","id":"a5d1f9928c7a2072c4eb549dc8cfee92bcb0db6d","venue_1":"World neurosurgery","year":"2014","title":"An updated assessment of the risk of radiation-induced neoplasia after radiosurgery of arteriovenous malformations.","authors":"Robert M Starke, Chun Po Yen, Ching-Jen Chen, Dale Ding, Carrie A Mohila, Mary E Jensen, Neal F Kassell, Jason P Sheehan","author_ids":"8639020, 7618470, 2329127, 4617557, 4141557, 4687793, 7846847, 5091811","abstract":"OBJECTIVE\nGamma Knife radiosurgery (GKRS) is a minimally invasive technique employed in the treatment of intracranial arteriovenous malformations (AVMs). Patients experience a low incidence of complications following treatment. As long-term follow-up data became available, some late adverse effects have been reported. However, the exact incidence of radiosurgically induced neoplasia is not known.\n\n\nMETHODS\nAt University of Virginia, imaging and clinical outcomes of 1309 patients with intracranial AVMs treated with GKRS have been reviewed. AVM patients underwent magnetic resonance imaging (MRI) every 6 months for 2 years and then annually following GKRS. When the nidi were no longer visible on magnetic resonance imaging, angiography was performed to verify the obliteration of AVMs. Patients were thereafter recommended to continue MRIs every 3-5 years to detect any long-term complications. A subset of 812, 358, and 78 patients had neuroimaging and clinical follow-up of at least 3, 10, and 15 years, respectively.\n\n\nRESULTS\nThe authors report the occurrence of 3 cases of radiosurgically induced neoplasia. More than 10 years after GKRS, 2 patients were found to have an incidental, uniformly enhancing, dural-based mass lesion near the site of the AVM with radiologic characteristics of a meningioma. As the lesions have shown no evidence of mass effect, they are being followed with serial neuroimaging. A third patient was found to have neurologic decline from a tumor in immediate proximity to an AVM previously treated with proton beam radiosurgery and GKRS. The patient underwent resection, demonstrating a high-grade glioma. The 3-, 10-, and 15-year incidence of a radiation-induced tumor is 0% (0/812), 0.3% (1/358), and 2.6% (2/78), respectively. The cumulative rate of radiosurgically induced tumors in those with a minimum of 10-year follow-up is 3 in 4692 person-years or 64 in 100,000 person-years. Thus, patients had a 0.64% chance of developing a radiation-induced tumor within ≥10 years following GKRS. If we calculate rates based on a subset of 78 patients with neuroimaging and clinical follow-up of ≤15 years, the cumulative rate was 3.4%. These are the second, third, and fifth reported cases of radiation-induced tumors following GKRS for an AVM.\n\n\nCONCLUSIONS\nAlthough radiosurgery is generally considered a safe modality in the treatment of AVMs, radiation-induced neoplasia is a rare but serious adverse event. The possibility of GKRS-induced tumors underscores the necessity of long-term follow-up in AVM patients receiving radiosurgery.","cites":"2","conferencePercentile":"85.42857143"},{"venue":"World neurosurgery","id":"0c9e8c13961c0b7920cf7d0451c198633ed74d70","venue_1":"World neurosurgery","year":"2016","title":"Transforaminal Endoscopic Foraminoplasty and Discectomy for the Treatment of a Thoracic Disc Herniation.","authors":"Ralf Wagner, Albert E Telfeian, Menno Iprenburg, Guntram Krzok, Ziya Gokaslan, David B Choi, Francesco G Pucci, Adetkunbo Oyelese","author_ids":", 4186848, 4758607, 8066869, 5325973, 3257330, 2076487, 8264252","abstract":"Transforaminal endoscopic spine surgery has emerged internationally as a minimally invasive technique that can be performed in an awake patient in the outpatient setting. Advances in high-definition endoscopic camera technologies as well as the availability of specialty graspers, reamers, drills, and other instruments that can be used down a working channel endoscope have made a myriad of spine diseases accessible to the minimally invasive spine surgeon. The major challenge inherent in the surgical treatment of thoracic disc disease is that the disc herniation is often ventral to the spinal cord. The transforaminal approach and the angled endoscopic camera are an ideal combination for creating a technical advantage to accessing thoracic disc disease.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"37e4048d27cf94c9500191cd65882e6c5280f14d","venue_1":"World neurosurgery","year":"2016","title":"Stent-Assisted Coiling of 501 Wide-Necked Intracranial Aneurysms: A Single-Center 8-Year Experience.","authors":"Yongtao Zheng, Yanbing Song, Yingjun Liu, Qiang Xu, Yanlong Tian, Bing Leng","author_ids":"8499499, 8280877, 7896018, 1693462, 8193585, 2962218","abstract":"BACKGROUND\nStent-assisted coiling has expanded the treatment of complex wide-necked intracranial aneurysms. We present our experience with stent-assisted coiling, with an emphasis on procedure-related neurologic complications and the incidence of angiographic recurrence.\n\n\nMETHODS\nA total of 480 patients with 501 aneurysms who were treated with stent-assisted coiling between January 2007 and December 2014 were reviewed retrospectively. Baseline characteristics, procedure-related complications, angiographic follow-up results, and clinical outcomes were statistically analyzed.\n\n\nRESULTS\nAmong the 480 patients, 423 (88%) were treated electively and 57 (11%) were treated in the context of subarachnoid hemorrhage. There were 22 (4.58%) overall procedure-related complications, which caused death in 4 patients (0.83%) and morbidity in 4 patients (0.83%). In a logistic regression analysis, the complications differed significantly among the patients with hypertension (odds ratio [OR], 2.85; 95% confidence interval [CI], 1.09-7.48; P = 0.03), patients with aneurysms treated with coiling before stenting (OR, 3.07; 95% CI, 1.07-8.81; P = 0.04), and patients treated with multiple stents (OR, 4.96; 95% CI, 1.02-24.07; P = 0.04). Angiographic follow-up was available for 396 patients (83.4%) for a mean of 13 months. The rates of recanalization and retreatment were 13.9% and 3.5%, respectively. In a logistic analysis, larger aneurysm size and initial incomplete aneurysm occlusion were predictors of recanalization. Clinical follow-up was available for 406 patients (85.6%) for a mean of 44.8 months, and 399 patients (98.3%) achieved a Glasgow Outcome Scale score of 5.\n\n\nCONCLUSIONS\nStent-assisted coiling appears to be a safe and effective option for treating complex wide-necked aneurysms. Higher complication rates are associated with coiling before stenting, use of multiple stents, and hypertension. Stent delivery before coil deployment reduces the risk of procedural complications. Larger aneurysm size and initial incomplete occlusion are associated with aneurysm recanalization.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"23015a5c1934ebdfb2394c91a7caf323ea701070","venue_1":"World neurosurgery","year":"2012","title":"Management of intraneural vessels during microvascular decompression surgery for trigeminal neuralgia.","authors":"Xuesheng Zheng, Baohui Feng, Wenyao Hong, Wenchuan Zhang, Min Yang, Yinda Tang, Jun Zhong, Xuming Hua, Shiting Li","author_ids":"7912936, 6504099, 4457420, 8030680, 5184537, 7868528, 3106556, 7156436, 8086934","abstract":"OBJECTIVE\nTo present the authors' experience in surgical treatment of patients with trigeminal neuralgia (TN) with intraneural vessels.\n\n\nMETHODS\nThe study included three patients with TN and an intraneural artery (superior cerebellar artery) and eight patients with TN and an intraneural vein. The patients underwent microvascular decompression (MVD) procedures. The intraneural arteries were wrapped by a thin piece of Teflon sponge. The intraneural veins all were coagulated and divided. Clinical outcomes and postoperative complications were analyzed.\n\n\nRESULTS\nEight patients were free of facial pain soon after surgery, achieving excellent outcomes; two patients had good outcomes; and one patient had a failed first operation but experienced pain relief after reoperation, achieving an excellent outcome. Three patients had postoperative facial numbness because the trigeminal nerves were impaired owing to coagulation or mechanical injury. However, no dense corneal numbness or loss of corneal reflex occurred.\n\n\nCONCLUSIONS\nIf the intraneural vessel is an artery, it can be decompressed by wrapping techniques. Otherwise, intraneural veins should be coagulated and divided. Most patients can achieve excellent or good pain relief with this approach; facial numbness is uncommon.","cites":"0","conferencePercentile":"21.55172414"},{"venue":"World neurosurgery","id":"5963e96e401a040b947c687f9841fe6e7918c9ce","venue_1":"World neurosurgery","year":"2015","title":"Olfactory ensheathing cells: part I—current concepts and experimental laboratory models.","authors":"Karen Gladwin, David Choi","author_ids":"7599244, 3257330","abstract":"OBJECTIVE\nThis study sought to assess the results of current laboratory studies of olfactory ensheathing cell (OEC) transplantation for the treatment of central nervous system repair.\n\n\nMETHODS\nThis study used a literature search and topic review.\n\n\nRESULTS\nThere are numerous successful reports of regeneration and functional improvements in animals after OEC transplantation, but a few negative studies raise questions.\n\n\nCONCLUSIONS\nAlthough the exact mechanisms of action of OECs are not fully understood, it is clear that OECs have beneficial regenerative properties in laboratory studies, and the ease with which OECs can be harvested and cultured in animal models make clinical application a very reasonable prospect.","cites":"1","conferencePercentile":"80.1980198"},{"venue":"World neurosurgery","id":"b54696c2d177363c2c35cdb686d659eaeeb4c9ba","venue_1":"World neurosurgery","year":"2016","title":"Endoscopic Endonasal Approach to Mesencephalic Cavernous Malformations.","authors":"Shi-Ming He, Yuan Wang, Tian-Zhi Zhao, Tao Zheng, Wen-Hai Lv, Lan-Fu Zhao, Long Chen, Cole Sterling, Yan Qu, Guo-Dong Gao","author_ids":"8056516, 1724874, 3587213, 1728519, 7881148, 7901130, 1737625, 6535636, 3579294, 2172147","abstract":"BACKGROUND\nSymptomatic cavernous malformations involving the brainstem are difficult to access by conventional approaches, which often require dramatic brain retraction to gain adequate operative corridor. Here, we present a successful endoscopic endonasal transclival approach for resection of a hemorrhagic, symptomatic mesencephalic cavernous malformation.\n\n\nCASE DESCRIPTION\nA 20-year-old woman presented with acute onset of headache, nausea, and vomiting. Computed tomography scan revealed a ventral midbrain hemorrhage. On day 3 of admission, the patient developed left-sided hemiparesis, restriction of medial and lateral left-eye movements, and loss of left pupillary light reflex. Subsequent magnetic resonance imaging demonstrated an increase of the midbrain lesion to 1.2 cm × 1.7 cm. Diffusion tensor imaging showed compression and lateral displacement of the right corticospinal tract near the thalamus and cerebral peduncle. Given the patient's clinical presentation and the findings on imaging, we suspected a mesencephalic cavernous malformation.\n\n\nCONCLUSIONS\nThe patient underwent an endoscopic endonasal transclival resection of a ventral midline mesencephalon cavernous malformation. A dark red lesion was directly visualized under the endoscope. After a small cortiectomy, the pial and perforator vessels were dissected, and dark-brown blood was drained from the cavernoma cavity. Using a biopsy forceps and with careful attention to the cavernoma borders, the lesion was removed and hemostasis was achieved. Pathologic examination confirmed cavernous malformation. One week after the operation, magnetic resonance imaging demonstrated total resection of the lesion. A 3-month follow-up revealed improved neurologic symptoms with minimal surgical morbidity.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"a359896da4b59f49ec82993fbd3673063463bad9","venue_1":"World neurosurgery","year":"2015","title":"Surgical Treatment of Cerebellar Cavernous Malformations: A Single-Center Experience with 58 Cases.","authors":"Hongji Wu, Tao Yu, Shuo Wang, Jizong Zhao, Yuanli Zhao","author_ids":"7263602, 1690307, 5994097, 7817852, 3485720","abstract":"OBJECTIVE\nThe goal of this study was to discuss the surgical indications, surgical approaches, and prognostic factors of cerebellar cavernous malformation (CM).\n\n\nMETHODS\nWe retrospectively reviewed the presentation, surgery, and outcome of 58 consecutive patients who underwent resection of cerebellar CMs between 2009 and 2013 in our center.\n\n\nRESULTS\nThe study population consisted of 31 males and 27 females, mean age 39.9 years. Fifty-eight patients experienced 67 symptomatic hemorrhages. The median diameter of all lesions was 2.2 ± 0.9 cm (range, 0.8-4.8 cm). The locations were classified into 3 groups: group 1, cerebellar hemisphere (17 cases, 29.3%); group 2, vermis (18 cases, 31.0%); and group 3, cerebellar peduncle (23 cases, 39.7%). Complete resection was achieved in all patients without surgical mortality. Postoperatively, 11 patients developed new surgical complications, including facial paralysis in 6 patients, ataxia in 2 patients, dizziness in 2 patients, and decrease in facial sensation in 1 patient. The mean modified Rankin Scale (mRS) at final follow-up was significantly improved compared with the preoperative score (0.5 ± 0.5 vs. 1.4 ± 0.7, P = 0.035). The symptoms and neurologic deficits improved in most patients. The lesion location was the only factor that predicted a worse outcome, and the mRS was significantly lower in group 3 than groups 1 and group 2 (P = 0.019).\n\n\nCONCLUSIONS\nPatients with cerebellar CMs usually achieve favorable outcomes via surgery. Cerebellar peduncle CMs cause significantly more neurologic deficits than other locations. A reasonable surgical approach and meticulous manipulation are necessary to prevent impairment of neurologic function.","cites":"0","conferencePercentile":"34.52970297"},{"venue":"World neurosurgery","id":"86a6f2736193e73582ea3f63081aa220efa54870","venue_1":"World neurosurgery","year":"2016","title":"Prediction of High-Grade Pediatric Meningiomas: Magnetic Resonance Imaging Features Based on T1-Weighted, T2-Weighted, and Contrast-Enhanced T1-Weighted Images.","authors":"Hao Li, Meng Zhao, Yuming Jiao, Peicong Ge, Zhicen Li, Ji Ma, Shuo Wang, Yong Cao, Jizong Zhao","author_ids":"1706574, 2389548, 7229242, 8205303, 7718414, 2286836, 5994097, 7185872, 7817852","abstract":"BACKGROUND\nPrediction of high-grade meningiomas before surgery is essential to determine optimal treatment strategies; however, the relationship between radiologic features and malignancy of meningiomas in pediatric patients has not been clearly demonstrated. The aim of this study was to identify preoperative magnetic resonance imaging features that are significantly correlated with high risk of high-grade pediatric meningiomas.\n\n\nMETHODS\nWe retrospectively reviewed preoperative magnetic resonance imaging features and histopathologic diagnosis according to the 2007 World Health Organization classification system for intracranial tumors of 79 pediatric meningiomas from 2005 to 2015. World Health Organization grade II and III meningiomas were defined as high-grade meningiomas. The relationship between the radiologic findings and incidence of high-grade meningiomas was assessed initially with univariate analysis and then corrected by multivariate analysis.\n\n\nRESULTS\nAccording to univariate analysis, heterogeneous tumor enhancement, an unclear tumor-brain interface, tumor cyst, type of dural attachment, lateral location, positive capsular enhancement, and irregular shape of tumor were strong predictive factors for high-grade meningiomas. When corrected by multivariate analysis, an unclear tumor-brain interface (P < 0.001; odds ratio = 10.4; 95% confidence interval, 3.0-37.0), lateral location (P = 0.014; odds ratio = 4.9; 95% confidence interval, 1.4-17.6), and narrow base (P = 0.001; odds ratio = 8.3; 95% confidence interval, 2.5-27.1) were strong independent predictive factors for high-grade meningiomas.\n\n\nCONCLUSIONS\nIn pediatric patients, meningiomas with an unclear tumor-brain interface, lateral location, and narrow base on preoperative magnetic resonance imaging are more likely to be high-grade meningiomas. Our results may be helpful in decision making regarding therapeutic strategies for pediatric patients with meningiomas.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"73499dcc0411b8d87b3d71f11d73a2b7b2bc2ff3","venue_1":"World neurosurgery","year":"2016","title":"Type II Odontoid Fracture with Atlantoaxial Dislocation Presenting as Symptomatic Seizures: A Case Report.","authors":"Guoyun Bu, Feng Shuang, Gang Liu, Ye Wu, Shuxun Hou, Dongfeng Ren","author_ids":"7156273, 1814616, 1697913, 7860959, 7693754, 7328391","abstract":"OBJECTIVE AND BACKGROUND\nTo report symptomatic seizures of a patient with an old type II odontoid fracture with atlantoaxial dislocation. The type II odontoid fracture is a dangerous disease and presents as neurological deficits. Because of the compression of upper cervical cord, without timely diagnosis and treatment, a type II odontoid fracture may result in sudden death. Although it has been shown that epileptic seizures may lead to type II odontoid fracture, there is no report of symptomatic seizures in patients with odontoid fracture.\n\n\nMETHODS\nA 16-year-old adolescent boy with neurological deficits, especially grand mal seizures for duration of 5 years, was diagnosed as an old type II odontoid fracture with atlantoaxial dislocation and treated in our hospital. A 1-year follow-up was performed.\n\n\nRESULTS\nSystematic analyses of the clinical history, manifestations, physical examination, and radiologic results of the patient revealed an old type II odontoid fracture. Magnetic resonance imaging showed spinal cord compression and degeneration. The patient received posterior atlantoaxial fixation and fusion procedure following successful closed reduction. The frequency of seizures was reduced to once a month and there was a thorough recovery in other neurological functions 1 year after the operation.\n\n\nCONCLUSIONS\nOld type II odontoid fracture might present as symptomatic seizures in addition to other neurological deficits. Posterior atlantoaxial screw-plate fixation and fusion is an effective treatment for old type II odontoid fracture.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"8e03dabdf1d0ccfb2e323ef04f85fc583451ab41","venue_1":"World neurosurgery","year":"2012","title":"Relationship between learning and memory deficits and Arp2 expression in the hippocampus in rats with traumatic brain injury.","authors":"Xuewei Xia, Yuwei Dong, Yiqing Du, Yongdong Yang, Wenbo Wang, Yong Li","author_ids":"4887150, 7571982, 6482858, 7607548, 1722461, 1689181","abstract":"OBJECTIVE\nTo investigate the learning and memory impairments at acute phase after mild traumatic brain injury (TBI) in Sprague-Dawley rats and its relationship with the expression of Arp2.\n\n\nMETHODS\nHundred adult male Sprague-Dawley rats were randomly assigned into a TBI group or a control group. TBI was produced by using an impact acceleration model. Learning and memory function was assessed using Morris Water Maze test after different injury intervals, and synaptic function was investigated after TBI treatment by using field excitatory postsynaptic and long-term potentials. Western blot, immunochemistry, and polymerase chain reaction (PCR) were used to detect the mRNA and protein expression of actin-related protein 2 (Arp2) after injury, whereas Nissl staining and DNA ladder assays were performed to detect neuron apoptosis.\n\n\nRESULTS\nUsing water maze measurement, the authors found escape latency to be significantly higher in the TBI group compared with the control group, and at 7 days postinjury, the difference almost reached up to 30 seconds. Field excitatory postsynaptic potential measurement further found that the long-term potential decreased by nearly 20% in the TBI group compared with the control group, which meant the synaptic excitatory function was downregulated in the TBI group. Further, no significant neuron apoptosis could be detected in the TBI group by Nissl staining, terminal deoxynucleotidyl transferase dUTP nick end labeling (TUNEL) staining, and DNA ladder assays. At last, we found that after TBI treatment, the Arp2 mRNA and protein levels were decreased in a time-dependent manner and reached 29.3% and 45.7% of control at 7 days postinjury, separately, and the decrease of mRNA of Arp2 was correlated with delayed escape latency.\n\n\nCONCLUSIONS\nThis study demonstrated that impairments of learning and memory function in the acute phase after mild TBI may be induced by a reduction in Arp2 expression.","cites":"3","conferencePercentile":"82.18390805"},{"venue":"World neurosurgery","id":"0913f124a1ceaab0f80d755ab818e1220469baf3","venue_1":"World neurosurgery","year":"2016","title":"Efficacy and Safety of One-Stage Selective Discectomy Combined with Expansive Hemilaminectomy in the Treatment of Cervical Spondylotic Myelopathy.","authors":"Guoyun Bu, Feng Shuang, Gang Liu, Ye Wu, Shuxun Hou, Dongfeng Ren, Weilin Shang","author_ids":"7156273, 1814616, 1697913, 7860959, 7693754, 7328391, 7374928","abstract":"OBJECTIVES\nWe designed a novel surgical strategy named one-stage selective discectomy combined with expansive hemilaminectomy, which might theoretically reduce the postoperative complications of cervical spondylotic myelopathy (CSM). The objective of this study is to evaluate its efficacy and safety.\n\n\nMETHODS\nSixty-two patients with CSM were enrolled in this study. The procedure includes selective discectomy with fusion at 1 or 2 segments of maximal cord compression and expansive hemilaminectomy on the symptomatic or severe side of the body. Neurologic function was evaluated using the Japanese Orthopedics Association Score before and after surgery. Midsagittal dural sac diameter, dural sac transverse area at segments of discetomy on magnetic resonance imaging, and lordosis of the cervical spine on lateral plain film were measured. All patients were followed up for more than 1 year.\n\n\nRESULTS\nA total of 88 discs and 272 hemilaminas were resected from 62 patients. The Japanese Orthopedics Association Score improved from 8.7 ± 1.76 preoperatively to 13.4 ± 1.61 at 1 year follow-up (P < 0.001). The mean midsagittal dural sac diameter, dural sac area, and lordotic angle also increased from 0.45 ± 0.10 cm, 0.83 ± 0.14 cm(2), and 7.9 ± 2.60° to 0.81 ± 0.08 cm, 0.96 ± 0.14 cm(2), and 11.7 ± 3.06°, respectively (P < 0.05). No case of postoperative axial pain, C5 palsy, nonunion, or kyphosis was reported.\n\n\nCONCLUSIONS\nOne-stage selective discectomy combined with expansive hemilaminectomy is an effective surgical approach for the treatment of CSM in patients whose neurologic function, midsagittal dura sac diameter, and dura transverse area can be improved and has few postoperative complications.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"743e7ee0539bc8d55d6e995ddc47ff2d94e265d3","venue_1":"World neurosurgery","year":"2016","title":"Subaxial Cervical Intradiscal Pressure and Segmental Kinematics Following Atlantoaxial Fixation in Different Angles.","authors":"Qi Liu, Qunfeng Guo, Jun Yang, Peng Zhang, Tianming Xu, Xiaofei Cheng, Jinshui Chen, Huapeng Guan, Bin Ni","author_ids":"1728293, 6014505, 1750537, 1678443, 8132289, 7664468, 3031042, 3986361, 7494664","abstract":"OBJECTIVE\nTo evaluate in a comprehensive biomechanical study the influences of fixed C1-C2 and different C1-C2 angles on the range of motion (ROM) and the intradiscal pressure (IDP) of subaxial cervical spine.\n\n\nMETHODS\nWe simulated three-dimensional cervical motions on 8 human specimens with C1-C2 fixed in 3 different angles (neutral position, neutral position -10°, neutral position +10°) following intact analysis in the material test system. The ROM changes of each motion segment and the IDP changes of 4 subaxial motion segments (C2-C3, C3-C4, C4-C5, and C5-C6) were monitored.\n\n\nRESULTS\nROM change patterns at all subaxial segments were similar. Fixed C1-C2 led to a significant ROM increase relative to the intact condition during flexion/extension testing. A larger C1-C2 angle (neutral position +10°) caused an additional ROM increase during flexion, whereas a smaller C1-C2 angle (neutral position -10°) induced a further ROM increase during extension. Axial rotation testing revealed the most striking and similar ROM increases in the instrumented groups relative to the intact group. Lateral bending testing did not reveal significant ROM change between the instrumented groups and the intact group. For IDP analysis, C1-C2 fixed in a larger angle (neutral position +10°) caused significant IDP increases at the C2-C3, C3-C4, and C4-C5 levels during flexion.\n\n\nCONCLUSIONS\nTo maintain a physiologic sagittal alignment of subaxial cervical spine, C1-C2 should be fixed in the neutral position or a relatively smaller angle instead of a more lordotic position.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"ab36455fec3449122e8512fed7c980e764c4248a","venue_1":"World neurosurgery","year":"2015","title":"Visual Field Preservation in Surgery of Occipital Arteriovenous Malformations: A Prospective Study.","authors":"Xianzeng Tong, Jun Wu, Fuxin Lin, Yong Cao, Yuanli Zhao, Zhen Jin, Bo Ning, Bing Zhao, Yu Li, Lijun Wang, Shuo Zhang, Shuo Wang, Jizong Zhao","author_ids":"7450090, 1714535, 4633240, 7185872, 3485720, 6253281, 1727426, 2115618, 7770609, 1733333, 7138101, 5994097, 7817852","abstract":"OBJECTIVE\nWe reviewed our prospective study of patients with occipital arteriovenous malformations (AVMs) to assess whether the display of optic radiation diffusion tensor imaging (DTI) during neuronavigation-guided surgery can reduce the severity of postoperative visual field deficits (VFDs) and to evaluate the factors associated with visual field preservation.\n\n\nMETHODS\nForty-six consecutive patients with occipital AVMs were randomized in our study. DTI of the optic radiation was displayed during neuronavigation surgery in 24 patients. The other 22 patients were treated surgically without neuronavigation. Modified Rankin Scale (mRS) scores and visual fields were evaluated preoperatively, immediately after surgery, and at the last follow-up.\n\n\nRESULTS\nThe patients' baseline characteristics and AVM features were statistically similar between the 2 surgical groups. The postoperative obliteration rate was 100%. The postoperative mRS scores did not differ between the 2 groups (P > 0.05). Preexisting VFDs were more common (P = 0.00004) in patients who bled than in those with unruptured AVMs. The application of DTI-incorporated neuronavigation reduced the frequency and severity of postoperative VFDs (P = 0.013 and 0.001, respectively). Visual fields were more likely to be preserved in patients with an AVM >5 mm from the optic radiation (P = 0.025).\n\n\nCONCLUSIONS\nA history of hemorrhage is an independent risk factor for VFDs associated with occipital AVMs. Although not showing superiority in postoperative mRS, functional MRI navigation-guided surgery may help to radically resect occipital AVMs and preserve patient visual fields. A 5-mm distance from the optic radiation may be a suitable safety margin for visual field preservation.","cites":"0","conferencePercentile":"34.52970297"},{"venue":"World neurosurgery","id":"6183824bacc171ea43f345b048938445cdd32940","venue_1":"World neurosurgery","year":"2011","title":"Color doppler hemodynamic study of the superficial temporal arteries in superficial temporal artery-middle cerebral artery (STA-MCA) bypass surgery for Moyamoya disease.","authors":"Mingxing Wu, Zheng Huang, Dong Zhang, Lishu Wang, Jian Sun, Shuo Wang, Yuanli Zhao, Jizong Zhao","author_ids":"8745468, 4464933, 4944112, 4876057, 3322390, 5994097, 3485720, 7817852","abstract":"OBJECTIVE\nTo observe the hemodynamic changes of the superficial temporal artery (STA) by color Doppler and the correlation between the results of angiography and the hemodynamic changes of the STA after superficial temporal artery-middle cerebral artery (STA-MCA) bypass surgery for moyamoya disease.\n\n\nMETHODS\nThis study included 26 cases of moyamoya disease; standard STA-MCA bypass surgery were performed in all patients. GE-LOGIQ9 color ultrasound with 7L transducer was used to monitor STA hemodynamic changes, including peak systolic velocity (PSV), end-diastolic velocity (EDV), mean flow velocity (Vm), pulse index (PI), and resistance index (RI), preoperatively and 1 week and 3 months after surgery in 10 cases. In 22 cases, color Doppler of STA and digital subtraction angiography of the external carotid artery (ECA), internal carotid artery (ICA), common carotid artery (CCA), and vertebral artery (VA) were performed preoperatively and 1 week after surgery. Based on the patency of STA-MCA on angiography, the patients were divided into two groups: 11 patients were in the patent group, and 11 patients were in the nonpatent group. Statistical significance was evaluated using analysis of variance of random block design and paired samples t test. SPSS software version 11.5 was used.\n\n\nRESULTS\nIn the 10 cases, there was no significant difference among the three imaging series in PSV. Compared with the preoperative values, the values of EDV and Vm 1 week and 3 months after surgery were significantly higher (P < 0.05). The difference was not significant, however, between 1 week and 3 months after surgery. The PI and RI at 1 week and 3 months after surgery were significantly lower than the preoperative values (P < 0.05); there was no significant difference between 1 week and 3 months after surgery. Among the 22 cases, the values of PSV, EDV, and Vm increased significantly (P < 0.05) and the values of PI and RI decreased significantly(P < 0.01) after surgery in the patent group. In the nonpatent group, the values of PSV and PI decreased significantly after surgery (P < 0.05). EDV, Vm, and RI had no significant changes after surgery.\n\n\nCONCLUSIONS\nHigher blood flow can develop in anastomosed STA after STA-MCA bypass surgery. The hemodynamic changes of STA after surgery mainly occurred at an early period after operation with little change at 3-month follow-up examination. The increase of blood flow in STA may be due to the low resistance of the intracranial vascular bed. Postoperative Doppler examination of the STA may predict angiographic results of the anastomosis in the early postoperative period. Continuous observation is necessary to identify an accurate correlation between quantitative alteration of the Doppler parameters and angiographic results.","cites":"1","conferencePercentile":"42.40506329"},{"venue":"World neurosurgery","id":"b6bcd7951a69d6601c9f0b089c5f12c6d50fffbf","venue_1":"World neurosurgery","year":"2016","title":"Microsurgical outcome of unruptured brain arteriovenous malformations: a single-center experience.","authors":"Xianzeng Tong, Jun Wu, Yong Cao, Yuanli Zhao, Shuo Wang, Jizong Zhao","author_ids":"7450090, 1714535, 7185872, 3485720, 5994097, 7817852","abstract":"OBJECTIVE\nWe aimed to describe our single-center experience in treating unruptured brain arteriovenous malformations (uBAVMs) with microsurgical treatment.\n\n\nMETHODS\nDuring a 7-year period, 282 patients with uBAVMs were surgically treated at our institution. Patient clinical features, post-surgical complications, AVM obliteration rate, seizure control and functional outcome were collected and analyzed. Seizure control was evaluated with the Engel Seizure Outcome Scale. Patient functional outcome was assessed with modified Rankin Scale (mRS) score.\n\n\nRESULTS\nOverall, complete obliteration was achieved in 98.2%. Surgical mortality rate was 0% and overall mortality rate was 1.1%. Good functional outcome (mRS score 0-1) was achieved in 86.9% of all patients: in 92.5% of patients with Spetzler-Martin grade I and II uBAVMs, in 80.6% of those with Spetzler-Martin grade III uBAVMs and in 62.5% of those with Spetzler-Martin grade IV and V uBAVMs. Poor outcome was significantly associated with AVM size ≥6cm, deep venous drainage, eloquent location and poor seizure control (all p<0.05). For the 177 patients with pre-surgical seizures, good seizure outcome (Engel Class I seizure outcome) was achieved in 124 (70.1%) patients after microsurgical treatment. A short history of seizure occurrence, less pre-surgical seizures and generalized tonicoclonic seizure type may be predictors of good seizure outcome (all p<0.05).\n\n\nCONCLUSION\nGood functional outcome can be achieved by microsurgical resection in Spetzler-Martin grade I-II and selected grade III uBAVMs. Surgical resection for high grade (grade IV-V) uBAVMs is challenging. A relatively high seizure-free rate can be achieved in patients with initial seizure.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"838ad30c1756cdfec958110fcab02bdf9510c3db","venue_1":"World neurosurgery","year":"2014","title":"Irregular neointimal lining with prominent proliferative activity after carotid patch angioplasty: an autopsy case report.","authors":"Masaki Ito, Yoshimasa Niiya, Haruto Uchino, Naoki Nakayama, Shoji Mabuchi, Kiyohiro Houkin","author_ids":"2996551, 5806420, 3886235, 3010384, 6687899, 6897862","abstract":"OBJECTIVE\nAlthough the healing response after carotid balloon injury and carotid patch angioplasty injury has been well-documented in animal models, there is limited information about this process after carotid endarterectomy (CEA) in human patients.\n\n\nCASE DESCRIPTION\nWe describe the autopsy results of a 79-year-old man who died 18 days after CEA with patch angioplasty. The treated carotid artery had an adequate luminal diameter. Elastica-Masson staining revealed that the treated portion was covered with neointima but the patch graft was exposed to the arterial lumen at 18 days after CEA. Immunohistochemistry staining for alpha-smooth muscle actin (α-SMA), von-Willebrand factor, and vascular endothelial growth factor receptor-2 revealed that the neointima was mainly composed of α-SMA-positive cells. In addition, the α-SMA-rich neointima had many more Ki-67-positive cells than did the internal carotid artery intima in the area beyond the CEA-treated portion.\n\n\nCONCLUSIONS\nThis case report is the first to describe an entire carotid artery specimen in the acute stage after CEA with patch angioplasty. These findings suggest that an α-SMA-rich neointima with prominent proliferative activity covers the inner surface of the treated carotid artery, but patch grafts are left uncovered. The intrinsic arterial wall may have an important role in intimal regeneration after CEA, although the nature of the neointima and the mechanism by which it regulates proliferative activity remain unclarified.","cites":"0","conferencePercentile":"24"},{"venue":"World neurosurgery","id":"be3c438a8b9780ecaf55c51ae6f8268e0a48c97d","venue_1":"World neurosurgery","year":"2016","title":"Clinical and Angiographic Features of Patients with Moyamoya Disease and the p.R4810K Heterozygous Variant.","authors":"Qian Zhang, Dong Zhang, Rong Wang, Yaping Liu, Yan Zhang, Shuo Wang, Jizong Zhao","author_ids":"1737486, 4944112, 1698066, 2398582, 3397757, 5994097, 7817852","abstract":"OBJECTIVE\nTo elucidate the clinical and angiographic features in patients with moyamoya disease (MMD) and the p.R4810K heterozygous variant and present an angiographic grading system to evaluate disease severity.\n\n\nMETHODS\nWe retrospectively reviewed 87 patients with MMD and the p.R4810K variant treated at Beijing Tiantan Hospital. Clinical features, stroke subtype, and angiographic characteristics were analyzed.\n\n\nRESULTS\nThe median age at diagnosis was 25 years (range, 3-59). The ratio of women to men was 1.2:1. The familial occurrence of MMD was 14.9%. The primary symptom at diagnosis was ischemia, hemorrhage, or other in 67, 16, and 4 patients, respectively. Angiographic features correlating with ischemic stroke or stroke, including Suzuki grade, external carotid artery collaterals, leptomeningeal collaterals, and Mugikura grade, were identified. A binary logistic regression model demonstrated a significant correlation of Suzuki grade (P = 0.008) and posterior cerebral artery grade (P = 0.029) with ischemic stroke (142 hemispheres). A modified Suzuki-Mugikura grading system was developed. The areas under the receiver operating characteristic curves used to predict ischemic stroke based on the Suzuki grading, Mugikura grading, and modified Suzuki-Mugikura grading systems were 0.736, 0.69, and 0.741, respectively. Furthermore, the modified Suzuki-Mugikura grades were significantly correlated with infarction in posterior circulation and the number of infarcted regions.\n\n\nCONCLUSIONS\nThe clinical and angiographic features of a Chinese MMD population with the p.R4810K variant were similar to those of a Japanese MMD population; they might be a distinct cerebrovascular disease entity and represent a separate subgroup. A modified Suzuki-Mugikura grading system was valuable for predicting stroke and evaluating disease severity.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"d95ed96a69c47ebead25e073f4b7fbbbcbb8ec43","venue_1":"World neurosurgery","year":"2016","title":"Microsurgical Outcome of Cerebellar Arteriovenous Malformations: Single-Center Experience.","authors":"Xianzeng Tong, Jun Wu, Fuxin Lin, Yong Cao, Yuanli Zhao, Shuo Wang, Jizong Zhao","author_ids":"7450090, 1714535, 4633240, 7185872, 3485720, 5994097, 7817852","abstract":"OBJECTIVE\nWe aimed to describe our single-center experience in treating cerebellar arteriovenous malformations (AVMs) with microsurgical resection.\n\n\nMETHODS\nDuring a 16-year period, 181 patients with cerebellar AVMs were surgically treated at the Department of Neurosurgery in Beijing Tiantan Hospital. Patient functional status was evaluated using modified Rankin Scale (mRS) scores both before treatment and at the last follow-up. The mRS scores at the last follow-up were dichotomized as good outcome (mRS <3) and poor outcome (mRS ≥3). The treatment modalities, post-treatment complications, obliteration rate, and follow-up outcomes were analyzed.\n\n\nRESULTS\nOf the 181 patients, 172 (95%) patients presented with initial hemorrhage and 62 (34%) patients experienced rehemorrhage before microsurgical treatment. Complete obliteration of the AVMs was achieved in 177 (97.8%) patients. Good functional outcome was achieved in 144 (80%) of the patients. The surgical mortality rate was 4.4% (8/181), and overall mortality rate was 6.6% (12/181). Poor outcome was significantly associated with increasing age (P = 0.035; odds ratio [OR], 1.030; 95% CI 1.002-1.060), presurgical mRS ≥3 (P = 0.029; OR, 2.563; 95% CI 1.101-5.968), eloquent AVM location (P = 0.015; OR, 3.058; 95% CI 1.244-7.516), and presurgical rehemorrhage (P = 0.008; OR, 3.266; 95% CI 1.358-7.858).\n\n\nCONCLUSION\nGood outcome can be achieved by microsurgical resection in most patients with cerebellar AVMs. Increasing age at surgery, poor presurgical functional status, eloquent AVM location, and presurgical rehemorrhage are independent predictors of poor outcomes after AVM resection. We recommend early surgical resection for all surgically accessible cerebellar AVMs to prevent subsequent hemorrhage and resultant poor neurologic outcomes.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"0182ad531df0ce45325c31e36788859ef4159af3","venue_1":"World neurosurgery","year":"2016","title":"Minimally Invasive Transforaminal Lumbar Interbody Fusion Using Expandable Technology: A Clinical and Radiographic Analysis of 50 Patients.","authors":"Choll W Kim, Todd M Doerr, Ingrid Y Luna, Gita Joshua, Sun Ren Shen, Xin Fu, Ai-Min Wu","author_ids":"3735235, 4164858, 7806480, 2267368, 7804854, 2094310, 7616519","abstract":"OBJECTIVE\nInterbody cage implantation during minimally invasive surgery for transforaminal lumbar interbody fusion (MIS TLIF) presents challenges. Expandable cages when collapsed facilitate insertion; subsequent expansion in situ optimizes endplate contact. This report describes clinical and radiographic outcomes of MIS TLIF with an expandable cage.\n\n\nMETHODS\nResearchers retrospectively analyzed prospective data from 50 patients (62 operative levels) when an expandable interbody spacer was combined with transpedicular posterior stabilization. Clinical outcomes, fusion rates, incidence of reoperation, and device-related complications were obtained from clinical and radiographic records.\n\n\nRESULTS\nMean patient age was 58.1 years (56.2% female). In all, 76% (38/50) underwent 1-level fusion, and 24% (12/50) 2-level fusion. Average operative time was 239.9 ± 86.9 minutes for 1-level and 350.3 ± 74.9 minutes for 2-level procedures; average hospital stay overall was 2.5 ± 1.7 days, with no intraoperative complications reported. Mean visual analogue scale and Oswestry Disability Index scores decreased significantly from preoperative to all postoperative assessment times (6, 12, and 24 months) (P < 0.05). Intervertebral disc height (8.3 ± 2.7 vs. 11.3 ± 1.9 mm) increased significantly, with increases sustained over 24 months (P < 0.05). Postoperative radiographs showed no evidence of cage migration, subsidence, or collapse and suggested fusion at all operative levels by 12 months and 24 months (93%, 54/58; 97%, 28/29), respectively.\n\n\nCONCLUSIONS\nAn expandable interbody cage led to significant improvement in clinical and radiographic outcomes after MIS TLIF, including intervertebral disc height restoration and high fusion rates, with no evidence of device-related complications.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"a2d87823750c24a4c676223cf33c155f9c58d8f4","venue_1":"World neurosurgery","year":"2016","title":"Investigating Brain Network Characteristics Interrupted by Covert White Matter Injury in Patients with Moyamoya Disease: Insights from Graph Theoretical Analysis.","authors":"Ken Kazumata, Khin Khin Tha, Hisashi Narita, Hideo Shichinohe, Masaki Ito, Haruto Uchino, Takeo Abumiya","author_ids":"7852891, 1837561, 8450519, 6461498, 2996551, 3886235, 4279324","abstract":"Chronic ischemia in adult moyamoya disease (MMD) reduces the integrity of normal-appearing white matter (WM). We investigated whether covert WM impairment alters large-scale brain networks and specific neural circuits associated with neurocognitive dysfunction in MMD. Forty-six participants (control, n = 23; MMD, n = 23) were examined using diffusion tensor imaging and streamline tractography. Structural connectivity among 90 cortical and subcortical brain regions was evaluated using the mean fractional anisotropy along the fiber tracts. Graph theoretical analysis was used to measure network parameters and inter-regional connectivity. Global network parameters were reduced in patients with MMD, including cluster coefficient (controls vs. MMD: 3.62 ± 0.24 vs. 3.26 ± 0.36; P < 0.0001), characteristic path length (controls vs. MMD: 1.20 ± 0.02 vs. 1.17 ± 0.01; P < 0.001), and small-world property (controls vs. MMD: 3.07 ± 0.18 vs. 2.83 ± 0.27; P < 0.001). Reduced pairwise connectivity was found in prefrontal neural circuits within the middle/inferior frontal gyrus; supplementary motor area; and insular, inferior temporal, and dorsal cingulate cortices. Covert WM microstructural changes in patients with MMD alter large-scale brain networks, as well as lateral prefrontal neural circuits. Evaluation of structural connectivity may be useful to assess the severity of chronic ischemic injury from a network perspective.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"41436014d05a637dfe6f0f6539c78561cc19d50d","venue_1":"World neurosurgery","year":"2016","title":"Biomechanical Study of 3 Atlantoaxial Proactive Vertebral Artery Injury Prevention Fixation Combinations.","authors":"Peng Zhang, Qi Liu, Tianming Xu, Dezhi Sun, Jun Yang, Bin Ni","author_ids":"1678443, 1728293, 8132289, 1823346, 1750537, 7494664","abstract":"OBJECTIVE\nTo evaluate the biomechanical stability of 3 atlantoaxial proactive vertebral artery injury prevention fixation combinations.\n\n\nMETHODS\nWe used 6 fresh human cadaveric C0-C4 specimens for the biomechanical test with moment control in 6 loading directions. First, range of motion (ROM) was measured in the intact specimens before they were destabilized; next, ROM of the 4 conditions fixed with 4 different fixation combinations were tested in alternating sequence: bilateral transarticular screw (TAS) and 3 test combinations: C1 laminar hook (C1LH) and C2 intralaminar screw (C2ILS) on 1 side combined with TAS (C1LH-C2ILS/TAS) or C1LH and TAS (C1LH-C2ILS/C1LH-TAS) or C1LH and C2ILS on the other side (C1LH-C2ILS/C1LH-C2ILS).\n\n\nRESULTS\nROM of all 4 instrumented sets significantly decreased compared with intact specimens in all the loading cases (flexion, left and right lateral bending, left and right axial rotation) except extension. Compared with the TAS group, all 3 test groups showed higher stiffness in flexion and equivalent stability in the other 5 directions. Side-by-side comparison among the 3 test fixation techniques showed no significant difference.\n\n\nCONCLUSIONS\nThe combination of C1LH and C2ILS supplemented with contralateral TAS or C1LH and TAS or C1LH and C2ILS was superior to bilateral TAS fixation with regard to biomechanics and vertebral artery safety.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"3f01ca74ff169d5cc5fb52085cf8dd6fe6890276","venue_1":"World neurosurgery","year":"2012","title":"Surgical removal of giant acoustic neuromas.","authors":"Joana Silva, António Cerejo, Filipe Duarte, Fernando Silveira, Rui Vaz","author_ids":"4902302, 6012072, 2251144, 3111969, 4192066","abstract":"OBJECTIVE\nThe authors present the outcome of radical surgical removal of giant acoustic neuromas.\n\n\nMETHODS\nTwenty-nine patients with acoustic neuroma with maximum diameter greater than 40 mm, submitted to surgery between the years 2005 and 2010, were reviewed by a retrospective study. The extension of tumor removal, surgical morbidity, facial nerve function, hearing, and evolution after surgery of preoperative neurologic conditions were the studied parameters.\n\n\nRESULTS\nAll tumors were completely removed by a retrosigmoid approach, without perioperative mortality. As complications related to the surgery, there were three cases of local cerebrospinal fluid leak, one case of nasal cerebrospinal fluid leak, two cases of meningitis, one pseudomeningocele, and one case of transient lower cranial nerve dysfunction. The anatomic integrity of the facial nerve was preserved in 86% and facial function in 72%. In the 21 patients who did not need hypoglossal-facial anastomosis (72%), facial function was excellent or good (HB I-II) in 13 cases (45%), fair (HB III) in 5 cases (17%), and poor (HB IV) in 3 cases (10%). Before surgery, 12 patients (41%) had useful (H2) or moderate (H3) hearing. In 7 of these 12 patients (58%), it was possible to preserve some hearing function (with moderate hearing), after surgical removal of the tumors. Six patients presented with radiologic signs of hydrocephalus, two of them with visual disturbances. Two patients presented with trigeminal neuralgia (one contralateral), three with facial sensory loss and one with swallowing problems, that disappeared after surgery.\n\n\nCONCLUSIONS\nTotal removal of large acoustic neuroma can be achieved by retrosigmoid approach with acceptable morbidity and no mortality. Preoperative neurologic symptoms recovered after surgery in most cases. Facial function preservation was possible in the majority of cases. Even in large tumors, hearing preservation should be attempted if the patient has useful hearing preoperatively.","cites":"0","conferencePercentile":"21.55172414"},{"venue":"World neurosurgery","id":"0283c360834f9ac785c8ce6d67409aaf23e0eee1","venue_1":"World neurosurgery","year":"2016","title":"The Effect of Age, Sex, and Lesion Location on Initial Presentation in Patients with Brain Arteriovenous Malformations.","authors":"Xianzeng Tong, Jun Wu, Fuxin Lin, Yong Cao, Yuanli Zhao, Bo Ning, Bing Zhao, Lijun Wang, Shuo Zhang, Shuo Wang, Jizong Zhao","author_ids":"7450090, 1714535, 4633240, 7185872, 3485720, 1727426, 2115618, 1733333, 7138101, 5994097, 7817852","abstract":"OBJECTIVE\nTo identify whether age, sex, and lesion location are associated with initial presentation in patients with brain arteriovenous malformations (AVMs).\n\n\nMETHODS\nCollected data of 3299 consecutive patients with AVM treated at Beijing Tiantan Hosptial from January 1980 to January 2015 were analyzed. The variables assessed were age at diagnosis, sex, AVM location, and mode of initial presentation.\n\n\nRESULTS\nInitial presentation was AVM hemorrhage in 57.9%, seizure in 20.9%, chronic headache in 14.9%, focal neurologic deficit in 5.2%, and incidental in 1.2%. Younger age and female sex were associated with initial hemorrhage (all P < 0.05). Hemorrhage was more likely to occur in patients with AVMs in the basal ganglia, the corpus callosum, the ventricles, the cerebellum, and the brainstem (all P < 0.05). Male sex was associated with initial seizure (P < 0.05). Initial seizure was more likely to occur in patients with AVMs in the frontal, temporal, parietal, frontotemporal, and frontoparietal lobe (all P < 0.05). Compared with frontal AVMs, temporal AVMs were more likely to present with hemorrhage (P < 0.05) and less likely to present with seizure (P < 0.05). AVMs involving the occipital lobe were more likely to present with chronic headaches (P < 0.05).\n\n\nCONCLUSIONS\nInitial AVM presentation varied with patient age, sex, and AVM locations. Younger age, female sex, and deep and infratentorial locations may be associated with initial hemorrhage. Male sex and frontal, temporal, and parietal AVM locations may be predictors of initial seizure. Chronic headache was more likely to occur in patients with AVMs involving the occipital lobe.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"6cb398da0f0909ceb6d4e3dc39190d6ffa6440cc","venue_1":"World neurosurgery","year":"2016","title":"A Multicenter Analysis of Computed Tomography Angiography Alone Versus Digital Subtraction Angiography for the Surgical Treatment of Poor-Grade Aneurysmal Subarachnoid Hemorrhage.","authors":"Bing Zhao, Fuxin Lin, Jun Wu, Kuang Zheng, Xianxi Tan, Yong Cao, Yuanli Zhao, Shuo Wang, Ming Zhong","author_ids":"2115618, 4633240, 1714535, 5703941, 6802791, 7185872, 3485720, 5994097, 1776142","abstract":"BACKGROUND\nPoor-grade aneurysmal subarachnoid hemorrhage (aSAH) is associated with increased intracranial pressure, and these patients are unstable with a high risk of rebleeding. Computed tomography angiography (CTA) has been proposed as an examination tool for the rapid detection of ruptured aneurysms. We aimed to determine the safety and efficacy of CTA alone for surgical treatment of poor-grade aSAH compared with digital subtraction angiography (DSA).\n\n\nMETHODS\nWe conducted a multicenter retrospective analysis of 144 patients with poor-grade aSAH who underwent surgical treatment for 2 different cohorts. Patients were grouped into CTA alone and DSA groups. Baseline characteristics, postoperative complications, and clinical outcomes at discharge and at last follow-up were compared between the 2 groups. Multivariate logistic regression models were used to assess the association between CTA alone and clinical outcomes after we adjusted for potential confounders.\n\n\nRESULTS\nOf the 116 patients included, 42 (36.2%) patents received CTA alone and 74 patients (63.7%), including 12 patients with CTA and DSA and 62 patients with DSA alone, received DSA before surgical treatment. Patients with larger ruptured aneurysms (P = 0.006), aneurysm sizes of larger than 5 mm (P = 0.025), presence of single aneurysms (P = 0.018), and presence of intraventricular hemorrhage (P = 0.019) more often received CTA alone. All ruptured aneurysms were clipped successfully during surgery. There were no statistically significant differences in postoperative complications and clinical outcomes between the 2 groups.\n\n\nCONCLUSIONS\nAlthough CTA alone can be safely and effectively used in most patients requiring surgical treatment, additional DSA may be considered in patients with smaller ruptured aneurysms or in those with multiple aneurysms.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"450452b8c446f269ff8aa88a06e1b482a43986a5","venue_1":"World neurosurgery","year":"2016","title":"Anatomical and Ultrasonic Study Based on Selective Tibial Neurotomy.","authors":"Sheng Zhong, Guihong Li, Liu Yang, Qi Yan, Yufa Wang, Gang Zhao, Youqiong Li","author_ids":"8037735, 2932316, 1745614, , 5768808, 1679837, 7770948","abstract":"BACKGROUND\nSelective tibial neurotomy (STN) was considered as an effective procedure for the treatment of spastic feet. It's also widely used for treating obese calves in some Asian countries currently. This study aimed to provide morphological measurement data and theoretical support for the operation and intraoperative localization.\n\n\nMETHODS\nFifty lower legs from 20 embalmed cadavers and five fresh corpses were dissected to observe and record the relationship of four branches given off from the tibial nerve, as well as the length, width and thickness of the triceps surae. An ultrasonic transducer was also used to measure the thickness of muscles of 50 volunteers and acquire the ultrasonic image of muscles and nerve branches.\n\n\nRESULTS\nAnatomic results showed the tibial nerve gave off four branches in a proximal to distal direction: the medial sural cutaneous nerve, the motor branches innervating the medial and lateral gastrocnemius and the motor branch innervating the soleus. These nerve branches had eight patterns of origin. Significant finding was that the nerve innervating the soleus consisted of two branches. Ultrasonic measurement results showed that the thickness of the gastrocnemius and the soleus were positively related to the calf circumference.\n\n\nCONCLUSION\nThe calf circumference was positively related to the thickness of the soleus and the gastrocnemius. Tibial nerve branches diverging pattern were multiple, caution should be utilized to prevent damaging other branches. Tibial nerve, branches and diverging sites could be seen clearly in the ultrasonic image, a preoperational ultrasonic examination was recommended.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"c3e8300f4baa719f92d7dd37ff7d84dae543693a","venue_1":"World neurosurgery","year":"2016","title":"Cerebellar Arteriovenous Malformations: Clinical Feature, Risk of Hemorrhage and Predictors of Posthemorrhage Outcome.","authors":"Xianzeng Tong, Jun Wu, Fuxin Lin, Yong Cao, Yuanli Zhao, Shuo Wang, Jizong Zhao","author_ids":"7450090, 1714535, 4633240, 7185872, 3485720, 5994097, 7817852","abstract":"OBJECTIVE\nWe aimed to summarize the clinical presentation, risk of hemorrhage, and predictors of posthemorrhage outcome in patients with cerebellar arteriovenous malformations (AVMs).\n\n\nMETHODS\nWe searched our AVM database at Beijing Tiantan Hospital and identified 225 patients with cerebellar AVMs between the year 2000 and 2015. The clinical presentation and hemorrhage risk were analyzed in all patients. Further analysis of predictors for immediate posthemorrhage outcome was performed in patients with ruptured AVMs. Posthemorrhage modified Rankin Scale (mRS) scores were dichotomized into nonsevere outcome (mRS ≤3) and severe outcome (mRS >3). Univariate and multivariate logistic regression analyses were applied to test the risk factors of hemorrhage and predictors of severe outcome.\n\n\nRESULTS\nOf the 225 patients, 197 (88%) presented with hemorrhage. Patients with initial hemorrhage were much younger than those with unruptured AVMs (univariate: P = 0.003; multivariate: P = 0.002). Single arterial supply (odds ratio [OR], 2.846; 95% confidence interval [CI], 1.022-7.922) and exclusively deep venous drainage (OR, 3.361; 95% CI, 1.045-10.813) were the other 2 independent risk factors for hemorrhagic presentation. Regarding the neurologic outcome immediately after hemorrhagic presentation, we used 3 models of multivariate logistic regression. Severe neurologic outcome (mRS >3) was associated with eloquent or deep AVM location, associated aneurysm, and the presence of intraventricular hemorrhage (all P < 0.05).\n\n\nCONCLUSION\nCerebellar AVMs have an aggressive nature of hemorrhage. Younger age, single feeding artery, and exclusively deep venous drainage were independent risk factors for hemorrhagic presentation. Eloquent location, associated aneurysm, and presence of intraventricular hemorrhage may predict severe immediate posthemorrhage outcome.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"d41a62a02a807efc7392ce6924a6ee555867ae2c","venue_1":"World neurosurgery","year":"2016","title":"Clinicoradiological features and surgical outcomes of sellar xanthogranulomas: a single center 10-year experience.","authors":"Bao Yang, Chenlong Yang, Jingyi Fang, Guang Li, Jisheng Wang, Guijun Jia, Pinan Liu, Wang Jia, Shuo Wang","author_ids":"7324529, 3784287, 3074464, 5003981, 7897927, 8063761, 5367729, 7647969, 5994097","abstract":"BACKGROUND\nXanthogranulomas are uncommon granulomatous entities, and those occurring in the sellar region are extremely rare, with a limited number of cases reported in the literature. The diagnosis, management, and prognosis of sellar xanthogranulomas remain poorly understood.\n\n\nMETHODS\nWe retrospectively reviewed the profiles of 14 patients with histologically proven sellar xanthogranulomas in our institution between Jan 2006 and July 2016. Their clinical manifestations, radiological features, operative records, and follow-up outcomes were analysed.\n\n\nRESULTS\nThere were 9 male and 5 female patients with a mean age of 29.2 years. Clinical manifestations included headache (n=12, 85.7%), visual deficiencies (n=10, 71.4%), and endocrine disturbances (n=6, 42.9%). On magnetic resonance imaging, sellar xanthogranulomas revealed iso- to hyperintensity on T1-weighted imaging and hyperintensity or heterogeneous intensity on T2-weighted imaging with variable enhancement. Gross total resection of the lesion was achieved in 10 cases, and subtotal resection in 4 cases. Postoperatively, the headache was relieved in all cases, transient diabetes insipidus was observed in 2 cases, and there were no procedure-related complications. During a mean follow-up period of 52.9 months, the visual deficiencies were improved in 7 (70.0%) cases, whilst the endocrine disturbances were only improved in 2 (33.3%) cases. No recurrence or regrowth of the residual lesions was observed.\n\n\nCONCLUSIONS\nSellar xanthogranuloma should be considered in the differential diagnosis of lesions in the sellar region. Some radiological characteristics, including hyperintensity on T1-weighted imaging, heterogeneous hyperintensity on T2-weighted imaging, variable enhancement, and absence of calcification can assist the preoperative diagnosis. The surgical outcomes are favorable.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"4596abf22ee9b8a34717724e7336b7e47cf8094f","venue_1":"World neurosurgery","year":"2016","title":"Preoperative Functional Findings and Surgical Outcomes in Patients with Motor Cortical Arteriovenous Malformation.","authors":"Fuxin Lin, Jun Wu, Bing Zhao, Xianzeng Tong, Zhen Jin, Yong Cao, Shuo Wang","author_ids":"4633240, 1714535, 2115618, 7450090, 6253281, 7185872, 5994097","abstract":"OBJECTIVE\nThe relationship between preoperative functional findings, derived from functional magnetic resonance imaging and diffusion tensor imaging, and surgical outcomes in patients with motor cortical arteriovenous malformations (AVMs) has not been determined. The aim of this study was to determine the relationship between preoperative functional findings and surgical outcomes in patients with motor cortical AVM.\n\n\nMETHODS\nFifteen patients with AVM involving the precentral knob and/or paracentral lobule were reviewed. Each motor function involved was examined as an independent object. Preoperative functional findings included cortical reorganization, activation around the nidus, corticospinal tract (CST) reorganization, nidus involving the CST, and the level of the CST involved. The relationship between preoperative functional findings and surgical outcomes was analyzed statistically. A muscle strength of grade 3 or less was defined as a poor outcome after surgery, and a muscle strength of grade 4 or greater was defined as a good outcome.\n\n\nRESULTS\nEighteen objects were created and analyzed. Cortical reorganization (P = 1.000) was not correlated with surgical outcomes. However, nidus involving the CST was significantly associated with poor short-term outcomes (1 week after surgery) (P = 0.028) and permanent deficit in muscle strength (P = 0.042). Most of the objects had good outcomes (16/18, 88.9%) at 6 months after surgery (long-term outcomes). Only 1 patient with CST ruptured at the corona radiata level and 1 patient who had postoperative hemorrhage obtained poor long-term outcomes.\n\n\nCONCLUSIONS\nNidus involving the CST and the level of the CST involved, rather than cortical reorganization, may be associated with surgical outcomes in patients with motor cortical AVM.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"46bd436a11ba04a2398d5086c9c41f348976f45c","venue_1":"World neurosurgery","year":"2015","title":"Long-Term Outcomes After Small-Bone-Window Posterior Fossa Decompression and Duraplasty in Adults with Chiari Malformation Type I.","authors":"Xiaofeng Deng, Chenlong Yang, Jiahe Gan, Liang Wu, Tao Yang, Jun Yang, Yulun Xu","author_ids":"7385336, 3784287, 8418239, 4140966, 8667820, 1750537, 7870132","abstract":"BACKGROUND\nSmall-bone-window posterior fossa decompression with duraplasty is one of the popular surgical options for Chiari malformation type I, but its efficacy is controversial and the risk factors of clinical outcome remain unclear.\n\n\nMETHODS\nThe study cohort included 152 patients with Chiari malformation type I who received small-bone-window posterior fossa decompression at Beijing Tiantan hospital from January 2008 to September 2009. All patients underwent combined surgical procedures: a small-bone-window suboccipital decompression (diameter, 2.5-3 cm) and a C1 laminectomy (1.5- to 2-cm wide) followed by a duraplasty with an autologous graft. Clinical manifestations, radiologic features, and follow-up data during a 6-year span were analyzed. Risk factors associated with outcome were investigated by the use of χ(2) analysis and logistic regression analysis.\n\n\nRESULTS\nThe average follow-up duration was 74 months. Symptoms were improved in 126 patients (82.9%), remained stable in 21 patients (13.8%), and deteriorated in 5 patients (3.3%). There was no mortality. Postoperative magnetic resonance imaging scans were available for all patients. Preoperatively, 112 patients were associated with syringomyelia, and the follow-up magnetic resonance images showed obvious reduction of syringomyelia in 73 patients (65.2%) and no significant change in 39 patients (34.8%). In addition, enlargement of the cistern magna was observed in 92 patients (85.2%). Regression analysis indicates preoperative motor dysfunction, brainstem herniation and basilar invagination may influence the clinical outcome (P < 0.05).\n\n\nCONCLUSIONS\nSmall-bone-window posterior fossa decompression with duraplasty is an effective and safe treatment option with a low complication rate. Motor dysfunction, brainstem herniation, and basilar invagination are predictors of poor clinical prognosis.","cites":"0","conferencePercentile":"34.52970297"},{"venue":"World neurosurgery","id":"72162ebd86db5d9fc4b4de2093e72909cfb5d449","venue_1":"World neurosurgery","year":"2016","title":"Comparison of Primary Spinal Central and Peripheral Primitive Neuroectodermal Tumors in Clinical and Imaging Characteristics and Long-Term Outcome.","authors":"Wei Qi, Xiaofeng Deng, Tie Liu, Yingzhi Hou, Chenlong Yang, Liang Wu, Jingyi Fang, Xianzeng Tong, Jun Yang, Yulun Xu","author_ids":"1772359, 7385336, 8484868, 8471279, 3784287, 4140966, 3074464, 7450090, 1750537, 7870132","abstract":"OBJECTIVE\nPrimary spinal primitive neuroectodermal tumors are extremely rare entities. The purpose of this study was to analyze the differences in clinical and imaging characteristics and outcomes between primary spinal central PNETs (cPNETs) and peripheral PNETs (pPNETs).\n\n\nMETHODS\nThere were 25 consecutive patients with primary spinal primitive neuroectodermal tumors enrolled. The diagnosis was cPNET in 6 patients with negative CD99 expression and pPNET in 19 patients with positive CD99 expression. Gross total resection (GTR) was achieved in 12 patients, subtotal resection was performed in 9 patients, and partial resection was performed in 4 patients. Postoperative chemotherapy was given to 14 patients, and radiotherapy was given to 16 patients.\n\n\nRESULTS\nThe age at diagnosis was significantly younger in the cPNET group (mean 12.8 years) compared with the pPNET group (mean 22.5 years) (P = 0.040); the 2 pathologies did not show a significant difference in prognosis. GTR (P = 0.041), radiotherapy (P = 0.008), and GTR with radiotherapy (P = 0.009) were significant factors leading to a higher 2-year survival rate. Kaplan-Meier analysis showed that radiotherapy (P < 0.001) and GTR with radiotherapy (P = 0.040) resulted in a longer median survival time. Patients who underwent GTR, chemotherapy, and radiotherapy all together had the highest 1-year (100.0%) and 2-year (71.4%) survival rates and the longest median survival time (32 months).\n\n\nCONCLUSIONS\nPatients with spinal cPNETs were younger compared with patients with pPNETs. The prognosis of spinal cPNETs and pPNETs was poor with no significant difference between the entities. The most beneficial treatment modality is GTR combined with adjuvant radiotherapy and chemotherapy.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"de192fb7db582caca78aa5a76b19d261e72dd5da","venue_1":"World neurosurgery","year":"2016","title":"Choroid Plexus Papillomas of the Cerebellopontine Angle.","authors":"Wei Luo, Hai Liu, Jiaxin Li, Jun Yang, Yulun Xu","author_ids":"4154507, 4204183, 1727065, 1750537, 7870132","abstract":"OBJECTIVE\nChoroid plexus papillomas (CPPs) of the cerebellopontine angle (CPA) are extremely rare. We present a series of 21 cases operated on in the last 7 years at our institution.\n\n\nMETHODS\nDuring the period from January 2008 to October 2015, we encountered 102 histologically established cases of CPPs, of which 21 were located in the CPA region. Clinical profiles, radiologic features, surgical procedures, intraoperative findings, and outcomes were extracted from the patient records and neuroimaging data.\n\n\nRESULTS\nThe 21 CPPs in the CPA region accounted for 20.5% of all CPPs. Two of the tumors occurred in pediatric patients. Tumor size was 2.5-4.7 cm. The rate of calcification was higher in the CPPs in the CPA region. Peritumoral cysts and cysts with small nodules were observed in our cases. A far lateral suboccipital approach was chosen for CPPs protruding inferiorly into the foramen magnum region (n = 14), and a suboccipital retrosigmoid approach was chosen for the other tumors. Total resection was achieved in 18 patients, and subtotal resection was achieved in 3 patients. During the follow-up period, only 1 patient experienced recurrence 32 months after the first operation. The recurrence turned out to be an atypical CPP.\n\n\nCONCLUSIONS\nCPPs in the CPA region cannot be easily differentiated from other tumors preoperatively. Cysts and calcifications appear on neuroimaging. CPPs in the CPA region usually protrude inferiorly into the foramen magnum region. As much tumor should be removed as possible to avoid recurrence and malignant transition.","cites":"1","conferencePercentile":"97.49647391"},{"venue":"World neurosurgery","id":"0f27631c837ea1be11eb643e1d0703991a06f55d","venue_1":"World neurosurgery","year":"2011","title":"Huashan Hospital affiliated to Fudan University: spanning a century of history.","authors":"Ying Mao, Zhi F Shi, Liang F Zhou, Yao Zhao","author_ids":"5957266, 7947593, 4298828, 1684018","abstract":"Established in 1907, Huashan Hospital affiliated to Fudan University represents in microcosm the growth of modern Chinese medical science and shows its course of development. Over the past 103 years, the hospital has grown from a staff of a dozen to 3103 staff members, covering an area of 37,396 m(2) with 1216 hospital beds. Huashan Hospital has grown into one of the best-known hospitals in China with multiple world-renowned disciplines, including neurosurgery, hand surgery, dermatology, and infectious disease.","cites":"2","conferencePercentile":"63.60759494"},{"venue":"World neurosurgery","id":"c5bf466ea956e9cb95edb66fa716159a360dfe90","venue_1":"World neurosurgery","year":"2016","title":"Clinical Features and Long-Term Outcomes of Unilateral Moyamoya Disease.","authors":"Qian Zhang, Rong Wang, Yaping Liu, Yan Zhang, Shuo Wang, Yong Cao, Yuanli Zhao, Xingju Liu, Jia Wang, Xiaofeng Deng, Faliang Gao, Ziwen Yang, Meng Zhao, Peicong Ge, Yonggang Ma, Jizong Zhao, Dong Zhang","author_ids":"1737486, 1698066, 2398582, 3397757, 5994097, 7185872, 3485720, 8016529, 4263537, 7385336, 7410508, 3362682, 2389548, 8205303, 7777555, 7817852, 4944112","abstract":"OBJECTIVE\nTo elucidate the clinical features, risk factors for contralateral progression, and long-term outcomes of patients with unilateral moyamoya disease (MMD).\n\n\nMETHODS\nWe retrospectively reviewed 109 patients with unilateral MMD treated at Beijing Tiantan Hospital. Clinical features, radiologic findings, and outcomes were analyzed.\n\n\nRESULTS\nThe mean age at diagnosis was 30.8 ± 14.2 years with a one-peak distribution in the thirties. The ratio of women to men was 1.1:1. Familial occurrence was 5.5%. The primary symptoms at initial presentation were transient ischemic attack (39.4%), infarction (22%), and hemorrhage (26.6%). The distribution of the initial Suzuki stage was as follows: stage 2, n = 33; stage 3, n = 35; stage 4, n = 27; stage 5, n = 11, and stage 6, n = 3. Contralateral abnormality on initial angiography occurred in 19 adult patients (17.4%). Posterior cerebral artery involvement was observed in 28 (25.7%) patients. During the average follow-up of 43.8 ± 21.3 months, contralateral progression was observed in 18 patients (16.5%). Contralateral abnormalities (P = 0.033) on initial angiography and infarction at initial presentation (P = 0.041) were significantly associated with contralateral progression in adults and children, respectively. Approximately 91.7% of patients had a modified Rankin Scale score of 0-2 during follow-up.\n\n\nCONCLUSIONS\nA one-peak pattern in age distribution, lower grade of Suzuki stage, fewer familial cases, and posterior cerebral artery involvement were observed in patients with unilateral MMD. Contralateral abnormalities on initial angiography and infarction at onset were risk factors for contralateral progression in adult and pediatric patients, respectively. Good functional outcomes can be anticipated in the vast majority of surgically treated patients.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"5df8de28377142a85b9d478bea2a8242fe82a8aa","venue_1":"World neurosurgery","year":"2011","title":"Transarticular screw and C1 hook fixation for os odontoideum with atlantoaxial dislocation.","authors":"Bin Ni, Fengjin Zhou, Ning Xie, Xiang Guo, Lili Yang, Qunfeng Guo, Jian Yang, Songkai Li, Feng Zhang, Zhuangchen Zhu, Jinshui Chen","author_ids":"7494664, 4189639, 3420061, 3255489, 7866222, 6014505, 1704854, 8087057, 1801216, 8129657, 3031042","abstract":"OBJECTIVE\nTo introduce a fixation device composed of C1-2 transarticular (TA) screws and C1 hooks and explore its indication and clinical outcome for os odontoideum with atlantoaxial dislocation (AAD).\n\n\nMETHODS\nFrom January 2004 to December 2008, 12 patients with os odontoideum (5 men and 7 women, average age 37.7 years [range 14-62 years]) were treated in the authors' hospital. All patients had AAD with local symptoms, and 10 had myelopathy. All patients underwent a posterior atlantoaxial fixation with C1-2 TA screws and C1 hooks. Clinical and radiographic analyses were performed at 3, 6, and 12 months postoperatively and annually thereafter.\n\n\nRESULTS\nThe follow-up period was 12-66 months (average follow-up period 35.5 months). No neurologic or vascular complications occurred in these cases, and the device was placed well with no loosening or breakage. Plain radiographs and three-dimensional reconstruction of computed tomography (CT) images revealed solid bony fusion with a good alignment of C1 and C2 at 3 months postoperatively. No hardware failure, pseudarthrosis, or instability was noted during the follow-up period. All patients had relief of pain within 3 months, and neurologic symptoms were substantially improved.\n\n\nCONCLUSIONS\nWhen appropriate patients are selected, C1-2 TA screws combined with C1 hooks can be used to treat os odontoideum with AAD effectively with a relatively simple procedure resulting in excellent biomechanical strength and high bone fusion rate. Preoperative planning is crucial for the management of os odontoideum with AAD.","cites":"0","conferencePercentile":"15.50632911"},{"venue":"World neurosurgery","id":"f3353d75dc7aac002933f54da9bda6f0210a2576","venue_1":"World neurosurgery","year":"2010","title":"Visual outcome after extended endoscopic endonasal transsphenoidal surgery for tuberculum sellae meningiomas.","authors":"Qing Wang, Xiao-Jie Lu, Wei-Ying Ji, Zheng-Cun Yan, Jia Xu, Ya-Suo Ding, Jie Zhang","author_ids":"7135234, 3429929, 4699174, 7833543, 4508423, 7625539, 8714992","abstract":"BACKGROUND\nThe purpose of this study was to evaluate the visual outcome after extended endoscopic endonasal transsphenoidal surgery in patients with tuberculum sellae meningiomas (TSM).\n\n\nMETHODS\nA retrospective analysis was performed for 12 patients (4 men and 8 women) with TSMs who underwent extended endonasal transsphenoidal surgery with pure endoscopy between 2003 and 2008. Neuro-ophthalmic evaluation was performed preoperatively and postoperatively. Visual acuity, visual fields, and funduscopy results were documented during the preoperative and follow-up periods.\n\n\nRESULTS\nThere were three patients with bilateral optic foramen invasion and four patients with unilateral optic foramen invasion on radiologic findings preoperatively. Eleven patients had total tumor resection (Simpson grade I and II), and one patient had a subtotal tumor resection with a small asymptomatic tumor regrowth seen on magnetic resonance imaging at 14 months after surgery. Patients were observed for a mean follow-up time of 2.1 years (range 6 months-5 years), and the median was 28 months. Visual acuity improved in 92% of patients and was unchanged in 8% of patients. Eleven patients with visual field problems were better in various degrees at postoperative follow-up than before operation. No patients showed worsening of vision or visual field after surgery.\n\n\nCONCLUSIONS\nIn this small, selected series with a relatively short follow-up, the extended endoscopic endonasal transsphenoidal approach to TSMs was a feasible alternative to the transcranial approach with minimal manipulation of the optic nerve. Procedures in the subchiasmatic space can be performed effectively with excellent visualization of the blood network supply to the optic apparatus while preserving the optic nerve in most cases.","cites":"4","conferencePercentile":"88.32335329"},{"venue":"World neurosurgery","id":"381ba1b258dc91da3416f3253f2c1aae2a466430","venue_1":"World neurosurgery","year":"2015","title":"Olfactory ensheathing cells: Part II--source of cells and application to patients.","authors":"David Choi, Karen Gladwin","author_ids":"3257330, 7599244","abstract":"OBJECTIVE\nTo assess clinical methods of sourcing human olfactory ensheathing cells (OECs), and the results of present day clinical studies in OEC transplantation.\n\n\nMETHODS\nReview of literature.\n\n\nRESULTS\nPresent clinical studies of OEC transplantation have demonstrated the feasibility and safety of the technique, and no significant complications have occurred from harvest of the olfactory mucosa to culture OECs. These reported studies have not been designed to determine whether clinical outcome is improved by transplantation.\n\n\nCONCLUSIONS\nOEC transplantation strategies need to be studied further. At present clinical models for testing OECs vary in methodology and quality, and until high-quality, well-designed, and sufficiently powered studies have been performed, the true effect of OEC treatment for patients will remain unclear.","cites":"1","conferencePercentile":"80.1980198"},{"venue":"World neurosurgery","id":"56ba56fe8f75267923c57aa63a866d4c12db28d0","venue_1":"World neurosurgery","year":"2014","title":"Usefulness of tumor blood flow imaging by intraoperative indocyanine green videoangiography in hemangioblastoma surgery.","authors":"Masato Hojo, Yoshiki Arakawa, Takeshi Funaki, Kazumichi Yoshida, Takayuki Kikuchi, Yasushi Takagi, Yoshio Araki, Akira Ishii, Takeharu Kunieda, Jun C Takahashi, Susumu Miyamoto","author_ids":"6031287, 3012754, 6424870, 6883119, 2040460, 2668488, 2552957, 1727896, 5747691, 8101642, 3309153","abstract":"OBJECTIVE\nHemangioblastomas remain a surgical challenge because of their arteriovenous malformation-like character. Recently, indocyanine green (ICG) videoangiography has been applied to neurosurgical vascular surgery. The aim of this study was to evaluate the usefulness of tumor blood flow imaging by intraoperative ICG videoangiography in surgery for hemangioblastomas.\n\n\nMETHODS\nTwenty intraoperative ICG videoangiography procedures were performed in 12 patients with hemangioblastomas. Seven lesions were located in the cerebellum, two lesions were in the medulla oblongata, and three lesions were in the spinal cord.\n\n\nRESULTS\nTen procedures were performed before or during dissection, and 10 procedures were performed after tumor resection. ICG videoangiography could provide dynamic images of blood flow in the tumor and its related vessels under surgical view. Interpretation of these dynamic images of tumor blood flow was useful for discrimination of transit feeders (feeders en passage) and also for estimation of unexposed feeders covered with brain parenchyma. Postresection ICG videoangiography could confirm complete tumor resection and normalized blood flow in surrounding vessels.\n\n\nCONCLUSIONS\nIn surgery for hemangioblastomas, careful interpretation of dynamic ICG images can provide useful information on transit feeders and unexposed hidden vessels that cannot be directly visualized by ICG.","cites":"2","conferencePercentile":"85.42857143"},{"venue":"World neurosurgery","id":"b224ce2d3e4f1c08de0d11a62c9fddfd82eb303c","venue_1":"World neurosurgery","year":"2016","title":"Ultrasonic Observation and Clinical Application of Arcade of Struthers in the Mid-Arm.","authors":"Sheng Zhong, Zhuan Zhong, Yu Yu, Liu Yang, Yingjie Gao, Junxue Song, Fubo Cheng, Youqiong Li","author_ids":"8037735, 3650797, , 1745614, 8128620, 4344469, 3938924, 7770948","abstract":"BACKGROUND\nThe mid-arm structure named arcade of Struthers has been shrouded in controversy since it was identified. Most specimens in previous studies were European. The occurrence, component, extent, and position of this structure in the xanthoderm are not clear. Moreover, research into the arcade of Struthers has been at the anatomic level and there has been no ultrasonic research. The aim of this study was to elucidate and measure this anatomy by both anatomic dissection and ultrasonic observation to provide clear and definite criteria to classify the arcade of Struthers, as well as operation guidelines for identifying the arcade of Struthers in ultrasonic imaging and surgical decompression.\n\n\nMETHODS\nSixty-four upper limb specimens of 32 adult cadavers were dissected. The tendinous arcade of Struthers (TAS) and muscular arcade of Struthers (MAS) were observed and measured, as well as the position at which the medial intermuscular septum was pierced by the ulnar nerve. The position at which the concomitant blood vessel began to accompany the ulnar nerve was also recorded. Twenty healthy adult participants were enrolled for ultrasonic research. The ulnar nerve was scanned from the cubital tunnel to the fossa axillaris for the anatomic structure crossing it. Once the arcade of Struthers was found, the distal and proximal limits were marked on the skin and it was then measured.\n\n\nRESULTS\nAnatomic study showed TASs in 21 limbs, and MASs were found in 16 limbs. The total incidence of the arcade of Struthers was 57.8%. The length of TAS (2.12 ± 0.62 cm) and MAS (4.46 ± 1.96 cm) had a significant difference and the distance between its proximal limit and the medial humeral epicondyle were 8.93 ± 1.38 cm and 9.50 ± 1.69 cm, respectively. Ultrasonic study showed that the incidence of the arcade of Struthers was 50.0%. The distance between its proximal limit and the medial humeral epicondyle was 8.52 ± 1.88 cm and 9.45 ± 1.76 cm. The length was 1.85 ± 1.8 cm and 4.23 ± 1.93 cm, respectively.\n\n\nCONCLUSIONS\nWe believed that an arcade of Struthers described by multiple investigators did exist in Chinese people, and based on our study, it was classified into 2 types: TAS and MAS. Caution should be used to preserve the superior ulnar collateral artery when incising the arcade of Struthers. Ultrasonography can detect the existence ratio, dimension, and location of the arcade of Struthers.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"4a382e2698eea7ff2434578c0b090df50e440ecf","venue_1":"World neurosurgery","year":"2014","title":"Computational fluid dynamic simulation of a giant basilar tip aneurysm with eventual rupture after Hunterian ligation.","authors":"Masaaki Shojima, Akio Morita, Toshikazu Kimura, Marie Oshima, Taichi Kin, Nobuhito Saito","author_ids":"4572166, 3216347, 1759113, 2801392, 2974004, 2195000","abstract":"BACKGROUND\nHunterian ligation is performed to reduce and to change the flow of an aneurysm; it is a surgical option for a complex aneurysm that cannot be managed by either clipping or coiling. However, it may be associated with adverse effects. This study was carried out to analyze how Hunterian ligation changed the flow dynamics of a particular cerebral aneurysm.\n\n\nMETHODS\nA case of giant basilar tip aneurysm, in which Hunterian ligation resulted in rupture 6 months later, was subjected to computational fluid dynamic simulation. Among the simulations with various boundary conditions, the flow dynamic parameters of streamlines, velocities, and wall shear stresses were compared and analyzed qualitatively and quantitatively.\n\n\nRESULTS\nHunterian ligation switched the parent artery from the basilar artery to the left posterior communicating artery. The changes in the direction and the diameter of the parent arteries resulted in the focal elevation of the shear magnitude and the high shear gradient on the posterior wall of the aneurysm after the ligation. These hemodynamic changes might have been associated with the eventual rupture of the aneurysm.\n\n\nCONCLUSIONS\nHunterian ligation is a useful flow diversion surgery, but it might worsen the flow dynamics in specific cases.","cites":"1","conferencePercentile":"63.57142857"},{"venue":"World neurosurgery","id":"cda2b2551e6264afa19d47d29814e97fcd401b3f","venue_1":"World neurosurgery","year":"2013","title":"Assessment of quality of life after surgery for spinal metastases: position statement of the Global Spine Tumour Study Group.","authors":"David Choi, Steven Morris, Alan Crockard, Todd Albert, Cody Bunger, Michael Fehlings, James Harrop, Norio Kawahara, Juan A Martin, Eric M Massicotte, Christian Mazel, F C Oner, Wilco Peul, Katsuro Tomita, Michael Wang","author_ids":"3257330, 5721277, 5408366, 4217101, 7959490, 8648849, 5728903, 8496207, 2774697, 5013608, 8277977, 5462950, 3126098, 4460307, 2992677","abstract":"OBJECTIVE\nTo review suitable measures of patient-assessed outcome of surgery for spinal metastases, and suggest the Health-Related Quality of Life measures that are useful and practical for this group of patients.\n\n\nMETHODS\nSurgery for metastatic spinal tumors is becoming more common, but the impact of surgery on the patient, as determined by patient-assessed outcome measures, is not well known. The authors of this article include members of the Global Spine Tumour Study Group: an international group of spinal surgeons who are studying the techniques and outcomes of surgery for spinal tumors. During the development of a research database for the study of patients undergoing surgery for spinal metastases, the different outcome measures were discussed by a panel of spinal surgeons, and quality of life measures were chosen for inclusion, based on expert opinion and literature review.\n\n\nRESULTS\nSeveral different measures are available to assess outcome after spinal surgery for metastatic disease, each with specific advantages and limitations, which are discussed. Our position is to use the EuroQoL EQ-5D questionnaire, because of its simplicity and reliability.\n\n\nCONCLUSIONS\nWe recommend the use of the EQ-5D measure in research for assessment of patient-centered outcomes and calculation of cost effectiveness of surgery for spinal metastases. Routine use of the measure in clinical practice is also encouraged, because it is a simple and quick method to assess overall clinical outcome.","cites":"2","conferencePercentile":"74.81751825"},{"venue":"World neurosurgery","id":"853675d4848d65b85cad24b79cfe93be05a76a68","venue_1":"World neurosurgery","year":"2011","title":"Angiographic classification of tumor attachment of meningiomas at the cerebellopontine angle.","authors":"Naoto Kunii, Takahiro Ota, Taichi Kin, Kyousuke Kamada, Akio Morita, Nobutaka Kawahara, Nobuhito Saito","author_ids":"8096843, 3291068, 2974004, 2661980, 3216347, 8496074, 2195000","abstract":"OBJECTIVE\nTo present an angiographic classification of attachment of meningiomas at the cerebellopontine angle (CPA) based on tumor feeding and to validate the utility of this classification in predicting meningioma attachments at the CPA.\n\n\nMETHODS\nThe authors retrospectively analyzed 34 consecutive patients with meningioma at the CPA. Based on operative findings, tumors were classified into four types: the petroclival type, in which the trigeminal nerve is displaced laterally; the tentorial type, in which the center of tumor attachment is located at the medial tentorium; the anterior petrous type, in which the center of tumor attachment is located anterior to the meatus; and the posterior petrous type, in which the center of tumor attachment is located posterior to the meatus. Magnetic resonance imaging (MRI) was sufficient to confirm attachment of the posterior petrous type. Another 26 cases were analyzed angiographically and classified into three types: abnormal ipsilateral tentorial artery type (type A); bilateral internal carotid artery (ICA) type (type B); and nontentorial, non-ICA type (type N). This angiographic classification was validated by comparison with the attachment classification.\n\n\nRESULTS\nAngiographic types A, B, and N corresponded to tentorial, petroclival, and anterior petrous types of attachment. Observed agreement was very high, particularly for tumors greater than 30 mm in diameter (κ statistic 0.83; 95% confidence interval [CI] 0.62-1.0). Angiographic type in this paired attachment typing offered high sensitivity and specificity greater than 0.80 in tumors larger than 30 mm.\n\n\nCONCLUSIONS\nThis angiographic classification seems to be useful in predicting meningioma attachments at the CPA. The existence of an abnormally developed tentorial artery seems highly indicative of tumor attachment to the tentorium.","cites":"1","conferencePercentile":"42.40506329"},{"venue":"World neurosurgery","id":"40ebe693a59082ac0c2ecfc59e741428c43da236","venue_1":"World neurosurgery","year":"2016","title":"Morphologic Analysis of Occipital Sinuses for Occipital Screw Fixation Using Digital Subtraction Angiography.","authors":"Dong Hoon Lee, Jae Taek Hong, Jae Hoon Sung, Ashish Jain, Joon Huh, Sang Uk Kim, Joon Young Kim, Jae Yoel Kwon, Chul Bum Cho, Il Sup Kim, Sang Won Lee","author_ids":"1734251, 7011398, 3634924, 3113411, 7329451, 2185935, 4848292, 7021834, 6271995, 5112825, 3191413","abstract":"BACKGROUND\nNumerous methods to achieve occipitocervical stabilization have been described, including the use of occipital plate/screw constructs. Bicortical screws may increase the pullout strength, but intracranial injuries to venous sinuses have been reported. This study was performed to analyze the variations in occipital sinuses to prevent sinus injury caused by the bicortical screw.\n\n\nMETHODS\nOccipital sinuses of 1720 patients were examined using digital subtraction angiography. The data collected included patient age and sex, occipital sinus type, distance between occipital sinus and midline, depth from inion to occipital sinus, and distance between occipital sinus and midline occiput at different levels.\n\n\nRESULTS\nThe mean age of patients was 57 years ± 13. There were 807 (46.9%) men and 913 (53.1%) women. The most common occipital sinus type was single occipital sinus off-midline (type B2). The least common occipital sinus type was absent occipital sinuses (type A; 8.7% of patients). There was no significant difference between age and occipital sinus type (P = 0.310). Also, the difference between sexes was not significant in regard to occipital sinus type in general. However, in subgroup analysis of type B1 and B2, there was a significant difference between sexes (P < 0.01). The mean depth from bone to occipital sinus was 19.913 mm ± 7.437.\n\n\nCONCLUSIONS\nThe occipital sinus shows several variations, and many morphologic differences can be seen. Preoperative detailed examination by magnetic resonance venography or vertebral angiography may be required for cases in which bicortical occipital screw fixation is necessary to avoid occipital sinus-related complications.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"942c3af8b74d322479e5e98e0ccbd5fa9b55d5c3","venue_1":"World neurosurgery","year":"2012","title":"The values of thin sections and three-dimensional reconstruction in the sellar region.","authors":"Jun Liu, Shuwei Liu, Xueyuan Heng, Chang Fei, Youyi Wei, Jian Zhang, Zhonghe Zhang, Yuchun Tang","author_ids":"1843598, 2281717, 6599691, 7556049, 7506260, 1956835, 2499181, 1707055","abstract":"OBJECTIVE\nThe computerized freezing milling technique is derived from the virtual human project. It has been widely used in three-dimensional (3D) reconstruction of the human body and organs. With this technique, the study was undertaken to explore the 3D features and adjacent anatomic relationships of the sellar region for skull base surgery.\n\n\nMETHODS\nContinuous thin sections on the coronary plane were performed with the computerized freezing milling technique using a human head specimen. The related structures were described in six sections. After segmenting, labeling, and extracting in serial sections, the 3D reconstruction of the sellar region was finished with Amira 4.1 software.\n\n\nRESULTS\nA total of 390 thin coronary sections were obtained. In six sections, the anatomic relationships of the pituitary gland, carotid artery, sphenoid sinus, and nerves are displayed. Three-dimensional images of the sellar region are video films that continuously and dynamically display anatomic structures in 3D space at different velocities. It can show that the cavernous segment of the internal carotid artery is located anterolateral to the sphenoid sinus and lateral to the pituitary gland. The optic nerve protrudes into the superolateral portion of the sphenoid sinus.\n\n\nCONCLUSIONS\nThe combination of coronary sectional anatomy and 3D reconstruction can display the anatomic characteristics of the sellar region. The 3D models are video films that continuously and dynamically display anatomic structures in 3D space at different velocities.","cites":"0","conferencePercentile":"21.55172414"},{"venue":"World neurosurgery","id":"6aa51f2da1764485b1c26194a6fa4ba97a8ae3b8","venue_1":"World neurosurgery","year":"2016","title":"Neuroinflammation Preceding and Accompanying Primary Central Nervous System Lymphoma: Case Study and Literature Review.","authors":"Jian-Qiang Lu, Cian O'Kelly, Safwat Girgis, Derek Emery, Christopher Power, Gregg Blevins","author_ids":"8552895, 7216470, 3976571, 3267976, 6234503, 1837856","abstract":"BACKGROUND\nPrimary central nervous system lymphoma (PCNSL) is an aggressive lymphoma confined to the CNS. Although the pathogenesis of PCNSL in immunocompetent individuals remains unclear, there have been several case studies demonstrating the \"sentinel\" inflammatory lesions months before the manifestation of PCNSL. However, the pathologic relationship between the inflammatory lesions and subsequent PCNSL is still unknown.\n\n\nCASE DESCRIPTION\nWe present the case of a 44-year-old immunocompetent woman who developed several cerebral and cerebellar lesions on magnetic resonance imaging (MRI). A partial resection of the cerebellar contrast-enhancing lesion showed active inflammation with large destructive process but no evidence of B-cell lymphoma. Her disease was in a relapsing-remitting course for 28 months and progressed with new MRI findings of more contrast-enhancing lesions. She died at 33 months after the initial presentation. Postmortem examination revealed B-cell PCNSL with extensive involvement but sparing a few brain regions, including the previous resection site, with only an inflammatory destructive process.\n\n\nCONCLUSIONS\nPCNSL may be preceded and accompanied by an inflammatory process that is pathologically distinct from PCNSL. Our case study, in combination with a review of previously published similar cases, supports the hypothesis that the \"sentinel\" inflammatory lesions may be the first immune response against PCNSL.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"1b051924c45f7e3a97e5b0b8ada40876cfe61d0e","venue_1":"World neurosurgery","year":"2016","title":"Lesion-to-Eloquent Fiber Distance Is a Crucial Risk Factor in Presurgical Evaluation of Arteriovenous Malformations in the Temporo-occipital Junction.","authors":"Yuming Jiao, Fuxin Lin, Jun Wu, Hao Li, Lijun Wang, Zhen Jin, Shuo Wang, Yong Cao","author_ids":"7229242, 4633240, 1714535, 1706574, 1733333, 6253281, 5994097, 7185872","abstract":"OBJECTIVE\nTemporo-occipital junction arteriovenous malformations (TOJ-AVMs) do not often involve eloquent brain cortex, but rather exist beside functional fiber tracts. The objective of this study was to determine the outcomes after surgical treatment in patients with TOJ-AVMs and to identify risk factors associated with postoperative neurologic deficits.\n\n\nMETHODS\nWe retrospectively studied 41 patients with TOJ-AVMs. All patients underwent preoperative diffusion tensor imaging. Every potentially involved function (visual field and language) was studied as an independent function object (FO). The function-related optic radiation or arcuate fasciculus was tracked. Lesion-to-eloquent fiber distances (LFDs) were analyzed in regard to postoperative neurologic deficits. The areas under the receiver operating characteristic curves were compared.\n\n\nRESULTS\nThere were 58 FOs analyzed. Of these, 26 (44.8%) FOs led to short-term neurologic deficits, and 21 (36.2%) FOs resulted in long-term neurologic deficits. LFD was a significant predictor of short-term (P = 0.002) and long-term (P = 0.007) neurologic deficits. The Spetzler-Martin (S-M) score was associated with short-term neurologic deficits (P = 0.045), but it was not associated with long-term neurologic deficits. The area under the receiver operating characteristic curve of LFD was higher than that of the S-M score in predicting short-term neurologic deficits (0.89 vs. 0.72, P = 0.04) and long-term neurologic deficits (0.90 vs. 0.62, P = 0.002). The cutoff point for LFD in predicting long-term neurologic deficits was 3.10 mm.\n\n\nCONCLUSIONS\nPatients with TOJ-AVMs have a high risk of surgical morbidity, although they often have relatively low S-M scores; LFD is a crucial risk factor associated with postoperative neurologic deficits in patients with TOJ-AVMs.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"b35cb4089cf963918c6f7b982e41e193ca7758e5","venue_1":"World neurosurgery","year":"2016","title":"Risk Factors for Subsequent Hemorrhage in Patients with Cerebellar Arteriovenous Malformations.","authors":"Xianzeng Tong, Jun Wu, Fuxin Lin, Yong Cao, Yuanli Zhao, Shuo Wang, Jizong Zhao","author_ids":"7450090, 1714535, 4633240, 7185872, 3485720, 5994097, 7817852","abstract":"OBJECTIVE\nThe aim of this study was to identify the risk factors for subsequent hemorrhage in patients with untreated cerebellar arteriovenous malformations (AVMs).\n\n\nMETHODS\nWe searched our AVM database at Beijing Tiantan Hospital and identified 149 patients with cerebellar AVMs who were at least 1 month treatment free after initial diagnosis between 2000 and 2015. The patients were followed up from initial diagnosis until subsequent hemorrhage, initiation of treatment, or the end of 2015. The natural history of cerebellar AVMs was analyzed.\n\n\nRESULTS\nThe overall annual rupture rate was 8.6%, with a mean follow-up period of 4.2 years (range, 1 month to 15 years). The annual rupture rate for previously ruptured AVMs was 10.8% during the whole follow-up period, 12.4% in the first 5 years (18.8% in the first year and 9.0% in the subsequent 4 years) and 6.7% in more than 5 years after initial diagnosis. The overall annual rupture rate for previously unruptured AVMs was 4.0%. Childhood at diagnosis, AVM size ≥3 cm and exclusively deep venous drainage were independent risk factors for subsequent hemorrhage. Previous AVM rupture significantly increased the hemorrhagic risk during the first 5 years but did not significantly affect subsequent hemorrhage thereafter.\n\n\nCONCLUSIONS\nChildhood at diagnosis, large AVM size, and AVMs with exclusively deep venous drainage are independent risk factors for subsequent hemorrhage in patients with cerebellar AVMs. Previous rupture may increase the hemorrhagic risk during the first 5 years after diagnosis but may not significantly increase the risk in the following years.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"a49dbf962a5ebef1f454e72b9280dc6bb3146c35","venue_1":"World neurosurgery","year":"2015","title":"Morphological-Hemodynamic Characteristics of Intracranial Bifurcation Mirror Aneurysms.","authors":"Jixing Fan, Yang Wang, Jian Liu, Linkai Jing, Chao Wang, Chuanhui Li, Xinjian Yang, Ying Zhang","author_ids":"6289405, 1747927, 2106964, 4492749, 8205854, 7430926, 8314095, 1752812","abstract":"BACKGROUND\nMany morphological and hemodynamic parameters have been proposed as promising aneurysm rupture status discriminators. Besides, a clear dichotomy between sidewall and bifurcation aneurysms was reported. In this study, we strove to evaluate the contribution of many reported morphological and hemodynamic parameters to retrospective rupture status determination in bifurcation aneurysms independent of patients' characteristics.\n\n\nMETHODS\nComputational fluid dynamics were performed on 16 patients with bifurcation mirror aneurysms (MANs). Each pair was divided into ruptured and unruptured groups. The morphological and hemodynamic factors were analyzed and compared. Receiver operating characteristics (ROC) analysis was performed, and the area under the ROC curve (AUC) was calculated for all parameters to quantify the predictability of each index and identify the optimal threshold.\n\n\nRESULTS\nMorphological (size, aspect ratio, size ratio, and height-width ratio) and hemodynamic (time-averaged mean wall shear stress [WSSmean], low WSS area [LSA]) parameters reached statistical significance (P < 0.05). Aneurysm irregular shape, oscillatory shear index (OSI), flow stability, inflow concentration, and impingement zone did not achieve significantly statistical differences (P = 0.508, P = 0.319, P = 0.523, P = 0.227, and P = 1.000, respectively). After ROC analysis, only aspect ratio and LSA had excellent AUC values (0.840 and 0.824, respectively). Other key parameters, including size, size ratio, height-width ratio, and WSSmean, had AUC values between 0.7 and 0.8 (0.730, 0.715, 0.703, 0.727, respectively).\n\n\nCONCLUSIONS\nHigher aspect ratio and LSA are good indicators for bifurcation aneurysm rupture. MANs with different rupture status might be a useful disease model in which many factors are balanced to investigate possible features linked to aneurysm rupture.","cites":"1","conferencePercentile":"80.1980198"},{"venue":"World neurosurgery","id":"7f3584ab0a0c12b141da0d08a9d74a23e1487c28","venue_1":"World neurosurgery","year":"2014","title":"Supplementing the neurosurgical virtuoso: evolution of automation from mythology to operating room adjunct.","authors":"Frank J Attenello, Brian Lee, Cheng Yu, Charles Y Liu, Michael L J Apuzzo","author_ids":"5279679, 5839065, 2251665, 1892085, 4256051","abstract":"A central concept of scientific advancement in the medical and surgical fields is the incorporation of successful emerging ideas and technologies throughout the scope of human endeavors. The field of automation and robotics is a pivotal representation of this concept. Arising in the mythology of Homer, the concept of automation and robotics grew exponentially over the millennia to provide the substrate for a paradigm shift in the current and future practice of neurosurgery. We trace the growth of this field from the seminal concepts of Homer and Aristotle to early incorporation into neurosurgical practice. Resulting changes provide drastic and welcome advances in areas of visualization, haptics, acoustics, dexterity, tremor reduction, motion scaling, and surgical precision.","cites":"1","conferencePercentile":"63.57142857"},{"venue":"World neurosurgery","id":"aaa7f156c1c6044dfa06f5c972f22534cb065a01","venue_1":"World neurosurgery","year":"2016","title":"Ocular Movement Nerve Palsy After Mild Head Trauma.","authors":"Guichen Li, Xiaobo Zhu, Xiuhong Gu, Yang Sun, Xianfeng Gao, Yang Zhang, Kun Hou","author_ids":"5475157, 8362387, 7787780, 3136781, 8245867, 4449904, 2156639","abstract":"BACKGROUND\nOcular movement nerve (cranial nerve III, IV and VI) palsy (OMNP) is rarely encountered after mild head trauma. As a result of the inconsistent definition of this specific entity in published studies, it is difficult to offer an accurate management strategy and prognosis assessment to affected patients.\n\n\nMETHODS\nA retrospective review of the medical records of the patients at the First Hospital of Jilin University combined with a systematic review of published studies was conducted.\n\n\nRESULTS\nThirty-one patients (17 females, 55%), including 6 cases in our institution, were identified in this systematic review. Cranial nerves III, IV, and VI were involved in 54.8%, 3.2%, and 45.2% of the patients, respectively. Although all the patients in our case series experienced complete resolution, only 54.6% experienced complete resolution in a time course of 10 days to 13 months. Additional intracranial findings other than traumatic brain injury on imaging modalities that might predispose to OMNP after mild head trauma were identified in 25.8% of the patients.\n\n\nCONCLUSIONS\nOMNP after mild head trauma is a rare entity in neurosurgical practice. In patients with no positive intracranial finding, observation and follow-up are the mainstay of management. If any underlying intracranial lesions are identified, the management should be focused on the underlying lesions. From the data available, mild trauma does not mean mild injury or favorable recovery in OMNP after mild head trauma.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"7993bdc619af2e44b8cfdb4e35cc1614fa66454c","venue_1":"World neurosurgery","year":"2016","title":"Microvascular Decompression for Trigeminal Neuralgia: The Role of Mechanical Allodynia.","authors":"Chenlong Liao, Wenchuan Zhang, Min Yang, Wenxiang Zhong, Pengfei Liu, Shiting Li","author_ids":"4779973, 8030680, 5184537, 6763979, 1713891, 8086934","abstract":"OBJECTIVE\nThis study was conducted to determine whether mechanical allodynia (MA) acts as a predictor of outcome after microvascular decompression (MVD) for trigeminal neuralgia (TN) and to discuss the potential pathologic mechanisms involved.\n\n\nMETHODS\nA series of 246 patients who underwent MVD for TN were involved in the study. The classifications were based on the characteristic of pain (shocklike or constant), and the presence of MA was defined from the chart review, retrospectively. Surgical outcomes are defined as excellent, good, or poor. Immediate and long-term outcomes were compared to provide the information on recurrence and delayed relief. The relationship among the groups was investigated, and the strength was determined.\n\n\nRESULTS\nThe presence of MA and the type of TN pain are significant predictors of surgical outcome (P < 0.05). MA was proved to be an independent predictor of surgical outcome and a significant predictor of existence of neurovascular compression (P < 0.05) and lower rate of recurrence (P < 0.05). No statistically significant predictors of delayed relief were detected in this study.\n\n\nCONCLUSIONS\nThe presence of MA is a reliable predictor of immediate and long-term outcome after MVD for TN. Compared with the patients without MA, the incidence rate of intraoperative neurovascular compression was higher in MA-positive patients, who were more likely to achieve a better outcome and lower rate of recurrence after MVD for TN. Application of the information in this study will be helpful in patient selection of MVD for TN.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"8fd890e87b4a5aa8d2cdaa1775f0a10f57a3c829","venue_1":"World neurosurgery","year":"2016","title":"Simultaneous or Early Sequential Rupture of Multiple Intracranial Aneurysms: A Rare and Insufficiently Understood Entity.","authors":"Kun Hou, Jinchuan Zhao, Yang Zhang, Xiaobo Zhu, Yan Zhao, Guichen Li","author_ids":"2156639, 5525506, 4449904, 8362387, 3404111, 5475157","abstract":"BACKGROUND\nSimultaneous or early sequential rupture of multiple intracranial aneurysms (MIAs) is encountered rarely, with no more than 10 cases having been reported. As a result of its rarity, there are a lot of questions concerning this entity need to be answered.\n\n\nCASE DESCRIPTION\nA 67-year-old woman was admitted to the First Hospital of Jilin University (Eastern Division) from a local hospital after a sudden onset of severe headache, nausea, and vomiting. Head computed tomography (CT) at the local hospital revealed diffuse subarachnoid hemorrhage (SAH) that was concentrated predominately in the suprasellar cistern and interhemispheric fissure. During her transfer to our hospital, she experienced another episode of sudden headache. CT on admission to our hospital revealed that the SAH was increased with 2 isolated hematomas both in the interhemispheric fissure and the left paramedian frontal lobe. Further CT angiography and intraoperative findings were in favor of early sequential rupture of 2 intracranial aneurysms. To further elucidate the characteristics, mechanism, management, and prognosis of this specific entity, we conducted a comprehensive review of the literature.\n\n\nCONCLUSIONS\nThe mechanism of simultaneous or early sequential rupture of MIAs is still obscure. Transient elevation of blood pressure might play a role in the process, and preventing the sudden elevation of blood pressure might be beneficial for patients with aneurysmal SAH and MIAs. The management of simultaneously or early sequentially ruptured aneurysms is more complex for its difficulty in responsible aneurysm determination, urgency in treatment, toughness in intraoperative manipulation and poorness in prognosis.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"4798046a8fa96b5cab1cbd5ddc75e9588939c909","venue_1":"World neurosurgery","year":"2014","title":"Recapitulating flesh with silicon and steel: advancements in upper extremity robotic prosthetics.","authors":"Brian Lee, Frank J Attenello, Charles Y Liu, Michael P McLoughlin, Michael L J Apuzzo","author_ids":"5839065, 5279679, 1892085, 2239870, 4256051","abstract":"With the loss of function of an upper extremity because of stroke or spinal cord injury or a physical loss from amputation, an individual's life is forever changed, and activities that were once routine become a magnitude more difficult. Much research and effort have been put into developing advanced robotic prostheses to restore upper extremity function. For patients with upper extremity amputations, previously crude prostheses have evolved to become exceptionally functional. Because the upper extremities can perform a wide variety of activities, several types of upper extremity prostheses are available ranging from passive cosmetic limbs to externally powered robotic limbs. In addition, new developments in brain-machine interface are poised to revolutionize how patients can control these advanced prostheses using their thoughts alone. For patients with spinal cord injury or stroke, functional electrical stimulation promises to provide the most sophisticated prosthetic limbs possible by reanimating paralyzed arms of these patients. Advances in technology and robotics continue to help patients recover vital function. This article examines the latest neurorestorative technologies for patients who have either undergone amputation or lost the use of their upper extremities secondary to stroke or spinal cord injury.","cites":"0","conferencePercentile":"24"},{"venue":"World neurosurgery","id":"9ae1a59faf21c675fb2b1b324034de29a0250d6e","venue_1":"World neurosurgery","year":"2015","title":"Onyx Embolization of a Ruptured Rotundum Foreman Artery Aneurysm in a Patient with Moyamoya Disease: A Case Report.","authors":"Peng Liu, Xianli Lv, Youxiang Li, Ming Lv","author_ids":"1712572, 6896647, 4829241, 8396346","abstract":"BACKGROUND\nHemorrhage caused by the rupture of a rotundum foreman artery pseudoaneurysm in Moyamoya disease (MMD) is rarely reported.\n\n\nCASE DESCRIPTION\nWe report a case of 46-year-old man with MMD presenting with left temporal lobe hemorrhage. Cerebral angiogram showed a pseudoaneurysm located on the rotundum branch of the left internal maxillary artery, which anastomosed with a pial vessel. Using onyx 18, we successfully embolized the pseudoaneurysm. The patient was discharged neurologically intact.\n\n\nCONCLUSION\nGiven the difficulties and risks of surgery, onyx embolization of rotundum foreman artery aneurysm accompanied with MMD is feasible and effective.","cites":"0","conferencePercentile":"34.52970297"},{"venue":"World neurosurgery","id":"4f1efb9c80f38ae55b823bd2e8d3a30e6d9c0f45","venue_1":"World neurosurgery","year":"2013","title":"A primer on brain-machine interfaces, concepts, and technology: a key element in the future of functional neurorestoration.","authors":"Brian Lee, Charles Y Liu, Michael L J Apuzzo","author_ids":"5839065, 1892085, 4256051","abstract":"Conventionally, the practice of neurosurgery has been characterized by the removal of pathology, congenital or acquired. The emerging complement to the removal of pathology is surgery for the specific purpose of restoration of function. Advents in neuroscience, technology, and the understanding of neural circuitry are creating opportunities to intervene in disease processes in a reparative manner, thereby advancing toward the long-sought-after concept of neurorestoration. Approaching the issue of neurorestoration from a biomedical engineering perspective is the rapidly growing arena of implantable devices. Implantable devices are becoming more common in medicine and are making significant advancements to improve a patient's functional outcome. Devices such as deep brain stimulators, vagus nerve stimulators, and spinal cord stimulators are now becoming more commonplace in neurosurgery as we utilize our understanding of the nervous system to interpret neural activity and restore function. One of the most exciting prospects in neurosurgery is the technologically driven field of brain-machine interface, also known as brain-computer interface, or neuroprosthetics. The successful development of this technology will have far-reaching implications for patients suffering from a great number of diseases, including but not limited to spinal cord injury, paralysis, stroke, or loss of limb. This article provides an overview of the issues related to neurorestoration using implantable devices with a specific focus on brain-machine interface technology.","cites":"4","conferencePercentile":"91.60583942"},{"venue":"World neurosurgery","id":"30b8c6c4c9ede228447766d2997c5c6a316d27c1","venue_1":"World neurosurgery","year":"2010","title":"A clear map of the lower cranial nerves at the superior carotid triangle.","authors":"Daniel D Cavalcanti, Ulises Garcia-Gonzalez, Abhishek Agrawal, Paulo L M S Tavares, Robert F Spetzler, Mark C Preul","author_ids":"7980798, 3514363, 7389020, 2460582, 6135110, 4575108","abstract":"BACKGROUND\nThe lower cranial nerves must be identified to avoid iatrogenic injury during skull base and high cervical approaches. Prompt recognition of these structures using basic landmarks could reduce surgical time and morbidity.\n\n\nMETHODS\nThe anterior triangle of the neck was dissected in 30 cadaveric head sides. The most superficial segments of the glossopharyngeal, vagus and its superior laryngeal nerves, accessory, and hypoglossal nerves were exposed and designated into smaller anatomic triangles. The midpoint of each nerve segment inside the triangles was correlated to the angle of the mandible (AM), mastoid tip (MT), and bifurcation of the common carotid artery.\n\n\nRESULTS\nA triangle bounded by the styloglossus muscle, external carotid artery, and facial artery housed the glossopharyngeal nerve. This nerve segment was 0.06 ± 0.71 cm posterior to the AM and 2.50 ± 0.59 cm inferior to the MT. The vagus nerve ran inside the carotid sheath posterior to internal carotid artery and common carotid artery bifurcation in 48.3% of specimens. A triangle formed by the posterior belly of digastric muscle, sternocleidomastoid muscle, and internal jugular vein housed the accessory nerve, 1.90 ± 0.60 cm posterior to the AM and 2.30 ± 0.57 cm inferior to the MT. A triangle outlined by the posterior belly of digastric muscle, internal jugular vein, and common facial vein housed the hypoglossal nerve, which was 0.82 ± 0.84 cm posterior to the AM and 3.64 ± 0.70 cm inferior to the MT.\n\n\nCONCLUSIONS\nComprehensible landmarks can be defined to help expose the lower cranial nerves to avoid injury to this complex region.","cites":"1","conferencePercentile":"47.30538922"},{"venue":"World neurosurgery","id":"0dee22967bb945eb7ec69306656d023e244311c4","venue_1":"World neurosurgery","year":"2010","title":"Time course of plasma leptin concentrations after acute spontaneous basal ganglia hemorrhage.","authors":"Xiao-Qiao Dong, Man Huang, Yue-Yu Hu, Wen-Hua Yu, Zu-Yong Zhang","author_ids":"3711476, 2382939, 7741801, 7986031, 7969828","abstract":"BACKGROUND\nBrain cortex leptin messenger ribonucleic acid (mRNA) expression and serum leptin level are up-regulated in ischemic mouse brain, as well as in rat brain with traumatic brain injury. Elevated leptin plasma levels predict cerebral hemorrhagic stroke independently of traditional risk factors. The goal of this study was to investigate change in plasma leptin level after intracerebral hemorrhage (ICH) and to evaluate its relation with disease outcome.\n\n\nMETHODS\nEighty-six patients admitted within 6 hrs after ICH and 30 healthy controls were included. Plasma samples were obtained on admission and at days 1, 2, 3, 5, and 7 after ICH. Its concentration was measured by enzyme-linked immunosorbent assay (ELISA).\n\n\nRESULTS\nAfter ICH, plasma leptin level in patients increased during the 6-hour period immediately, peaked in 24 hours, decreased gradually thereafter, and was substantially higher than that in healthy controls during the 7-day period. Plasma leptin levels were highly associated with initial Glasgow coma scores, ICH volumes, presence of intraventricular hemorrhage, and survival rates (all P < 0.05). A multivariate analysis selected plasma leptin level related to plasma C-reactive protein level (standardized coefficient, 0.293; P = 0.003). A multivariate analysis showed baseline plasma leptin level as a good predictor for 1-week mortality (odds ratio, 1.228; 95% confidence interval, 1.070-1.409; P = 0.003). A receiver operating characteristic curve identified that a baseline plasma leptin level greater than 34.1 ng/mL predicted 1-week mortality of patients with 75.0% sensitivity and 85.2% specificity (P < 0.001). Area under curve of GCS score was statistically significantly larger than that of plasma leptin level (P = 0.035), but ICH volume's area under curve not (P = 0.078).\n\n\nCONCLUSIONS\nIncreased plasma leptin level is found after ICH and may contribute to inflammatory process of ICH, in association with a poor clinical outcome.","cites":"2","conferencePercentile":"68.56287425"},{"venue":"World neurosurgery","id":"22b21d34ee0a7b73024a1543ebd1bf299e113331","venue_1":"World neurosurgery","year":"2016","title":"Difference in Angiographic Characteristics Between Hemorrhagic And Nonhemorrhagic Hemispheres Associated with Hemorrhage Risk of Moyamoya Disease in Adults: A Self-Controlled Study.","authors":"Peng Liu, Ai-Hua Liu, Cong Han, Cheng Chen, Xian-Li Lv, De-Sheng Li, Hui-Jian Ge, Heng-Wei Jin, You-Xiang Li, Lian Duan","author_ids":"1712572, 2934673, 4155144, 1716895, 7829458, 7379079, 7139760, 7949687, 4829241, 1740786","abstract":"BACKGROUND\nHere, we compare the angiographic characteristics of hemorrhagic and nonhemorrhagic hemispheres within the same adult patient with moyamoya disease (MMD) and identify the possible risk factors for initial and recurrent hemorrhage during the long-term follow-up period.\n\n\nMETHODS\nWe retrospectively collected and analyzed the clinical and angiographic data of 145 consecutive adults with hemorrhagic MMD between 2004 and 2011. Separate angiographic characteristics of the hemorrhagic and nonhemorrhagic hemispheres were analyzed based on digital subtraction angiography. Multivariate logistic regression analysis was used to study the risk factors related to initial hemorrhage. In addition, clinical follow-up for at least 5 years was obtained in all the 145 patients. Cox regression analysis was used to determine the predictors for the subsequent recurrent hemorrhagic strokes.\n\n\nRESULTS\nWith regard to the 145 consecutive patients in our cohort, multivariate analysis indicated that the dilation grade of anterior choroidal artery (odds ratio [OR], 2.449; 95% confidence interval [CI], 1.617-3.862), the dilation grade of the posterior communicating artery (PComA) (OR, 1.491; 95% CI, 1.071-2.075), and the involvement of the posterior cerebral artery (OR, 4.623; 95% CI, 1.273-16.792) were significantly associated with initial hemorrhage. After a median follow-up of 6.33 ± 1.81 years, 20 of the 145 patients (13.8%) developed 22 recurrent episodes of hemorrhage. No significant correlation was found between rebleeding and the above significant factors associated with the initial hemorrhage.\n\n\nCONCLUSIONS\nCompared with the nonhemorrhagic hemispheres, hemorrhagic hemispheres are more prone to recurrent hemorrhage. Our case-control study showed the dilation of the anterior choroidal artery or posterior communicating artery, as well as the involvement of the posterior cerebral artery, is associated with the initial hemorrhage of MMD, but not for the episode of recurrent hemorrhage. Longer and more detailed clinical and angiographic follow-up are still needed to delineate the specific mechanism underlying the recurrent hemorrhage in hemorrhagic MMD.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"2e1899a5ffcce25c0d4eb3838562581bfd480e67","venue_1":"World neurosurgery","year":"2016","title":"Diagnosis and Treatment of Intracranial Aneurysms with 320-Detector Row Volumetric Computed Tomography Angiography.","authors":"Wenhua Chen, Wei Xing, Ya Peng, Zhongming He, Caoye Wang, Qi Wang","author_ids":"7307925, 8007621, 2506039, 4330355, 8206238, 4849112","abstract":"OBJECTIVES\nThe objective of the study was to determine the clinical utility of 320-detector row volume-computed tomographic angiography (VCTA) in the management of intracranial aneurysms.\n\n\nMETHODS\nBetween February 2011 and May 2015, 550 patients successfully underwent 320-detector row VCTA for suspected intracranial aneurysms. Three-dimensional (3D) digital subtraction angiography (DSA) was used as the ultimate reference standard, and the sensitivity, specificity, and accuracy of both nonsubtracted and subtracted VCTA in identifying aneurysms were analyzed.\n\n\nRESULTS\nNonsubtracted VCTA identified 417 aneurysms (2 false-positive readings, 12 false-negative readings). The diagnostic sensitivity, specificity, and accuracy of non-subtracted VCTA, on a per-aneurysm basis, were 97.2%, 99.0%, and 97.6%, respectively. Subtracted VCTA identified 426 aneurysms (2 false-positive readings, 3 false-negative readings). The sensitivity, specificity, and accuracy of subtracted VCTA, on a per-aneurysm basis, were 99.3%, 99.0%, and 99.2%, respectively. No differences in diagnostic accuracy were found between subtracted VCTA and 3D DSA. Nonsubtracted VCTA, however, was observed to be significantly less sensitive than 3D DSA and subtracted VCTA. Twenty-six aneurysm cases were referred for surgical treatment based on VCTA imaging. All aneurysms were deemed completely occluded during surgical clipping. On the basis of VCTA imaging, 299 aneurysms were found suitable for endovascular coiling, of which 293 aneurysms (98%) were treated successfully.\n\n\nCONCLUSIONS\nThe 320-detector row subtracted VCTA technique is an effective, first-line diagnostic imaging modality for surgical and endovascular treatment of aneurysms. The nonsubtracted VCTA was less accurate than the subtracted VCTA, especially for intracranial aneurysms adjoining bone tissue.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"94d8104fc3d9d78932419df5d649b942e999a556","venue_1":"World neurosurgery","year":"2014","title":"Surgical dissection of the internal carotid artery under flow control by proximal vessel clamping reduces embolic infarcts during carotid endarterectomy.","authors":"Kazumichi Yoshida, Yoshitaka Kurosaki, Takeshi Funaki, Takayuki Kikuchi, Akira Ishii, Jun C Takahashi, Yasushi Takagi, Sen Yamagata, Susumu Miyamoto","author_ids":"6883119, 5417503, 6424870, 2040460, 1727896, 8101642, 2668488, 6926735, 3309153","abstract":"OBJECTIVE\nTo evaluate the efficacy of flow control of the internal carotid artery (ICA) by the clamping of the common carotid artery, external carotid artery, and superior thyroid artery during surgical ICA dissection to reduce ischemic complications after carotid endarterectomy (CEA).\n\n\nMETHODS\nSixty-seven patients (59 men; age, 70.5 ± 6.2 years) who underwent CEA by the same surgeon were retrospectively studied. Both conventional CEA (n = 29) and flow-control CEA (n = 38) were performed with the patient under general anesthesia and with the use of somatosensory-evoked potential and near-infrared spectroscopy monitoring as a guide for selective shunting. The number of new postoperative infarcts was assessed with preoperative and postoperative diffusion-weighted images (DWIs) obtained within 3 days of surgery. In addition to surgical technique, the effects of the following factors on new infarcts also were examined: age, side of ICA stenosis, high-grade stenosis, symptoms, and application of shunting.\n\n\nRESULTS\nNew postoperative DWI lesions were observed in 7 of 67 patients (10.4%), and none of them was symptomatic. With respect to operative technique, the incidence rate of DWI spots was significantly lower in the flow-control group (2.6%) than in the conventional group (20.7%), odds ratio: 0.069; 95% confidence interval: 0.006-0.779; P = 0.031). On multiple logistic regression analysis, age, side of ICA stenosis, high-grade stenosis, symptoms, and the use of internal shunting did not have significant effects on new postoperative DWI lesions, whereas technique did have an effect.\n\n\nCONCLUSION\nThe proximal flow-control technique for CEA helps avoid embolic complications during surgical ICA dissection.","cites":"1","conferencePercentile":"63.57142857"},{"venue":"World neurosurgery","id":"125591fd5cdebf78f4eca4dbe268aae16e5b340f","venue_1":"World neurosurgery","year":"2016","title":"Fistula and Infratentorial Location, Characteristics That Contribute to Cerebral Arteriovenous Malformations, Lead to the Formation of Associated Aneurysms in Patients.","authors":"Ling-Feng Lai, Min Chen, Jia-Xiang Chen, Kuang Zheng, Xu-Ying He, Xi-Feng Li, Xin Zhang, Qiu-Jing Wang, Chuan-Zhi Duan","author_ids":"7885395, 1711628, 7557608, 5703941, 7792191, 7824457, 1682913, 7417923, 7906774","abstract":"OBJECTIVE\nBecause the formation of associated aneurysms (AAs) related to the characteristics of cerebral artriovenous malformations (cAVMs) is poorly recognized, the purpose of this study was to identify the responsible characteristics of cAVMs related to the formation of AAs and to identify patients with responsible characteristics related to the formation of AAs through the analysis of the outcomes of these patients after treatment.\n\n\nMETHODS\nThis study was performed to analyze the baseline characteristics of patients with cAVMs and AAs. The recurrent AA and residual size of cAVMs were used to evaluate the outcomes of patients after treatment. At the same time, the ROC curve was measured to gauge the relationship between the residual size of cAVMs and recurrent AAs in eligible patients.\n\n\nRESULTS\nFifty (15.0%) patients with cAVMs and AA were confirmed; these patients had twice the hazard of hemorrhage as patients with only isolated cAVMs. An infratentorial location (P < 0.001) and fistula (P = 0.002) were independent predictors of the formation of AAs. After a mean 22.7 months follow-up, 2 patients developed recurrent AAs, and the annual recurrence rate for patients with responsible characteristics was 17.6%, but for all patients was 7.2%. The ROC curve showed that patients, specifically patients with responsible characteristics, the residual size of the cAVM was closely related to recurrent AA (area = 0.89, 95% confidence interval 0.81-0.97, P = 0.023, cut-off value = 82.5%).\n\n\nCONCLUSIONS\nPatients with cAVMs and AA who harbor a fistula or an infratentorial location tend to form AAs. To prevent recurrent AAs and decrease the subsequent risk of hemorrhage, complete obliteration of cAVMs or retrograding over 80% size of cAVMs is recommended.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"a5c51e24a1640b4a6c8aef744e33ed72d4337ad2","venue_1":"World neurosurgery","year":"2015","title":"One-year Outcome of Bilateral Subthalamic Stimulation in Parkinson Disease: An Eastern Experience.","authors":"Shang-Ming Chiou, Yu-Chin Lin, Hsiang-Ming Huang","author_ids":"7859100, 7892701, 2035092","abstract":"BACKGROUND\nDeep brain stimulation (DBS) of the subthalamic nucleus (STN) is widely accepted as a treatment for advanced Parkinson disease (PD). However, published studies were conducted mainly in Western centers and recruited small numbers of patients. This study presents 1-year outcomes in Taiwanese patients with PD.\n\n\nMETHODS\nSixty-two consecutive patients underwent STN-DBS surgery during a 7-year period. Their median drug-off Hoehn and Yahr stage was 3 and mean illness history was 8 years. Clinical outcomes were evaluated by the change in drug-off/DBS-on Unified Parkinson Disease Rating Scale (UPDRS) scores relative to presurgical drug-off baseline and change in daily levodopa-equivalent dose (LED).\n\n\nRESULTS\nAfter 1 year of DBS therapy, patients showed significant improvements with a clinically high effect size in cardinal signs, particularly in tremor (63%). Posture instability was also improved, whereas speech dysfunction was hardly corrected. The LED need was significantly reduced, therefore preoperative drug-induced complications were prominently (51%) ameliorated after surgery and drug-induced dyskinesia was remarkably (63%) diminished. No serious adverse effects were encountered after surgery. Overall, motor functions declined by 15% within 1 year in drug-off state.\n\n\nCONCLUSIONS\nBilateral STN-DBS therapy provided effective and sustained benefits to Eastern patients with PD over a 1-year period.","cites":"0","conferencePercentile":"34.52970297"},{"venue":"World neurosurgery","id":"f353ccc3b15234a1a8175a134cb86ed943c8c1d0","venue_1":"World neurosurgery","year":"2016","title":"Time to Revive the Value of the Pseudocapsule in Endoscopic Endonasal Transsphenoidal Surgery for Growth Hormone Adenomas.","authors":"Tao Xie, Tengfei Liu, Xiaobiao Zhang, Lingli Chen, Rongkui Luo, Wei Sun, Fan Hu, Yong Yu, Ye Gu, Zhiqiang Lu","author_ids":"3263836, , 6565954, 4657425, 5549447, 1712625, 7253923, 3578922, 5781535, 2002863","abstract":"OBJECTIVE\nTo investigate the role of endoscopic endonasal transsphenoidal surgery and the pseudocapsule in the treatment of growth hormone adenomas.\n\n\nMETHODS\nThe study included 43 patients (age range, 21-64 years) with growth hormone adenomas treated with an endoscopic endonasal approach. We compared the tumor characteristics and surgical outcomes of cases with (group A, 21 cases, from November 2013 to January 2015) and without (group B, 22 cases, from October 2011 to October 2013) extra-pseudocapsule resection.\n\n\nRESULTS\nThe preoperative demographics, tumor characteristics, and surgical complications were not significantly different between groups A and B. Postoperative remission without adjuvant therapy was achieved in 18 of 21 cases (85.7%) in group A, which was significantly greater than that observed in group B (12 of 22 cases [54.4%]). In group A, the pseudocapsules were verified by endoscopy and histopathology. The pseudocapsule was removed en bloc with the whole adenoma in only 5 cases (23.8%). For the remaining 16 patients (76.2%), following extra-pseudocapsule dissection, incomplete pseudocapsule removals with intracapsule procedures were achieved.\n\n\nCONCLUSIONS\nThe combination of extra-pseudocapsule resection and endoscopy led to a high rate of gross total tumor resection and endocrinologicl remission in acromegalic patients compared with the group with intracapsular resection. Extra-pseudocapsule resection resulted in no additional postoperative complications.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"8112b688dd1eb254591660fa39f1788011a8652a","venue_1":"World neurosurgery","year":"2010","title":"Comparison of extraoral and transoral approaches to the craniocervical junction: morphometric and quantitative analysis.","authors":"Abhishek Agrawal, Daniel D Cavalcanti, Ulises Garcia-Gonzalez, Steve W Chang, Neil R Crawford, Volker K H Sonntag, Robert F Spetzler, Mark C Preul","author_ids":"7389020, 7980798, 3514363, 7434766, 6612364, 4070681, 6135110, 4575108","abstract":"BACKGROUND\nThe transoral (TO) approach to the craniocervical junction provides similar access to the periclival and subaxial spine compared with the extraoral anterolateral prevascular (EAP) approach, but the additional exposure gained by the EAP approach has not been quantified. This study quantitatively compared the two surgical exposures.\n\n\nMETHODS\nTen silicon-injected fixed cadaver heads were used for the TO approach and another 5 heads (10 sides) were dissected for the EAP approach. For the TO approach, mouth opening was standardized to 5.5 cm using a Spetzler-Sonntag retractor, and the soft palate was split 1.5 cm to access the periclival area. A frameless stereotactic device was used to calculate the lengths, angles, and areas of surgical exposure for different anatomic targets.\n\n\nRESULTS\nThe vertical working length on the dura progressively increased 61% (336 ± 26 mm to 539 ± 16 mm [mean ± standard deviation]; P < 0.001), and the vertical working angle increased 23% (98 ± 3 degrees to 121 ± 5 degrees; P < 0.0) using the TO versus the EAP approach. In the TO approach, the bilateral average horizontal working length on the C1 arch was less on the ipsilateral side than for the EAP approach (11 ± 1 mm vs. 17 ± 1 mm, 61%; P < 0.01). The mean periclival and subaxial exposures were 546 ± 72 mm(2) and 932 ± 70 mm(2) with the TO approach and 874 ± 75 mm(2) and 1644 ± 107 mm(2) with the EAP approach (mean increases 62% and 77%, respectively; both P < 0.001).\n\n\nCONCLUSIONS\nBoth the TO and EAP approaches improved surgical exposure, but the EAP approach provides more significant and consistent gains to the anterolateral periclival and subaxial areas.","cites":"0","conferencePercentile":"17.66467066"},{"venue":"World neurosurgery","id":"057476dd013b457df841a0861d2cd87b8b002532","venue_1":"World neurosurgery","year":"2013","title":"The incorporation of neuroendoscopy in neurosurgical training programs.","authors":"Abhishek Agrawal, Yoko Kato, Hirotoshi Sano, Tetsuo Kanno","author_ids":"7389020, 2300308, 4018128, 4755447","abstract":"Previously considered the domain of the otolaryngologists, the endoscopy is now a common part of the armamentarium of a neurosurgeon. Neuroendoscopy or endoscope-assisted microsurgery is now being used in almost all routine procedures performed in the neurosurgical operating room. Hands-on training has become essential to learn the basics of neuroendoscopy, even for neurosurgeons well accustomed to the use of microscopes. To decrease the slope of the learning curve of residents during their training and reduce complications of procedures, most neurosurgery training programs around the world have incorporated laboratory or dissection programs in their curricula. Preconference workshops held during annual meetings are also an excellent tool to aid in the transition of surgeons from being a resident under the umbrella of an attending neurosurgeon to being a neurosurgeon able to operate independently and with confidence. In this \"tech-savvy era,\" various cadaver or synthetic models are readily available for endoscopy training in a virtually simulated environment. In accord with the results of a surveys conducted by individual groups and societies, the authors firmly believe that incorporation of endoscopy in the neurosurgical curriculum would add a new dimension to the existing protocol. There is an urgent need for dedicated endoscopy training programs similar to postresidency fellowships in addition to translational research and establishment of dedicated societies to formulate guidelines for such research and monitor its progress.","cites":"0","conferencePercentile":"19.52554745"},{"venue":"World neurosurgery","id":"48c87e4e93595bf96bf97fa93eda1901314e095a","venue_1":"World neurosurgery","year":"2015","title":"Comprehensive Overview of Contemporary Management Strategies for Cerebral Aneurysms.","authors":"Amitoz Manhas, Shahid M Nimjee, Abhishek Agrawal, Jonathan Zhang, Orlando Diaz, Ali R Zomorodi, Tony Smith, Ciarán J Powers, Eric Sauvageau, Richard P Klucznik, Andrew Ferrell, Kiarash Golshani, Philip E Stieg, Gavin W Britz","author_ids":"6624600, 4767361, 7389020, 2012958, 1868335, 6780374, 7811283, 8345380, 7166948, 3200381, 4247570, 6343496, 8468276, 2966942","abstract":"Aneurysmal subarachnoid hemorrhage (SAH) remains an important health issue in the United States. Despite recent improvements in the diagnosis and treatment of cerebral aneurysms, the mortality rate following aneurysm rupture. In those patients who survive, up to 50% are left severely disabled. The goal of preventing the hemorrhage or re-hemorrhage can only be achieved by successfully excluding the aneurysm from the circulation. This article is a comprehensive review by contemporary vascular neurosurgeons and interventional neuroradiolgists on the modern management of cerebral aneurysms.","cites":"2","conferencePercentile":"94.8019802"},{"venue":"World neurosurgery","id":"75e1f421939c1bfa48f0735624bfcf45b4bdfcd5","venue_1":"World neurosurgery","year":"2013","title":"The role of simulation in neurosurgical education: a survey of 99 United States neurosurgery program directors.","authors":"Aruna Ganju, Salah G Aoun, Marc R Daou, Tarek Y El Ahmadieh, Alice Chang, Lucy Wang, H Hunt Batjer, Bernard R Bendok","author_ids":"5975152, 7557692, 8260656, 4971172, 8328776, 2130622, 6317457, 5345632","abstract":"OBJECTIVE\nWith the reduction of resident work hours and the increasing focus on patient safety, it has become evident that simulation has a growing role to play in surgical education. We surveyed the program directors of 99 U.S. Neurosurgery programs in an effort to better understand how simulation can be implemented in Neurosurgery and to gain insight into key issues that are currently being discussed amongst Neurosurgical educators.\n\n\nMETHODS\nA 14-item questionnaire was emailed to 99 Neurosurgery residency program directors. Questions assessed the clinical impact of simulation, the role of simulation in academia, the investments required in time and money, and the model best suited for simulation.\n\n\nRESULTS\nThe survey response rate was 53.5%. Seventy-two percent of respondents believed that simulation would improve patient outcome, 74% that it could supplement conventional training, but only 25% that it could replace it. The majority strongly believed that it could help preparing complex cases and could be of use to attending faculty. Forty-five percent thought that residents should achieve pre-defined levels of proficiency on simulators before working on patients. Seventy-four percent of respondents declared they would make simulator practice mandatory if available, and the majority was willing to invest daily time and considerable funds on simulators. Cadavers were the least preferred models to use compared to virtual simulation and noncadaveric physical models.\n\n\nCONCLUSIONS\nSimulation should be integrated in Neurosurgery training curricula. The validation of available tools is the next step that will enable the training, acquisition, and testing of neurosurgical skills.","cites":"4","conferencePercentile":"91.60583942"},{"venue":"World neurosurgery","id":"8ee93d9ee8917887ed1969af904f64fc57b1e289","venue_1":"World neurosurgery","year":"2016","title":"Radial Artery Bypass for Intractable Vertebrobasilar Insufficiency: Case Series and Review of the Literature.","authors":"Gavin W Britz, Vijay Agarwal, Frank Mihlon, Dinesh Ramanathan, Abhishek Agrawal, Shahid M Nimjee, David Kaylie","author_ids":"2966942, 7515143, 4614739, 2442468, 7389020, 4767361, 4768041","abstract":"BACKGROUND\nVertebrobasilar insufficiency resulting from embolism, atherosclerosis, or arterial dissection has long been a challenge for successful management and outcomes. The main treatment options include medical therapy, angioplasty and stenting, and surgical revascularization. Unlike cardiac or peripheral vascular revascularization, large randomized trials with cerebrorevascularization have not revealed favorable outcomes. In patients who have failed maximal medical therapy, and having persistent debilitating symptomology, cerebral revascularization may still be a viable option.\n\n\nMETHODS\nWe report 3 patients who presented with symptoms of vertebrobasilar ischemia. The diagnosis was verified by computerized tomographic arteriography and digital subtraction angiography.\n\n\nRESULTS\nThese patients subsequently underwent revascularization with a radial artery graft. We also present a comprehensive review of the literature of treatment for vertebrobasilar insufficiency.\n\n\nCONCLUSIONS\nSurgical revascularization should be considered in the posterior circulation in the rare subset of patients with VBI, who remain symptomatic despite having a protracted course of maximal medical therapy with large- and medium-sized vessel occlusions and poor collateral circulation.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"66d606757b620e7b8520c7b9ed1c2733eb5f4970","venue_1":"World neurosurgery","year":"2016","title":"Risk Factors for Surgical Site Infection After Spinal Surgery: A Meta-Analysis.","authors":"Qi Fei, Jinjun Li, JiSheng Lin, Dong Li, BingQiang Wang, Hai Meng, Qi Wang, Nan Su, Yong Yang","author_ids":"5739723, 8550174, 8188245, 1678390, 2248768, 2210202, 4849112, 1949216, 7135232","abstract":"BACKGROUND\nSurgical-site infection (SSI) after spinal surgery is the most common complication, which results in greater morbidity, mortality, and health care costs. Identifying risk factors of SSI is an important point for preventive strategies to reduce the incidence of SSI. The aim of this meta-analysis is to investigate the most important risk factors for SSI after spinal surgery.\n\n\nMETHODS\nPubMed, Embase, and Web of Science were systematically searched to identify cohort or case-control studies that investigated the risk factors for SSI following spinal surgery. A fixed-effects or random-effects model was used to pool the estimates, depending on the heterogeneity among the included studies. Heterogeneity between the studies was assessed by I(2) and Cochran's Q test.\n\n\nRESULTS\nTwelve studies with a total of 13,476 patients met the inclusion criteria were included in this meta-analysis. Of them, 1 was a nested case-control studies, 7 were case-control studies, and 4 were cohort studies. The most important predictors of SSI were diabetes (risk ratio [RR] = 2.22, 95% confidence interval [95% CI] 1.38-3.60; P = 0.001), prolonged operative times (>3 hours) (RR = 2.16, 95% CI 1.12-4.19; P = 0.009), body mass index more than 35 (RR = 2.36, 95% CI 1.47-3.80; P = 0.000), and posterior approach (RR = 1.22, 95% CI 1.05-1.41; P = 0.009).\n\n\nCONCLUSION\nDiabetes, prolonged operative times (>3 hours), body mass index more than 35, posterior approach, and number of intervertebral levels (≥7) are associated with an increased risk of SSI after spinal surgery. Almost all these risk factors are in line with the known risk factors for SSI in patients who underwent spinal surgery.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"d6f64cd58265c1a2b2fe6eaedd8e8e7e0e23c4e2","venue_1":"World neurosurgery","year":"2013","title":"Predictive factors for craniopharyngioma recurrence: a systematic review and illustrative case report of a rapid recurrence.","authors":"Ruth Prieto, José M Pascual, Issa Subhi-Issa, Manuela Jorquera, Miguel Yus, Roberto Martínez","author_ids":"5823572, 6370734, 7231229, 3967829, 2509457, 7224064","abstract":"BACKGROUND\nRecurrence of craniopharyngiomas (CPs) represents a frequent and unpredictable incident. Rapid tumor recurrence within a few months after surgery has been rarely reported. Nondefinitive predictive factors for rapid CP recurrence have been identified to date. We have systematically analyzed the tumor factors that presumably influence in CP recurrence.\n\n\nMETHODS\nWe present the histologic and immunohistochemical analysis of an infundibulo-tuberal CP that was operated twice within a 3-month interval due to rapid recurrence. We investigated the differential characteristics of the subgroup of CPs that recurred in large surgical series published in the literature, along with cases reporting rapid tumor recurrence after surgery.\n\n\nRESULTS\nSpecimens of our patient showed an adamantinomatous CP with whorl-like arrays and thick peritumoral gliosis. Ki-67 labeling index in primary and recurrent samples was 20% and 15%, respectively. p53 labeling index was 18% and 15%, respectively. The thorough analysis of literature showed that presence of tumor remnants and missing radiotherapy treatment after subtotal removal are strong predictors of tumor recurrence. Third ventricle involvement, large tumor size, tight adherence to surrounding structures, and presence of whorl-like arrays might also foster recurrence. High Ki-67 levels, p53 expression, and an intense reactive gliosis might point to rapid tumor growth.\n\n\nCONCLUSIONS\nReliable tumor markers that predict CP recurrence are still lacking. The CP features presumably related to a higher risk of its recurrence are thought to be a larger tumor size, a tight adherence to the hypothalamus, the presence of whorl-like arrays, and high Ki-67 and p53 levels.","cites":"2","conferencePercentile":"74.81751825"},{"venue":"World neurosurgery","id":"fd61433a7e72aa3df0ee0bb8131d6a723005d14b","venue_1":"World neurosurgery","year":"2016","title":"Influence of Hormone Receptor Status on Spinal Metastatic Lesions in Patients with Breast Cancer.","authors":"Jenny Lin, Leanne Goldstein, Amanda Nesbit, Mike Y Chen","author_ids":"8188317, 3465414, 7722117, 2335746","abstract":"OBJECTIVE\nBony metastasis predominantly affects the spinal column and has been commonly associated in patients with breast cancer. There are two types of lesions that can occur with spine cancer-osteolytic or osteoblastic. Some patients may have mixed lesions, which include lytic and blastic in one vertebra or lytic and blastic in different vertebrae. Previous studies have shown that patients with breast cancer have an increased likelihood for development of lytic spinal metastases.\n\n\nMETHODS\nA retrospective chart review was conducted to more closely examine the association between hormone receptor status and spinal lesion type. A total of 195 patients were initially identified through the City of Hope Cancer Registry. Of the 195, only 153 patients had hormone receptor marker status available. Associations between spinal lesion and hormone receptor status were evaluated using χ(2) tests with alpha = 0.05 significance level. In a secondary analysis, the Oncomine Platform was used, which integrated The Cancer Genome Atlas (TCGA) datasets, to identify osteogenic genes that may be relevant to invasive breast cancers.\n\n\nRESULTS\nContrary to previous studies, our findings revealed progesterone receptor positive (PR+) patients were significantly more likely to present with blastic than lytic or mixed lesions. Furthermore, using TCGA analysis, COL1A1 and COL1A2 were found to be up-regulated, which could provide a molecular explanation for the development of blastic metastases.\n\n\nCONCLUSIONS\nBy integrating clinical and bioinformatic techniques, this study provides a novel discovery of the relationship between blastic and PR + breast cancers, which may have important implications for diagnostic strategies concerning vertebral metastases.","cites":"1","conferencePercentile":"97.49647391"},{"venue":"World neurosurgery","id":"ec5f7b17d9483ed22ea7cf6c49f0b025561d25ec","venue_1":"World neurosurgery","year":"2011","title":"The laterocavernous sinus system: venous inflows, venous outflows, and clinical significance.","authors":"Xianli Lv, Chuhan Jiang, Youxiang Li, Lian Liu, Jie Liu, Zhongxue Wu","author_ids":"6896647, 6622728, 4829241, 4158867, 1699746, 4556577","abstract":"BACKGROUND\nThe laterocavernous sinus system is best defined as the entire territory served by the laterocavernous and the superior petrosal sinuses (SPS).\n\n\nMETHODS\nThe laterocavernous sinus is a small but important venous structure located between the two dural layers forming the lateral wall of the cavernous sinus and has been described as one of the principal drainage pathways of the deep and superficial middle cerebral veins.\n\n\nRESULTS\nSeveral disease processes in the head involve the laterocavernous sinus. To evaluate and treat these diseases it is necessary for neuroradiologists not only to know selective angiography and embolization techniques, but also the territory of the laterocavernous sinus and venous watershed between the deep and superficial venous systems.\n\n\nCONCLUSIONS\nIn the present report the normal angiographic anatomy of the laterocavernous sinus system, its relationship with the deep and superficial venous systems, and its importance in clinical situations are outlined.","cites":"0","conferencePercentile":"15.50632911"},{"venue":"World neurosurgery","id":"5a83d87b9d35be115a181e14f14b64865f8ab64f","venue_1":"World neurosurgery","year":"2016","title":"Coevolution of Peer-Reviewed Literature and Clinical Practice in High-Grade Glioma Resection.","authors":"Brian R Hirshman, Laurie A Jones, Kate T Carroll, Jessica A Tang, James A Proudfoot, Kathleen M Carley, Bob S Carter, Clark C Chen","author_ids":"1994883, 7661452, 3590489, 5710362, 5524039, 1702030, 2848602, 7863622","abstract":"BACKGROUND\nThe paradigm of evidence-based medicine dictates that clinical practice should reflect the shifting landscape of the peer-reviewed literature. Here, we examined the extent to which this premise is fulfilled as it pertains to the surgical resection of high-grade gliomas (HGGs).\n\n\nOBJECTIVE\nWe assessed trends in published literature regarding HGG survival after resection in conjunction with trends in clinical practice patterns of HGG resection.\n\n\nMETHODS\nWe performed a comprehensive PubMed search to identify articles that examined whether gross total resection (GTR) improves HGG survival. Temporal trends in the literature were compared with rates of GTR in the Surveillance Epidemiology and End Results (SEER) database, the Veterans Health Administration database, and published data series from academic neuro-oncology centers.\n\n\nRESULTS\nBefore 2000, the ratio of articles supporting survival benefit of GTR relative to those not supporting it ranged from approximately 1:5 to 1:1. Since 2000, this ratio has steadily increased such that by the post-2013 period, 32 of the 33 published articles (>30:1) supported the survival benefit of GTR. Although the frequency of GTR increased during the 2000-2004 period in the SEER and Veterans Health Administration database, no further increase in the frequency of GTR was observed thereafter. In contrast, resection rates in academic neuro-oncology centers continued to increase subsequent to 2004.\n\n\nCONCLUSIONS\nOur results indicate that clinical practice patterns mirror publication patterns for HGG resection, suggesting that neurosurgical oncology is a field in which clinical practice is informed by the peer-reviewed literature.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"947a343d28e8c91461997adea488880a8521ea58","venue_1":"World neurosurgery","year":"2016","title":"Analysis of Multiple Intracranial Aneurysms with Different Outcomes in the Same Patient After Endovascular Treatment.","authors":"Linkai Jing, Jian Liu, Ying Zhang, Nikhil Paliwal, Hui Meng, Shengzhang Wang, Xinjian Yang","author_ids":"4492749, 2106964, 1752812, 3508349, 4229819, 3173918, 8314095","abstract":"BACKGROUND\nAneurysm recanalization after coiling, with or without stent assistance, is a major issue in the endovascular management of intracranial aneurysms. Multiple intracranial aneurysms with different outcomes after endovascular treatment may represent a useful disease model in which patient-specific risk factors can be balanced to investigate possible features linked to aneurysm recanalization. In the present study, we evaluated the impact of aneurysm-specific, treatment-related, and hemodynamics-related factors on multiple aneurysms and to explore the reason why one aneurysm recanalized and the other did not.\n\n\nMETHODS\nBetween 2010 and 2015, 763 multiple intracranial aneurysms in 326 patients were diagnosed by digital subtraction angiography. We retrospectively collected and analyzed 13 pairs of multiple aneurysms with different outcomes (recanalized or stable) in the same patient. Patient-specific models were constructed and analyzed by a computational fluid dynamics method. The virtual stent deployment method was used, and the coils were simulated by a porous medium model. Factors were evaluated for significance with respect to recanalization.\n\n\nRESULTS\nAneurysm size (P = 0.021), neck width (P = 0.027), ruptured aneurysms (P = 0.002), reduction ratio of averaged velocity (P = 0.008), and wall shear stress (P = 0.024) were significantly associated with aneurysm recanalization. By contrast, the aneurysm location, all of treatment-related factors (packing density, duration of follow-up, stent use, initial angiographic result) and the reduction ratio of averaged pressure were not significantly associated (P > 0.05).\n\n\nCONCLUSIONS\nSmall aneurysm size and neck width, unruptured aneurysm, and perianeurysmal hemodynamics with marked reduction may be important factors associated with the midterm durability of aneurysm embolization.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"bb22deb96b6146400cd9d36259082f83edaf897e","venue_1":"World neurosurgery","year":"2016","title":"Endovascular Treatment of 48 Early Branch Aneurysms of the Middle Cerebral Artery.","authors":"Chuan-Chuan Wang, Wan-Ling Wen, Zheng-Zhe Feng, Yi Xu, Bo Hong, Jian-Min Liu, Qing-Hai Huang","author_ids":"8206445, 7738620, 7357620, 1734114, 3876717, 8190496, 8304988","abstract":"OBJECTIVE\nTo evaluate the feasibility of endovascular treatment (EVT) for early branch aneurysms (EBAs) of the middle cerebral artery (MCA).\n\n\nMETHODS\nWe reviewed 211 MCA aneurysms that received EVT between January 2012 and December 2014. The EBAs were identified according to their special patterns on cerebral angiography. The angiographic features, clinical outcomes, and angiographic results were investigated.\n\n\nRESULTS\nForty-eight EBAs (22.7%) in 47 patients were identified among the MCA aneurysms. The treatments were successful in all EBAs, including coiling in 23 aneurysms, balloon-assisted coiling in 4, and stent-assisted coiling in 21. Immediate angiograms showed complete occlusion in 15 aneurysms, residual neck in 18, and residual aneurysm in 15. A procedure-related complication occurred in 1 patient (2.1%) who experienced rebleeding during treatment, and no neurologic function was insulted. Thirty-nine patients underwent angiographic follow-up (mean, 8.2 months), which showed 36 aneurysms were not aggravated, 3 had minor recanalization, and none showed major recanalization. The clinical follow-up (mean, 22.8 months) of all patients demonstrated no neurologic deterioration or rebleeding; however, 1 patient died of unexplained cerebral hemorrhage.\n\n\nCONCLUSIONS\nPreliminary experience demonstrates that EVT for EBAs is feasible and safe. Direct comparison of clipping and coiling is warranted.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"d42a8a8ab9784976299da3e450be05a45996bd83","venue_1":"World neurosurgery","year":"2016","title":"Orbitocranial Low-Velocity Penetrating Injury: A Personal Experience, Case Series, Review of the literature, and Proposed Management Plan.","authors":"Juma M Mzimbiri, Jian Li, Mdaish A Bajawi, Song Lan, Fenghua Chen, Jinfang Liu","author_ids":"8012712, 1701502, 8292565, 2705325, 7243363, 3570311","abstract":"BACKGROUND\nOrbitocranial penetrating injuries (OPI) are an unfamiliar subset of head injury and are particularly rare in clinical practice. They are usually the result of falls or motor vehicle collisions and occur more commonly in children, who are prone to trauma while playing games improperly.\n\n\nMETHODS\nWe present a retrospective review of 5 cases of OPI treated in the Neurotrauma Department at Xiangya Hospital of Central South University in the last 5 years. Also, we performed comprehensive literature searches using Web of Science and the terms \"orbitocranial injury,\" \"penetrating ocular trauma,\" \"penetrating orbital trauma,\" and \"transorbital chopstick penetrating injury\" to search for presentation, mechanism of injury, and management of transorbital penetrating injury.\n\n\nRESULTS\nIn 2 patients, there was right internal carotid artery occlusion while in other 2 patients, the penetrating objects reached the brainstem through the cavernous sinus, resulting in orbital apex syndrome. All patients underwent a thorough physical examination followed by diagnostic imaging. The cases were successfully managed surgically by removing the foreign bodies through their trajectories.\n\n\nCONCLUSIONS\nComputed tomography, magnetic resonance imaging, and computed tomography angiography are key imaging modalities that are frequently used to determine the course of the foreign object and the extent of brain tissue injury as well as to rule out vascular injury in these types of cases. Early surgical exploration by a multidisciplinary team approach is essential to attain good recovery and a favorable outcome.","cites":"1","conferencePercentile":"97.49647391"},{"venue":"World neurosurgery","id":"54d3511865d39a89403afe8f0e7ad0ece18c311d","venue_1":"World neurosurgery","year":"2010","title":"Transverse-sigmoid sinus dural arteriovenous fistulae.","authors":"Xianli Lv, Chuhan Jiang, Youxiang Li, Lian Liu, Jie Liu, Zhongxue Wu","author_ids":"6896647, 6622728, 4829241, 4158867, 1699746, 4556577","abstract":"Transverse-sigmoid sinus dural arteriovenous fistulae are abnormal arteriovenous communications within the dural wall of the transverse-sigmoid sinuses. They present with a variety of clinical features, ranging from benign bruits to intracranial hemorrhage and neurologic deficits. The presentation and natural history of these fistulae are largely determined by the pattern of venous drainage. Knowledge of natural history and careful study of the angioarchitecture by angiography is therefore mandatory for correct management of these lesions. In this review, anatomy and pathology, principles of management, and the various factors that influence treatment decisions are discussed, with a focus on endovascular therapy. Indications for endovascular treatment, therapeutic goals, approaches, and techniques are reviewed. The role of surgical treatment is also briefly discussed.","cites":"4","conferencePercentile":"88.32335329"},{"venue":"World neurosurgery","id":"0a63f4ea7406d1999b1175e3da764a06a6f9f38f","venue_1":"World neurosurgery","year":"2016","title":"Recanalization, Regrowth, and Delayed Rupture of a Previously Coiled Unruptured Anterior Communicating Artery Aneurysm: A Longitudinal Hemodynamic Analysis.","authors":"Jian Liu, Linkai Jing, Chao Wang, Ying Zhang, Xinjian Yang","author_ids":"2106964, 4492749, 8205854, 1752812, 8314095","abstract":"BACKGROUND\nDelayed rupture of a previously coiled unruptured aneurysm is extremely rare, and no hemodynamic analysis of such aneurysms has been reported during the postprocedural course.\n\n\nCASE DESCRIPTION\nWe present a case of an initially successfully embolized, unruptured anterior communicating artery aneurysm that subsequently underwent recanalization, regrowth, and delayed rupture 35 months after embolization. We used computational fluid dynamics to determine the hemodynamics at different stages during longitudinal follow-up and to evaluate wall shear stress (WSS) and flow velocity at peak systole. We found that high-flow impingement was associated with recanalization, that regrowth as bleb formation was induced by high WSS and flow velocity, and that low WSS was a risk factor for aneurysm rupture.\n\n\nCONCLUSIONS\nHeterogeneous hemodynamic characteristics were involved in the outcomes of intracranial aneurysm after endovascular treatment. High-flow impingement and WSS were associated with recanalization and regrowth, whereas low WSS was associated with aneurysm rupture.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"33709c69c5e48e170552743f8c79d2101ea05d5b","venue_1":"World neurosurgery","year":"2016","title":"Hemodynamic Effect of Flow Diverter and Coils in Treatment of Large and Giant Intracranial Aneurysms.","authors":"Linkai Jing, Jingru Zhong, Jian Liu, Xinjian Yang, Nikhil Paliwal, Hui Meng, Shengzhang Wang, Ying Zhang","author_ids":"4492749, 6927380, 2106964, 8314095, 3508349, 4229819, 3173918, 1752812","abstract":"BACKGROUND\nThis study aimed to investigate the hemodynamic changes induced by a flow diverter (FD) and coils in the treatment of internal carotid artery aneurysms, as well as to evaluate the effect of this treatment by using angiographic follow-up data.\n\n\nMETHODS\nSix large and giant aneurysms were treated by the Tubridge FD and loose packing coils between June 2013 and May 2015. Patient-specific models were constructed and analyzed using a computational fluid dynamics (CFD) method. The virtual FD deployment method was used to implant the Tubridge stent into a 3-dimensional digital subtraction angiographic image of the aneurysms, and the coils were simulated by a porous medium model.\n\n\nRESULTS\nTubridge FD alone can significantly reduce the intra-aneurysmal flow velocity (0.17 ± 0.05 m/s-0.11 ± 0.06 m/s, P < 0.001) and wall shear stress (WSS, 1.39 ± 0.29 Pa-0.77 ± 0.34 Pa, P = 0.001) and increase the low wall shear area (LSA, 6.38% ± 1.49%-34.60% ± 28.90%, P = 0.047). Coils, as a supplementary measure, further reduced the velocity (0.11 ± 0.06 m/s-0.08 ± 0.05 m/s, P = 0.03) and WSS (0.77 ± 0.34 Pa-0.47 ± 0.35 Pa, P = 0.04) and increased the LSA (34.60% ± 28.90%-63.33% ± 34.82%, P = 0.044). Aneurysm with sustained strong inflow after treatment (case 3, 25% reduction in velocity, 12% reduction in WSS, and 16% increment in LSA) showed partial patency, whereas others with a weaker inflow jet (mean 56% reduction in velocity, 74% reduction in WSS, and 1081% increment in LSA) showed complete occlusion at follow-up.\n\n\nCONCLUSIONS\nOn the basis of using the CFD method, adjunctive coiling with the Tubridge FD placement may significantly reduce intra-aneurysmal flow velocity and WSS, promoting thrombosis formation and occlusion of aneurysms.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"bbc1d4a98c2eeeeaca700fcee21446c7bcc542a8","venue_1":"World neurosurgery","year":"2015","title":"Patient Age, Hemorrhage Patterns, and Outcomes of Arteriovenous Malformation.","authors":"Xianli Lv, Jie Liu, Xiulan Hu, Youxiang Li","author_ids":"6896647, 1699746, 7796782, 4829241","abstract":"BACKGROUND\nThe angioarchitecture and presentation of arteriovenous malformations (AVMs) associated with AVM hemorrhage may vary with patient age. Our aim was to determine the influence of patient age at diagnosis on hemorrhage patterns and outcomes.\n\n\nMETHODS\nA consecutive case series of 267 cases of ruptured AVMs was retrospectively analyzed. Hemorrhage patterns (intracerebral hemorrhage, subarachnoid hemorrhage, and intraventricular hemorrhage) were confirmed based on computed tomography imaging at initial diagnosis. Clinical outcomes were classified with a modified Rankin Score. These cases were analyzed with respect to age at diagnosis, hemorrhage patterns, Spetzler-Martin grades, and their clinical outcomes.\n\n\nRESULTS\nDuring a mean 22.2 months follow-up time (range, 7 hours to 10 years), 212 cases (79.4%) were favorable (modified Rankin Score ≤2) and 55 cases (21.6%) were unfavorable (modified Rankin Score ≥3). The mean age was higher in patients with an unfavorable outcome at follow-up. In univariate analyses, different age groups were significantly associated with bleeding patterns (P = 0.022). Unfavorable outcome was associated with intracerebral hemorrhage (odds ratio, 0.330; 95% confidence interval, 0.142-0.768; P = 0.008) and evacuation of hematoma (odds ratio, 0.195; 95% confidence interval, 0.044-0.867; P = 0.025), whereas intraventricular hemorrhage, subarachnoid hemorrhage, and intraventricular drainage were significantly associated with a favorable outcome. Different age groups were not significantly associated with bleeding patterns, sex, and the location of the AVM, and Spetzler-Martin grades did not show a significant association with the severity of outcomes.\n\n\nCONCLUSIONS\nDifferent age groups were significantly associated with bleeding patterns. Higher patient age, intracerebral hemorrhage, and evacuation of hematoma seem to be associated with an unfavorable outcome after AVM rupture.","cites":"0","conferencePercentile":"34.52970297"},{"venue":"World neurosurgery","id":"19bd8254832d276c0ff5f28a2559089021196cf3","venue_1":"World neurosurgery","year":"2016","title":"Magnetic Resonance Imaging Follow-Up of Large or Giant Vertebrobasilar Dissecting Aneurysms After Total Embolization on Angiography.","authors":"Yisen Zhang, Yanmin Wang, Binbin Sui, Youxiang Li, Shiqing Mu, Ying Zhang, Zhongxue Wu, Xinjian Yang","author_ids":"7549144, 7709249, 6097441, 4829241, 4571644, 1752812, 4556577, 8314095","abstract":"OBJECTIVE\nTo evaluate the outcomes of large or giant vertebrobasilar dissecting aneurysms (VBDAs) after endovascular total embolization by follow-up 3T magnetic resonance imaging (MRI).\n\n\nMETHODS\nBetween November 2011 and July 2015, 4 patients had unruptured large or giant VBDAs that were treated with endovascular techniques with total embolization of VBDAs confirmed on follow-up angiography, but the patients had persistent or worsened symptoms. Preoperative and postoperative 3T high-resolution MRI was performed to evaluate arterial wall evolution.\n\n\nRESULTS\nFollow-up angiographic results were satisfactory in all 4 patients; however, symptoms in cases 1, 2, and 4 worsened, and symptoms in case 3 did not improve. Postoperative high-resolution MRI in case 1 showed a new intramural hematoma, and postoperative high-resolution MRI of cases 2, 3, and 4 showed persistent intramural hemorrhagic signals. Follow-up MRI showed increased aneurysm size in cases 1, 2, and 4 but no size change in case 3.\n\n\nCONCLUSIONS\nThe efficacy of conventional endovascular treatment (e.g., internal trapping with coils, stent-assisted coiling, and stent placement without coils) for large or giant VBDAs is uncertain. Follow-up angiography alone does not adequately predict the outcome. High-resolution MRI is a worthwhile adjunct to follow these lesions.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"45f68625965da0c5246a6ab27ccf16d533508898","venue_1":"World neurosurgery","year":"2015","title":"A Single-Center Experience with the NeuroPace RNS System: A Review of Techniques and Potential Problems.","authors":"Brian Lee, Muhammad N Zubair, Yvette D Marquez, David M Lee, Laura A Kalayjian, Christianne N Heck, Charles Y Liu","author_ids":"5839065, 8609124, 5949348, 2225868, 5754532, 3703973, 1892085","abstract":"INTRODUCTION\nThe clinical results for the RNS System (NeuroPace, Mountain View, California, USA) closed-loop responsive neurostimulator for the treatment of medically intractable partial-onset seizures have been encouraging. The University of Southern California (USC) Neurorestoration Center and the Keck Hospital of USC have become the world's first institutions to implant an RNS System post U.S. Food and Drug Administration (FDA) approval. As one of the study centers, we review our experience with our group of patients who have been implanted with the RNS System.\n\n\nMETHODS\nA total of 40 surgeries by a single surgeon were performed on 10 patients (7 male and 3 female) with an average age of 39.2 years (24-66 years) and were followed for an average of 45 months (30-54 months). The average age at seizure onset was 14 years (birth-37 years) with an average of 4.7 (3-12) failed antiepileptic drugs. We reviewed the patients' charts for complications from the surgeries including infections requiring surgical intervention, hematomas, hardware failures, and death.\n\n\nRESULTS\nOf the 40 surgeries, there were 10 initial implantations of the neurostimulator and leads, 24 neurostimulator replacements for expected end of neurostimulator service, 2 incision and drainage procedures (I & Ds) for soft tissue infection followed by 1 explantation and 1 reimplantation (same patient), and 2 revisions because of one lead that was damaged at the exit point between the skull and a titanium mesh and the second lead that was damaged at an acute bend over the skull (same patient). Eight of the patients had no complications and underwent an average of 2.7 neurostimulator replacements over 7 consecutive years to date. Each patient underwent routine postoperative computed tomography imaging of the brain, and none had any intracranial hematomas or misplaced leads requiring revision surgery. Finally, there were no deaths in our patient population.\n\n\nCONCLUSIONS\nOur experience with the NeuroPace RNS System over an average follow-up of 45 months suggests that the surgery and device are safe when placed by an experienced surgeon. Although there were no clinically significant hematomas or patient deaths, we did have 1 patient each with infection and lead damage at the point of exit from the skull. We compare the results of this study with other neuromodulation procedures for epilepsy to evaluate the safety and complications associated with the RNS System. Our initial experience suggests that the RNS System can be readily incorporated into an active epilepsy surgical center.","cites":"1","conferencePercentile":"80.1980198"},{"venue":"World neurosurgery","id":"0c02785825f024d50c5c16300a5a8234402c01d8","venue_1":"World neurosurgery","year":"2016","title":"Parametric Digital Subtraction Angiography Imaging for the Objective Grading of Collateral Flow in Acute Middle Cerebral Artery Occlusion.","authors":"Wan-ling Wen, Yi-bin Fang, Peng-fei Yang, Yong-wei Zhang, Yi-na Wu, Hui Shen, Jia-jia Ge, Yi Xu, Bo Hong, Qing-hai Huang, Jian-min Liu","author_ids":"7738417, 8589955, 8020439, 4823460, 7861272, 1730001, 8509203, 1734114, 3876717, 8304988, 8190870","abstract":"PURPOSE\nTo report the feasibility of parametric color-coded digital subtraction angiography (DSA) in complementing the traditional, subjective way of leptomeningeal collateral assessment in acute middle cerebral artery (MCA) occlusions.\n\n\nMETHODS\nThirty-three consecutive patients with acute MCA occlusion who received endovascular treatment were recruited for investigation. Eighteen of 33 consecutive patients were included. The target downstream territory (TDT) of MCA and reference point at terminal internal carotid artery of each patient was contoured by 5 raters independently on the basis of anteroposterior 2-dimensional DSA. Two parameters of relative maximum density of TDT (rDensitymax) and peak time interval (ΔPT) between reference and TDT were extracted by the use of parametric DSA analysis software. Interrater reliability was tested with intraclass correlation coefficients. Parameters with sufficient interrater reliability entered validity evaluation. Then, the correlation test with the American Society of Interventional and Therapeutic Neuroradiology collateral grading system and efficacy in predicting favorable clinical outcome was evaluated.\n\n\nRESULTS\nThe intraclass correlation coefficient of rDensitymax and ΔPT were 0.983, 95% confidence interval 0.968-0.993 and 0.831, 95% confidence interval 0.705-0.923, respectively. The parameter rDensitymax showed a strong correlation with the American Society of Interventional and Therapeutic Neuroradiology collateral grading system score (r of Spearman correlation test = 0.869, P < 0.001) and mRS at 3 months (partial correlation coefficient = 0.616, P = 0.009), whereas ΔPT_average did not. A cut-off point of 0.224 in rDensitymax predicted a favorable clinical outcome with high sensitivity and specificity.\n\n\nCONCLUSIONS\nThe relative maximum contrast density of MCA territory on 2-dimensional DSA measured by parametric imaging technique appears to be a simple and reliable metric for the assessment of leptomeningeal collaterals in cases of acute MCA occlusion.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"b76f359a10cb62d3181848d5d5a2fbf3f8436dc5","venue_1":"World neurosurgery","year":"2011","title":"Intramedullary abscess of the cervical spinal cord in an otherwise healthy man.","authors":"Brian Hood, Stacey Quintero Wolfe, Rikin A Trivedi, Chetan Rajadhyaksha, Barth Green","author_ids":"8562962, 5919648, 3035581, 7469495, 6671562","abstract":"BACKGROUND\nAn intramedullary spinal cord abscess is a rare, albeit widely publicized entity. Classically, patients have an acute onset of symptoms with fevers and leukocytosis supporting the diagnosis. We present a case of intramedullary spinal cord without classic history or imaging characteristics in which the diagnosis was made with diffusion weighted magnetic resonance imaging (MRI).\n\n\nCASE DESCRIPTION\nA 57-year-old physician presented with severe neck and shoulder pain, which progressed over several days to right-sided hemiparesis with dysesthesias. There was no history of fevers, rigors, or illness. A contrast enhanced MRI of the cervical spine revealed an intramedullary lesion centered around C6-T1 that showed peripheral enhancement with gadolinium and edema extending rostrally and caudally. He was then transferred to our institution where the novel application of diffusion weighted MRI of the spinal cord was performed, suggesting an abscess. He then underwent focal laminectomies and biopsy of this lesion with drainage of the necrotic cavity. Intraoperative Gram stain revealed gram-positive cocci, and cultures were sent to the laboratory. After draining the purulent material and completing a course of tailored antibiotics, the patient showed improvement of his neurologic deficit.\n\n\nCONCLUSIONS\nThe use of diffusion weighted imaging in the spine is a novel application of technology that provided an accurate preoperative diagnosis and allowed us to tailor our surgical approach and provide a rapid focal decompression.","cites":"1","conferencePercentile":"42.40506329"},{"venue":"World neurosurgery","id":"bbc55bf4cd5fe8225d2cb85fd5bf74374ec6d7c3","venue_1":"World neurosurgery","year":"2016","title":"Extensive Therapies for Extraneural Metastases from Glioblastoma, as Confirmed with the OncoScan Assay.","authors":"Ming Xu, Ying Wang, Jian Xu, Yu Yao, Wei-Xing Yu, Ping Zhong","author_ids":"4669392, 7707566, 1766389, 1770435, 7986219, 3011517","abstract":"BACKGROUND\nThe diagnosis of extraneural metastasis from glioblastoma is usually based on the histopathology and immunohistochemical staining of a tumor specimen. Information regarding the molecular features of glioblastoma and optimal treatment strategies for extraneural metastasis is limited.\n\n\nCASE DESCRIPTION\nA 58-year-old woman with a glioblastoma located in the left temporal lobe underwent resection followed by radiotherapy plus concomitant and adjuvant temozolomide. Ipsilateral cervical lymph node tumors were treated 29 months later with supraomohyoid neck dissection and temozolomide. The diagnosis of lymph node metastases from glioblastoma was confirmed with an OncoScan assay and pathologic analysis. The brain and lymph node tumors had identical genotypes: C228T-mutated TERT promoter, wild-type IDH1, wild-type IDH2, wild-type TP53, EGFR amplification, and unmethylated MGMT promoter. Subsequently, multiple bone metastases were detected and treated with CyberKnife radiosurgery. Widespread extraneural metastases were detected 49 months after the initial diagnosis, and the patient underwent chemotherapy with cisplatin and semustine. There was no evidence of intracranial relapse until death, which occurred 5 months after chemotherapy.\n\n\nCONCLUSIONS\nSimilar to carcinomas, glioblastomas can spread via the lymphatic route. Extensive therapies for extraneural metastases from glioblastoma can alleviate discomfort and prolong survival, especially in patients without intracranial relapse.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"97230ef385ce4f70b5754ebc1dc6548bbcbebfd1","venue_1":"World neurosurgery","year":"2016","title":"Treatment of Pediatric Traumatic Intracranial Pseudoaneurysm Using Endovascular Covered Stent: Three Case Reports.","authors":"Peng Liu, Ming Yang, Mingjun Cai, Jie Qin, Li Pan","author_ids":"1712572, 5015133, 2788626, 7889960, 5331055","abstract":"BACKGROUND\nPediatric traumatic intracranial pseudoaneurysm (TIPA) is a relatively rare clinical entity resulting from blunt, penetrating, or iatrogenic head trauma. The diagnosis, management, and prognosis of patients with pediatric TIPA is not well understood. Surgical craniotomy for TIPA is a high-risk operation. Advancements in minimally invasive technology have allowed for endovascular reconstruction of TIPA.\n\n\nCASE DESCRIPTION\nWe present our experience with use of endovascular covered stents for treatment of 3 pediatric patients with TIPA. The clinical and radiologic characteristics are presented. No procedure-related complications or deaths occurred during follow-up.\n\n\nCONCLUSIONS\nIn this study, the use of the Willis covered stent was associated with favorable prognoses in 3 patients with TIPA. No major complications were encountered during follow-up. The Willis covered stent appears to be a viable therapeutic modality in these patients. A definitive prognosis assessment will necessitate prospective clinical trials with longer duration of follow-up.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"7af4842a763f59d48af9c546cfa2235020c9500a","venue_1":"World neurosurgery","year":"2012","title":"Quantum computing: a prime modality in neurosurgery's future.","authors":"Brian Lee, Charles Y Liu, Michael L J Apuzzo","author_ids":"5839065, 1892085, 4256051","abstract":"OBJECTIVE\nWith each significant development in the field of neurosurgery, our dependence on computers, small and large, has continuously increased. From something as mundane as bipolar cautery to sophisticated intraoperative navigation with real-time magnetic resonance imaging-assisted surgical guidance, both technologies, however simple or complex, require computational processing power to function. The next frontier for neurosurgery involves developing a greater understanding of the brain and furthering our capabilities as surgeons to directly affect brain circuitry and function.\n\n\nMETHODS\nThis has come in the form of implantable devices that can electronically and nondestructively influence the cortex and nuclei with the purpose of restoring neuronal function and improving quality of life.\n\n\nRESULTS\nWe are now transitioning from devices that are turned on and left alone, such as vagus nerve stimulators and deep brain stimulators, to \"smart\" devices that can listen and react to the body as the situation may dictate.\n\n\nCONCLUSION\nThe development of quantum computers and their potential to be thousands, if not millions, of times faster than current \"classical\" computers, will significantly affect the neurosciences, especially the field of neurorehabilitation and neuromodulation. Quantum computers may advance our understanding of the neural code and, in turn, better develop and program implantable neural devices. When quantum computers reach the point where we can actually implant such devices in patients, the possibilities of what can be done to interface and restore neural function will be limitless.","cites":"0","conferencePercentile":"21.55172414"},{"venue":"World neurosurgery","id":"dfd7e5e6080e96429ab49a10c59d8cabb3818af7","venue_1":"World neurosurgery","year":"2016","title":"Surviving the Largest Atypical Parasagittal Meningioma in a 2-Year-Old Child: A Case Report and a Brief Review of the Literature.","authors":"Jian Li, Juma M Mzimbiri, Jie Zhao, Zhiping Zhang, Xinbin Liao, Jingping Liu","author_ids":"1701502, 8012712, 1701907, , 4101140, 8190540","abstract":"BACKGROUND\nMeningiomas arising in pediatric populations are rare neoplasms with distinct biological and clinical features. A rare case of a 2-year-old boy with extremely large intracranial parasagittal meningioma is presented. To our knowledge, this case is the largest parasagittal meningioma to be reported to date in the pediatric age group.\n\n\nCASE DESCRIPTION\nThe tumor size at its largest diameter was 14.2 cm. Two-stage craniotomy was performed within 3 weeks to resect the tumor totally by Simpson grade II while preserving the superior sagittal sinus. Three months after the second resection, the patient had a complication of subdural hematoma, which was managed by external drainage and urokinase.\n\n\nCONCLUSIONS\nThe patient's postoperative recovery was unremarkable, and the previously compressed brain rebounded. There was no evidence of recurrence after two years of follow-up. Every effort should be exerted to achieve radical resection of the tumor, which can result in a satisfactory prognosis and a low recurrence rate.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"93a9acbd1839e090e777529447eff2f043e58ca5","venue_1":"World neurosurgery","year":"2016","title":"Bifurcation Location Is Significantly Associated With Rupture of Small Intracranial Aneurysms (<5 mm).","authors":"Xin Feng, Wenjun Ji, Zenghui Qian, Peng Liu, Huibin Kang, Xiaolong Wen, Wenjuan Xu, Youxiang Li, Chuhan Jiang, Zhongxue Wu, Aihua Liu","author_ids":"7285471, 4459383, 5901955, 1712572, 6490015, 2979716, 4776242, 4829241, 6622728, 4556577, 7762690","abstract":"BACKGROUND\nand Purpose: Patients with small (< 5 mm) unruptured intracranial aneurysms (UIAs) are at risk of subarachnoid hemorrhage, but risk assessment of them remains controversy in daily clinical practice. We aimed to identify the risk factors of aneurysmal rupture in these patients.\n\n\nMETHODS\nWe retrospectively analyzed consecutive patients with small UIAs who were admitted to our center between February 2009 and December 2014. The enrolled patients were divided into the ruptured and unruptured groups. The risk factors for aneurysmal rupture were determined using multivariate logistic regression analysis.\n\n\nRESULTS\nA total of 548 patients with 618 small intracranial aneurysms (267 ruptured and 351 unruptured) were included. Univariate analysis revealed that rupture of small aneurysms was related to sex, age, smoking, hypertension, aspect ratio, size ratio, irregular shape, aneurysm width, height, and neck diameter, and location at bifurcation or posterior circulation. Multivariate logistic regression revealed that rupture was associated with bifurcation location (odds ratio [OR], 5.409, 95% confidence interval [CI], 3.656-8.001, P < 0.001), size ratio (OR, 3.092, 95% CI, 2.002-4.774, P < 0.001), location (OR, 2.624, 95% CI, 1.428-4.824, P = 0.002), hypertension (OR, 1.698, 95% CI, 1.1140-2.527, P = 0.009), and age at diagnosis of UIA (OR, 1.826, 95% CI, 1.225-2.723, P = 0.003).\n\n\nCONCLUSION\nThis study revealed that 70.4% of small ruptured intracranial aneurysms (<5 mm) located at parent artery bifurcations, and bifurcation location was a significant independent factor for the risk of rupture of small UIAs (<5 mm). Prophylactic treatment may should be recommended for small UIAs in this location.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"6bc1a62ecc57d89d5968f7704f483c1a8f288ea5","venue_1":"World neurosurgery","year":"2016","title":"Intracranial Aneurysms Associated with Moyamoya Disease in Children: Clinical Features and Long-Term Surgical Outcome.","authors":"Peng Liu, Xian-Li Lv, Ai-Hua Liu, Cheng Chen, Hui-Jian Ge, Heng-Wei Jin, Xin Feng, Ming Lv, You-Xiang Li, Lian Duan","author_ids":"1712572, 7829458, 2934673, 1716895, 7139760, 7949687, 7285471, 8396346, 4829241, 1740786","abstract":"BACKGROUND\nMoyamoya disease (MMD) in children was rarely associated with intracranial aneurysms. The purpose of this study was to report the clinical characteristics and long-term surgical outcomes of pediatric intracranial aneurysms accompanied with MMD.\n\n\nMETHODS\nBetween October 2002 and October 2013, our department treated 9 pediatric MMD patients (aged ≤17 years) with intracranial aneurysms. Clinical and angiographic features, treatment selection, as well as follow-up information were obtained and analyzed. The efficacy of vascularization and the changes of intracranial aneurysms were evaluated with digital subtraction angiography (DSA). We also collected 7 previously published reports to analyze the characteristics of this rare condition.\n\n\nRESULTS\nIn our series of 9 patients, 7 were male. The mean age was 11 ± 3.4 years (range 5-16). Seven patients presented with intracranial hemorrhage as the initial manifestation, while 2 patients suffered transient ischemic attacks. The most common aneurysm location was the posterior choroidal artery (4, 44.4%). One anterior choroidal artery aneurysm was completely embolized with Onyx (ev3, Irvine, California, USA). One posterior choroidal artery aneurysm failed due to inaccessibility to the parent artery. Bilateral encephalo-duro-arterio-synangiosis (EDAS) surgery was performed for all the children. During the follow-up period of 6.4 ± 2.2 years (range 3-11), spontaneous occlusion of aneurysm was observed in 4 children, including 1 child with middle cerebral artery aneurysm, 1 with lenticulostriate artery aneurysm, and 2 with posterior choroidal artery aneurysm. Good or fair vascularization was observed in all the 9 children with DSA follow-up. No patients suffered intracranial hemorrhage during the follow-up period.\n\n\nCONCLUSIONS\nThe long-term survey showed EDAS surgery could effectively increase the cerebral blood flow and maintain good outcomes in children, which may further result in the disappearance of the intracranial aneurysms and decrease the incidence of recurrent hemorrhage.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"41c8fcf699e254a19fa3ea1c83b0fd4938e33659","venue_1":"World neurosurgery","year":"2016","title":"Clinical features and prognostic factors of children and adolescent patients with clival chordomas.","authors":"Yixuan Zhai, Jiwei Bai, Hua Gao, Shuai Wang, Mingxuan Li, Songbai Gui, Chuzhong Li, Yazhuo Zhang","author_ids":"1777079, 3545376, 2510935, 3804894, 8392780, 6142309, 7431075, 2857143","abstract":"OBJECTIVE\nChordomas in children and adolescents are extremely uncommon, and minimal published information is available. Therefore, our aim was to research clinical features and prognostic factors associated with clival chordomas in younger patients.\n\n\nMETHODS\nThe study included 25 patients (10 males and 15 females). The average follow-up was 42.95 months (range: 2 to 108 months). Kaplan-Meier analysis was used to determine overall survival (OS) and progression-free survival (PFS). Pearson correlation was used to perform correlation analysis. Immunohistochemistry was used to detect the expression levels of Ki67, cytokeratin 8, platelet-derived growth factor receptor-β (PDGFR-β), and Brachyury.\n\n\nRESULTS\nThe average age (± SD) of patients was 14.44 (3.44) years. Total resection (TR) and non-total resection (NTR) was achieved in 5 cases and 20 cases, respectively. The average OS of patients with a Karnofsky performance score (KPS) ≥90 or those in the TR group was significantly longer compared with that of patients with KPS<90 group (p=0.041) or those in the NTR group (p=0.0497). Patients with lower Ki67 expression levels had longer OS (p=0.0207). The PFS of patients with lower CK8 expression levels was significantly longer compared with those with higher levels (p=0.008). The expression levels of PDGFR-β was significantly correlated with those of Brachyury (p=0.016).\n\n\nCONCLUSION\nIn children and adolescent patients with clival chordomas, higher pre-operative KPS, total resection, and lower levels of Ki67 and CK8 expression were favorable prognostic factors. PDGFR-β might play a role in tumorigenesis and epithelial-mesenchymal transition of clival chordomas.","cites":"0","conferencePercentile":"47.81382228"},{"venue":"World neurosurgery","id":"273bb8c9d899dbed0a396eb3b8372805dc3e4a57","venue_1":"World neurosurgery","year":"2016","title":"Prognostic value of a category based on electron microscopic features of clival chordomas.","authors":"Jiwei Bai, Yixuan Zhai, Shuai Wang, Hua Gao, Jiang Du, Junmei Wang, Mingxuan Li, Chuzhong Li, Songbai Gui, Cuiping Zhang, Yilin Sun, Yazhuo Zhang","author_ids":"3545376, 1777079, 3804894, 2510935, 2411359, 7898119, 8392780, 7431075, 6142309, 6577915, 8165934, 2857143","abstract":"OBJECTIVE\nSkull base chordomas are clinically malignant because of the difficulty of total removal and the high recurrence rate. Because the disease-free survival after surgery is currently unpredictable, there is a need for new parameters obtained from histological analyses of the resection specimen that allows a risk stratification of patients with chordoma.\n\n\nMETHODS\nElectron microscopic diagnoses were introduced into the clinical practice for the diagnosis of chordoma in our department in recent years. Clinical outcomes and electron microscopic features were retrospectively reviewed in the study. The electron micrograph shows that clival chordoma can be divided into cell-dense type (CDT) and matrix-rich type (MRT). Of all the patients with chordoma, complete data from 27 patients were taken. There were 12 patients and 15 patients in the CDT and MRT groups, respectively. The paraffin-embedded tissue samples were also stained with Ki-67 antibody. The prognostic values of electron microscopic classification were compared between the two groups.\n\n\nRESULTS\nThere were no statistical differences in the gender (P = 0.704) and age distribution (P = 0.243) between the two groups. There was also no statistical difference concerning the constitution of primitive tumors and recurrent tumors between the two groups (P = 0.706). The CDT group had a higher mortality rate than the MRT group (P = 0.037). The tumors in the CDT group were prone to recurrence and the need for reoperation within one year after surgery, which is statistically different from that in the MRT group (P ＜0.001). Chordoma tumors of 23 patients (85.2%) stained positive for Ki-67. CDT chordomas had a higher Ki-67 proliferation index than the MRT chordomas (P = 0.013).\n\n\nCONCLUSIONS\nThe present study demonstrates the utility of the ultrastructural features in the prognostic outcome of patients with chordoma. According to the ultrastructures of chordomas, they can be divided into CDT and MRT. CDT chordoma cells have a more aggressive proliferative ability. CDT is a poor prognostic factor in clival chordoma, which has a higher risk of recurrence and shorter survival.","cites":"0","conferencePercentile":"47.81382228"}]}