{"World_journal_of_emergency_surg":[{"venue":"World journal of emergency surgery : WJES","id":"630d42df8a0747277fe80bb5adce5aa2093166ea","venue_1":"World journal of emergency surgery : WJES","year":"2016","title":"Surgeon agreement at the time of handover, a prospective cohort study","authors":"Richard Hilsden, Bradley Moffat, Sarah Knowles, Neil Parry, Ken Leslie","author_ids":"5516990, 6821771, 5899737, 6191271, 5657498","abstract":"BACKGROUND\nAcute Care Surgical Teams are responsible for emergent surgical patients, and as such require regular handover and coordination between different surgeons. Despite the recent emergence of this model of care, minimal research has been conducted on the quality of patient handover and no research has attempted to determine the rate of clinical agreement or disagreement among surgeons participating in these teams.\n\n\nMETHODS\nA prospective cohort study was carried out with our acute care surgical service at a tertiary care teaching hospital from January 2 to March 31 2012. At the conclusion of the daily morning handover, receiving surgeons were asked to indicate, on provided handover sheets, whether they agreed with the proposed management plan for each patient that was discussed. The specific aspects of care over which they disagreed were also described, and disagreements were classified a priori as major or minor. The primary outcome was the rate of disagreement over the handed over management plan.\n\n\nRESULTS\nSix staff surgeons agreed to participate and a total of 417 unique patients were handed over during the study period. For the primary outcome, a total of 41 disagreements were recorded for a disagreement rate of 9.8 %. 15 of the 41 disagreements were classified as major, for a major disagreement rate of 3.6 %. Consultant to consultant disagreements were classified as major disagreements 63 % of the time, whereas consultant to resident disagreements were classified as major 31 % of the time (P = 0.217). On average, the age of patients for which a clinical disagreement occurred were older; 63 vs. 57 (P < 0.05).\n\n\nCONCLUSIONS\nDespite the frequency of handovers in clinical practice, little research has been conducted to determine the rate of disagreement over patient management among surgeons participating working in academic centers. This study demonstrated that the rate of clinical disagreement is low among surgeons working in an tertiary care teaching hospital.","cites":"0","conferencePercentile":"43.61702128"},{"venue":"World journal of emergency surgery : WJES","id":"7b9d0de30ab731bd656fd66784b9f5cfacc0ff0b","venue_1":"World journal of emergency surgery : WJES","year":"2016","title":"WSES Guidelines for the management of acute left sided colonic diverticulitis in the emergency setting","authors":"Massimo Sartelli, Fausto Catena, Luca Ansaloni, Federico Coccolini, Ewen A. Griffiths, Fikri M. Abu-Zidan, Salomone Di Saverio, Jan Ulrych, Yoram Kluger, Ofir Ben-Ishay, Frederick A. Moore, Rao R. Ivatury, Raul Coimbra, Andrew B. Peitzman, Ari Leppaniemi, Gustavo P. Fraga, Ronald V. Maier, Osvaldo Chiara, Jeffry Kashuk, Boris Sakakushev, Dieter G. Weber, Rifat Latifi, Walter Biffl, Miklosh Bala, Aleksandar Karamarkovic, Kenji Inaba, Carlos A. Ordonez, Andreas Hecker, Goran Augustin, Zaza Demetrashvili, Renato Bessa Melo, Sanjay Marwah, Sanoop K. Zachariah, Vishal G. Shelat, Michael McFarlane, Miran Rems, Carlos Augusto Gomes, Mario Paulo Faro, Gerson Alves Pereira Júnior, Ionut Negoi, Yunfeng Cui, Norio Sato, Andras Vereczkei, Giovanni Bellanova, Arianna Birindelli, Isidoro Di Carlo, Kenneth Y Kok, Mahir Gachabayov, Georgios Gkiokas, Konstantinos Bouliaris, Elif Çolak, Arda Isik, Daniel Rios-Cruz, Rodolfo Soto, Ernest E. Moore","author_ids":"5272384, 5814916, 2404570, 4801312, 4084876, 4260257, 4373794, 2826980, 5704477, 3545038, 2018335, 6619510, 3477107, 5925086, 6056771, 3523969, 8031325, 6348617, 4053123, 5765999, 1815606, 5471392, 7495491, 5741633, 6784115, 7275961, 2402461, 2288369, 5780399, 3912101, 3589176, 4506828, 6622880, 8533806, 3921276, 4827639, 3717601, 4544285, 7578517, 6627806, 2557604, 1731577, 6552290, 6940108, 4169111, 6520550, 4261101, 6863947, 3740095, 5663488, 4851554, 5524116, 5953663, 2204565, 3780695","abstract":"Acute left sided colonic diverticulitis is one of the most common clinical conditions encountered by surgeons in acute setting. A World Society of Emergency Surgery (WSES) Consensus Conference on acute diverticulitis was held during the 3rd World Congress of the WSES in Jerusalem, Israel, on July 7th, 2015. During this consensus conference the guidelines for the management of acute left sided colonic diverticulitis in the emergency setting were presented and discussed. This document represents the executive summary of the final guidelines approved by the consensus conference.","cites":"0","conferencePercentile":"43.61702128"},{"venue":"World journal of emergency surgery : WJES","id":"36e7cc18e448c955d7fe5abb9cd724f3012c6b4e","venue_1":"World journal of emergency surgery : WJES","year":"2016","title":"Antimicrobials: a global alliance for optimizing their rational use in intra-abdominal infections (AGORA)","authors":"Massimo Sartelli, Dieter G. Weber, Etienne Ruppé, Matteo Bassetti, Brian J. Wright, Luca Ansaloni, Fausto Catena, Federico Coccolini, Fikri M. Abu-Zidan, Raul Coimbra, Ernest E. Moore, Frederick A. Moore, Ronald V. Maier, Jan J. De Waele, Andrew W. Kirkpatrick, Ewen A. Griffiths, Christian Eckmann, Adrian J. Brink, John E. Mazuski, Addison K. May, Rob G. Sawyer, Dominik Mertz, Philippe Montravers, Anand Kumar, Jason A. Roberts, Jean-Louis Vincent, Richard R. Watkins, Warren Lowman, Brad Spellberg, Iain J. Abbott, Abdulrashid Kayode Adesunkanmi, Sara Al-Dahir, Majdi N. Al-Hasan, Ferdinando Agresta, Asma A. Althani, Shamshul Ansari, Rashid Ansumana, Goran Augustin, Miklosh Bala, Zsolt J. Balogh, Oussama Baraket, Aneel Bhangu, Marcelo A. Beltrán, Michael Bernhard, Walter L. Biffl, Marja A. Boermeester, Stephen M. Brecher, Jill R. Cherry-Bukowiec, Otmar R. Buyne, Miguel A. Cainzos, Kelly A. Cairns, Adrian Camacho-Ortiz, Sujith J. Chandy, Asri Che Jusoh, Alain Chichom-Mefire, Caroline Colijn, Francesco Corcione, Yunfeng Cui, Daniel Curcio, Samir Delibegovic, Zaza Demetrashvili, Belinda De Simone, Sameer Dhingra, José J. Diaz, Isidoro Di Carlo, Angel Dillip, Salomone Di Saverio, Michael P. Doyle, Gereltuya Dorj, Agron Dogjani, Hervé Dupont, Soumitra R. Eachempati, Mushira Abdulaziz Enani, Valery N. Egiev, Mutasim M. Elmangory, Paula Ferrada, Joseph R. Fitchett, Gustavo P. Fraga, Nathalie Guessennd, Helen Giamarellou, Wagih Ghnnam, George Gkiokas, Staphanie R. Goldberg, Carlos Augusto Gomes, Harumi Gomi, Manuel Guzmán-Blanco, Mainul Haque, Sonja Hansen, Andreas Hecker, Wolfgang R. Heizmann, Torsten Herzog, Adrien Montcho Hodonou, Suk-Kyung Hong, Reinhold Kafka-Ritsch, Lewis J. Kaplan, Garima Kapoor, Aleksandar Karamarkovic, Martin G. Kees, Jakub Kenig, Ronald Kiguba, Peter K. Kim, Yoram Kluger, Vladimir Khokha, Kaoru Koike, Kenneth Y. Y. Kok, Victory Kong, Matthew C. Knox, Kenji Inaba, Arda Isik, Katia Iskandar, Rao R. Ivatury, Maurizio Labbate, Francesco M. Labricciosa, Pierre-François Laterre, Rifat Latifi, Jae Gil Lee, Young Ran Lee, Marc Leone, Ari Leppaniemi, Yousheng Li, Stephen Y. Liang, Tonny Loho, Marc Maegele, Sydney Malama, Hany E. Marei, Ignacio Martin-Loeches, Sanjay Marwah, Amos Massele, Michael McFarlane, Renato Bessa Melo, Ionut Negoi, David P. Nicolau, Carl Erik Nord, Richard Ofori-Asenso, AbdelKarim H. Omari, Carlos A. Ordonez, Mouaqit Ouadii, Gerson Alves Pereira Júnior, Diego Piazza, Guntars Pupelis, Timothy Miles Rawson, Miran Rems, Sandro Rizoli, Claudio Rocha, Boris Sakakhushev, Miguel Sanchez-Garcia, Norio Sato, Helmut A. Segovia Lohse, Gabriele Sganga, Boonying Siribumrungwong, Vishal G. Shelat, Kjetil Soreide, Rodolfo Soto, Peep Talving, Jonathan V. Tilsed, Jean-Francois Timsit, Gabriel Trueba, Ngo Tat Trung, Jan Ulrych, Harry van Goor, Andras Vereczkei, Ravinder S. Vohra, Imtiaz Wani, Waldemar Uhl, Yonghong Xiao, Kuo-Ching Yuan, Sanoop K. Zachariah, Jean-Ralph Zahar, Tanya L. Zakrison, Antonio Corcione, Rita M. Melotti, Claudio Viscoli, Perluigi Viale","author_ids":"5272384, 1815606, 8193944, 4706674, 4951713, 2404570, 5814916, 4801312, 4260257, 3477107, 3780695, 2018335, 8031325, 7211718, 7428095, 4084876, 7222609, 5406018, 6294689, 2117900, 4136211, 3963959, 6542497, 2675832, 2871126, 5061970, 4767191, 3570630, 4146069, 6926787, 4184100, 6963701, 4111764, 5906215, 4404457, 5754013, 5635649, 5780399, 5741633, 8075565, 5812096, 5695063, 7977529, 3303983, 7495491, 4803285, 6833817, 4129416, 3553194, 4243118, 5097837, 5759324, 5173772, 5854624, 6343899, 3169156, 6223311, 2557604, 8355730, 4770127, 3912101, 8584044, 5797986, 4916939, 6520550, 5840493, 4373794, 8486762, 6783292, 3517392, 5066583, 6069890, 3601671, 6497556, 5785787, 6276506, 4870130, 3523969, 4380559, 5855567, 6074336, 4675108, 5482297, 3717601, 4678914, 5526026, 2477980, 7534149, 2288369, 5552445, 6327649, 6850047, 4843828, 5712998, 3741325, 4042034, 6784115, 4175256, 3088462, 5971827, 7245271, 5704477, 4722539, 3889778, 4261101, 5207810, 8023423, 7275961, 5524116, 6547743, 6619510, 3060880, 6294096, 4334233, 5471392, 2314644, 7856671, 5851810, 6056771, 2682809, 6021876, 4768634, 7293879, 5043540, 4746662, 4480637, 4506828, 6326116, 3921276, 3589176, 6627806, 3795866, 5164641, 4473348, 8167869, 2402461, 6569430, 7912885, 2898010, 5098008, 5695482, 4827639, 3812052, 3654694, 6918839, 7681369, 1731577, 8470302, 5392493, 3784512, 8533806, 4921522, 2204565, 3901243, 5198106, 3030928, 3683271, 7403944, 2826980, 4342374, 6552290, 7580177, 6527336, 2470200, 7986653, 3621692, 6622880, 4415761, 6808526, 5561050, 7915082, 7517950, 8317785","abstract":"Intra-abdominal infections (IAI) are an important cause of morbidity and are frequently associated with poor prognosis, particularly in high-risk patients. The cornerstones in the management of complicated IAIs are timely effective source control with appropriate antimicrobial therapy. Empiric antimicrobial therapy is important in the management of intra-abdominal infections and must be broad enough to cover all likely organisms because inappropriate initial antimicrobial therapy is associated with poor patient outcomes and the development of bacterial resistance. The overuse of antimicrobials is widely accepted as a major driver of some emerging infections (such as C. difficile), the selection of resistant pathogens in individual patients, and for the continued development of antimicrobial resistance globally. The growing emergence of multi-drug resistant organisms and the limited development of new agents available to counteract them have caused an impending crisis with alarming implications, especially with regards to Gram-negative bacteria. An international task force from 79 different countries has joined this project by sharing a document on the rational use of antimicrobials for patients with IAIs. The project has been termed AGORA (Antimicrobials: A Global Alliance for Optimizing their Rational Use in Intra-Abdominal Infections). The authors hope that AGORA, involving many of the world's leading experts, can actively raise awareness in health workers and can improve prescribing behavior in treating IAIs.","cites":"2","conferencePercentile":"98.93617021"},{"venue":"World journal of emergency surgery : WJES","id":"2e06ec760f67a8e1415a6dc583e8f00e7b119712","venue_1":"World journal of emergency surgery : WJES","year":"2015","title":"A proposal for a CT driven classification of left colon acute diverticulitis","authors":"Massimo Sartelli, Frederick A Moore, Luca Ansaloni, Salomone Di Saverio, Federico Coccolini, Ewen A Griffiths, Raul Coimbra, Ferdinando Agresta, Boris Sakakushev, Carlos A Ordoñez, Fikri M Abu-Zidan, Aleksandar Karamarkovic, Goran Augustin, David Costa Navarro, Jan Ulrych, Zaza Demetrashvili, Renato B Melo, Sanjay Marwah, Sanoop K Zachariah, Imtiaz Wani, Vishal G Shelat, Jae Il Kim, Michael McFarlane, Tadaja Pintar, Miran Rems, Miklosh Bala, Offir Ben-Ishay, Carlos Augusto Gomes, Mario Paulo Faro, Gerson Alves Pereira, Marco Catani, Gianluca Baiocchi, Roberto Bini, Gabriele Anania, Ionut Negoi, Zurabs Kecbaja, Abdelkarim H Omari, Yunfeng Cui, Jakub Kenig, Norio Sato, Andras Vereczkei, Matej Skrovina, Koray Das, Giovanni Bellanova, Isidoro Di Carlo, Helmut A Segovia Lohse, Victor Kong, Kenneth Y Kok, Damien Massalou, Dmitry Smirnov, Mahir Gachabayov, Georgios Gkiokas, Athanasios Marinis, Charalampos Spyropoulos, Ioannis Nikolopoulos, Konstantinos Bouliaris, Jaan Tepp, Varut Lohsiriwat, Elif Çolak, Arda Isik, Daniel Rios-Cruz, Rodolfo Soto, Ashraf Abbas, Cristian Tranà, Emanuele Caproli, Darija Soldatenkova, Francesco Corcione, Diego Piazza, Fausto Catena","author_ids":"5272384, 2018335, 2404570, 4373794, 4801312, 4084876, 3477107, 5906215, 5765999, 3593376, 4260257, 6784115, 5780399, 7892281, 2826980, 3912101, 3589176, 4506828, 6622880, 6527336, 8533806, 1819062, 3921276, 4461238, 4827639, 5741633, 4704825, 3717601, 4544285, 5584181, 2238485, 3511806, 8217844, 5642290, 6627806, 5704305, 4363431, 2557604, 3088462, 1731577, 6552290, 3828936, 5073927, 6940108, 6520550, 8470302, 5696631, 4261101, 3714256, 4099463, 6863947, 3740095, 4482458, 6467203, 3644944, 5663488, 6014098, 4479262, 4851554, 5524116, 5953663, 2204565, 6263473, 6255779, 4951047, 3910303, 6223311, 2898010, 5814916","abstract":"Computed tomography (CT) imaging is the most appropriate diagnostic tool to confirm suspected left colonic diverticulitis. However, the utility of CT imaging goes beyond accurate diagnosis of diverticulitis; the grade of severity on CT imaging may drive treatment planning of patients presenting with acute diverticulitis. The appropriate management of left colon acute diverticulitis remains still debated because of the vast spectrum of clinical presentations and different approaches to treatment proposed. The authors present a new simple classification system based on both CT scan results driving decisions making management of acute diverticulitis that may be universally accepted for day to day practice.","cites":"3","conferencePercentile":"96.72131148"},{"venue":"World journal of emergency surgery : WJES","id":"c029a5b604cd29acbe0afcdfa224d9eb618d147a","venue_1":"World journal of emergency surgery : WJES","year":"2013","title":"Penetrating arterial trauma to the limbs: outcome of a modified protocol","authors":"Antonio Krüger, Carla Florido, Amelie Braunisch, Eric Walther, Tugba Han Yilmaz, Dietrich Doll","author_ids":"1790548, 6842204, 6299405, 6254894, 5154745, 5258380","abstract":"BACKGROUND\nPenetrating arterial injuries to the limbs are common injuries in high volume trauma centers. Their overall surgical results reported in the literature are satisfactory - apart of those of the popliteal artery that still may lead to a significant incidence in amputations. With the present study we assessed our outcome with penetrating arterial injuries to the limb as to see if the direct involvement of vascular surgeons in the management of popliteal artery injuries leads to an improved (lowered) amputation rate. Results were benchmarked with our published results from previous years.\n\n\nMETHODS\nAll patients sustaining penetrating arterial injuries to the limbs admitted to the Chris Hani Baragwanath Academic Hospital during an 18- month period ending in September 2011 were included in this study. Axillary, brachial and femoral artery injuries were operated on by the trauma surgeons as in the past. All popliteal artery injuries were operated on by the vascular surgeons (new).\n\n\nRESULTS\nThere were a total of 113 patients with 116 injuries, as some patients had multiple vascular injuries: 10 axillary, 47 brachial, 34 femoral and 25 popliteal artery injuries. Outcome of axillary, brachial and femoral artery injury repair were excellent and not significantly different from our previous reported experience. Injury to the popliteal artery showed a diminished re-exploration rate from 34% down to 10% (p = 0,049) and a decrease of amputation rate from 16% to 11% which was statistically not significant (p = 0,8).\n\n\nCONCLUSION\nPenetrating arterial trauma to the axillary, brachial and femoral artery is followed by excellent results when operated by trauma surgeons. In the case of popliteal artery injury operated by the vascular surgeons, the results of this study do not show any statistically significant difference related to amputation rate from our previous reported studies when operated by trauma surgeons. Taking into consideration the diminished re-exploration rate and a tendency to a lower amputation rate, we feel that there is possible tendency of better outcome if operated by vascular surgeons. Multicenter studies with large number of enrolled patients will be required to prove the validity of this suggestion.","cites":"2","conferencePercentile":"68.42105263"}]}