{"World_journal_of_gastroenterolo":[{"venue":"World journal of gastroenterology","id":"5e2f5386b5503b58652adfbce97140e9d98c9f27","venue_1":"World journal of gastroenterology","year":"2016","title":"Diabetes mellitus may affect the long-term survival of hepatitis B virus-related hepatocellular carcinoma patients after liver transplantation","authors":"Qing Zhang, Yong-Lin Deng, Chang Liu, Li-Hong Huang, Lei Shang, Xin-Guo Chen, Le-Tian Wang, Jin-Zan Du, Ying Wang, Pei-Xiao Wang, Hui Zhang, Zhong-Yang Shen","author_ids":"1681771, 6561710, 1759234, 7535788, 2285952, 8081699, 7974658, 8491140, 2258758, 8120314, 1688592, 7333299","abstract":"AIM\nTo determine whether diabetes mellitus (DM) affects prognosis/recurrence after liver transplantation (LT) for hepatitis B virus (HBV)-related hepatocellular carcinoma (HCC).\n\n\nMETHODS\nA retrospective study was conducted between January 2000 and August 2013 on 1631 patients with HBV-related HCC who underwent LT with antiviral prophylaxis. Patient data were obtained from the China Liver Transplant Registry (https://www.cltr.org/). To compare the outcomes and tumor recurrence in the HBV-related HCC patients with or without DM, statistical analyses were conducted using χ2 tests, Mann-Whitney tests, the Kaplan-Meier method, log-rank tests and multivariate step-wise Cox regression analysis.\n\n\nRESULTS\nUnivariate analysis of 1631 patients who underwent LT found overall 1-, 3- and 5-year survival rates of 79%, 73% and 71% respectively in the DM patients, and 84%, 78% and 76% in the non-DM patients respectively. Overall survival rate differences after LT between the two groups were significant (P = 0.041), but recurrence-free survival rates were not (P = 0.096). By stratified analysis, the overall survival rates in DM patients for age > 50 years (P = 0.002), the presence of vascular invasion (P = 0.096), tumors ≤ 3 cm (P = 0.047), two to three tumor nodules (P = 0.007), Child-Pugh grade B (P = 0.018), and pre-LT alanine aminotransferase levels between 40 and 80 IU/L (P = 0.017) were significantly lower than in non-DM patients. Additionally, serum α-fetoprotein level > 2000 ng/mL (P = 0.052) was associated with a significant survival difference trend between DM and non-DM patients. Multivariate analysis showed that the presence of DM (P < 0.001, HR = 1.591; 95%CI: 1.239-2.041) was an independent predictor associated with poor survival after LT.\n\n\nCONCLUSION\nHBV-related HCC patients with DM have decreased long-term overall survival and poor LT outcomes. Prevention strategies for HCC patients with DM are recommended.","cites":"0","conferencePercentile":"47.43975904"},{"venue":"World journal of gastroenterology","id":"7e8378f4ed3030877fabd323a124517a469036d1","venue_1":"World journal of gastroenterology","year":"2003","title":"Leptin receptor expression in the basolateral nucleus of amygdala of conditioned taste aversion rats.","authors":"Zhen Han, Jian-Qun Yan, Guo-Gang Luo, Yong Liu, Yi-Li Wang","author_ids":"8246525, 7034418, 7156726, 7135550, 7709367","abstract":"AIM\nTo determine whether serum leptin level and the leptin receptor (OB-R) expression in the basolateral amygdala (BLA) change following conditioned taste aversion (CTA) formation.\n\n\nMETHODS\nThe serum leptin concentration was measured by rat leptin RIA kit, long and short forms of leptin receptor (OB-Rb and OB-Ra) mRNA in the brain sections were examined by in situ hybridization (ISH) and the expression of OB-R was assessed by immunohistochemistry ABC method with a highly specific goat anti-OB-R antibody.\n\n\nRESULTS\nThe level of serum leptin didn't show significant difference between CTA and control group. Comparing with the control group, the CTA group had an increase on count of OB-R immunohistochemistry positive-stained cells in the BLA (127+/-12 vs 48+/-9 per 1 mm(2)). The OB-Rb mRNA expression level enhanced by 11.9 % in the BLA, while OB-Ra mRNA level increased by 7.4 % on the choroid plexus in CTA group. So BLA was supposed to be a region where interactions between gustatory and vagal signals take place.\n\n\nCONCLUSION\nBLA is one of the sites, which are responsible for CTA formation in the brain. Leptin and OB-R maybe involved in neuronal communication for CTA. So leptin and its receptors probably take part in CTA and integration of autonomic and extroceptive information.","cites":"1","conferencePercentile":"22.22222222"},{"venue":"World journal of gastroenterology","id":"3f8741bd7706bbcde3cd4aa47b076d374aa572fd","venue_1":"World journal of gastroenterology","year":"2016","title":"C5a/C5aR pathway is essential for up-regulating SphK1 expression through p38-MAPK activation in acute liver failure","authors":"Yan-Chang Lei, Chun-Lei Lu, Ling Chen, Ke Ge, Ling-Ling Yang, Wen Li, Yuan-Hua Wu","author_ids":"7858124, 7434359, 1717165, 8459701, 7866459, 1807382, 7860994","abstract":"AIM\nTo investigate the role of the complement 5a (C5a)/C5a receptor (C5aR) pathway in the pathogenesis of acute liver failure (ALF) in a mouse model.\n\n\nMETHODS\nBALB/c mice were randomly assigned to different groups, and intraperitoneal injections of lipopolysaccharide (LPS)/D-galactosamine (D-GalN) (600 mg/kg and 10 μg/kg) were used to induce ALF. The Kaplan-Meier method was used for survival analysis. Serum alanine aminotransferase (ALT) levels, at different time points within a 1-wk period, were detected with a biochemistry analyzer. Pathological examination of liver tissue was performed 36 h after ALF induction. Serum complement 5 (C5), C5a, tumor necrosis factor-α (TNF-α), interleukin (IL)-1β, IL-6, high-mobility group protein B1 (HMGB1) and sphingosine-1-phosphate levels were detected by enzyme-linked immunosorbant assay. Hepatic morphological changes at 36 h after ALF induction were assessed by hematoxylin and eosin staining. Expression of C5aR, sphingosine kinase 1 (SphK1), p38-MAPK and p-p38-MAPK in liver tissue, peripheral blood mononuclear cells (PBMCs) and peritoneal exudative macrophages (PEMs) of mice or RAW 264.7 cells was analyzed by western blotting. C5aR mRNA levels were detected by quantitative real-time PCR.\n\n\nRESULTS\nActivation of C5 and up-regulation of C5aR were observed in liver tissue and PBMCs of mice with ALF. Blockade of C5aR with a C5aR antagonist (C5aRa C5aRa) significantly reduced the levels of serum ALT, inflammatory cytokines (TNF-α, IL-1β and IL-6) and HMGB1, as well as the liver tissue damage, but increased the survival rates (P < 0.01 for all). Blockade of C5aR decreased SphK1 expression in both liver tissue and PBMCs significantly at 0.5 h after ALF induction. C5aRa pretreatment significantly down-regulated the phosphorylation of p38-MAPK in liver tissues of ALF mice and C5a stimulated PEMs or RAW 264.7 cells. Moreover, inhibition of p38-MAPK activity with SB203580 reduced SphK1 protein production significantly in PEMs after C5a stimulation.\n\n\nCONCLUSION\nThe C5a/C5aR pathway is essential for up-regulating SphK1 expression through p38 MAPK activation in ALF in mice, which provides a potential immunotherapeutic strategy for ALF in patients.","cites":"0","conferencePercentile":"47.43975904"},{"venue":"World journal of gastroenterology","id":"979c5b0a7642a415657c17592064e5cf1bed76b3","venue_1":"World journal of gastroenterology","year":"2016","title":"Clinical features of acute hepatitis E super-infections on chronic hepatitis B","authors":"Chong Chen, Shu-Ye Zhang, Dan-Dan Zhang, Xin-Yan Li, Yu-Ling Zhang, Wei-Xia Li, Jing-Jing Yan, Min Wang, Jing-Na Xun, Chuan Lu, Yun Ling, Yu-Xian Huang, Liang Chen","author_ids":"6121162, 7671444, 8335832, 3336213, 7550114, 7878297, 8247938, 8618758, 8163389, 3594402, 2687641, 7524306, 8702312","abstract":"AIM\nTo examine the clinical features and risk factors for adverse outcomes in chronic hepatitis B (CHB) superimposed with hepatitis E virus (HEV).\n\n\nMETHODS\nThis retrospective cohort study included 228 patients with acute HEV infection (showing clinical acute hepatitis symptomology and positivity for anti-HEV immunoglobulin M) with underlying CHB (confirmed by positivity for hepatitis B surface antigen and/or hepatitis B virus (HBV) DNA over 6 mo) who had been admitted to the Shanghai Public Health Clinical Center, which represents the regional tertiary hospital for infectious diseases in Shanghai city, China. Data for adverse outcomes were collected, and included severe liver diseases (defined as liver failure and/or acute liver decompensation) and liver-related mortality. Logistic regression modeling was performed to determine the risk factors for adverse outcomes.\n\n\nRESULTS\nThe symptoms caused by superimposed acute hepatitis E (AHE) were much more severe in cirrhotic patients (n = 94) than in non-cirrhotic patients (n = 134), as evidenced by significantly higher liver complications (77.7% vs 28.4%, P < 0.001) and mortality rate (21.3% vs 7.5%, P = 0.002). Most of the cirrhotic patients (n = 85, 90.4%) had no prior decompensation. Among the non-cirrhotic patients, superimposed AHE caused progressively more severe diseases that corresponded with the CHB disease stages, from immune tolerant to immune reactivation phases. Few risk factors were identified in the cirrhotic patients, but risk factors for non-cirrhotic patients were found to be intermediate HBV DNA levels (OR: 5.1, P = 0.012), alcohol consumption (OR: 6.4, P = 0.020), and underlying diabetes (OR: 7.5, P = 0.003) and kidney diseases (OR: 12.7, P = 0.005). Only 28.7% of the cirrhotic patients and 9.0% of the non-cirrhotic patients had received anti-HBV therapy previously and, in all cases, the efficacy had been suboptimal.\n\n\nCONCLUSION\nCHB-related cirrhosis and intermediate HBV DNA level were associated with severe disease in superinfected patients, and successful antiviral treatment might counter this outcome.","cites":"0","conferencePercentile":"47.43975904"},{"venue":"World journal of gastroenterology","id":"86d788598cec23599f01ca332bccc1f1ba96e28a","venue_1":"World journal of gastroenterology","year":"2016","title":"Programmed death ligand-1 expression and its prognostic role in esophageal squamous cell carcinoma","authors":"Ryul Kim, Bhumsuk Keam, Dohee Kwon, Chan-Young Ock, Miso Kim, Tae Min Kim, Hak Jae Kim, Yoon Kyung Jeon, In Kyu Park, Chang Hyun Kang, Dong-Wan Kim, Young Tae Kim, Dae Seog Heo","author_ids":"2766271, 5984343, 7423240, 5794426, 7590918, 3284507, 8186902, 4788829, 1690728, 6748533, 1831802, 2800946, 7917151","abstract":"AIM\nTo investigate the expression and prognostic role of programmed death ligand-1 (PD-L1) in locally advanced esophageal squamous cell carcinoma (ESCC).\n\n\nMETHODS\nA total of 200 patients with ESCC who underwent radical esophagectomy with standard lymphadenectomy as the initial definitive treatment in Seoul National University Hospital from December 2000 to April 2013 were eligible for this analysis. Tissue microarrays were constructed by collecting tissue cores from surgical specimens, and immunostained with antibodies directed against PD-L1, p16, and c-Met. Medical records were reviewed retrospectively to assess clinical outcomes. Patients were divided into two groups by PD-L1 status, and significant differences in clinicopathologic characteristics between the two groups were assessed.\n\n\nRESULTS\nTumor tissues from 67 ESCC patients (33.5%) were PD-L1-positive. Positive p16 expression was observed in 21 specimens (10.5%). The H-score for c-Met expression was ≥ 50 in 42 specimens (21.0%). Although PD-L1-positivity was not significantly correlated with any clinical characteristics including age, sex, smoking/alcoholic history, stage, or differentiation, H-scores for c-Met expression were significantly associated with PD-L1-positivity (OR = 2.34, 95%CI: 1.16-4.72, P = 0.017). PD-L1 expression was not significantly associated with a change in overall survival (P = 0.656). In contrast, the locoregional relapse rate tended to increase (P = 0.134), and the distant metastasis rate was significantly increased (HR = 1.72, 95%CI: 1.01-2.79, P = 0.028) in patients with PD-L1-positive ESCC compared to those with PD-L1-negative ESCC.\n\n\nCONCLUSION\nPD-L1 expression is positively correlated with c-Met expression in ESCC. PD-L1 may play a critical role in distant failure and progression of ESCC.","cites":"0","conferencePercentile":"47.43975904"},{"venue":"World journal of gastroenterology","id":"87d6ab63feb68f8f2f699b2837039292d526be95","venue_1":"World journal of gastroenterology","year":"2003","title":"Functional brain imaging in irritable bowel syndrome with rectal balloon-distention by using fMRI.","authors":"Yao-Zong Yuan, Ran-Jun Tao, Bin Xu, Jing Sun, Ke-Min Chen, Fei Miao, Zhong-Wei Zhang, Jia-Yu Xu","author_ids":"7809780, 3522454, 3448332, 1768036, 8336660, 2369890, 6700518, 7170087","abstract":"AIM\nIrritable bowel syndrome (IBS) is characterized by abdominal pain and changes in stool habits. Visceral hypersensitivity is a key factor in the pathophysiology of IBS. The aim of this study was to examine the effect of rectal balloon-distention stimulus by blood oxygenation level-dependent functional magnetic resonance imaging (BOLD-fMRI) in visceral pain center and to compare the distribution, extent, and intensity of activated areas between IBS patients and normal controls.\n\n\nMETHODS\nTwenty-six patients with IBS and eleven normal controls were tested for rectal sensation, and the subjective pain intensity at 90 ml and 120 ml rectal balloon-distention was reported by using Visual Analogue Scale. Then, BOLD-fMRI was performed at 30 ml, 60 ml, 90 ml, and 120 ml rectal balloon-distention in all subjects.\n\n\nRESULTS\nRectal distention stimulation increased the activity of anterior cingulate cortex (35/37), insular cortex (37/37), prefrontal cortex (37/37), and thalamus (35/37) in most cases. At 120 ml of rectal balloon-distention, the activation area and percentage change in MR signal intensity of the regions of interest (ROI) at IC, PFC, and THAL were significantly greater in patients with IBS than that in controls. Score of pain sensation at 90 ml and 120 ml rectal balloon-distention was significantly higher in patients with IBS than that in controls.\n\n\nCONCLUSION\nUsing fMRI, some patients with IBS can be detected having visceral hypersensitivity in response to painful rectal balloon-distention. fMRI is an objective brain imaging technique to measure the change in regional cerebral activation more precisely. In this study, IC and PFC of the IBS patients were the major loci of the CNS processing of visceral perception.","cites":"10","conferencePercentile":"100"},{"venue":"World journal of gastroenterology","id":"67b988d881f2cf262ad5f81cb027cd9627ed4073","venue_1":"World journal of gastroenterology","year":"2016","title":"Schwannoma in the hepatoduodenal ligament: A case report and literature review","authors":"Shao-Yan Xu, Ke Sun, Hai-Yang Xie, Lin Zhou, Shu-Sen Zheng, Wei-Lin Wang","author_ids":"8182510, 2319643, 8303982, 2684534, 7149791, 7634785","abstract":"Schwannomas are mesenchymal neoplasms with low malignant potential that arise from Schwann cells. They can occur almost anywhere, although the most common locations are the head, neck and extremities. Primary benign schwannoma of the hepatoduodenal ligament is rare. To date, only three cases have been reported in the English literature. In the present study, we report a case of hepatoduodenal ligament schwannoma in a 43-year-old male, who was admitted to our hospital because of a abdominal mass found by physical examination. It was hard to determine the definitive location and diagnosis of the mass using ultrasound, computed tomography and magnetic resonance cholangiopancreatography. During laparotomy, the mass was found in the hepatoduodenal ligament and close to the cholecystic duct, so we resected the gallbladder and cholecystic duct along with the mass. The gross specimen revealed an 8.5 cm × 5.5 cm × 3.0 cm localized tumor. Microscopic examination showed that the tumor was mainly composed of spindle-shaped cells. Immunohistochemical staining showed a strong positive S-100 protein reaction. Finally, the lesion was diagnosed as a benign schwannoma in the hepatoduodenal ligament. However, one month later, the patient was readmitted to our hospital because of skin and sclera jaundice caused by common bile duct stenosis without common bile duct stone or tumor. The patient recovered well after implantation of a common bile duct stent under endoscopic retrograde cholangiopancreatography. He was followed up for a period of 17 mo, during which he was well with no complications.","cites":"0","conferencePercentile":"47.43975904"},{"venue":"World journal of gastroenterology","id":"c6fa5fac78b2d0bae84c50ca233e67fb31ea8349","venue_1":"World journal of gastroenterology","year":"2016","title":"Synchronous occurrence of a hepatic myelolipoma and two hepatocellular carcinomas","authors":"Shao-Yan Xu, Hai-Yang Xie, Lin Zhou, Shu-Sen Zheng, Wei-Lin Wang","author_ids":"8182510, 8303982, 2684534, 7149791, 7634785","abstract":"Myelolipoma is a rare tumor composed of fat and bone marrow components, most of which are located in the adrenal gland. Myelolipoma in the liver is extremely rare. To date, only 10 cases have been reported in the English-language medical literature. In one of these cases, the hepatic myelolipoma was found within a hepatocellular carcinoma (HCC). In the present study, we report the first case of the synchronous occurrence of hepatic myelolipoma and HCCs in different liver sections of one patient, a 26-year-old female who was admitted to our hospital because of a 4-d history of upper abdominal pain. The unenhanced computed tomography (CT) images showed a well-defined low-density mass with adipose components in the right liver lobe, 4.2 cm × 4.1 cm in size. Two inhomogeneous low-density masses were found in the left liver lobe, 8.6 cm × 7.7 cm and 2.6 cm × 2.6 cm in size. The masses in both the right and left liver lobes were heterogeneously enhanced in the contrast-enhanced CT images. Based on the results of the imaging examination, the mass in the right liver lobe was preliminarily considered to be a hamartoma, and the two masses in the left liver were preliminarily considered to be HCCs. We performed a right hepatectomy, a left hepatic lobectomy, and a cholecystectomy. Microscopic and immunohistochemical results revealed that the tumor in the right liver lobe was a hepatic myelolipoma, and that the two tumors in the left liver lobe were HCCs.","cites":"0","conferencePercentile":"47.43975904"},{"venue":"World journal of gastroenterology","id":"f952ed583d734590ed848cd113cb5d87223c3612","venue_1":"World journal of gastroenterology","year":"2016","title":"Central pancreatectomy for pancreatic schwannoma: A case report and literature review","authors":"Shao-Yan Xu, Ke Sun, Kwabena Gyabaah Owusu-Ansah, Hai-Yang Xie, Lin Zhou, Shu-Sen Zheng, Wei-Lin Wang","author_ids":"8182510, 2319643, 6347574, 8303982, 2684534, 7149791, 7634785","abstract":"Schwannomas are mesenchymal tumors originating from Schwann cells in peripheral nerve sheaths. Although the tumor can be located in any part of the human body, the most common locations are the head, neck, trunk and extremities. Pancreatic schwannomas are rare. To our knowledge, only 64 cases of pancreatic schwannoma have been reported in the English literature over the past 40 years. In this paper, we present a pancreatic schwannoma in a 59-year-old female. Ultrasound, computed tomography and magnetic resonance imaging revealed the tumor located in the pancreatic body; however, accurate diagnosis was hard to obtain preoperatively and a pancreatic cystadenoma was preliminarily considered. During laparotomy, the mass was found in the body of the pancreas. An enlarged gallbladder with multiple stones was also observed. We performed central pancreatectomy, end-to-side pancreaticojejunostomy and cholecystectomy. Notably, central pancreatectomy has been reported in only one case prior to this report. The gross specimen showed a mass with a thin capsule, 1.6 cm × 1.1 cm × 1.1 cm in size. Microscopic examination showed that the tumor was mainly composed of spindle-shaped cells with palisading arrangement and no atypia, which is consistent with a benign tumor. Both hypercellular and hypocellular areas were visible. Immunohistochemical staining revealed strongly positive results for protein S-100. Finally, the tumor was diagnosed as a schwannoma of the pancreatic body. Postoperatively, the patient recovered well and left the hospital 6 d later. During the 53-mo follow-up period, the patient remained well and free of complications.","cites":"0","conferencePercentile":"47.43975904"},{"venue":"World journal of gastroenterology","id":"df2b140b0d92abce92a0c9db68b2b995c962dfd7","venue_1":"World journal of gastroenterology","year":"2016","title":"Fecal microbiota in pouchitis and ulcerative colitis","authors":"Kai-Yu Li, Jian-Lin Wang, Jiang-Peng Wei, Sen-Yang Gao, Ying-Ying Zhang, Li-Tian Wang, Gang Liu","author_ids":"8497876, 7898319, 4407578, 6393318, 7549604, 7974501, 1697913","abstract":"AIM\nTo investigate the changes in microbiota in feces of patients with ulcerative colitis (UC) and pouchitis using genomic technology.\n\n\nMETHODS\nFecal samples were obtained from UC patients with or without an ileal pouch-anal anastomosis (IPAA) procedure, as well as healthy controls. The touchdown polymerase chain reaction technique was used to amplify the whole V3 region of the 16S rRNA gene, which was transcribed from DNA extracted from fecal samples. Denaturing gradient gel electrophoresis was used to separate the amplicons. The band profiles and similarity indices were analyzed digitally. The predominant microbiota in different groups was confirmed by sequencing the 16S rRNA gene.\n\n\nRESULTS\nMicrobial biodiversity in the healthy controls was significantly higher compared with the UC groups (P < 0.001) and IPAA groups (P < 0.001). Compared with healthy controls, the UC patients in remission and those in the mildly active stage, the predominant species in patients with moderately and severely active UC changed obviously. In addition, the proportion of the dominant microbiota, which was negatively correlated with the disease activity of UC (r = -6.591, P < 0.01), was decreased in pouchitis patients. The numbers of two types of bacteria, Faecalibacterium prausnitzii and Eubacterium rectale, were reduced in UC. Patients with pouchitis had an altered microbiota composition compared with UC patients. The microbiota from pouchitis patients was less diverse than that from severely active UC patients. Sequencing results showed that similar microbiota, such as Clostridium perfringens, were shared in both UC and pouchitis.\n\n\nCONCLUSION\nLess diverse fecal microbiota was present in patients with UC and pouchitis. Increased C. perfringens in feces suggest its role in the exacerbation of UC and pouchitis.","cites":"0","conferencePercentile":"47.43975904"},{"venue":"World journal of gastroenterology","id":"5dc619ca1f3e1bc3cfee8df5fd7f4b0d5d8e1224","venue_1":"World journal of gastroenterology","year":"2016","title":"Naringenin protects against isoniazid- and rifampicin-induced apoptosis in hepatic injury","authors":"Chao Wang, Rui-Qin Fan, Yan-Xiang Zhang, Hao Nie, Kan Li","author_ids":"6250419, 7242510, 7549087, 1810261, 8497891","abstract":"AIM\nTo explore the protective effects and mechanisms of naringenin (NRG) on hepatic injury induced by isoniazid (INH) and rifampicin (RIF).\n\n\nMETHODS\nMale mice were randomly divided into four groups and treated for 14 d as follows: normal control group was administered intragastrically with normal saline solution alone; model group was administered intragastrically with INH (100 mg/kg) and RIF (100 mg/kg); low- and high-dosage NRG pretreatment groups were administered intragastrically with different doses of NRG (50 or 100 mg/kg) 2 h before INH and RIF challenge. Mice were killed 16 h after the last dose of drug treatment to determine activity of serum transaminases. Oxidative stress was evaluated by measuring hepatic glutathione (GSH) and superoxide dismutase (SOD) and malondialdehyde (MDA) levels. Histopathological changes in hepatic tissue were observed under the optical microscope. Hepatocyte apoptosis was measured by TUNEL assay and caspase-3 activation. Expression of Bcl-2 and Bax in liver was determined by western blot.\n\n\nRESULTS\nBoth low- and high-dosage NRG pretreatment obviously alleviated serum levels of alanine aminotransferase and aspartate aminotransferase, liver index, hepatic MDA content, and increased hepatic GSH content and SOD activity compared with the INH and RIF-treated group (44.71 ± 8.15 U/L, 38.22 ± 6.64 U/L vs 58.15 ± 10.54 U/L; 98.36 ± 14.78 U/L, 92.41 ± 13.59 U/L vs 133.05 ± 19.36 U/L; 5.34% ± 0.26%, 4.93% ± 0.25% vs 5.71% ± 0.28%; 2.76 ± 0.67 nmol/mgprot, 2.64 ± 0.64 nmol/mgprot vs 4.49 ± 1.12 nmol/mgprot; 5.91 ± 1.31 mg/gprot, 6.42 ± 1.42 mg/gprot vs 3.11 ± 0.73 mg/gprot; 137.31 ± 24.62 U/mgprot, 148.83 ± 26.75 U/mgprot vs 102.34 ± 19.22 U/mgprot; all P < 0.01 or 0.05). Histopathological evaluation showed obvious necrosis and inflammatory cell infiltration in liver of mice administered INH and RIF; however, mice pretreated with NRG showed minor hepatic injury. In addition, INH and RIF resulted in hepatocyte apoptosis, and NRG pretreatment dramatically suppressed INH- and RIF-induced hepatocytes apoptosis. Furthermore, NRG-mediated anti-apoptotic effects seemed to be in connection with its regulation of Bax and Bcl-2 protein expression in hepatic tissue.\n\n\nCONCLUSION\nNRG might attenuate INH- and RIF-induced hepatic injury via suppression of oxidative stress and hepatocyte apoptosis.","cites":"0","conferencePercentile":"47.43975904"},{"venue":"World journal of gastroenterology","id":"04ebd325d434d6a69a3f7e72578e3418e2bd0904","venue_1":"World journal of gastroenterology","year":"2014","title":"ZD 7288, an HCN channel blocker, attenuates chronic visceral pain in irritable bowel syndrome-like rats.","authors":"Yu Chen, Chun Lin, Ying Tang, Ai-Qin Chen, Cui-Ying Liu, Da-Li Lu","author_ids":"8696939, 3284814, 1684697, 7785584, 7531808, 7382535","abstract":"AIM\nTo investigate the effects of ZD 7288, a hyperpolarization-activated cyclic nucleotide-gated (HCN) channel blocker, on rats with chronic visceral pain.\n\n\nMETHODS\nRats with visceral hypersensitivity were generated using neonatal colon irritation during postnatal days 8-15 as described previously. Visceral hypersensitivity was evaluated using electromyographic (EMG) responses of abdominal external oblique muscles to 20-80 mmHg colorectal distentions (CRD). Abdominal withdrawal reflex (AWR) scores and pain thresholds were also detected in adult rats. Different doses of ZD 7288 (25, 50, and 100 nmol/L) were intrathecally administered in rats to study the role of spinal HCN channel in chronic visceral hypersensitivity.\n\n\nRESULTS\nEMG responses to 20-80 mmHg CRD and AWR scores under 20-60 mmHg CRD significantly increased in rats with visceral hypersensitivity compared to control rats (P < 0.05). The pain threshold in rats with visceral hypersensitivity significantly decreased compared to control rats (P < 0.05). Treatment with 50-100 nmol/L ZD 7288 significantly inhibited EMG responses (16%-62%, 80-20 mmHg CRD, P < 0.05) and AWR scores (24%-37%, 40-20 mmHg CRD, P < 0.05; 12%-61%, 80-20 mmHg CRD, P < 0.05, respectively), and significantly increased pain thresholds (32%-77%, P < 0.05).\n\n\nCONCLUSION\nSpinal HCN channels may play an important role in chronic visceral hypersensitivity.","cites":"1","conferencePercentile":"32.35294118"},{"venue":"World journal of gastroenterology","id":"7a1d98657d4d3e7cbfa828135419e0dde3973e57","venue_1":"World journal of gastroenterology","year":"2016","title":"Hepatocyte isolation from resected benign tissues: Results of a 5-year experience","authors":"Fan-Ying Meng, Li Liu, Jun Liu, Chun-You Li, Jian-Ping Wang, Feng-Hui Yang, Zhi-Shui Chen, Ping Zhou","author_ids":"7555613, 1714009, 1843598, 6280146, 1743989, 4915336, 3640412, 1703090","abstract":"AIM\nTo analyze retrospectively a 5-year experience of human hepatocyte isolation from resected liver tissues with benign disease.\n\n\nMETHODS\nWe established a method of modified four-step retrograde perfusion to isolate primary human hepatocytes. Samples were collected from the resected livers of patients with intrahepatic duct calculi (n = 7) and liver hemangioma (n = 17). Only the samples weighing ≥ 15 g were considered suitable for hepatocyte isolation. By using the standard trypan blue exclusion technique, hepatocyte viability and yield were immediately determined after isolation.\n\n\nRESULTS\nTwenty-four liver specimens, weighing 15-42 g, were immediately taken from the margin of the removed samples and transferred to the laboratory for hepatocyte isolation. Warm ischemia time was 5-35 min and cold ischemia time was 15-45 min. For the 7 samples of intrahepatic duct calculi, the method resulted in a hepatocyte yield of 3.49 ± 2.31 × 10(6) hepatocytes/g liver, with 76.4% ± 10.7% viability. The 17 samples of liver hemangioma had significantly higher yield of cells (5.4 ± 1.71 × 10(6) cells/g vs 3.49 ± 2.31 × 10(6) cells/g, P < 0.05) than the samples of intrahepatic duct calculi. However, there seems to be no clear difference in cell viability (80.3% ± 9.67% vs 76.4% ± 10.7%, P > 0.05). We obtained a cell yield of 5.31 ± 1.87 × 10(6) hepatocytes/g liver when the samples weighed > 20 g. However, for the tissues weighing ≤ 20 g, a reduction in yield was found (3.08 ± 1.86 × 10(6) cells/g vs 5.31 ± 1.87 × 10(6) cells/g, P < 0.05).\n\n\nCONCLUSION\nBenign diseased livers are valuable sources for large-number hepatocyte isolation. Our study represents the largest number of primary human hepatocytes isolated from resected specimens from patients with benign liver disease. We evaluated the effect of donor liver characteristics on cell isolation, and we found that samples of liver hemangioma can provide better results than intrahepatic duct calculi, in terms of cell yield. Furthermore, the size of the tissues can affect the outcome of hepatocyte isolation.","cites":"0","conferencePercentile":"47.43975904"},{"venue":"World journal of gastroenterology","id":"af74169e6705f81163fd73c604c16250e513b21a","venue_1":"World journal of gastroenterology","year":"2016","title":"Prognostic implications of FGFR1 and MYC status in esophageal squamous cell carcinoma","authors":"Dohee Kwon, Ji Yun Yun, Bhumsuk Keam, Young Tae Kim, Yoon Kyung Jeon","author_ids":"7423240, 8396013, 5984343, 2800946, 4788829","abstract":"AIM\nTo investigate the clinicopathological features and prognostic implications of combined MYC and fibroblast growth factor receptor 1 (FGFR1) status in esophageal squamous cell carcinomas (ESCCs).\n\n\nMETHODS\nAll patients with ESCC (n = 180) underwent surgical resection at Seoul National University Hospital sometime between 2000 and 2013. A tissue microarray was constructed using cores obtained from representative tumor areas of formalin-fixed, paraffin-embedded tissue blocks. FGFR1 and MYC copy numbers were quantified using fluorescence in situ hybridization. The level of MYC expression was determined using immunohistochemistry. FGFR1 and MYC amplification status was compared between primary and metastatic lymph nodes. Univariate and multivariate survival analyses were performed according to adjuvant therapy status.\n\n\nRESULTS\nFGFR1 and MYC amplifications were observed in 21.4% (37/173) and 54.2% (91/168) of patients, respectively, while MYC expression was observed in 58.9% (106/180) of patients. There was a positive correlation between MYC amplification and overexpression (P = 0.002). Although FGFR1 amplification was not associated with MYC amplification or expression, 12.3% (20/163) of patients exhibited both FGFR1 amplification and MYC expression. There was also a correlation in FGFR1 amplification status between matched primary tumors and metastatic lymph nodes (P < 0.001). MYC expression was higher in ESCCs with pT1 (P < 0.001) and in those with no lymph node metastasis (P = 0.023). MYC expression was associated with prolonged disease-free survival (P = 0.036) and overall survival (OS) (P = 0.017) but was not an independent prognostic factor. FGFR1 amplification was an independent predictor for prolonged OS in all patients (P = 0.029) and in those who did not receive adjuvant therapy (P = 0.013). Combined FGFR1 amplification and MYC expression predicted better OS in patients who did not receive adjuvant therapy (P = 0.034) but not in those who did receive adjuvant therapy.\n\n\nCONCLUSION\nFGFR1 amplification and MYC expression have prognostic implications in resected ESCCs with respect to adjuvant therapy. The role of FGFR1-targeted therapy in ESCC remains to be explored.","cites":"0","conferencePercentile":"47.43975904"},{"venue":"World journal of gastroenterology","id":"0938b8c7d8bb34b17918e178d9e70385999ed2de","venue_1":"World journal of gastroenterology","year":"2016","title":"Anti-inflammatory effect of cannabinoid agonist WIN55, 212 on mouse experimental colitis is related to inhibition of p38MAPK","authors":"Ya-Jing Feng, Yong-Yu Li, Xu-Hong Lin, Kun Li, Ming-Hua Cao","author_ids":"8061450, 7770505, 8013969, 7137324, 8594850","abstract":"AIM\nTo investigate the anti-inflammatory effect and the possible mechanisms of an agonist of cannabinoid (CB) receptors, WIN55-212-2 (WIN55), in mice with experimental colitis, so as to supply experimental evidence for its clinical use in future.\n\n\nMETHODS\nWe established the colitis model in C57BL/6 mice by replacing the animals' water supply with 4% dextran sulfate sodium (DSS) for 7 consecutive days. A colitis scoring system was used to evaluate the severity of colon local lesion. The plasma levels of proinflammatory cytokines, such as tumor necrosis factor-alpha (TNF-α) and interleukin-6 (IL-6), and the myeloperoxidase (MPO) activity in colon tissue were measured. The expressions of cannabinoid receptors, claudin-1 protein, p38 mitogen-activated protein kinase (p38MAPK) and its phosphorylated form (p-p38) in colon tissue were determined by immunohistochemistry and Western blot. In addition, the effect of SB203580 (SB), an inhibitor of p38, was investigated in parallel experiments, and the data were compared with those from intervention groups of WIN55 and SB alone or used together.\n\n\nRESULTS\nThe results demonstrated that WIN55 or SB treatment alone or together improved the pathological changes in mice with DSS colitis, decreased the plasma levels of TNF-α, and IL-6, and MPO activity in colon. The enhanced expression of claudin-1 and the inhibited expression of p-p38 in colon tissues were found in the WIN55-treated group. Besides, the expression of CB1 and CB2 receptors was enhanced in the colon after the induction of DSS colitis, but reduced when p38MAPK was inhibited.\n\n\nCONCLUSION\nThese results confirmed the anti-inflammatory effect and protective role of WIN55 on the mice with experimental colitis, and revealed that this agent exercises its action at least partially by inhibiting p38MAPK. Furthermore, the results showed that SB203580, affected the expression of CB1 and CB2 receptors in the mouse colon, suggesting a close linkage and cross-talk between the p38MAPK signaling pathway and the endogenous CB system.","cites":"0","conferencePercentile":"47.43975904"},{"venue":"World journal of gastroenterology","id":"b6ed703701bbbf9f1ed464d578917c1ebbb37a18","venue_1":"World journal of gastroenterology","year":"2016","title":"Na+/HCO3- cotransporter is expressed on β and α cells during rat pancreatic development","authors":"Li-Hua Cao, Cheng-Cai Xia, Zhao-Chun Shi, Ning Wang, Zheng-Hua Gu, Li-Zhi Yu, Qi Wan, Wei De","author_ids":"7240538, 7412955, 7947504, 1692369, 7683431, 8548212, 3594607, 3733030","abstract":"AIM\nTo determine the expression and localization of the electrogenic Na+/HCO3- cotransporter (NBC1) in rat pancreas during development.\n\n\nMETHODS\nThe rat pancreas from postnatal and embryos removed from the uterus of pregnant rats that had been sacrificed by CO2 asphyxiation were used. Rat pancreas from embryonic day (E) 15.5 and E18.5 rat embryos was isolated under a stereomicroscope. Rat pancreas from postnatal (P) days 0, 7, 14, 21 and adult was directly isolated by the unaided eye. The RT-PCR analysis of the NBC1 specific region on rat pancreas tissues from different developmental stages. The two antibodies which target the NBC1 common COOH-terminal region and NH2-terminal region detected a clear band of about 145 kDa in the Western blot analysis. The localization of NBC1 was examined by immuno-fluorescence detection.\n\n\nRESULTS\nThe results revealed the first peak of NBC1 expression at E18.5 and the second peak at P14. Meanwhile, the low NBC1 expression occurred at P7 and adult stages. Our results demonstrated, for the first time, the presence of NBC1 in the plasma membrane of β and α cells, as well as in the basolateral membrane of acinar cells of the rat pancreas at different stages of development.\n\n\nCONCLUSION\nThe data strongly suggests that NBC1 is diversely expressed in the pancreas at different developmental stages, where it may exert its functions in pancreatic development especially islet cell growth through HCO3- transport and pH regulation.","cites":"0","conferencePercentile":"47.43975904"},{"venue":"World journal of gastroenterology","id":"ab9cdaf45d7fd3d0fc11747a0815d84ee0a7cdda","venue_1":"World journal of gastroenterology","year":"2002","title":"Hyposmotic membrane stretch potentiated muscarinic receptor agonist-induced depolarization of membrane potential in guinea-pig gastric myocytes.","authors":"Lin Li, Nan-Ge Jin, Lin Piao, Ming-Yu Hong, Zheng-Yuan Jin, Ying Li, Wen-Xie Xu","author_ids":"1686030, 4267034, 7175639, 4729377, 5952462, 4744617, 6259262","abstract":"AIM\nTo investigate the relationship between hyposmotic membrane stretch and muscarinic receptor agonist-induced depolarization of membrane potential in antral gastric circular myocytes of guinea-pig.\n\n\nMETHODS\nUsing whole cell patch-clamp technique recorded membrane potential and current in single gastric myocytes isolated by collagenase.\n\n\nRESULTS\nHyposmotic membrane stretch hyperpolarized membrane potential from -60.0mV+/-1.0mV to -67.9mV+/-1.0mV. TEA (10 mmol/L), a nonselective potassium channel blocker significantly inhibited hyposmotic membrane stretch-induced hyperpolarization. After KCl in the pipette and NaCl in the external solution were replaced by CsCl to block the potassium current, hyposmotic membrane stretch depolarized the membrane potential from -60.0 mV+/-1.0mV to -44.8 mV+/-2.3mV (P<0.05), and atropine (1 micromol/L) inhibited the depolarization of the membrane potential. Muscarinic receptor agonist Carbachol depolarized membrane potential from -60.0mV+/-1.0mV to -50.3 mV+/-0.3mV (P<0.05) and hyposmotic membrane stretch potentiated the depolarization. Carbachol induced muscarinic current (I( cch )) was greatly increased by hyposmotic membrane stretch.\n\n\nCONCLUSION\nHyposmotic membrane stretch potentiated muscarinic receptor agonist-induced depolarization of membrane potential, which is related to hyposmotic membrane stretch-induced increase of muscarinic current.","cites":"1","conferencePercentile":"25"},{"venue":"World journal of gastroenterology","id":"8a2f2325c5952e94185ae315dfe969a009ae9599","venue_1":"World journal of gastroenterology","year":"2016","title":"Understanding the role of PIN1 in hepatocellular carcinoma","authors":"Chi-Wai Cheng, Ka-Wai Leong, Eric Tse","author_ids":"7152114, 7831905, 2765760","abstract":"PIN1 is a peptidyl-prolyl cis/trans isomerase that binds and catalyses isomerization of the specific motif comprising a phosphorylated serine or threonine residue preceding a proline (pSer/Thr-Pro) in proteins. PIN1 can therefore induce conformational and functional changes of its interacting proteins that are regulated by proline-directed serine/threonine phosphorylation. Through this phosphorylation-dependent prolyl isomerization, PIN1 fine-tunes the functions of key phosphoproteins (e.g., cyclin D1, survivin, β-catenin and x-protein of hepatitis B virus) that are involved in the regulation of cell cycle progression, apoptosis, proliferation and oncogenic transformation. PIN1 has been found to be over-expressed in many cancers, including human hepatocellular carcinoma (HCC). It has been shown previously that overexpression of PIN1 contributes to the development of HCC in-vitro and in xenograft mouse model. In this review, we first discussed the aberrant transcription factor expression, miRNAs dysregulation, PIN1 gene promoter polymorphisms and phosphorylation of PIN1 as potential mechanisms underlying PIN1 overexpression in cancers. Furthermore, we also examined the role of PIN1 in HCC tumourigenesis by reviewing the interactions between PIN1 and various cellular and viral proteins that are involved in β-catenin, NOTCH, and PI3K/Akt/mTOR pathways, apoptosis, angiogenesis and epithelial-mesenchymal transition. Finally, the potential of PIN1 inhibitors as an anti-cancer therapy was explored and discussed.","cites":"0","conferencePercentile":"47.43975904"},{"venue":"World journal of gastroenterology","id":"c716f726528113f87c938358c4c6b41e8e65552a","venue_1":"World journal of gastroenterology","year":"2005","title":"Molecular physiology of vesicular glutamate transporters in the digestive system.","authors":"Tao Li, Fayez-K Ghishan, Liqun Bai","author_ids":"1726351, 4757613, 5151943","abstract":"Glutamate is the major excitatory neurotransmitter in the mammalian central nervous system (CNS). Packaging and storage of glutamate into glutamatergic neuronal vesicles require ATP-dependent vesicular glutamate uptake systems, which utilize the electrochemical proton gradient as a driving force. Three vesicular glutamate transporters (VGLUT1-3) have been recently identified from neuronal tissue where they play a key role to maintain the vesicular glutamate level. Recently, it has been demonstrated that glutamate signaling is also functional in peripheral neuronal and non-neuronal tissues, and occurs in sites of pituitary, adrenal, pineal glands, bone, GI tract, pancreas, skin, and testis. The glutamate receptors and VGLUTs in digestive system have been found in both neuronal and endocrinal cells. The glutamate signaling in the digestive system may have significant relevance to diabetes and GI tract motility disorders. This review will focus on the most recent update of molecular physiology of digestive VGLUTs.","cites":"1","conferencePercentile":"43.33333333"},{"venue":"World journal of gastroenterology","id":"02d73f40913bf635205c02b85bbc9da630652fa0","venue_1":"World journal of gastroenterology","year":"2016","title":"Response of BRCA1-mutated gallbladder cancer to olaparib: A case report","authors":"Yuan Xie, Yan Jiang, Xiao-Bo Yang, An-Qiang Wang, Yong-Chang Zheng, Xue-Shuai Wan, Xin-Ting Sang, Kai Wang, Da-Dong Zhang, Jia-Jia Xu, Fu-Gen Li, Hai-Tao Zhao","author_ids":"1886992, 4338747, 8314354, 8129756, 8499517, 7594705, 7148765, 3751236, 8335415, 7169589, 7279933, 7574675","abstract":"Gallbladder cancer (GBC), although considered as a relatively rare malignancy, is the most common neoplasm of the biliary tract system. The late diagnosis and abysmal prognosis present challenges to treatment. The overall 5-year survival rate for metastatic GBC patients is extremely low. BRCA1 and BRCA2 are the breast cancer susceptibility genes and their mutation carriers are at a high risk for cancer development, both in men and women. Olaparib, an oral poly ADP-ribose polymerase inhibitor, has been approved by the Food and Drug Administration and the European Commission for the treatment of ovarian cancer with any BRCA1/2 mutations. The first case of a BRCA1-mutated GBC patient who responded to olaparib treatment is reported here.","cites":"0","conferencePercentile":"47.43975904"},{"venue":"World journal of gastroenterology","id":"c8b554257e9c0fb81603ae9be964ef19a50c3aea","venue_1":"World journal of gastroenterology","year":"1994","title":"A case report of localized gastric amyloidosis.","authors":"Dan Wu, Jian-Ying Lou, Jian Chen, Lun Fei, Gui-Jie Liu, Xiao-Yu Shi, Han-Ting Lin","author_ids":"1808776, 6738900, 4330919, 8657524, 5387173, 1797383, 4676018","abstract":"AIM\nTo elucidate the clinical and laboratory features of localized gastric amyloidosis via a rare report along with a review of related literatures.\n\n\nMETHODS\nThe clinical manifestations, laboratory results and surgical treatment of a female patient with localized gastric amyloidosis in our hospital were summarized. The relevant literatures were reviewed on the etiology, clinical features, diagnosis, treatment and prognosis of this disease.\n\n\nRESULTS\nThe patient was lack of specific clinical manifestations and positive laboratory results. Prior to the treatment, she was suspected to be of malignization from gastric ulcer by both gastroscopy and endoscopic ultrasonography, which was denied by the gastric biopsy. The patient was treated with subtotal gastrectomy and clearance of perigastric lymph nodes. The postoperative pathological diagnosis determined the lesion to be the deposition of amyloid materials in the gastric mucosa, submucosa and blood vessel walls with intestinal metaplasia and atrophy of the gastric glands, in which no malignant tumor was found. Congo red staining with prior potassium permanganate incubation confirmed the AA type of amyloid in this case. Multiple biopsies from esophagus, remnant stomach, duodenum, colon and bone marrow in the follow-up survey showed no amyloidal deposition in these tissues and organs. Up to the present, no signs of recurrence have been found in this patient.\n\n\nCONCLUSION\nLocalized gastric amyloidosis, being rare in incidence, should be considered in the differentiation of gastric tumors, in which biopsy is the only means to confirm the diagnosis. Currently, surgical resection of pathological tissue and circumambient lymph nodes may be a preferable therapeutic strategy for the localized amyloidosis to prevent possible complications. Although with a benign prognosis, gastric amyloidosis possesses a recurrent tendency as suggested by the literatures.","cites":"4","conferencePercentile":"100"}]}