{"World_journal_of_emergency_medi":[{"venue":"World journal of emergency medicine","id":"9623dc6557145ac2992c91dc6dbfbca1c94cea55","venue_1":"World journal of emergency medicine","year":"2013","title":"Upregulated expression of S100A8 in mice brain after focal cerebral ischemia reperfusion","authors":"Peng Sun, Qian Li, Qing Zhang, Li Xu, Ji-yuan Han","author_ids":"1702326, 7137586, 1681771, 6736904, 5644894","abstract":"BACKGROUND\nRecent studies have showed that S100A8 has been implicated in the pathobiology of inflammatory disorders, and that cerebral ischemia reperfusion (I/R) rapidly activates inflammation responses via Toll-like receptor 4 (TLR4). This study aimed to explore the expression of S100A8 and the relationship between S100A8 and TLR4 in focal cerebral ischemia reperfusion injury.\n\n\nMETHODS\nC3H/HeJ mice (n=30) and C3H/HeN mice (n=30) were divided randomly into a C3H/HeJ model group (n=18), a C3H/HeJ control group (n=12), a C3H/HeN model group (n=18), and a C3H/HeN control group (n=12). Middle cerebral artery I/R model in mice was produced using a thread embolism method. The brains of the mice were collected after ischemia for 1 hour and reperfusion for 12 hours. Stroke outcome was evaluated by determination of infarct volume and assessment of neurological impairment scores. Brain injury after cerebral I/R was observed by an optical microscope after TTC and HE dyeing. The immunofluorescence technique and real time PCR were used to test the expression level of S100A8 in brain damage.\n\n\nRESULTS\nCompared with C3H/HeN mice, TLR4-deficient mice (C3H/HeJ) had lower infarct volumes and better outcomes in neurological tests. The levels of S100A8 increased sharply in the brains of mice after I/R injury. In addition, mice that lacked TLR4 (C3H/HeJ) had lower expression of I/R-induced S100A8 than C3H/HeN mice in the model group, indicating that a close relationship might exist between the levels of S100A8 and TLR4.\n\n\nCONCLUSION\nS100A8 interaction with TLR4 might be involved in brain damage and in inflammation triggered by I/R injury.","cites":"0","conferencePercentile":"37.93103448"},{"venue":"World journal of emergency medicine","id":"6f9137eb02021083b9a2c4fcaf31ebd7d86fb705","venue_1":"World journal of emergency medicine","year":"2013","title":"Effect of early goal directed therapy on tissue perfusion in patients with septic shock","authors":"Yuan-hua Lu, Ling Liu, Xiao-hua Qiu, Qin Yu, Yi Yang, Hai-bo Qiu","author_ids":"4937125, 1701262, 3936874, 8292604, 1698559, 8130942","abstract":"BACKGROUND\nThis study aimed to observe the effect of early goal directed therapy (EGDT) on tissue perfusion, microcirculation and tissue oxygenation in patients with septic shock.\n\n\nMETHODS\nPatients with early septic shock (<24 hours) who had been admitted to the ICU of Zhongda Hospital Affiliated to Southeast University from September 2009 through May 2011 were enrolled (research time: 12 months), and they didn't meet the criteria of EGDT. Patients who had one of the following were excluded: stroke, brain injury, other types of shock, severe heart failure, acute myocardial infarction, age below 18 years, pregnancy, end-stage disease, cardiac arrest, extensive burns, oral bleeding, difficulty in opening the mouth, and the onset of septic shock beyond 24 hours. Patients treated with the standard protocol of EGDT were included. Transcutaneous pressure of oxygen and carbon dioxide (PtcO2, PtcCO2) were monitored and hemodynamic measurements were obtained. Side-stream dark field (SDF) imaging device was applied to obtain sublingual microcirculation. Hemodynamics, tissue oxygen, and sublingual microcirculation were compared before and after EGDT. If the variable meets the normal distribution, Student's t test was applied. Otherwise, Wilcoxon's rank-sum test was used. Correlation between variables was analyzed with Pearson's product-moment correlation coefficient method.\n\n\nRESULTS\nTwenty patients were involved, but one patient wasn't analyzed because he didn't meet the EGDT criteria. PtcO2 and PtcCO2 were monitored in 19 patients, of whom sublingual microcirculation was obtained. After EGDT, PtcO2 increased from 62.7±24.0 mmHg to 78.0±30.9 mmHg (P<0.05) and tissue oxygenation index (PtcO2/FiO2) was 110.7±60.4 mmHg before EGDT and 141.6±78.2 mmHg after EGDT (P<0.05). The difference between PtcCO2 and PCO2 decreased significantly after EGDT (P<0.05). The density of perfused small vessels (PPV) and microcirculatory flow index of small vessels (MFI) tended to increase, but there were no significant differences between them (P>0.05). PtcO2, PtcO2/FiO2, and PtcCO2 were not linearly related to central venous saturation, lactate, oxygen delivery, and oxygen consumption (P>0.05).\n\n\nCONCLUSION\nPeripheral perfusion was improved after EGDT in patients with septic shock, and it was not exactly reflected by the index of systemic perfusion.","cites":"0","conferencePercentile":"37.93103448"},{"venue":"World journal of emergency medicine","id":"b9f8776a7ce0f6cafa4b134025537865402e174a","venue_1":"World journal of emergency medicine","year":"2013","title":"Urokinase-type plasminogen activator receptor as a predictor of poor outcome in patients with systemic inflammatory response syndrome","authors":"Xiao-ling Wu, Ding Long, Li Yu, Jun-hui Yang, Yuan-chao Zhang, Feng Geng","author_ids":"7917188, 8681765, 1720783, 2399137, 7550633, 6069929","abstract":"BACKGROUND\nUrokinase-type plasminogen activator (uPA) and urokinase-type plasminogen activator receptor (uPAR) are known as important factors, which mediate a variety of functions in terms of vascular homeostasis, inflammation and tissue repair. However, their role in systemic inflammatory response syndrome (SIRS) has been less well studied. This study aimed to test the hypothesis that the abnormalities of fibrinolysis and degradation of extracellular matrix mediated by uPA and uPAR are directly related to the patients with SIRS. We therefore analyzed their role and clinicopathological significance in patients with SIRS.\n\n\nMETHODS\nA case-control study was conducted with 85 patients who were divided into two groups according to the diagnostic criteria of SIRS: SIRS group (n=50) and non-SIRS group (n=35). The SIRS group was divided into MODS group (n=26) and non-MODS group (n=24) by their severity, and survival group (n=35) and non-survival group (n=15) by their prognosis. Another 30 healthy adults served as normal controls. uPA and uPAR in plasma were detected by commercial enzyme-linked immunosorbent assay (ELISA) kits.\n\n\nRESULTS\nThe plasma level of uPA was lower in the SIRS group than in the non-SIRS group and controls (P<0.001 and P<0.001). It was lower in sepsis patients and the MODS group than in the non-sepsis patients and the non-MODS patients (all P<0.05). However, there was no difference in uPA level between survivors and non-survivors (P>0.05). The plasma level of uPAR increased in the SIRS group compared with the non-SIRS group and controls (P<0.001 and P<0.001). There was a significant elevation of uPAR in sepsis patients, MODS patients and non-survivors as compared with non-sepsis patients, non-MODS patients and survivors respectively (all P<0.05). Plasma uPAR levels were positively correlated with APACHE II score (r=0.575, P<0.001) and SOFA score (r=0.349, P=0.013). AUCs for the prediction of SIRS mortality were 0.67 and 0.51, respectively, for uPA and uPAR.\n\n\nCONCLUSION\nuPAR could be a predictor of poor outcome in patients with SIRS.","cites":"0","conferencePercentile":"37.93103448"},{"venue":"World journal of emergency medicine","id":"49611c70e5bed2ad9832dcb0ec9dc28f60d7f727","venue_1":"World journal of emergency medicine","year":"2010","title":"High S100B levels in cerebrospinal fluid and peripheral blood of patients with acute basal ganglial hemorrhage are associated with poor outcome.","authors":"Man Huang, Xiao-Qiao Dong, Yue-Yu Hu, Wen-Hua Yu, Zu-Yong Zhang","author_ids":"2382939, 3711476, 7741801, 7986031, 7969828","abstract":"BACKGROUND\nS100B is involved in brain injury. This study aimed to determine plasma and cerebral spinal fluid (CSF) levels of S100B in patients with spontaneous intracerebral hemorrhage (ICH), and to correlate S100B levels with Glasgow Coma Scale (GCS) scores, ICH volumes, presence of intraventricular hemorrhage (IVH), and survival rate, and to correlate CSF S100B levels with plasma S100B levels as well as CSF interleukin-1beta (IL-1β) levels.\n\n\nMETHODS\nTen patients with suspicion of subarachnoid hemorrhage and 38 patients with spontaneous basal ganglia hemorrhage were included in the study. Their plasma and CSF samples were collected. The concentrations of IL-1β in CSF and S100B in plasma and CSF were analyzed by enzyme-linked immunosorbent assay.\n\n\nRESULTS\nPlasma or CSF S100B levels in the ICH group were significantly higher than those in the control group (178.7±74.2 versus 63.2±23.0 pg/ml; P<0.001 or 158.1±70.9 versus 1.8±0.7 ng/ml; P<0.001). S100B levels were highly associated with GCS scores, ICH volumes, presence of IVH, and survival rate (all P<0.05). CSF S100B levels were highly associated with plasma S100B levels as well as CSF IL-1β levels (both P<0.01) in patients with ICH. A receiver operating characteristic curve identified CSF and plasma S100B cutoff levels that predicted 1-week mortality of patients with a high sensitivity and specificity. The areas under curves (AUCs) of GCS scores and ICH volumes were larger than those of CSF and plasma S100B levels, but the differences were not statistically significant (P>0.05).\n\n\nCONCLUSION\nHigh levels of S100B are present in the cerebrospinal fluid and peripheral blood of patients with ICH and may contribute to the inflammatory processes of ICH. The levels of CSF and plasma S100B after spontaneous onset of ICH seem to correlate with clinical outcome in these patients. Increases in peripheral S100B properly reflect brain injury, and plasma S100B level may serve as a useful clinical marker for evaluating the prognosis of ICH.","cites":"2","conferencePercentile":"100"},{"venue":"World journal of emergency medicine","id":"50092e40c234d2ed4343a36ecaf5ced170b9548f","venue_1":"World journal of emergency medicine","year":"2013","title":"Clinical analysis of central venous catheter-related infections in patients in the emergency ICU","authors":"Min Chen, Ri-jin Zhu, Feng Chen, Xiao-pin Wang, Jun Ke","author_ids":"1711628, 6573207, 1692998, 3929875, 8540538","abstract":"BACKGROUND\nCatheter-related infection (CRI) of the central vein is a common cause of nosocomial infection. This study was undertaken to investigate the pathogen culturing and risk factors of CRI in emergency intensive care unit (EICU) in order to provide the beneficial reference.\n\n\nMETHODS\nFrom January 2008 to December 2010, a total of 1 363 patients were subjected to catheterization. In these patients, the peak CRI rate of the patients was determined by bacterial cultivation and blood bacterial cultivation.\n\n\nRESULTS\nCRI happened in 147 of the 1 363 patients using the central venous catheter. The peak rate of CRI was 10.79%, with an incidence of 3.05 episodes per 1 000 catheter days. Of the 147 patients, 46.94% had gram-negative bacilli, 40.14% had gram-positive cocci, and 12.92% had fungi. Unconditional logistic regression analysis suggests that multiple catheterization, femoral vein catheterization, the application of multicavity catheter, and the duration of catheterization were the independent risk factors for CRI.\n\n\nCONCLUSION\nThe risk factors for catheter-related infections should be controlled to prevent the occurrence of nosocomial infection.","cites":"0","conferencePercentile":"37.93103448"},{"venue":"World journal of emergency medicine","id":"68d370ea35602b3aaad74badcad5ed9fd0f521c7","venue_1":"World journal of emergency medicine","year":"2014","title":"Effects of mild hypothermia on the ROS and expression of caspase-3 mRNA and LC3 of hippocampus nerve cells in rats after cardiopulmonary resuscitation.","authors":"Jian Lu, Yi Shen, Hui-Yin Qian, Li-Jun Liu, Bao-Chun Zhou, Yan Xiao, Jin-Ning Mao, Guo-Yin An, Ming-Zhong Rui, Tao Wang, Chang-Lai Zhu","author_ids":"3782814, 1746161, 8276647, 7954748, 7458714, , 8359187, 7146819, 7860589, 1685072, 7883835","abstract":"BACKGROUND\nCardiac arrest (CA) is a common and serious event in emergency medicine. Despite recent improvements in resuscitation techniques, the survival rate of patients with CA is unchanged. The present study was undertaken to observe the effect of mild hypothermia (MH) on the reactive oxygen species (ROS) and the effect of neurological function and related mechanisms.\n\n\nMETHODS\nSixty-five healthy male Sprague Dawley (SD) adult rats were randomly (random number) divided into 2 groups: blank control group (n=5) and CPR group (n=60). CA was induced by asphyxia. The surviving rats were randomly (random number) divided into two groups: normothermia CPR group (NT) and hypothermia CPR group (HT). Normothermia of 37 °C was maintained in the NT group after return of spontaneous circulation (ROSC), hypothermal intervention of 32 °C was carried out in the HT group for 4 hours immediately after ROSC. Both the NT and HT groups were then randomly divided into 2 subgroups 12 hours and 24 hours after ROSC (NT-12, NT-24, HT-12, HT-24 subgroups). During observation, the neurological deficit scores (NDSs) was recorded, then the bilateral hippocampi were obtained from rats' head, and monoplast suspension of fresh hippocampus tissue was made immediately to determine the level of intracellular ROS by flow cytometry. Transmission electron microscope was used to observe the ultramicro changes of cellular nucleus and mitochondria. Reverse transcription-polymerase chain reaction (RT-PCR) was used to determine the expression of caspase-3 mRNA, and western-blotting (WB) was used to determine the level of LC3 in frozen hippocampus tissue. Measured data were analyzed with paired sample t test and One-Way ANOVA.\n\n\nRESULTS\nOf 60 rats with CA, 44 (73%) were successfully resuscitated and 33 (55%) survived until the end of the experiment. The NDSs of rats in the NT and HT groups were more significantly reduced than those in the BC group (F=8.107, P<0.05), whereas the NDSs of rats in the HT-12 and HT-24 subgroups were significantly increased in comparison with those NDSs of rats in the NT-12 and NT-24 subgroups, respectively (t=9.692, P<0.001; t=14.374, P<0.001). The ROS in hippocampus nerve cells in the NT and HT groups significantly increased compared to the BC group (F=16.824, P<0.05), whereas the ROS in the HT-12 and HT-24 subgroups significantly reduced compared with that ROS in the NT-12 and NT-24 subgroups, respectively (t=9.836, P<0.001; t=7.499, P<0.001). The expression of caspase-3 mRNA in hippocampus nerve cells in the NT and HT groups were significantly increased compared to the BC group (F=24.527, P<0.05), whereas the expression of caspase-3 mRNA in rats of the HT-12 and HT-24 subgroups was significantly reduced compared to the NT-12 and NT-24 subgroups, respectively (t=6.935, P<0.001; t=4.317, P<0.001). The expression of LC3B-II/I in hippocampus nerve cells of rats in the NT and HT groups significantly increased compared to the BC group (F=6.584, P<0.05), whereas the expression of LC3B-II/I in rats of the HT-12 and HT-24 subgroups significantly reduced compared to the NT-12 and NT-24 subgroups, respectively (t=10.836, P<0.001; t=2.653, P=0.02). Ultrastructure damage of nucleus and mitochondria in the NT group was more evident than in the BC group, and eumorphism of nucleus and mitochondria were maintained in rats of the HT group compared with the NT group.\n\n\nCONCLUSION\nMild hypothermia lessened the injury of nerve cells and improved the neurological function of rats that survived from cardiac arrest by reducing the ROS production of nerve cells and inhibiting the expression of caspase-3 mRNA and LC3, leading to cellular apoptosis and massive autophagy in rats that survived from cardiac arrest after CPR.","cites":"0","conferencePercentile":"100"}]}