{"WORM_07.csv":[{"venue":"WORM '07","id":"53d48c330855264972341cf09fe842c2434bb4e7","venue_1":"WORM '07","year":"2007","title":"Quorum sensing and self-stopping worms","authors":"Ryan Vogt, John Aycock, Michael J. Jacobson","author_ids":"3269522, 1747867, 2299671","abstract":"Random-scanning worms can be adapted, without a complex overlay control network, to stop their scanning activity once a certain percentage of all vulnerable hosts have been infected. This modification makes a worm more difficult to detect for a defender. This paper examines the theoretical concept of a perfect self-stopping algorithm, and discusses some of the limitations of Ma et al.'s Sum-Count-X self-stopping mechanism [7]. An alternative self-stopping mechanism based on the bacterial mechanism of quorum sensing [4] is suggested, and its feasibility is explored via simulation. Possible counter-measures to this new mechanism are also discussed","cites":"8","conferencePercentile":"37.5"},{"venue":"WORM '07","id":"7c7633164b52a3d353212a40d689cd8fe0f38ce8","venue_1":"WORM '07","year":"2007","title":"A new worm exploiting IPv4-IPv6 dual-stack networks","authors":"Qinhua Zheng, Ting Liu, Xiaohong Guan, Yu Qu, Na Wang","author_ids":", 1691474, 1693616, 1703607, 1806730","abstract":"It is commonly believed that the IPv6 protocol can provide good protection against network worms due to its huge address space. However, it is proved to be incorrect by our study on the new \"dual-stack worm\" which can spread in IPv4-IPv6 dual-stack networks. It is found in this paper that the dual-stack worm can collect the IPv6 addresses of all running hosts on the link-local quickly and effectively, which may result in accelerated worm spreading on the IPv6 link-locals. This worm applies a two-level scanning mechanism to find its targets in dual-stack networks, which is investigated by exploring its similarity to the self-replicating behaviors of biological viruses. Based on the ideas of classifying the population into different species or patches, we categorized all vulnerable hosts into two species and separated all dual-stack hosts into several patches to model the propagation of this worm by differential equations. Simulation is performed to validate the worm propagation model and to study the propagation of the worm in various dual-stack networks with different patch parameters. The simulation results show that the worm is able to spread much faster in IPv4-IPv6 dual-stack network than that in the pure IPv4 Internet. It is also noted that the dual-stack links may influence the propagation of the worm in the Internet","cites":"2","conferencePercentile":"18.75"}]}