{"WormBook__the_online_review_of_":[{"venue":"WormBook : the online review of C. elegans biology","id":"495137163f176a6bab4733363cf8f2a2d2a5a0e5","venue_1":"WormBook : the online review of C. elegans biology","year":"2014","title":"Overview of gene structure in C. elegans.","authors":"John Spieth, Daniel Lawson, Paul Davis, Gary Williams, Kevin Howe","author_ids":"2311972, 2959363, 4478986, 4631622, 2756691","abstract":"In the early stage of the C. elegans sequencing project, the ab initio gene prediction program Genefinder was used to find protein-coding genes. Subsequently, protein-coding genes structures have been actively curated by WormBase using evidence from all available data sources. Most coding loci were identified by the Genefinder program, but the process of gene curation results in a continual refinement of the details of gene structure, involving the correction and confirmation of intron splice sites, the addition of alternate splicing forms, the merging and splitting of incorrect predictions, and the creation and extension of 5' and 3' ends. The development of new technologies results in the availability of further data sources, and these are incorporated into the evidence used to support the curated structures. Non-coding genes are more difficult to curate using this methodology, and so the structures for most of these have been imported from the literature or from specialist databases of ncRNA data. This article describes the structure and curation of transcribed regions of genes.","cites":"1","conferencePercentile":"28.57142857"},{"venue":"WormBook : the online review of C. elegans biology","id":"71fb2b82ca27fd7ec34a6b658a02c39e8dfc8d05","venue_1":"WormBook : the online review of C. elegans biology","year":"2014","title":"Thermotaxis navigation behavior.","authors":"Miriam B Goodman, Mason Klein, Samuel Lasse, Linjiao Luo, Ikue Mori, Aravi Samuel, Piali Sengupta, Dong Wang","author_ids":"6289820, 5117424, 5847204, 5878561, 4785372, 7991227, 6149558, 1726751","abstract":"This chapter describes four different protocols used to assay thermotaxis navigation behavior of single, or populations of, C. elegans hermaphrodites on spatial thermal gradients within the physiological temperature range (15-25°C). A method to assay avoidance of noxious temperatures is also described.","cites":"1","conferencePercentile":"28.57142857"}]}