{"WOSN.csv":[{"venue":"WOSN","id":"224c52abb8f18648bb4066aa563396f68c5f0ffc","venue_1":"WOSN","year":"2008","title":"Photo-based authentication using social networks","authors":"Sarita Yardi Schoenebeck, Nick Feamster, Amy Bruckman","author_ids":"1844852, 1800154, 1687835","abstract":"We present Lineup, a system that uses the social network graph in Facebook and auxiliary information (e.g., \"tagged\" user photos) to build a photo-based Web site authentication framework. Lineup's underlying mechanism leverages the concept of CAPTCHAs, programs that are designed to distinguish bots from human users. Lineup extends this functionality to help a Web site ascertain a user's identity or membership in a certain group (e.g., an interest group, invitees to a certain event) in order to infer some level of trust. Lineup works by presenting a user with photographs and asking the user to identify subjects in the photo whom a user with the appropriate identity or group membership should know. We present the design and implementation for Lineup, describe a preliminary prototype implementation, and discuss Lineup's security properties, including possible guarantees and threats.","cites":"24","conferencePercentile":"21.42857143"},{"venue":"WOSN","id":"4a824c4063b719e33a8869e7f3df103eae1bc706","venue_1":"WOSN","year":"2012","title":"Shortest Paths in Less Than a Millisecond","authors":"Rachit Agarwal, Matthew Caesar, Brighten Godfrey, Ben Y. Zhao","author_ids":"1981379, 1795621, 1758273, 1972108","abstract":"We consider the problem of answering point-to-point shortest path queries on massive social networks. The goal is to answer queries within tens of milliseconds while minimizing the memory requirements. We present a technique that achieves this goal for an extremely large fraction of path queries by exploiting the structure of the social networks. Using evaluations on real-world datasets, we argue that our technique offers a unique trade-off between latency, memory and accuracy. For instance, for the LiveJournal social network (roughly 5 million nodes and 69 million edges), our technique can answer 99.9 of the queries in less than a millisecond. In comparison to storing all pair shortest paths, our technique requires at least 550x less memory; the average query time is roughly 365 microseconds --- 430x faster than the state-of-the-art shortest path algorithm. Furthermore, the relative performance of our technique improves with the size (and density) of the network. For the Orkut social network (3 million nodes and 220 million edges), for instance, our technique is roughly 2588x faster than the state-of-the-art algorithm for computing shortest paths.","cites":"8","conferencePercentile":"27.27272727"},{"venue":"WOSN","id":"0c7c163db1d41254acddde847a75e325f088cb8a","venue_1":"WOSN","year":"2012","title":"Coarse-Grained Topology Estimation via Graph Sampling","authors":"Maciej Kurant, Minas Gjoka, Yan Wang, Zack W. Almquist, Carter T. Butts, Athina Markopoulou","author_ids":"2803792, 2752625, 1678691, 2485727, 3014984, 1706319","abstract":"In many online networks, nodes are partitioned into <i>categories</i> (<i>e.g.</i>, countries or universities in OSNs), which naturally defines a weighted <i>category graph i.e.</i>, a coarse-grained version of the underlying network. In this paper, we show how to efficiently estimate the category graph from a probability sample of nodes. We prove consistency of our estimators and evaluate their efficiency via simulation. We also apply our methodology to a sample of Facebook users to obtain a number of category graphs, such as the college friendship graph and the country friendship graph. We share and visualize the resulting data at www.geosocialmap.com.","cites":"17","conferencePercentile":"81.81818182"},{"venue":"WOSN","id":"6f4645fbd2cd2f6ab9fbaec7f3638bde118e147d","venue_1":"WOSN","year":"2008","title":"Lockr: social access control for web 2.0","authors":"Amin Tootoonchian, Kiran K. Gollu, Stefan Saroiu, Yashar Ganjali, Alec Wolman","author_ids":"1846752, 2335843, 2817840, 1731999, 1793636","abstract":"Sharing personal content online is surprisingly hard despite the recent emergence of a huge number of content sharing systems and sites. These systems suffer from several drawbacks: they each have a different way of providing access control which cannot be used with other systems; moving to a new system is a lengthy process and requires registration and invitation of all one's friends to the new system; and the rules for access control are complicated and become more so as our networks of online friends grow.\n In this paper, we present Lockr - an access control scheme based on social relationships that makes sharing personal content easy. Lockr separates social networking information from the content sharing mechanisms, thereby eliminating the need for users to maintain many site-specific copies of their social networks. We describe Lockr's design, security properties, and limitations. We also present how we integrated Lockr with two popular systems for sharing content online - BitTorrent and Flickr.","cites":"40","conferencePercentile":"50"},{"venue":"WOSN","id":"34c7a2a830ad3605fd75d11508bfa7880b7f1f92","venue_1":"WOSN","year":"2012","title":"Keeping information safe from social networking apps","authors":"Bimal Viswanath, Emre Kiciman, Stefan Saroiu","author_ids":"2559642, 1754874, 2817840","abstract":"The ability of third-party applications to aggregate and re-purpose personal data is a fundamental privacy weakness in today's social networking platforms. Prior work has proposed sandboxing in a hosted cloud infrastructure to prevent leakage of user information [22]. In this paper, we extend simple sandboxing to allow sharing of information among friends in a social network, and to help application developers securely aggregate user data according to differential privacy properties. Enabling these two key features requires preventing, among other subtleties, a new \"Kevin Bacon\" attack aimed at aggregating private data through a social network graph. We describe the significant architectural and security implications for the application framework in the Web (JavaScript) application, backend cloud, and user data handling.","cites":"10","conferencePercentile":"45.45454545"},{"venue":"WOSN","id":"0725f4722694c3fde78751e68d72cc7b18d9faa9","venue_1":"WOSN","year":"2009","title":"Temporal distance metrics for social network analysis","authors":"John Kit Tang, Mirco Musolesi, Cecilia Mascolo, Vito Latora","author_ids":"3446337, 1806767, 1733840, 8427301","abstract":"The analysis of social and technological networks has attracted a lot of attention as social networking applications and mobile sensing devices have given us a wealth of real data. Classic studies looked at analysing <i>static</i> or <i>aggregated</i> networks, i.e., networks that do not change over time or built as the results of aggregation of information over a certain period of time. Given the soaring collections of measurements related to very large, real network traces, researchers are quickly starting to realise that connections are inherently varying over time and exhibit more dimensionality than static analysis can capture.\n In this paper we propose new temporal distance metrics to quantify and compare the speed (delay) of information diffusion processes taking into account the evolution of a network from a local and global view. We show how these metrics are able to capture the temporal characteristics of time-varying graphs, such as delay, duration and time order of contacts (interactions), compared to the metrics used in the past on static graphs. As a proof of concept we apply these techniques to two classes of time-varying networks, namely connectivity of mobile devices and e-mail exchanges.","cites":"64","conferencePercentile":"80"},{"venue":"WOSN","id":"95498f0d8e2b3ce47bb69e69ca20abc32a568faa","venue_1":"WOSN","year":"2010","title":"Distance Matters: Geo-social Metrics for Online Social Networks","authors":"Salvatore Scellato, Cecilia Mascolo, Mirco Musolesi, Vito Latora","author_ids":"1790269, 1733840, 1806767, 8427301","abstract":"Online Social Networks (OSNs) are increasingly becoming one of the key media of communication over the Internet. The potential of these services as the basis to gather statistics and exploit information about user behavior is appealing and, as a consequence, the number of applications developed for these purposes has been soaring. At the same time, users are now willing to share information about their location, allowing for the study of the role of geographic distance in social ties. In this paper we present a graph analysis based approach to study social networks with geographic information and new metrics to characterize how geographic distance affects social structure. We apply our analysis to four large-scale OSN datasets: our results show that there is a vast portion of users with short-distance links and that clusters of friends are often geographically close. In addition, we demonstrate that different social networking services exhibit different geo-social properties: OSNs based mainly on location-advertising largely foster local ties and clusters, while services used mainly for news and content sharing present more connections and clusters on longer distances. The results of this work can be exploited to improve many classes of systems and a potential vast number of applications, as we illustrate by means of some practical examples.","cites":"97","conferencePercentile":"92.30769231"},{"venue":"WOSN","id":"83cd129b870d68f2c570a95c6d182adb380185a1","venue_1":"WOSN","year":"2010","title":"I rate you. You rate me. Should we do so publicly?","authors":"ChunYuen Teng, Debra Lauterbach, Lada A. Adamic","author_ids":"2444631, 2843598, 1778398","abstract":"We find that ratings are not absolute, but rather depend on whether they are given anonymously or under one's own name and whether they are displayed publicly or held confidentially. The potential to reciprocate produces higher and more correlated ratings than when individuals are unable to see how others rated them. Ratings further depend on the gender and nationalities of the raters and ratees. All of these findings indicate that ratings should not be taken at face value without considering social nuances .","cites":"6","conferencePercentile":"19.23076923"},{"venue":"WOSN","id":"901d4a5cca6e52a88017be377c2cdbadf2fa1317","venue_1":"WOSN","year":"2012","title":"Why watching movie tweets won't tell the whole story?","authors":"Felix Ming Fai Wong, Soumya Sen, Mung Chiang","author_ids":"1895058, 1687150, 1683977","abstract":"Data from Online Social Networks (OSNs) are providing analysts with an unprecedented access to public opinion on elections, news, movies, etc. However, caution must be taken to determine whether and how much of the opinion extracted from OSN user data is indeed reflective of the opinion of the larger online population. In this work we study this issue in the context of movie reviews on Twitter and compare the opinion of Twitter users with that of IMDb and Rotten Tomatoes. We introduce metrics to quantify how Twitter users can be characteristically different from general users, both in their rating and their relative preference for Oscar-nominated and non-nominated movies. We also investigate whether such data can truly predict a movie's box-office success.","cites":"12","conferencePercentile":"54.54545455"},{"venue":"WOSN","id":"be39139a9ad21278423288604cfbcaa4e25b88de","venue_1":"WOSN","year":"2008","title":"Are you moved by your social network application?","authors":"Abderrahmen Mtibaa, Augustin Chaintreau, Jason LeBrun, Earl Oliver, Anna Kaisa Pietiläinen, Christophe Diot","author_ids":"3148662, 2775909, 2383055, 2990204, 2200078, 1737360","abstract":"This paper studies a Bluetooth-based mobile social network application deployed among a group of 28 participants collected during a computer communication conference. We compare the social graph containing friends, as defined by participants, to the contact graph, that is the temporal network created by opportunistic contacts as owners of devices move and come into communication range. Our contribution is twofold: first, we prove that most properties of nodes, links, and paths correlate among the social and contact graphs. Second, we describe how the structure of the social graph helps build forwarding paths in the contact graph, allowing two nodes to communicate over time using opportunistic contacts and intermediate nodes. Efficient paths can be built using only pairs of nodes that are socially close (i.e. connected through a few pairs of friends). Our results indicate that opportunistic forwarding complies with the requirement of social network application.","cites":"39","conferencePercentile":"42.85714286"},{"venue":"WOSN","id":"34933df0253a7ca5e0281b5457ab7977c0adf9c4","venue_1":"WOSN","year":"2008","title":"Authenticated out-of-band communication over social links","authors":"Anirudh Ramachandran, Nick Feamster","author_ids":"2580932, 1800154","abstract":"Many existing host-based applications rely on their own authentication mechanisms and peer discovery services. Although social networking sites already provide mechanisms for users both to discover other users (e.g., by logging on to the social network Web site) and to communicate securely with each other (e.g., using instant messages within the social networking site), today's applications have no way to exploit the relationships and trust that are inherent in these networks. This paper proposes Authenticatr, a framework that allows applications to use the authentication and peer discovery mechanisms inherent in social networking sites to bootstrap their own authenticated communication channels. We describe motivating applications, detail the interface that Authenticatr exposes to applications, and discuss practical considerations and security threats.","cites":"16","conferencePercentile":"14.28571429"},{"venue":"WOSN","id":"632ad36cd5f42d1e869cd432d35f6d0fcba2eb5e","venue_1":"WOSN","year":"2010","title":"The Effects of Restrictions on Number of Connections in OSNs: A Case-Study on Twitter","authors":"Saptarshi Ghosh, Gautam Korlam, Niloy Ganguly","author_ids":"2407600, 3182677, 8238017","abstract":"Most popular Online Social Networks (OSNs) in today's world, such as Facebook, Orkut and Twitter impose restrictions on the number of friends / connections that a member can have in the network. This is primarily due to two reasons-to limit spam and to reduce the strain on the system due to member-to-all-friends communication. We study the effects of such restrictions on node-degree, on the topological properties of the OSN networks, taking the restriction imposed by Twitter as a case-study. To the best of our knowledge, this is the first study of its nature, on any OSN. Towards this end, we use a network growth model based on preferential attachment to develop an analytical framework that can be used to assess the effects of various forms of restrictions on OSNs, as well as to design new restrictions of varying rigidity.","cites":"5","conferencePercentile":"7.692307692"},{"venue":"WOSN","id":"1f85fba6993a1dbb2da85c751d2f9d6f6d1a3917","venue_1":"WOSN","year":"2010","title":"Don't Tread on Me: Moderating Access to OSN Data with SpikeStrip","authors":"Christo Wilson, Alessandra Sala, Joseph Bonneau, Robert Zablit, Ben Y. Zhao","author_ids":"1682616, 8316792, 5919191, 2110302, 1972108","abstract":"Online social networks rely on their valuable data stores to attract users and produce income. Their survival depends on the ability to protect users' profiles and disseminate it to other users through controlled channels. Given the sparse user adoption of privacy policies, however , there is increasing incentive and opportunity for malicious parties to extract these datasets for profit using automated \" crawlers \" and \" screen-scrapers. \" With the arrival of distributed botnets and low-cost hosted VMs, attackers can perform fast, distributed crawls that evade traditional detectors and rate limiters. We propose SpikeStrip, a server add-on that uses lightweight link encryption to isolate and rate limit crawlers. We experiment with real OSN data, and show that SpikeStrip successfully curtails sophisticated, distributed crawlers while imposing minimal server throughput overhead and inconvenience to end-users.","cites":"7","conferencePercentile":"30.76923077"},{"venue":"WOSN","id":"3871ef9939c6a40b265a3dd0fdbae22ddd62e009","venue_1":"WOSN","year":"2008","title":"Do social networks improve e-commerce?: a study on social marketplaces","authors":"Gayatri Swamynathan, Christo Wilson, Bryce Boe, Kevin C. Almeroth, Ben Y. Zhao","author_ids":"2258139, 1682616, 2312856, 3131174, 1972108","abstract":"Social networks have made a significant impact on how Internet users communicate, search for and share data today. Numerous proposals have been made to improve existing distributed systems by leveraging the inherent trust built into social links. For example, many believe that by augmenting online marketplaces with social networking, we can improve trust between transaction partners and increase user satisfaction. In this paper, we perform a detailed study of Overstock Auctions, an auction site that has recently integrated social links into user profiles. Using data on connections between roughly 400,000 Overstock users, we evaluate the impact of social connections on business transactions. Our results show that while the majority of users do not engage in social networking, those who transact with friends from their social network generally obtain significant benefits in the form of higher user satisfaction.","cites":"8","conferencePercentile":"7.142857143"},{"venue":"WOSN","id":"318da811771e5bfd53be0d1aef318984e64c6da9","venue_1":"WOSN","year":"2009","title":"MobiClique: middleware for mobile social networking","authors":"Anna Kaisa Pietiläinen, Earl Oliver, Jason LeBrun, George Varghese, Christophe Diot","author_ids":"2200078, 2990204, 2383055, 1746289, 1737360","abstract":"We consider a mobile ad hoc network setting where Bluetooth enabled mobile devices communicate directly with other devices as they meet opportunistically. We design and implement a novel mobile social networking middleware named <i>MobiClique</i>. MobiClique forms and exploits ad hoc social networks to disseminate content using a store-carry-forward technique. Our approach distinguishes itself from other mobile social software by removing the need for a central server to conduct exchanges, by leveraging existing social networks to bootstrap the system, and by taking advantage of the social network overlay to disseminate content. We also propose an open API to encourage third-party application development. We discuss the system architecture and three example applications. We show experimentally that MobiClique successfully builds and maintains an ad hoc social network leveraging contact opportunities between friends and people sharing interest(s) for content exchanges. Our experience also provides insight into some of the key challenges and short-comings that researchers face when designing and deploying similar systems.","cites":"120","conferencePercentile":"90"},{"venue":"WOSN","id":"4a4fb1a475f567bf22f1f02727df6be7be7de9db","venue_1":"WOSN","year":"2012","title":"The importance of being placefriends: discovering location-focused online communities","authors":"Chloë Brown, Vincenzo Nicosia, Salvatore Scellato, Anastasios Noulas, Cecilia Mascolo","author_ids":"2913959, 1830342, 1790269, 1718233, 1733840","abstract":"Discovering groups of online friends who go to the same physical places has numerous potential applications including privacy management, friend recommendation, and contact grouping as in Google+ circles. Until recently, little information was available about places visited by users of online social networking services, so community detection on the social graph could not take this into account. With the rise of services such as Foursquare, Gowalla, and Facebook Places, where users <i>check in</i> to named venues and share their location with their friends, we now have the right data to make this possible. In this work, we propose a way to extract place-focused communities from the social graph by annotating its edges with check-in information. Using traces from two online social networks with location sharing, we show that we can extract groups of friends who meet face-to-face, with many possible benefits for online social services.","cites":"9","conferencePercentile":"36.36363636"},{"venue":"WOSN","id":"0925cd176a9eab53f4986d17da1a0a5102970076","venue_1":"WOSN","year":"2008","title":"Characterizing User Mobility in Second Life","authors":"Chi-Anh La, Pietro Michiardi","author_ids":"2685815, 1715270","abstract":"In this work we present a measurement study of user mobility in Second Life. We first discuss different techniques to collect user traces and then focus on results obtained using a crawler that we built. Tempted by the question whether our methodology could provide similar results to those obtained in real-world experiments, we study the statistical distribution of user contacts and show that user mobility in Second Life presents similar traits to those of real humans. We further push our analysis to radio networks that emerge from user interaction and show that they are highly clustered. Lastly, we focus on the spatial properties of user movements and observe that users in Second Life revolve around several points of interest traveling in general short distances.\n Using maximum likelihood estimation, we show that our empirical data best fit to power-law with cutoff distributions, indicating that contact time distributions in a virtual environment has very similar characteristics to those observed in real-world experiments.","cites":"28","conferencePercentile":"35.71428571"},{"venue":"WOSN","id":"9285041939beeb3b90973d4abb51211d00343574","venue_1":"WOSN","year":"2010","title":"Diffusion Dynamics of Games on Online Social Networks","authors":"Xiao Wei, Jiang Yang, Lada A. Adamic, Ricardo Matsumura de Araújo, Manu Rekhi","author_ids":"6190853, 2071053, 1778398, 3018335, 2841448","abstract":"Social games, being embedded in and drawing upon existing social networks, have the potential to spread virally. In this paper, we examine two popular social games, each having millions of Facebook users, to understand the role that users play individually and collectively in propagating social applications. At the individual level, the users' invitation behavior significantly outweighs their demographic and social network properties in predicting invitation success rate. At the collective level, we demonstrate that social games that encourage group formation tend to rapidly integrate dense network cliques. Finally, engagement in a social game is closely tied with the ability to recruit friends.","cites":"11","conferencePercentile":"42.30769231"},{"venue":"WOSN","id":"141f3e49e5ad2cd5691d9ee767b119226f3b4ae8","venue_1":"WOSN","year":"2008","title":"Poking facebook: characterization of osn applications","authors":"Minas Gjoka, Michael Sirivianos, Athina Markopoulou, Xiaowei Yang","author_ids":"2752625, 2698864, 1706319, 1803611","abstract":"Facebook is one of the most popular Internet sites today. A key feature that arguably contributed to Facebook's unprecedented success is its application platform, which enables the development of third-party social-networking applications. Understanding how these applications are installed and used is important for the function and utility of web-based online social networks, e.g. to better engineer them and/or to design advertising campaigns.\n In this paper, we characterize the popularity and user reach of Facebook applications. We analyze application usage data gathered over a period of six months from Facebook and Adonomics - a Facebook analytics service. We also crawl publicly accessible Facebook user profiles and obtain per-user application installation statistics, for approximately 300K users and 13.6K applications. Our findings include that (i) the popularity of Facebook applications has a highly skewed distribution; (ii) although the total number of application installations increases with time, the average user activity decreases; and (iii) users with more applications installed are more likely to install new applications.","cites":"47","conferencePercentile":"57.14285714"},{"venue":"WOSN","id":"0412eaba25a3c44b46191b7f1174a528753a24e5","venue_1":"WOSN","year":"2009","title":"Privacy-enabling social networking over untrusted networks","authors":"Jonathan Anderson, Claudia Díaz, Joseph Bonneau, Frank Stajano","author_ids":"2410054, 3179148, 5919191, 2389090","abstract":"Current social networks require users to place absolute faith in their operators, and the inability of operators to protect users from malicious agents has led to sensitive private information being made public. We propose an architecture for social networking that protects users' social information from both the operator and other network users. This architecture builds a social network out of smart clients and an untrusted central server in a way that removes the need for faith in network operators and gives users control of their privacy.","cites":"43","conferencePercentile":"70"},{"venue":"WOSN","id":"28d59df610b1bc1a5099bf38124a7bcd6500e281","venue_1":"WOSN","year":"2012","title":"Far from the eyes, close on the web: impact of geographic distance on online social interactions","authors":"Andreas Kaltenbrunner, Salvatore Scellato, Yana Volkovich, David Laniado, Dave Currie, Erik J. Jutemar, Cecilia Mascolo","author_ids":"1889171, 1790269, 1782794, 3203785, 2621510, 3343572, 1733840","abstract":"Online friendship connections are often not representative of social relationships or shared interest between users, but merely provide a public display of personal identity. A better picture of online social behaviour can be achieved by taking into account the intensity of communication levels between users, yielding useful insights for service providers supporting this communication. Among the several factors impacting user interactions, geographic distance might be affecting how users communicate with their friends. While spatial proximity appears influencing how people connect to each other even on the Web, the relationship between social interaction and spatial distance remains unexplored.\n In this work we analyse the relationship between online user interactions and geographic proximity with a detailed study of a large Spanish online social service. Our results show that while geographic distance strongly affects how social links are created, spatial proximity plays a negligible role on user interactions. These findings offer new insights on the interplay between social and spatial factors influencing online user behaviour and open new directions for future research and applications.","cites":"16","conferencePercentile":"68.18181818"},{"venue":"WOSN","id":"6053ceff2c58c4c89720b967142daac9dc42103c","venue_1":"WOSN","year":"2010","title":"Orion: Shortest Path Estimation for Large Social Graphs","authors":"Xiaohan Zhao, Haitao Zheng","author_ids":"3000939, 5053008","abstract":"Through measurements, researchers continue to produce large social graphs that capture relationships, transactions , and social interactions between users. Efficient analysis of these graphs requires algorithms that scale well with graph size. We examine node distance computation , a critical primitive in graph problems such as computing node separation, centrality computation, mutual friend detection, and community detection. For large million-node social graphs, computing even a single shortest path using traditional breadth-first-search can take several seconds. In this paper, we propose a novel node distance estimation mechanism that effectively maps nodes in high dimensional graphs to positions in low-dimension Eu-clidean coordinate spaces, thus allowing constant time node distance computation. We describe Orion, a prototype graph coordinate system, and explore critical decisions in its design. Finally, we evaluate the accuracy of Orion's node distance estimates, and show that it can produce accurate results in applications such as node separation , node centrality, and ranked social search.","cites":"29","conferencePercentile":"76.92307692"},{"venue":"WOSN","id":"2891da32932a45f8b14bb95f7e26b5ae9677f430","venue_1":"WOSN","year":"2009","title":"On the evolution of user interaction in Facebook","authors":"Bimal Viswanath, Alan Mislove, Meeyoung Cha, Krishna P. Gummadi","author_ids":"2559642, 1729928, 1775511, 1958921","abstract":"Online social networks have become extremely popular; numerous sites allow users to interact and share content using social links. Users of these networks often establish hundreds to even thousands of social links with other users. Recently, researchers have suggested examining the activity network - a network that is based on the actual interaction between users, rather than mere friendship - to distinguish between strong and weak links. While initial studies have led to insights on how an activity network is structurally different from the social network itself, a natural and important aspect of the activity network has been disregarded: the fact that over time social links can grow stronger or weaker. In this paper, we study the evolution of activity between users in the Facebook social network to capture this notion. We find that links in the activity network tend to come and go rapidly over time, and the strength of ties exhibits a general decreasing trend of activity as the social network link ages. For example, only 30% of Facebook user pairs interact consistently from one month to the next. Interestingly, we also find that even though the links of the activity network change rapidly over time, many graph-theoretic properties of the activity network remain unchanged.","cites":"424","conferencePercentile":"100"},{"venue":"WOSN","id":"1027439a7ed76eddcefad45e6660e71d6ddeef55","venue_1":"WOSN","year":"2008","title":"Characterizing social cascades in flickr","authors":"Meeyoung Cha, Alan Mislove, Ben Adams, Krishna P. Gummadi","author_ids":"1775511, 1729928, 6335691, 1958921","abstract":"Online social networking sites like MySpace and Flickr have become a popular way to share and disseminate content. Their massive popularity has led to the viral marketing of content, products, and political campaigns on the sites themselves. Despite the excitement, the precise mechanisms by which information is exchanged over these networks are not well understood.\n In this paper, we investigate social cascades, or how information disseminates through social links in online social networks. Using real traces of 1,000 popular photos and a social network collected from Flickr, and a theoretical framework borrowed from epidemiology, we show that social cascades are an important factor in the dissemination of content. Our work provides an important first step in understanding how information disseminates in social networks.","cites":"81","conferencePercentile":"71.42857143"},{"venue":"WOSN","id":"590c4a1a8d54a5ff4532616489a6acb1d6775538","venue_1":"WOSN","year":"2009","title":"Privacy, cost, and availability tradeoffs in decentralized OSNs","authors":"Amre Shakimov, Alexander Varshavsky, Landon P. Cox, Ramón Cáceres","author_ids":"1833259, 2635867, 2554943, 2540940","abstract":"Online Social Networks (OSNs) have become enormously popular. However, two aspects of many current OSNs have important implications with regards to privacy: their centralized nature and their acquisition of rights to users' data. Recent work has proposed decentralized OSNs as more privacy-preserving alternatives to the prevailing OSN model. We present three schemes for decentralized OSNs. In all three, each user stores his own personal data in his own machine, which we term a Virtual Individual Server (VIS). VISs self-organize into peer-to-peer overlay networks, one overlay per social group with which the VIS owner wishes to share information. The schemes differ in where VISs and data reside: (a) on a virtualized utility computing infrastructure in the cloud, (b) on desktop machines augmented with socially-informed data replication, and (c) on desktop machines during normal operation, with failover to a standby virtual machine in the cloud when the primary VIS becomes unavailable. We focus on tradeoffs between these schemes in the areas of privacy, cost, and availability.","cites":"37","conferencePercentile":"60"},{"venue":"WOSN","id":"2d7e04e61aab62e37c007c60efdfa05819a8724b","venue_1":"WOSN","year":"2008","title":"Growth of the flickr social network","authors":"Alan Mislove, Hema Swetha Koppula, Krishna P. Gummadi, Peter Druschel, Bobby Bhattacharjee","author_ids":"1729928, 1723948, 1958921, 1736987, 1708336","abstract":"Online social networking sites like MySpace, Orkut, and Flickr are among the most popular sites on the Web and continue to experience dramatic growth in their user population. The popularity of these sites offers a unique opportunity to study the dynamics of social networks at scale. Having a proper understanding of how online social networks grow can provide insights into the network structure, allow predictions of future growth, and enable simulation of systems on networks of arbitrary size. However, to date, most empirical studies have focused on static network snapshots rather than growth dynamics.\n In this paper, we collect and examine detailed growth data from the Flickr online social network, focusing on the ways in which new links are formed. Our study makes two contributions. First, we collect detailed data covering three months of growth, encompassing 950,143 new users and over 9.7 million new links, and we make this data available to the research community. Second, we use a first-principles approach to investigate the link formation process. In short, we find that links tend to be created by users who already have many links, that users tend to respond to incoming links by creating links back to the source, and that users link to other users who are already close in the network.","cites":"161","conferencePercentile":"92.85714286"},{"venue":"WOSN","id":"121e31e095b825a1ff6dc12e5b62a099e7121c43","venue_1":"WOSN","year":"2010","title":"Outtweeting the Twitterers - Predicting Information Cascades in Microblogs","authors":"Wojciech Galuba, Karl Aberer, Dipanjan Chakraborty, Zoran Despotovic, Wolfgang Kellerer","author_ids":"1740364, 1751802, 1738028, 1779291, 1749109","abstract":"Microblogging sites are a unique and dynamic Web 2.0 communication medium. Understanding the information flow in these systems can not only provide better insights into the underlying sociology, but is also crucial for applications such as content ranking, recommendation and filtering, spam detection and viral marketing. In this paper, we characterize the propagation of URLs in the social network of Twitter, a popular microblogging site. We track 15 million URLs exchanged among 2.7 million users over a 300 hour period. Data analysis uncovers several statistical regularities in the user activity, the social graph, the structure of the URL cascades and the communication dynamics. Based on these results we propose a propagation model that predicts which users are likely to mention which URLs. The model correctly accounts for more than half of the URL mentions in our data set, while maintaining a false positive rate lower than 15%.","cites":"103","conferencePercentile":"100"},{"venue":"WOSN","id":"1cb405a023af8cf9004d570b70cd6fa655efb77a","venue_1":"WOSN","year":"2012","title":"Inferring who-is-who in the Twitter social network","authors":"Naveen Kumar Sharma, Saptarshi Ghosh, Fabrício Benevenuto, Niloy Ganguly, Krishna P. Gummadi","author_ids":"2050683, 2407600, 2810330, 8238017, 1958921","abstract":"In this paper, we design and evaluate a novel who-is-who service for inferring attributes that characterize individual Twitter users. Our methodology exploits the Lists feature, which allows a user to group other users who tend to tweet on a topic that is of interest to her, and follow their collective tweets. Our key insight is that the List meta-data (names and descriptions) provides valuable semantic cues about who the users included in the Lists are, including their topics of expertise and how they are perceived by the public. Thus, we can infer a user's expertise by analyzing the meta-data of crowdsourced Lists that contain the user. We show that our methodology can accurately and comprehensively infer attributes of millions of Twitter users, including a vast majority of Twitter's influential users (based on ranking metrics like number of followers). Our work provides a foundation for building better search and recommendation services on Twitter.","cites":"27","conferencePercentile":"100"}]}