{"WoSQICSE.csv":[{"venue":"WoSQ@ICSE","id":"8d934c57fa8263a7e44a90542f8ac0d51e410341","venue_1":"WoSQ@ICSE","year":"2005","title":"QFD application in software process management and improvement based on CMM","authors":"Xiaoqing Frank Liu, Yan Lindsay Sun, Gautam Kane, Yuji Kyoya, Kunio Noguchi","author_ids":"1687294, 6083084, 2570877, 1721281, 2182139","abstract":"Capability Maturity Model (CMM) from Software Engineering Institute has been used successfully by many organizations for software process improvement. However, there exists a disconnection between business goals and maturity levels. A new framework using Quality Function Deployment (QFD) is developed to deal with this problem. This framework serves three purposes: (1) it provides a connection between business requirements and CMM; (2) it proposed a methodology for the priority assessment of requirements from multiple perspectives; and (3) it helps identify a set of software process improvement actions based on business requirements and CMM.","cites":"6","conferencePercentile":"59.09090909"},{"venue":"WoSQ@ICSE","id":"e2a815cd4f182e8ea48981d87b110ba13f9c862d","venue_1":"WoSQ@ICSE","year":"2007","title":"Specification of Non-functional Requirements for Contract Specification in the NGOSS Framework for Quality Management and Product Evaluation","authors":"Xiaoqing Frank Liu, Manooch Azmoodeh, Nektarios Georgalas","author_ids":"1687294, 2841563, 1732833","abstract":"The community of Operation Support Systems (OSS) for telecom applications defined a set of fundamental principles, processes, and architectures for developing the Next Generation OSS through the TeleManagement Forum TMF. At the heart of NGOSS lies the notion of a \"Contract\" which embodies the specification of services offered by an OSS component for quality management and product evaluation. However, TMF does not provide any method (or process) for specification of the non-functional part in the NGOSS contract specification. In this paper, we develop a systematic approach for specifying non-functional requirements of telecom OSS applications for contracts in the NGOSS framework for quality management and evaluation. Specifically, two categories of non-functional specification techniques are explored: qualitative and quantitative. Furthermore, we introduce two quantitative non-functional requirements specification methods: crisp and elastic to expand the capability of the current NGOSS contract specification method since only qualitative non-functional specification is currently available from TMF.","cites":"8","conferencePercentile":"60"},{"venue":"WoSQ@ICSE","id":"1cd3ba9f6434b3642c039fb69982fd5150163d62","venue_1":"WoSQ@ICSE","year":"2008","title":"An effort and time based measure of usability","authors":"Dan E. Tamir, Oleg V. Komogortsev, Carl J. Mueller","author_ids":"2991004, 1778350, 1978721","abstract":"The hypothesis of this research is that usability relates to the physical effort that is required in order to use software in the accomplishment of interactive tasks. Implications of this hypothesis are significant since effort is an objective quantity that can be measured efficiently in a relatively non-expensive and non-invasive fashion. Based on this hypothesis, this work proposes metrics for measuring operability, learnability, and understandability.\n Usability testing is an essential element of a robust validation process. Nevertheless, evaluating software usability is an expensive and time consuming activity, frustrating both developers and managers. Developers are frustrated because it is a critical part of their work; yet, they do not have solid information on how to address it. Managerial frustration lies in the fact that correcting usability defects is an iterative process, and the amount of preparation required can significantly delay a project. Hence, wider utilization of usability testing requires reducing the cost and simplifying the approach.\n This paper proposes a framework for measuring effort and using the effort measurements to assess usability. The framework has two main components: One bases effort on keystrokes and mouse usage; the second uses a model of the eye muscles along with eye-movement tracking to estimate eye effort. The two components are independent, but they could be used in tandem. Tracking time and effort may not be as precise an evaluation of usability. Nevertheless, it can provide a good screening tool to reduce development cost.","cites":"12","conferencePercentile":"90.90909091"}]}