{"WoT.csv":[{"venue":"WoT","id":"23bbd22fee3d3fe0bbddda65a59eccd107d8a0aa","venue_1":"WoT","year":"2012","title":"Third International Workshop on the Web of Things (WoT 2012)","authors":"Simon Mayer, Dominique Guinard, Erik Wilde","author_ids":"1889586, 1800797, 7149138","abstract":"Continuing the successful Web of Things workshop series, the goal of this workshop is to further explore the use of technologies and principles at the core of the Web to provide methods for a seamless integration of physical devices. In particular, our goal is to foster discussion on systems towards a real-time Web of Things and the discovery, search, and composition of services provided by Web-enabled things. This document contains all submissions to WoT 2012 that were accepted after a double-blind peer-reviewing process and cover current research in the fields of Web-based service discovery and semantic descriptions, case studies and toolkits for the Web of Things, and architectures that demonstrate the possibilities which arise when combining Web patterns and technologies with metadata and machine learning approaches to create smart environments.","cites":"1","conferencePercentile":"37.5"},{"venue":"WoT","id":"1114b866226338eb71d2eefc717d6af13617a364","venue_1":"WoT","year":"2011","title":"An extensible discovery service for smart things","authors":"Simon Mayer, Dominique Guinard","author_ids":"1889586, 1800797","abstract":"We present DiscoWoT, a semantic discovery service for Web-enabled smart things. The service is based on the application of multiple <i>Discovery Strategies</i> to a Web resource's representation, where arbitrary users can create and update strategies at runtime using DiscoWoT's RESTful interface. Its goal is to provide a future-proof mechanism for enabling both, human users and machines, to semantically discover functionality provided by Web-enabled devices. Ultimately, it aims to allow for the facilitated discovery, selection, and utilization of smart things. DiscoWoT incorporates a transparent mechanism for deferring resource discovery to external handlers and can thus interact with other services within discovery service federations. It may be accessed by arbitrary users for ad hoc discovery of functionality offered by Web resources or incorporated into infrastructures for Web-enabled smart things.","cites":"21","conferencePercentile":"100"},{"venue":"WoT","id":"09638ec70c86e97d8d6c47c31e9a0c43e4245b10","venue_1":"WoT","year":"2014","title":"From Load Forecasting to Demand Response - A Web of Things Use Case","authors":"Yong Ding, Martin Alexander Neumann, Ömer Kehri, Geoff Ryder, Till Riedel, Michael Beigl","author_ids":"4433183, 2270723, 3067682, 2360002, 1763678, 1692616","abstract":"This paper provides a Web of Things use case from a personalized load forecasting service to a gamified demand response program. Combining real-world measuring applications with web-based applications opens new opportunities to the smart grid. For this purpose, we propose a Web of Things framework for a novel load forecasting process at the appliance level. Firstly, we illustrate the concept design of the Web of Things framework consisting of the sensing infrastructure, the activity recognition and the load forecasting modules. Secondly, we show how we guarantee the modularity and flexibility for implementing all the three modules in a web-based manner. On top of our infrastructure, we propose an extended Web of Things use case by integrating our load forecasting approach into a demand response concept.","cites":"0","conferencePercentile":"35.71428571"},{"venue":"WoT","id":"9d7c25a31a8f1490bef41d5e4033484c2eb2633c","venue_1":"WoT","year":"2012","title":"WoTKit: a lightweight toolkit for the web of things","authors":"Michael Blackstock, Rodger Lea","author_ids":"2586198, 2409890","abstract":"In this position paper, we discuss our experiences with a lightweight Web of Things (WoT) toolkit and use those experiences to explore what an effective WoT toolkit looks like. We argue that while the WoT community has experimented, like us, with a variety of toolkits, it hasn't yet found one that appeals sufficiently to a broad range of developers. This failure, we believe, is hindering the adoption of the WoT and the growth of the community. We conclude the paper with a set of open questions, which, although not exhaustive, are aimed at opening up a community discussion on the needs of developers and how best the community can meet those needs and so further the adoption of the WoT. In essence, we believe that the time may be right to begin to agree on some basic functionality and approaches to WoT toolkits.","cites":"7","conferencePercentile":"93.75"},{"venue":"WoT","id":"35abcbe5e5f3eaa2d2efbd150395eac513724120","venue_1":"WoT","year":"2011","title":"A distributed resource management architecture for interconnecting Web-of-Things using uBox","authors":"Naoya Namatame, Yong Ding, Till Riedel, Hideyuki Tokuda, Takashi Miyaki, Michael Beigl","author_ids":"2509195, 4433183, 1763678, 1700496, 2279502, 1692616","abstract":"Although there are many smart devices and networked embedded object applications using World Wide Web technologies, it is still a big step to go towards a true Web of Things. It is e.g. difficult to build ubiquitous WoT applications that work in and accross multiple environments. Approaches which aggregate WoT ressources by centralizing all the resource information, have problems: total dependency on external infrasture, lack of private WoT management, inflexible communication patterns and limited dynamic ressource discovery and mapping. To solve these problems, we propose <i>uBox</i>, a local WoT platform which can be a stand-alone server to make your WoT environment, with interfaces to connect the other local WoT platforms. This way, which we call <i>uBoXing</i>, we can create World Wide WoT platform with a distributed architecture. This paper describes the concept of a distributed resource management architecture, and how we implement the concept into software. Also, we will discuss the platform with the example application in SmartTecO environment.","cites":"4","conferencePercentile":"50"},{"venue":"WoT","id":"383d2e471901b8cb424c06887b6094a80dd6fb0c","venue_1":"WoT","year":"2011","title":"Uniting online social networks with places and things","authors":"Michael Blackstock, Rodger Lea, Adrian Friday","author_ids":"2586198, 2409890, 8133498","abstract":"As the Web of Things (WoT) broadens real world interaction via the internet, there is an increasing need for a user centric model for managing and interacting with real world objects. We believe that online social networks can provide that capability and can enhance existing and future WoT platforms leading to a <i>Social WoT</i>. As both social overlays and user interface containers, online social networks (OSNs) will play a significant role in the evolution of the web of things. As user interface containers and social overlays, they can be used by end users and applications as an on-line entry point for interacting with things, both receiving updates from sensors and controlling things. Conversely, access to user identity and profile information, content and social graphs can be useful in physical social settings like caf&#233;s. In this paper we describe some of the key features of social networks used by existing social WoT systems. We follow this with a discussion of open research questions related to integration of OSNs and how OSNs may evolve to be more suitable for integration with places and things. Several ongoing projects in our lab leverage OSNs to connect places and things to online communities.","cites":"12","conferencePercentile":"84.61538462"},{"venue":"WoT","id":"13c6916cd8ac35a47976986d06379ec69de3e413","venue_1":"WoT","year":"2011","title":"Second International Workshop on the Web of Things (WoT 2011)","authors":"Dominique Guinard, Vlad Trifa, Erik Wilde","author_ids":"1800797, 8163667, 7149138","abstract":"The Web of Things community explores how to extend the <i>Internet of Things</i> vision to the <i>World Wide Web</i>. This requires to look beyond establishing mere connectivity, and address the specific issues of loose coupling, massive scalability and heterogeneity in the context of pervasive computing. Specifically, the goal of the second International Workshop on the Web of Things (WoT 2011) is to look at the problems and research issues that can be identified when thinking \"out of the box\" of most pervasive computing applications, which often assume a homogeneous and centrally managed infrastructure that supports some specific applications scenario. Looking at the Web level, it becomes necessary to consider new constraints and design issues. While certain scenarios might not map well to Web concepts, the opportunities and economies of scale available at Web scale make it very interesting to carefully examine how to eventually build a fully functioning and performant \"Web of Things\".","cites":"1","conferencePercentile":"23.07692308"},{"venue":"WoT","id":"4d1439c66b9604e7b737b03fa7c316a03ef3a71e","venue_1":"WoT","year":"2014","title":"Virtual Things for Machine Learning Applications","authors":"Gérôme Bovet, Antonio Ridi, Jean Hennebert","author_ids":"1719747, 1842828, 1722800","abstract":"Internet-of-Things (IoT) devices, especially sensors are producing large quantities of data that can be used for gathering knowledge. In this field, machine learning technologies are increasingly used to build versatile data-driven models. In this paper, we present a novel architecture able to execute machine learning algorithms within the sensor network, presenting advantages in terms of privacy and data transfer efficiency. We first argument that some classes of machine learning algorithms are compatible with this approach, namely based on the use of generative models that allow a distribution of the computation on a set of nodes. We then detail our architecture proposal, leveraging on the use of Web-of-Things technologies to ease integration into networks. The convergence of machine learning generative models and Web-of-Things paradigms leads us to the concept of virtual things exposing higher level knowledge by exploiting sensor data in the network. Finally, we demonstrate with a real scenario the feasibility and performances of our proposal.","cites":"0","conferencePercentile":"35.71428571"},{"venue":"WoT","id":"825a7a2530b4ed88d0844f9721670d53bb4b009a","venue_1":"WoT","year":"2014","title":"A Scalable Cloud Storage for Sensor Networks","authors":"Gérôme Bovet, Gautier Briard, Jean Hennebert","author_ids":"1719747, 3106697, 1722800","abstract":"Data storage has become a major topic in sensor networks as large quantities of data need to be archived for future processing. In this paper, we present a cloud storage solution benefiting from the available memory on smart things becoming data nodes. In-network storage reduces the heavy traffic resulting of the transmission of all the data to an outside central sink. The system built on agents allows an autonomous management of the cloud and therefore requires no human in the loop. It also makes an intensive use of Web technologies to follow the clear trend of sensors adopting the Web-of-Things paradigm. Further, we make a performance evaluation demonstrating its suitability in building management systems.","cites":"0","conferencePercentile":"35.71428571"},{"venue":"WoT","id":"2aab08e3e4f25d8c81cc84a3c71a4ccd796c048e","venue_1":"WoT","year":"2011","title":"Towards modeling real-world aware business processes","authors":"Sonja Meyer, Klaus Sperner, Carsten Magerkurth, Jacques Pasquier-Rocha","author_ids":"3069770, 3201789, 1711753, 3119359","abstract":"In this paper we aim at bringing together the Web of Things (WoT) domain with the domain of enterprise business process modeling in order to work towards a Future Internet that includes all layers of networked technology stacks. We suggest introducing new notation concepts to the current business process modeling standards to facilitate modeling WoT aware business processes. We obtain and classify known WoT specific properties of real-world business processes. By means of a sensor based case study we analyze existing business process modeling standards such as Business Process Modeling and Notation (BPMN), Web Service Business Process Execution Language (WSBPEL), Extended Event-driven Process Chain (eEPC) and Unified Modeling Language (UML) in order to extract WoT specific process properties. A final evaluation concludes with the current most fitting process notation for modeling real world processes using WoT technology and suggests extending established approaches by including WoT specific aspects.","cites":"10","conferencePercentile":"73.07692308"},{"venue":"WoT","id":"007d71c507bbad01b874e82cb7729f269e2bee89","venue_1":"WoT","year":"2014","title":"Semantic Web Based Context-Adaptable Generation of Product Specific Documentation","authors":"Andrei Miclaus, Till Riedel, Jack Unseld, Michael Beigl","author_ids":"2047311, 1763678, 2130731, 1692616","abstract":"As users and developers have started to put the Internet of Things to good use, the approach of documenting applications has not evolved to handle the created complexity. As items, devices and systems become more customizable and adapted to their users, their documentation still lags behind. In particular, documentation covering the contextual behaviour and specific configuration of artifacts is needed.\n We design a system that leverages semantic web technologies to create smart documentation on the basis of model based system descriptions and heterogeneous data sources, which are needed to create valuable and up-to-date documentation.\n Based on two scenarios we show the benefits for both the development cycle and the user experience of Web of Things applications. The paper presents a mashup of Internet of Things, model driven development, semantic web and HTML5 MVC technologies for generating context-sensitive documentation.","cites":"1","conferencePercentile":"71.42857143"},{"venue":"WoT","id":"34398081c5675e6390818877cc727c9256aa9c0d","venue_1":"WoT","year":"2011","title":"PalimPost: information convergence using sticky notes","authors":"Li Bian, Roy Shilkrot","author_ids":"6386594, 2509354","abstract":"In today's world, the digital information retrieval experience is inherently a sparse device-centric activity. Users rely on the ability of the currently used device to supply the requested information, in some disconnection from past activities on other devices. There is a growing need to develop new methods of connecting cross-context information retrieval sessions. We present PalimPost, a converged system for storing, searching, and sharing digital and physical world information using sticky notes and mobile devices. PalimPost extracts contextual cues from a user's physical environment and activities, and connects them to the user's digital world research. Subsequently, the system presents systematically categorized information that is relevant to the moment of interaction in a just-in-time manner. PalimPost uses physical sticky notes with embedded QR codes, as well as virtual sticky notes on mobile devices. The system incorporates Automatic Speech Recognition (ASR), Optical Character Recognition (OCR), and Natural Language Processing (NLP) techniques for understanding and categorizing the content.","cites":"0","conferencePercentile":"11.53846154"},{"venue":"WoT","id":"672792778a9888237de14bcba1b8cc0022a7208c","venue_1":"WoT","year":"2011","title":"Cloud computing, REST and Mashups to simplify RFID application development and deployment","authors":"Dominique Guinard, Christian Floerkemeier, Sanjay E. Sarma","author_ids":"1800797, 2162307, 1934849","abstract":"While of increasing importance for the real-time enterprise, deployments of Internet of Things infrastructures such as RFID remain complex and expensive. In this paper, we illustrate these challenges by studying the applications of the EPC Network which is an RFID standards framework that aims to facilitate interoperability and application development. We show how the use of blueprints that were successful on the Web can help to make the adoption of these standards less complex. We discuss in particular how Cloud Computing, RESTful interfaces, Real-time Web (Websockets and Comet) and Web 2.0 Mashups can simplify application development, deployments and maintenance in a common RFID application. Our analysis also illustrates that RFID/EPC Network applications are an excellent playground for Web of Things technologies and that further research in this field can significantly contribute to making real-world applications less complex and cost-intensive.","cites":"10","conferencePercentile":"73.07692308"},{"venue":"WoT","id":"6ebc9eb3d5c21fa0ad770941e2d912b1b7e9f356","venue_1":"WoT","year":"2012","title":"A computational space for the web of things","authors":"Simon Mayer, David S. Karam","author_ids":"1889586, 2521731","abstract":"The expansion of the World Wide Web to include information that is generated by physical devices with embedded sensing and actuation capabilities entails a surge of high-frequency real-time data that is mostly published without further processing in its raw form. To derive \"smart\" decisions from this data and thus use it to enable a \"smart world\" requires the distilling of more abstract, higher-level knowledge from it. In this paper, we propose the concept of a <i>computational marketplace</i> as a framework to enable the analysis and aggregation of real-time data. Here, multiple tiers of hyperlinked algorithms from different providers interact to refine data within computational graphs, which are linked structures of cascaded processing steps. We present an analysis of the key constraints on such a framework and provide a corresponding implementation as well as results from evaluations in an experimental use case scenario.","cites":"5","conferencePercentile":"75"},{"venue":"WoT","id":"88a118d389833f9437431188c2561e9f1b9ea26e","venue_1":"WoT","year":"2015","title":"IndianaJS: Building spatially aware web sites for the Web of Things","authors":"Andrei Miclaus, Jack Unseld, Alexandru Miclaus, Matthias Berning, Till Riedel, Michael Beigl","author_ids":"2047311, 2130731, 2164571, 2142880, 1763678, 1692616","abstract":"While almost any device today may have a virtual representation, the web itself is not yet a very physical experience. Bringing proven spatial interaction and ubiquitous computing paradigms to life using current web technology, we designed IndianaJS, a JavaScript framework to add a physical browsing experience to any Web of Things content. The evaluation of the IoT-Radar, built on top of our library, shows that web-based hyper-reality can still achieve a unique user experience 15 years after the first implementations.","cites":"0","conferencePercentile":"62.5"},{"venue":"WoT","id":"7bdc5baa1207aee13fe186d62214f483b6d290a9","venue_1":"WoT","year":"2014","title":"Toward a Distributed Data Flow Platform for the Web of Things (Distributed Node-RED)","authors":"Michael Blackstock, Rodger Lea","author_ids":"2586198, 2409890","abstract":"Several web-based platforms have emerged to ease the development of interactive or near real-time IoT applications by providing a way to connect things and services together and process the data they emit using a data flow paradigm. While these platforms have been found to be useful on their own, many IoT scenarios require the coordination of computing resources across the network: on servers, gateways and devices themselves. To address this, we explore how to extend existing IoT data flow platforms to create a system suitable for execution on a range of run time environments, toward supporting distributed IoT programs that can be partitioned between servers, gateways and devices. Eventually we aim to automate the distribution of data flows using appropriate distribution mechanism, and optimization heuristics based on participating resource capabilities and constraints imposed by the developer.","cites":"3","conferencePercentile":"85.71428571"},{"venue":"WoT","id":"d8f5e4f26a1969120eb499231e4c463f1df9f692","venue_1":"WoT","year":"2014","title":"WoT 2014: Fifth International Workshop on the Web of Things","authors":"Simon Mayer, Dominique Guinard, Vlad Trifa, Erik Wilde","author_ids":"1889586, 1800797, 8163667, 7149138","abstract":"The Web of Things is about extending the Internet of Things concept beyond the connection of things and considering issues like heterogeneity, scalability, and usability with respect to pervasive computing. The goal of this initiative is to reuse the architectural principles that made the Web successful and apply them to smart devices, thereby making real-world objects first-class citizens of the Web. The approach taken by the Web of Things initiative is to look at the problems and research issues that emerge when considering the interaction of heterogeneous devices within composite applications. Continuing the successful Web of Things workshop series, this workshop aims at further exploring the use of technologies and principles at the core of the Web to provide methods for a seamless integration of physical devices. In particular, our goal is to foster discussion on systems towards a real-time Web of Things and the discovery, search, and composition of services that are provided by Web-enabled devices.","cites":"0","conferencePercentile":"35.71428571"},{"venue":"WoT","id":"2aef88c549f709089a34ea361ced4ecdfbabf442","venue_1":"WoT","year":"2011","title":"Connecting things to the web using programmable low-power WiFi modules","authors":"Benedikt Ostermaier, Matthias Kovatsch, Silvia Santini","author_ids":"1788937, 2269570, 1827246","abstract":"We present first experiences of using programmable low-power WiFi modules for connecting things directly to the Web. Instead of relying on dedicated low-power radio technology and specialized protocols, we leverage the ubiquity of IEEE 802.11 access points and the interoperability of the HTTP protocol. Using a loosely coupled approach, we enable seamless association of sensors, actuators, and everyday objects with each other and with the Web. Our experimental results show that low-power WiFi modules can achieve long battery lifetime despite the fact that we are using HTTP over TCP/IP for communication.","cites":"15","conferencePercentile":"92.30769231"},{"venue":"WoT","id":"705f802e4dae2238037755389319ce7f338737e0","venue_1":"WoT","year":"2015","title":"Enabling reactive cities with the iFLUX middleware","authors":"Olivier Liechti, Laurent Prévost, Valentin Delaye, Jean Hennebert, Vincent Grivel, Jean-Philippe Rey, Jonathan Depraz, Marc Sommer","author_ids":"3199753, 3100142, 2468792, 1722800, 2548556, 8101169, 2313344, 5095694","abstract":"This paper presents the iFLUX middleware, designed to provide a lightweight integration solution for Smart City applications. Based on three core abstractions, namely event sources, action targets and rules, iFLUX makes it very easy to expose sensors and actuators through REST APIs so that they can be integrated in application-level workflows. Sensors and actuators can be smart objects integrating hardware and software, but can also be pure software services. In the paper, we introduce the iFLUX programming model and describe how it has been implemented in a middleware platform. We also report on how the platform has been used and evaluated in various contexts. While iFLUX has been initially designed in the context of Smart City applications, it is generic and applicable to other domains where hardware and software components are connected through the Web.","cites":"0","conferencePercentile":"62.5"}]}