{"Wound_repair_and_regeneration__":[{"venue":"Wound repair and regeneration : official publication of the Wound Healing Society [and] the European Tissue Repair Society","id":"eee4de4bab33485d306cffe0e2f585f4762af1dc","venue_1":"Wound repair and regeneration : official publication of the Wound Healing Society [and] the European Tissue Repair Society","year":"2010","title":"Novel noninvasive identification of biomarkers by analytical profiling of chronic wounds using volatile organic compounds.","authors":"Alexis N Thomas, Svetlana Riazanskaia, William Cheung, Yun Xu, Royston Goodacre, C L Paul Thomas, Mohamed S Baguneid, Ardeshir Bayat","author_ids":"2051703, 5729905, 4022080, 6476924, 2536329, 8722082, 6261431, 5878331","abstract":"A complex profile of volatile organic compounds (\"VOC\"s) emanates from human skin, which is altered by changes in the body's metabolic or hormonal state, the external environment, and the bacterial species colonizing the skin surface. The aim of this study was to compare VOC profiles sampled from chronic leg wounds with those from asymptomatic skin. Five participants with chronic arterial leg ulcers were selected. VOC samples were obtained using polydimethylsilicone membranes (\"skin-patch method\") and analyzed by gas chromatography-ion trap mass spectrometry. Resultant data were analyzed using multivariate analysis and mass spectral matches were compared against the National Institute of Standards and Technology database. Principal component analysis showed differences in profiles obtained from healthy skin and boundary areas and between profiles from healthy skin and lesion samples (p<0.05). Partial least squares for discriminant analysis gave an average prediction accuracy of 73.3% (p<0.05). Mass spectral matching (verified against microbial swab results) identified unique VOCs associated with each sample area, wound bacterial colonization, and ingested medications. This study showcases a reproducible, robust, noninvasive methodology that is applicable in a clinical setting and may offer a new, hitherto unexplored, class of biochemical markers underpinning the metabolism of chronic wounds.","cites":"4","conferencePercentile":"100"}]}