{"WOWMOM.csv":[{"venue":"WoWMoM","id":"b1e55755cbbff11531ff9a6d7a12170fd31d67d2","venue_1":"WoWMoM","year":"2016","title":"Have you asked your neighbors? A Hidden Market approach for device-to-device offloading","authors":"Dimitris Chatzopoulos, Mahdieh Ahmadi, Sokol Kosta, Pan Hui","author_ids":"8608653, 2873311, 2756005, 2665582","abstract":"—During the last years, researchers have proposed solutions to help smartphones offload heavy tasks to remote entities in order to improve execution time and reduce energy consumption. Lately, inspired by the promising results of message forwarding in op-portunistic networks, many researchers have proposed strategies for task offloading towards nearby mobile devices. None of these strategies, though, proposes any mechanism that considers selfish users and, most importantly, that motivates and defrays the participating devices who spend their resources. In this paper, we address these problems and propose the design of a framework that integrates an incentive scheme and a reputation mechanism. Our proposal follows the principles of the Hidden Market Design approach, which allows users to specify the amount of resources they are willing to \"sacrifice\" when participating in the offloading system. The underlying algorithm, that users are not aware of, is based on a truthful auction strategy and a peer-to-peer reputation exchange scheme. Extensive simulations on real traces depict how our designed mechanism achieves higher offloading rate and produces less traffic compared to three benchmark algorithms. Finally, we show how collaborating devices get rewarded for their contribution, while selfish ones get sidelined by others.","cites":"2","conferencePercentile":"95.45454545"},{"venue":"WoWMoM","id":"0fb62d96cf00acc80768b3cbe056b6ba13bb0fb2","venue_1":"WoWMoM","year":"2014","title":"Energy-aware adaptive security management for wireless sensor networks","authors":"Ethiopia Nigussie, Antti Hakkala, Seppo Virtanen, Jouni Isoaho","author_ids":"1693623, 1922859, 2829227, 1696147","abstract":"—We present a work in progress of an adaptive security management scheme for wireless sensor networks. The unique characteristics of these networks place great demands on their design and operation in terms of resource and security management. Resource and security adaptability achieved through self-and context-awareness will take the feasibility of the networks to a new level. The scheme has self-and context-awareness in addition to a holistic view of security services at each layer of the communication stack. It uses distributed agents and intrusion detection systems to monitor the security threats and then dynamically adapts its security level by jointly considering several dimensions. This translates into optimal security-energy under a given resource and context. The key dimensions are energy budget, computing power and memory size of nodes, location-based security threat levels, data coherence, and data lifetime. Trust management is used to test the integrity of untrusted nodes which further assist the adaptation decision.","cites":"0","conferencePercentile":"15.95744681"},{"venue":"WoWMoM","id":"715b321526a0069f2aba322fa06dbad6a8c1463f","venue_1":"WoWMoM","year":"2014","title":"ISA100.11a∗: The ISA100.11a extension for supporting energy-harvested I/O devices","authors":"Pouria Zand, Emi Mathews, Kallol Das, Arta Dilo, Paul J. M. Havinga","author_ids":"1829109, 2482657, 3252927, 1688726, 1679046","abstract":"—Wireless standards developed for industrial applications such as ISA100.11a and WirelessHART, generally use centralized management approaches. However, such centralized approaches cannot cope with network dynamicity in real-time manner. They also incur high management overhead and latency. Consequently, the network becomes unsuitable for resource constraint devices, e.g I/O devices. The problems become exacerbated when the network scales up. ISA100.11a standard allows reduced functionality devices in the network and supports hybrid network topology. We propose an extension to ISA100.11a to better address the requirements of the energy constrained I/O devices. The proposed extension makes the management more decentralized by delegating a part of the management responsibility to the routers in the network. It also allows the I/O devices to choose their best routers according to the metric considered using local statistics and advertised routers' ranks. We show that the proposed extension can better address the real-time and reliability requirements of industrial wireless networks. It can achieve higher network management efficiency in terms of reducing the delay and overhead of I/O devices than the ISA100.11a standard. I. INTRODUCTION Wireless standards developed for condition monitoring and process control applications have increasingly gained the confidence of industry and their adoption has increased over the last few years. Most of these applications expect the wireless sensor/actuators (I/O devices) to work for long durations of time without maintenance. To facilitate such working conditions , energy-harvested I/O devices with or without additional power sources are becoming popular. The availability of harvested energy typically varies over time in a non-deterministic manner. With today's energy harvesters, only a few wireless transmission/receptions per reporting cycle of the I/O devices are feasible [1]. This calls for the design of efficient wireless communication protocols suitable for industrial environments. ISA100.11a [2] and WirelessHART [3] are two of the most important standards accepted by the industry. In wireless networks, typical network topologies are either star networks, mesh networks or hybrid networks (a combination of star and mesh). In WirelessHART, all field devices are considered to have routing capability to support full mesh topology. On the other hand, the I/O devices in the ISA100.11a network can be defined as nodes with or without routing capability. It thus supports both star, mesh and hybrid topology. As the harvester-powered I/O devices have severe constraints on resources, especially energy, it is advisable to make them non-routing (end devices) in the network. Hence, the hybrid network topology supported by ISA100.11a …","cites":"1","conferencePercentile":"51.06382979"},{"venue":"WoWMoM","id":"ba9a40dab47f7e8f391993ecfda40c69d1c1fef7","venue_1":"WoWMoM","year":"2014","title":"Temporal Synchronization Scheme in live 3D video streaming over IEEE 802.11 wireless networks","authors":"Yohaan Yoon, Myungchul Kim, Ben Lee, Kyungmin Go","author_ids":"3346340, 1806505, 1708098, 1755233","abstract":"—Although 3D video has become popular, streaming over wireless network faces a number of challenges. Due to frequent frame losses in wireless networks, temporal asynchrony occurs and results in serious visual fatigue for viewers. In order to provide better quality of 3D video, this paper proposes a new scheme called the Temporal Synchronization Scheme (TSS) for live 3D video streaming over wireless networks. TSS delivers video frames for the left and right views in the same frame order with the same transmission priority and compensates for frame damage and loss during the decoding phase. In addition, a new metric called the Stereoscopic Temporal Variation Index (STVI) is proposed to measure the degree of temporal asynchrony in 3D video. Subjective assessments demonstrate that STVI is an objective metric for measuring subjective quality. Moreover, our study shows that the proposed scheme results in better 3D video quality than the conventional method in terms of STVI and MOS. Keywords—3D video steaming; temporal synchronization in 3D video; 3D video quality assessment; IEEE 802.11 wireless networks","cites":"0","conferencePercentile":"15.95744681"},{"venue":"WoWMoM","id":"72ac9b6135966256fd3c60b456b9bd7ccdd26ee4","venue_1":"WoWMoM","year":"2014","title":"Temporal random walk as a lightweight communication infrastructure for opportunistic networks","authors":"Victor Ramiro, Emmanuel Lochin, Patrick Sénac, Thierry Rakotoarivelo","author_ids":"1793927, 1703113, 1678583, 1946623","abstract":"Temporal random walk as a lightweight communication infrastructure for opportunistic networks. OATAO is an open access repository that collects the work of Toulouse researchers and makes it freely available over the web where possible. Abstract—This paper explores the idea of sharing a common storage unit (token) as a lightweight communication infrastructure for opportunistic networks. Instead of using contacts as opportunities to transfer messages, we use them to pass the token over time. We implement a Temporal Random Walk (TRW) process to support such evolution. Sending a message is equivalent to copying it in the token and passing the token to a connected node. Eventually the recipient node will get the token and all its addressed messages. We study our approach using both synthetic and real traces. We show that it can be equivalent to common routing strategies in terms of delivery ratio and delay. I. INTRODUCTION Opportunistic networks assume that all nodes in the network may interact using their contacts as a communication opportunity [1], [2]. The store-carry-forward paradigm allows nodes to exploit such contacts to effectively deliver messages over time. In real life social networks, we are often unable to transmit data even if two parties are in contact. The different device technologies or even the use of different routing algorithms may prevent opportunistic communications. So we raise the question: can we design a mobile and opportunistic infrastructure that could help deliver messages? We explore the idea and impact of such a minimal and non invasive infrastructure. Experiments have studied and characterized opportunistic networks in real life scenarios [3], [4]. For instance, let us consider an academic conference where attendees want to share data with other attendees. WiFi access is often scarce, saturated or simply non existent in conferences. Is it still possible to share data in that scenario? The store-carry-forward message diffusion proposes a solution for such cases: when two parties are in contact (defined by a connection range) they can share data. Nevertheless, this assumes that both parties either have a specific device or understand the same protocol to actually profit from the contact opportunity. Even with today's smartphone revolution, such a solution can be cumbersome due to lack of connection, complexity to interconnect mobile devices, or different routing protocols. The easiest solution to transfer data could be using a USB key (often provided to each participant) to copy and pass messages among attendees. We extend this …","cites":"2","conferencePercentile":"76.59574468"},{"venue":"WoWMoM","id":"e9d6d59b1b2526b3bebe362dcca0879e6a7b9ae0","venue_1":"WoWMoM","year":"2014","title":"A distributed web-based naming system for smart buildings","authors":"Gérôme Bovet, Jean Hennebert","author_ids":"1719747, 1722800","abstract":"—Nowadays, pervasive application scenarios relying on sensor networks are gaining momentum. The field of smart buildings is a promising playground where the use of sensors allows a reduction of the overall energy consumption. Most of current applications are using the classical DNS which is not suited for the Internet-of-Things because of requiring humans to get it working. From another perspective, Web technologies are pushing in sensor networks following the Web-of-Things paradigm advocating to use RESTful APIs for manipulating resources representing device capabilities. Being aware of these two observations, we propose to build on top of Web technologies leading to a novel naming system that is entirely autonomous. In this work, we describe the architecture supporting what can be called an autonomous Web-oriented naming system. As proof of concept, we simulate a rather large building and compare the behaviour of our approach to the legacy DNS and Multicast DNS (mDNS).","cites":"0","conferencePercentile":"15.95744681"},{"venue":"WoWMoM","id":"526001c57b92f57f59dc4b13c3b851de874d9144","venue_1":"WoWMoM","year":"2014","title":"Increasing opportunistic gain in small cells through base station-driven traffic spreading","authors":"Qing Wang, Balaji Rengarajan, Jörg Widmer","author_ids":"7135234, 1800879, 1712634","abstract":"—Dense deployment of small cells is an important, emerging trend to enable future cellular networks to cope with growing traffic demand. However, this reduces the number of users per cell and thus opportunistic scheduling gain. We propose a base station-driven energy-aware approach to exploit user-user communication to increase the opportunistic gain. We use tools from stochastic Lyapunov optimization to determine the optimal scheduling policy subject to a constraint on energy consumption for user-user communication. Our simulation results show that with a large energy budget, packet transfer delay is reduced by up to 70%. The bulk of the performance improvement can be achieved with only a small increase in energy consumption, where 60% of the improvement is achieved at only 20% of the additional energy consumption. Further, we evaluate our algorithm using realistic video traffic traces and show that frame loss ratio is reduced by 90% and PSNR is improved by 4dB.","cites":"1","conferencePercentile":"51.06382979"},{"venue":"WoWMoM","id":"d6ceeb1bdef82f7315812f137463fbdda3195d88","venue_1":"WoWMoM","year":"2014","title":"D-MHR: A distributed management scheme for hybrid networks to provide real-time industrial wireless automation","authors":"Pouria Zand, Kallol Das, Emi Mathews, Paul J. M. Havinga","author_ids":"1829109, 3252927, 2482657, 1679046","abstract":"—Current wireless technologies for industrial application , such as WirelessHART and ISA100.11a, use a centralized management approach which makes it difficult and costly for harvester-powered I/O devices to re-join the network in case of power failure. The communication overhead and delay to cope with the dynamic environment of a large-scale industrial network are also very high for an I/O device. In this paper, we therefore propose a distributed management scheme named D-MHR, which can address the requirements of energy constrained I/O devices. In D-MHR, the routers can dynamically reserve communication resources and manage the I/O devices in the local star sub-networks. We demonstrate that D-MHR achieves higher network management efficiency compared to IS100.11a standard, without compromising the latency and reliability requirements of industrial wireless networks.","cites":"1","conferencePercentile":"51.06382979"},{"venue":"WoWMoM","id":"05585cbf93115c8b7fd656b11f594c9bde14d3c5","venue_1":"WoWMoM","year":"2016","title":"Asynchronous reputation systems in device-to-device ecosystems","authors":"Dimitris Chatzopoulos, Pan Hui","author_ids":"8608653, 2665582","abstract":"Advances in Device-to-Device (D2D) ecosystems have brought on mobile applications that utilise nearby mobile devices in order to improve users' quality of experience (QoE). The interactions between the mobile devices have to be transparent to the end users and can be of many services -- opportunistic networking, traffic offloading, computation offloading, cooperative streaming and P2P based k-anonymity location privacy service, to name a few. Whenever mobile users are willing to \"ask for help\" from their neighbours, they need to make non trivial decisions in order to maximise their utility. Current motivation approaches for mobile users that participate in such environments are of two types: (i) credit-based and (ii) reputation-based. These approaches rely either on centralised authorities or require prohibitively many messages or require tamper resistant security modules. In this paper we propose a trust-based approach that does not require synchronisation between the mobile users. Moreover, we present the three-way tradeoff between, consistency, message exchange and awareness and we conclude that our approach can provide first-rate data to neighbour selection mechanisms for D2D ecosystems with much less overhead.","cites":"0","conferencePercentile":"36.36363636"},{"venue":"WoWMoM","id":"4f7cce02084519441de0d3bcc474c8774ccd2585","venue_1":"WoWMoM","year":"2016","title":"ResFi: A Secure Framework for Self Organized Radio Resource Management in Residential WiFi Networks","authors":"Sven Zehl, Anatolij Zubow, Adam Wolisz, Michael Doering","author_ids":"2560685, 2827545, 1778337, 1686561","abstract":"In dense deployments of residential WiFi networks individual users suffer performance degradation due to both contention and interference. While Radio Resource Management (RRM) is known to mitigate this effects its application in residential WiFi networks being by nature unplanned and individually managed creates a big challenge. We propose ResFi-a framework supporting creation of RRM functionality in legacy deployments. The radio interfaces are used for efficient discovery of adjacent APs and as a side-channel to establish a secure communication among the individual Access Point Management Applications within a neighborhood over the wired Internet backbone. We have implemented a prototype of ResFi and studied its performance in our testbed. As a show-case we have implemented various RRM applications among others a distributed channel assignment algorithm using ResFi. ResFi is provided to the community as open source.","cites":"2","conferencePercentile":"95.45454545"},{"venue":"WoWMoM","id":"14cb182025007e65421c6ba5d9156b60cf34475a","venue_1":"WoWMoM","year":"2016","title":"Evolution of vehicular congestion control without degrading legacy vehicle performance","authors":"Bin Cheng, Ali Rostami, Marco Gruteser, Hongsheng Lu, John B. Kenney, Gaurav Bansal","author_ids":"1770235, 1695167, 1708469, 4490275, 1759277, 1700211","abstract":"—Channel congestion is one of the major challenges for IEEE 802.11p-based vehicular ad hoc networks. To tackle the challenge, several algorithms have been proposed and some of them are being considered for standardization. Situations could arise where vehicles with different algorithms operate in the same network. Our previous work has investigated the performance of a mixed-algorithm vehicular network for the CAM-DCC and LIMERIC algorithms and identified that the CAM-DCC vehicles could potentially experience a performance degradation after introducing the LIMERIC vehicles into the network. In this work, we study whether it is possible to eliminate or bound this degradation. We propose a CBP target adjustment mechanism which controls the CBP target of LIMERIC vehicles according to vehicle density and mixing situation of the two algorithms in the network to limit the performance degradation of CAM-DCC vehicles to a desired level. The proposed mechanism is evaluated via both MATLAB and ns-2 simulations and the simulation results indicate that the performance degradation of the CAM-DCC vehicles is controlled as expected with only negligible impact on the performance of LIMERIC vehicles, which still perform similar or better than CAM-DCC vehicles.","cites":"0","conferencePercentile":"36.36363636"},{"venue":"WoWMoM","id":"5e8ee560e16420643081e317dbe8aeab24cd50b7","venue_1":"WoWMoM","year":"2014","title":"ILPS: Indoor localization using physical maps and smartphone sensors","authors":"Ahmad Abadleh, Sangyup Han, Soon J. Hyun, Ben Lee, Myungchul Kim","author_ids":"1975502, 2126402, 2928684, 1708098, 1806505","abstract":"— Indoor positioning and tracking services are garnering more attention. Recently, several state-of-the-art localization techniques have been proposed that use radio maps or the sensors readily available on smartphones. This paper presents a localization system called Indoor Localization using Physical maps and smartphone Sensors (ILPS), which is based on a building blueprint database and smartphone sensors. The blueprint database and access points (APs) provide a number of reference points that can be used to acquire the initial position and adjust the user position each time a reference point is detected. The proposed method is implemented on a smartphone and tested in real indoor environments. The experiments with ILPS demonstrate that using a static blueprint will avoid the costly database updates that are usually required in other approaches due to signal attenuation. Furthermore, ILPS performs better than existing work in term of accuracy and effectiveness for indoor localization.","cites":"0","conferencePercentile":"15.95744681"}]}