{"WOWS.csv":[{"venue":"WOWS","id":"05f7a0c8ee8d17b086970115573af2c6fd81cdeb","venue_1":"WOWS","year":"1999","title":"Web Analysis Visualization Spreadsheet","authors":"Ed Huai-hsin Chi","author_ids":"1730922","abstract":"In this paper, we present methods of information vi-sualization that applies to the discovery of patterns in WorldWide Web sites. We hope to use techniques of information visualization to help in the organization and categorization of Web sites. We present a detailed case study of using the spreadsheet to analyze the content, usage, and structure of a large Web site. We demonstrate how the visualization spreadsheet principles apply in this specific data domain.","cites":"3","conferencePercentile":"33.33333333"},{"venue":"WOWS","id":"4c4ec468085ef5e0b1b40adbaa666740447710d3","venue_1":"WOWS","year":"1999","title":"Discovery and Retrieval of Logical Information Units in Web","authors":"Keishi Tajima, Kenji Hatano, Takeshi Matsukura, Ryoichi Sano, Katsumi Tanaka","author_ids":"2792621, 2098257, 2755454, 3196592, 1750132","abstract":"In ordinary search engines for Web pages, the data unit for query processing is individual pages. Indexes are produced for each page in accordance with the words appearing in it. In actual Web data, however, a logical document discussing one topic is often organized into a set of pages connected via links provided by the page author as \" standard navigation routes. \" In such a situation , conjunctive queries with multiple keywords may fail to retrieve an appropriate document if those keywords appear in different pages within that document. Therefore, a data unit for Web data retrieval should not be a page but should be a connected subgraph corresponding to one logical document. In this paper, we develop new techniques for discovering and retrieving the logical information units in Web data. As in some previous researches, we adopt minimal subgraph semantics for conjunctive queries. In our approach, when given a conjunctive query, we try to approximate information units including all the given keywords in the following three steps: (1) we distinguish standard route links from the others, (2) we find minimal subgraphs connected via those links and including all the keywords, and (3) we compute the score of each subgraph based on the locality of the keywords within it in order to examine whether it is really a logical information unit relevant to the query. Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. To copy otherwise, to republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee.","cites":"26","conferencePercentile":"100"},{"venue":"WOWS","id":"52eb6e7c4e9ab523ad2314860f3e52b703a31b26","venue_1":"WOWS","year":"1999","title":"Constructing Web Views from Automated Navigation Sessions","authors":"Nadav Zin, Mark Levene","author_ids":"2749932, 1722499","abstract":"Existing web search engines provide users with the ability to query an off-line database of indices in order to decide on an entry point for further manual navigation. Results are often presented as a list of URLs in descending order of relevance, with no information on the underlying topology of the result set. We believe that information on the topology is important for useful exploration and can also help to reduce the feeling of disorientation that users experience. We present an alternative to the result set of a conventional search engine, which we call a web probabilistic view – a weighted subgraph of the underlying document space which maximizes the overall expected relevance of trails. We model a web database as a probabilistic grammar and present several algorithms to calculate its weights, expressed as probabilities attached to transition rules. We provide results from a recent set of experiments , showing the effectiveness of our approach measured as improvement in the expected relevance of the grammar.","cites":"11","conferencePercentile":"83.33333333"},{"venue":"WOWS","id":"c6080b0c3eab674a5b2051484f2bfb309f05da29","venue_1":"WOWS","year":"1999","title":"Virtual TV Channel: Filtering, Merging and Presenting Internet Broadcasting Channels","authors":"Qiang Ma, Hiroyuki Kondo, Kazutoshi Sumiya, Katsumi Tanaka","author_ids":"2831462, 1722053, 1678794, 1750132","abstract":"Broadcast-based information dissemination systems on the Internet are becoming increasingly popular due to advances in the area of Web technology and information delivery. In this paper, we propose a concept and a way to construct a virtual TV channel, which is a user-deened (virtual) channel from existing push-based Internet channels. Our virtual TV channel is (1) to lter contents of multiple push-based Internet channels , (2) to merge selected articles from diier-ent channels, and (3) to present them by a TV-program-like GUI.","cites":"5","conferencePercentile":"66.66666667"}]}