{"WPA_16.csv":[{"venue":"WPA '16","id":"13b6c4f9e052d04cb8df72c00d05e76a4b7b497c","venue_1":"WPA '16","year":"2016","title":"Next Generation Physical Analytics for Digital Signage","authors":"Mateusz Mikusz, Anastasios Noulas, Nigel Davies, Sarah Clinch, Adrian Friday","author_ids":"3277286, 1718233, 1789887, 1787300, 8133498","abstract":"Traditional digital signage analytics are based on a display-centric view of the world, reporting data on the content shown augmented with frequency of views and possibly classification of the audience demographics. What these systems are unable to provide, are insights into viewers' overall experience of content. This is problematic if we want to understand where, for example, to place content in a network of physically distributed digital signs to optimise content exposure. In this paper we propose a new approach that combines mobility simulations with comprehensive signage analytics data to provide viewer-centric physical analytics. Our approach enables us to ask questions of the analytics from the viewer's perspective for the first time, including estimating the exposure of different user groups to specific content across the entire signage network. We describe a proof of concept implementation that demonstrates the feasibility of our approach, and provide an overview of potential applications and analytics reports.","cites":"1","conferencePercentile":"87.5"},{"venue":"WPA '16","id":"e7b92a06cc4c3302b316e9bcaa91da2dcfe4ec67","venue_1":"WPA '16","year":"2016","title":"Capturing Personal and Crowd Behavior with Wi-Fi Analytics","authors":"Utku Gunay Acer, Geert Vanderhulst, Afra Masshadi, Aidan Boran, Claudio Forlivesi, Philipp M. Scholl, Fahim Kawsar","author_ids":", 1720416, , 2174495, 1779159, 2387442, 1792840","abstract":"We present a solution for analysing crowds at events such as conferences where people have networking opportunities. Often, potential social relations go unexploited because no business cards were exchanged or we forget about interesting people we met earlier. We created a solution built on top of ubiquitous Wi-Fi signals that is able to create a memory of human trajectories and touch points. In this paper we elaborate on the technological assets we designed to perform crowd anlaytics. We present small wearable Wi-Fi badges that last for the duration of an event (up to 3 days) with a single charge, as well as network equipment that senses the signals radiating from these badges and contemporary mobile devices.","cites":"0","conferencePercentile":"37.5"},{"venue":"WPA '16","id":"7b027b227121ddf522b72b10c6f08739297c706a","venue_1":"WPA '16","year":"2016","title":"Margdarshak: A Mobile Data Analytics based Commute Time Estimator cum Route Recommender","authors":"Rohit Verma, Aviral Shrivastava, Sandip Chakraborty, Bivas Mitra","author_ids":"6400671, 1726554, 1708109, 1780327","abstract":"Waiting at traffic signals and getting stuck in traffic congestion eats a lot of time for a commuter in most of the metro cities of the world. Although there exists a large pool of navigation applications, but all of them turn out to be ineffective for dynamically finding out the best route under uncertainty. In this work, we present Margdarshak, a navigation system which utilizes the impact of congestion and wait time at traffic signals for estimating the travel time over a route. We collected a month-long traffic data from different routes at five various cities in India for analyzing the problem in detail. The evaluations performed over the system show that Margdarshak gives a mean estimation error of &#177;1.5$ minutes, and performs significantly better under uncertainty, compared to other state of the art navigation systems like Google Maps, Here Maps and Waze.","cites":"0","conferencePercentile":"37.5"},{"venue":"WPA '16","id":"f86993829c103e1f0228abe28e338b914396d5b8","venue_1":"WPA '16","year":"2016","title":"MobiCamp: a Campus-wide Testbed for Studying Mobile Physical Activities","authors":"Mengyu Zhou, Kaixin Sui, Minghua Ma, Youjian Zhao, Dan Pei, Thomas Moscibroda","author_ids":"3412189, 2155086, 3152770, 3022584, 1784745, 1715172","abstract":"Ubiquitous WiFi infrastructure and smart phones offer a great opportunity to study physical activities. In this paper, we present MobiCamp, a large-scale testbed for studying mobility-related activities of residents on a campus. MobiCamp consists of ~2,700 APs, ~95,000 smart phones, and an App with ~2,300 opt-in volunteer users. More specifically, we capture how mobile users interact with different types of buildings, with other users, and with classroom courses, <i>etc</i>. To achieve this goal, we first obtain a relatively complete coverage of the users' mobility traces by utilizing four types of information from SNMP and by relaxing the location granularity to roughly at the room level. Then the popular App provides user attributes (grade, gender, <i>etc</i>.) and fine-grained behavior information (phone usages, course timetables, <i>etc.</i>) of the sampled population. These detailed mobile data is then correlated with the mobility traces from the SNMP to estimate the entire campus population's physical activities. We use two applications to show the power of MobiCamp.","cites":"1","conferencePercentile":"87.5"},{"venue":"WPA '16","id":"beb8fe2e917d82e0a7dad311aafdf24090d76bef","venue_1":"WPA '16","year":"2016","title":"MyDrive: Drive Behavior Analytics Method And Platform","authors":"Tanushree Banerjee, Arijit Chowdhury, Tapas Chakravarty","author_ids":"3542844, 2385219, 1817415","abstract":"In recent times, research on intelligent transportation and drive quality characterization has emerged to be an important area in the domain of intelligent vehicular telematics. The estimation of driving behavior quality and relative assessment of risky driving has always been a topic of interest for fleet managers, vehicle owners as well as the insurance providers. The most appealing use case that has come up is the analysis and reporting of the driving behavior, so that the drivers can get the feedback and change their driving pattern accordingly. Assessing driving style of an individual, relative categorization in a group of drivers, identifying his abnormal trips among all trips, demands continuous monitoring of the driver. In order to address these problems a statistical aggregate model is required. In this paper we propose an algorithm Skill- Aggression Quantifier (SAQ) which monitors, quantifies and classifies driving styles. The formulated idea has been implemented in an automated tool \"MyDrive\", which monitors and analyses the road-vehicle-driver interaction and models the driving styles of the individuals statistically.","cites":"1","conferencePercentile":"87.5"},{"venue":"WPA '16","id":"0cf34375fe49bb08165cdebd81dea7c44d6ad77a","venue_1":"WPA '16","year":"2016","title":"Small Scale Deployment of Seat Occupancy Detectors","authors":"Nguyen Huy Hoang Huy, Gihan Hettiarachchi, Youngki Lee, Rajesh Krishna Balan","author_ids":", 3431692, 3693511, ","abstract":"In this paper, we present the results of a small-scale field deployment of our capacitance-based seat occupancy detector [1]. We deployed our sensors to 36 seats in our university library and measured the performance of our system over a period of 8 weeks. As part of this deployment, we had to tackle numerous real-world deployment issues such as hardware failure, variations in signal quality, and interference caused by multiple objects in near proximity. We present our overall system design, along with the modifications we made to tackle various real-world problems. Finally, we present the results of our deployment which showed that our system achieves a reasonably high level of accuracy at 91.2%.","cites":"0","conferencePercentile":"37.5"}]}