{"WPAMobiSys.csv":[{"venue":"WPA@MobiSys","id":"eea6d3ce4e4ea5fd40708826845f82a945a064c8","venue_1":"WPA@MobiSys","year":"2014","title":"GlimpseData: towards continuous vision-based personal analytics","authors":"Seungyeop Han, Rajalakshmi Nandakumar, Matthai Philipose, Arvind Krishnamurthy, David Wetherall","author_ids":"1871038, 2112142, 3041721, 1689594, 1780215","abstract":"Emerging wearable devices provide a new opportunity for mobile context-aware applications to use continuous audio/video sensing data as primitive inputs. Due to the high-datarate and compute-intensive nature of the inputs, it is important to design frameworks and applications to be efficient. We present the <i>GlimpseData</i> framework to collect and analyze data for studying continuous high-datarate mobile perception. As a case study, we show that we can use low-powered sensors as a <i>filter</i> to avoid sensing and processing video for face detection. Our relatively simple mechanism avoids processing roughly 60% of video frames while missing only 10% of frames with faces in them.","cites":"7","conferencePercentile":"100"},{"venue":"WPA@MobiSys","id":"8e19fe99b4a90c0dd59c44a3dafaf993becf6eaa","venue_1":"WPA@MobiSys","year":"2014","title":"Physical analytics to model health behaviors","authors":"Anmol Madan","author_ids":"1805059","abstract":"Mobile phones are a pervasive platform for opportunistic sensing of social and health related behaviors. In this talk, I discuss how sensor data from mobile phones can be used to model and predict health outcomes. The talk starts with a review of research at the MIT Media Lab, and then transitions into how Ginger.io has built a commercial platform to collect, annotate, analyze and drive healthcare interventions at scale, deployed with major US hospital systems and healthcare providers. The Ginger.io three-part platform -- patient app, behavioral analytics engine, and provider dashboard -- applies this technology to give care providers a window into their patients' health between office visits. Our mobile app uses smartphone sensors to passively collect information about a patient's daily patterns. Using this data, our machine learning models are able to detect at-risk patients significantly better than the standard of care. Any concerning changes in behavior are communicated to the provider through our simple, action-oriented web dashboard. Ginger.io is part of the care solutions at institutions such as Kaiser Permanente, Novant Health, UCSF, Duke Medical and Cincinnati Children's.","cites":"0","conferencePercentile":"27.27272727"},{"venue":"WPA@MobiSys","id":"71039de3720ad4ea9670835879f5784b5f60505c","venue_1":"WPA@MobiSys","year":"2015","title":"Matching Physical Sites with Web Sites for Semantic Localization","authors":"Rufeng Meng, Sheng Shen, Romit Roy Choudhury, Srihari Nelakuditi","author_ids":"3031484, 7804628, 1694368, 1686965","abstract":"Locations are often expressed in physical coordinates such as an [<i>X, Y</i>] tuple in some coordinate system. Unfortunately, a vast majority of location-based applications desire the semantic translation of coordinates, i.e., store-names like Starbucks, Macy's, Panera. Past work has mostly focused on achieving localization accuracy, while assuming that the translation of physical to semantic coordinates will be done manually. In this paper, we explore an opportunity for automatic semantic localization -- the presence of a website corresponding to each physical store. We propose to correlate the information seen in a physical store with that found in websites of the stores around that location, to recognize that store. Specifically, we assume a repository of crowdsourced WiFi-tagged pictures from different stores. By correlating words inside the pictures, against words extracted from store websites, our proposed system can automatically label clusters of pictures, and the corresponding WiFi APs, with the store name. Later, when a user enters a store, her smartphone can scan the WiFi APs and consult a lookup table to recognize the store she is in. Our preliminary experiments with 18 stores in a shopping mall show that, our prototype system could correctly match the text from the physical stores with the text extracted from the corresponding web sites and hence label WiFi APs with store names with an accuracy upwards of 90%, which encourages us to pursue this study further. Moreover, we believe the core idea of correlating physical and web sites has broader applications beyond semantic localization, leading to better product placement and shopping experience, yielding benefits for both store owners and shoppers.","cites":"1","conferencePercentile":"37.5"},{"venue":"WPA@MobiSys","id":"4ba2faeb056ceb7b56a402ac25ac0913f2435353","venue_1":"WPA@MobiSys","year":"2015","title":"Device-Free Radio-based Low Overhead Identification of Subject Classes","authors":"Markus Scholz, Lukas Kohout, Matthias Horne, Matthias Budde, Michael Beigl, Moustafa Youssef","author_ids":"2792226, 3340301, 2696306, 2416795, 1692616, 1780388","abstract":"An increasing corpus of research focuses on inferring contexts solely through analysis of changes in surrounding wireless signals without the subject carrying a device (device-free). This paper takes device-free recognition a step further: We present <i>WiDisc</i>, a novel device-free RF system for distinguishing three subject classes (e.g. tall, medium, small). <i>WiDisc</i> models the problem as fingerprinting-based classification. To alleviate the significant location-based training overhead per subject class which is usually required, <i>WiDisc</i> employs 3D subject class model construction and electromagnetic simulations to generate the fingerprints with no manual training overhead. <i>WiDisc</i> further estimates the most relevant RF links to maximize recognition performance. Our lab evaluation with only four transceivers and three subject classes shows that the link selection module can accurately predict the two most important links, falling short only 5% of the achievable accuracy. In addition, <i>WiDisc</i> achieves a classification accuracy of 67% with zero training overhead vs 76% with traditional fingerprinting. Discrimination works esp. well for the medium and tall subjects but confusions for the small subject are frequent, indicating potential for further research. Still, the results highlight <i>WiDiscs</i> ability to trade off accuracy and training overhead and opens the door for new applications including finer-grained intrusion detection forensics, device-free parental control, personalized device-free gesture recognition, to name a few.","cites":"1","conferencePercentile":"37.5"},{"venue":"WPA@MobiSys","id":"bf990cc874df611ecc66eb92d226cab4da51170c","venue_1":"WPA@MobiSys","year":"2015","title":"Quantified Workplace: Opportunities and Challenges","authors":"Akhil Mathur, Marc Van den Broeck, Geert Vanderhulst, Afra J. Mashhadi, Fahim Kawsar","author_ids":"2005305, 2914691, 1720416, 1743965, 1792840","abstract":"We present the design of a Quantified Workplace system which has been deployed in two European offices of a research organization since October 2014. So far, the system has collected more than 680,000 samples of various environment metrics in the workplace (e.g., noise, air quality, . . . ) and 57,340 data points on the indoor location of employees. In addition, the system has received 7504 participatory inputs from the users about their moods and physical activities in the workplace. We present the system and its different services, discuss our initial findings on the user engagement, and highlight the challenges of device heterogeneity, privacy and trust. We conclude by discussing potential applications of workplace quantification that can be developed using the data we are collecting.","cites":"1","conferencePercentile":"37.5"},{"venue":"WPA@MobiSys","id":"d062b8c39c91ea33ec3b5e8bed2599ecb3d2fc8e","venue_1":"WPA@MobiSys","year":"2014","title":"Using smartphones to sense, assess, and improve well-being","authors":"Tanzeem Choudhury","author_ids":"1729948","abstract":"The people-aware computing group at Cornell has been developing techniques to cheaply, accurately, and continuously collect data on daily human behavior, social interactions, and context. This data is subsequently leveraged to provide targeted, personalized and effective feedback to promote better mental and physical health in individuals. In this talk I will give an overview of our work on turning sensor-enabled mobile phones into well-being monitors and instruments for administering real-time/real-place interventions.","cites":"0","conferencePercentile":"27.27272727"},{"venue":"WPA@MobiSys","id":"e581c462b2363e9f460708f5fde97dddede1e4d1","venue_1":"WPA@MobiSys","year":"2014","title":"The case for human-centric personal analytics","authors":"Youngki Lee, Rajesh Krishna Balan","author_ids":"3693511, 1730123","abstract":"The rich context provided by smartphones has enabled many new context-aware applications. However, these applications still need to provide their own mechanisms to interpret low-level sensing data and generate high-level user states. In this paper, we propose the idea of building a personal analytics (PA) layer that will use inputs from multiple lower layer sources, such as sensor data (accelerometers, gyroscopes, etc.), phone data (call logs, application activity, etc.), and online sources (Twitter, Facebook posts, etc.) to generate high-level user contextual states (such as emotions, preferences, and engagements). Developers can then use the PA layer to easily build a new set of interesting and compelling applications. We describe several scenarios enabled by this new layer and present a proposed software architecture. We end with a description of some of the key research challenges that need to be solved to achieve this goal.","cites":"2","conferencePercentile":"68.18181818"},{"venue":"WPA@MobiSys","id":"3f5a0a1f23b8b548949168aa4f8e3f271dbc8747","venue_1":"WPA@MobiSys","year":"2014","title":"My smartphone knows i am hungry","authors":"Fanglin Chen, Rui Wang, Xia Zhou, Andrew T. Campbell","author_ids":"3697557, 3372566, 2253140, 1690035","abstract":"Can a smartphone learn our eating habits without the user being in the loop? Clearly, the phone could use checkins based on location to infer that if you were in a cafe, for example, there is a good possibility you might eat or drink something. In this paper, we use inferred behavioral data and location history to predict if you are going to eat or not in the near future. These predictors could serve as a basis for future eating trackers that work unobtrusively in the background of your phone rather than relying on burdensome user input. In this paper, we report on a simple model that predicts the food purchases of a group of undergraduate college students (N=25) using inferred behavioral and location data from smartphones. The 10-week study uses the dining related purchase records from student college cards as ground-truth to validate our prediction model. Initial results show that we can predict food and drink purchases with an accuracy of 74% using three weeks of training data.","cites":"2","conferencePercentile":"68.18181818"},{"venue":"WPA@MobiSys","id":"0ad0e6fe6e0630fdaeec79793beecf03e921d9bd","venue_1":"WPA@MobiSys","year":"2014","title":"Tracking people and monitoring their vital signs using body radio reflections","authors":"Dina Katabi","author_ids":"1785714","abstract":"Wireless signals are typically used for data communication between an RF transmitter and an RF receiver. Recent advances in wireless technologies, however, have demonstrated that a person's motion can modulate the wireless signal, enabling the transfer of information from a human to an RF transceiver, even when the person does not carry a transmitter. This leads to new wireless systems in which a user communicates directly with remote devices using gestures. It also allows for using wireless signals to learn about the environment. For example, one may track objects and people as they move around, purely based on how their motion modulates the wireless signal. This could lead to new video games and virtual reality applications that work in non-line-of-sight and across rooms. It can also be used for health-care monitoring in hospitals or at home, and for intrusion detection or search-and-rescue operations. In this talk, I will present sensing technologies that pinpoint people's locations based purely on RF reflections off their bodies. They can further track a person's breathing and heartbeat remotely, without requiring any body contact. They operate by transmitting a low-power wireless signal and monitoring its reflections. They use these reflections to track body motion as well as minute movements associated with breathing and heartbeat (e.g., the chest movements caused by the inhale-exhale process). We envision that such technologies can enable truly smart homes that learn people's habits and monitor their vital signs to adapt the environment and actively contribute to their inhabitants' well-being.","cites":"0","conferencePercentile":"27.27272727"},{"venue":"WPA@MobiSys","id":"cd214a39ba0b87e3d02af13900c801c8d4428745","venue_1":"WPA@MobiSys","year":"2015","title":"Analyzing Shopper's Behavior through WiFi Signals","authors":"Yunze Zeng, Parth H. Pathak, Prasant Mohapatra","author_ids":"1950350, 2304251, 1697868","abstract":"Substantial progress in WiFi-based indoor localization has proven that pervasiveness of WiFi can be exploited beyond its traditional use of internet access to enable a variety of sensing applications. Understanding shopper's behavior through physical analytics can provide crucial insights to the business owner in terms of effectiveness of promotions, arrangement of products and efficiency of services. However, analyzing shopper's behavior and browsing patterns is challenging. Since video surveillance can not used due to high cost and privacy concerns, it is necessary to design novel techniques that can provide accurate and efficient view of shopper's behavior. In this work, we propose WiFi-based sensing of shopper's behavior in a retail store. Specifically, we show that various states of a shopper such as standing near the entrance to view a promotion or walking quickly to proceed towards the intended item can be accurately classified by profiling Channel State Information (CSI) of WiFi. We recognize a few representative states of shopper's behavior at the entrance and inside the store, and show how CSI-based profile can be used to detect that a shopper is in one of the states with very high accuracy (&#8776; 90%). We discuss the potential and limitations of CSI-based sensing of shopper's behavior and physical analytics in general.","cites":"6","conferencePercentile":"100"},{"venue":"WPA@MobiSys","id":"63edd09c5f909074515e29e1b3b7208fe6ed7292","venue_1":"WPA@MobiSys","year":"2015","title":"An Autonomous Reputation Framework for Physical Locations based on WiFi Signals","authors":"Afra J. Mashhadi, Geert Vanderhulst, Utku Günay Acer, Fahim Kawsar","author_ids":"1743965, 1720416, 3338636, 1792840","abstract":"Online reviews are used on the large scale to assess the quality and reputation of urban venues like hotels, restaurants, museums, etc. However, contributing reviews requires manual effort in the digital world, undertaken by only a small fraction of a venue's visitors. In this position paper, we present a framework that automatically assigns an offline reputation score by only relying on the physical presence of a user at a venue. In our approach, we passively capture the list of preferred WiFi networks (PNL) radiating from users smartphone as part of WiFi Probe requests in order to anonymously detect similar and recurrent users and to derive a personalised reputation score for an urban venue. By leveraging these ubiquitous WiFi radio signals, we seek to gather participation from a much broader set of visitors than online contributors. In this position paper, we outline our scoring technique, an early prototype architecture and discuss the potential of the proposed framework.","cites":"1","conferencePercentile":"37.5"},{"venue":"WPA@MobiSys","id":"09474362f0ef00d7e7115399df78e1a2027ed866","venue_1":"WPA@MobiSys","year":"2014","title":"Socio-physical analytics: challenges & opportunities","authors":"Archan Misra, Kasthuri Jayarajah, Shriguru Nayak, Philips Kokoh Prasetyo, Ee-Peng Lim","author_ids":"1721672, 1791322, 1961655, 2942038, 1709901","abstract":"In this paper, we argue for expanded research into an area called <i>Socio-Physical Analytics</i>, that focuses on combining the behavioral insight gained from mobile-sensing based monitoring of physical behavior with the inter-personal relationships and preferences deduced from online social networks. We highlight some of the research challenges in combining these heterogeneous data sources and then describe some examples of our ongoing work (based on real-world data being collected at SMU) that illustrate two aspects of socio-physical analytics: (a) how additional demographic and online analytics based attributes can potentially provide better insights into the preferences and behaviors of individuals or groups (in terms of movement prediction and understanding of physical vs. online interactions), and (b) how online and physical interactions can help us discover latent characteristics of physical spaces and entities.","cites":"2","conferencePercentile":"68.18181818"},{"venue":"WPA@MobiSys","id":"2b5f61f41756338c89418d21dcf68f101905348e","venue_1":"WPA@MobiSys","year":"2015","title":"Walking in Sync: Two is Company, Three's a Crowd","authors":"Kleomenis Katevas, Hamed Haddadi, Laurissa N. Tokarchuk, Richard G. Clegg","author_ids":"2226725, 1763096, 3184975, 8642177","abstract":"Eventual gait synchronization between two individuals while walking and talking with each other has been shown to be an indicator of agreeableness and companionship. The inferred physical signal from this subconscious phenomenon can potentially be an indicator of cooperation or relation between two individuals. In this paper we investigate this effect, and whether having a third person actively engaging in the same act or conversation can reduce this synchronization level. Using high frequency accelerometer data from a dedicated smartphone app, we perform a number of controlled experiments on a number of individuals in different group configuration. Our results bring an interesting insight: it is the <i>non-verbal social signals</i> such as the <i>gaze, head orientation</i> and <i>gestures</i> that is the key factor in synchronization, not necessarily the number or configuration of the walkers. These early results can lead us on detecting relationships between individuals or detecting the group formation and numbers for crowd-sensing applications when only partial data is available.","cites":"1","conferencePercentile":"37.5"}]}