{"WPES_16.csv":[{"venue":"WPES '16","id":"a5d1c51819a4a1df391c2c34d7acef6ea9631d0a","venue_1":"WPES '16","year":"2016","title":"Generating Secret Keys from Biometric Body Impedance Measurements","authors":"Marc Roeschlin, Ivo Sluganovic, Ivan Martinovic, Gene Tsudik, Kasper B. Rasmussen","author_ids":"2258227, 2723226, 1697125, 1702391, 1900527","abstract":"Growing numbers of ubiquitous electronic devices and services motivate the need for effortless user authentication and identification. While biometrics are a natural means of achieving these goals, their use poses privacy risks, due mainly to the difficulty of preventing theft and abuse of biometric data. One way to minimize information leakage is to derive biometric keys from users' raw biometric measurements. Such keys can be used in subsequent security protocols and ensure that no sensitive biometric data needs to be transmitted or permanently stored.\n This paper is the first attempt to explore the use of human body impedance as a biometric trait for deriving secret keys. Building upon Randomized Biometric Templates as a key generation scheme, we devise a mechanism that supports consistent regeneration of unique keys from users' impedance measurements. The underlying set of biometric features are found using a feature learning technique based on Siamese networks. Compared to prior feature extraction methods, the proposed technique offers significantly improved recognition rates in the context of key generation.\n Besides computing experimental error rates, we tailor a known key guessing approach specifically to the used key generation scheme and assess security provided by the resulting keys. We give a very conservative estimate of the number of guesses an adversary must make to find a correct key. Results show that the proposed key generation approach produces keys comparable to those obtained by similar methods based on other biometrics.","cites":"0","conferencePercentile":"47.5"},{"venue":"WPES '16","id":"49fa6f97efc878632a88a9e17a1b17554889275c","venue_1":"WPES '16","year":"2016","title":"On Profile Linkability despite Anonymity in Social Media Systems","authors":"Michael Backes, Pascal Berrang, Oana Goga, Krishna P. Gummadi, Praveen Manoharan","author_ids":"1749517, 2747035, 2362490, 1958921, 1827960","abstract":"A number of works have recently shown that the privacy offered by pseudonymous identities on social media systems like Twitter or Reddit is threatened by cross-site identity linking attacks. Such attacks link the identities of the same user across websites. Therefore, assessing linkability, i.e., the risk that identities are linked across different websites, remains an important open problem. In this work, we analyze whether anonymity within a single social media site can protect a user from being linked across sites. To this end, we first introduce a relative linkability measure ranking identities within a social media site by their anonymity. We show that anonymity alone is not sufficient to assess linkability risks, by evaluating this measure on a data set comprising 15 million comments gathered from the Reddit social media system.\n Second, we mitigate this insufficiency and present our absolute linkability measure, which in addition utilizes information about matching identities. Then, we confirm the validity of this measure on our data set. The measure is able to accurately assess the linkability risk in almost 75% of the cases and, more importantly, is shown to never underestimate the linkability risk.","cites":"0","conferencePercentile":"47.5"},{"venue":"WPES '16","id":"30c2d57d34e18168f22d550ad0a782fe9ca428b1","venue_1":"WPES '16","year":"2016","title":"Detecting Communities under Differential Privacy","authors":"Hiep H. Nguyen, Abdessamad Imine, Michaël Rusinowitch","author_ids":"2455122, 1766469, 1734192","abstract":"Complex networks usually expose community structure with groups of nodes sharing many links with the other nodes in the same group and relatively few with the nodes of the rest. This feature captures valuable information about the organization and even the evolution of the network. Over the last decade, a great number of algorithms for community detection have been proposed to deal with the increasingly complex networks. However, the problem of doing this in a private manner is rarely considered. In this paper, we solve this problem under differential privacy, a prominent privacy concept for releasing private data. We analyze the major challenges behind the problem and propose several schemes to tackle them from two perspectives: input perturbation and algorithm perturbation. We choose Louvain method as the back-end community detection for input perturbation schemes and propose the method LouvainDP which runs Louvain algorithm on a noisy super-graph. For algorithm perturbation, we design ModDivisive using exponential mechanism with the modularity as the score. We have thoroughly evaluated our techniques on real graphs of different sizes and verified that ModDivisive steadily gives the best modularity and avg.F1Score on large graphs while LouvainDP outperforms the remaining input perturbation competitors in certain settings.","cites":"0","conferencePercentile":"47.5"},{"venue":"WPES '16","id":"f0c6e6ff647d2ac457c00ef1963efa702a526222","venue_1":"WPES '16","year":"2016","title":"(The Futility of) Data Privacy in Content-Centric Networking","authors":"Cesar Ghali, Gene Tsudik, Christopher A. Wood","author_ids":"2801252, 1702391, 1681210","abstract":"Content-centric networking is an architecture designed to transfer named and addressable data from producers to consumers. Data retrieval is driven by a simple request and response protocol. A consumer issues a request for named data that is routed by the network towards the nearest location where this data is stored. Once found, the corresponding data is returned to the consumer. This data-centric model is different from the datagram- and stream-based protocols used to transport data between endpoints in IP networks: Instead of being tied to the channel through which data flows, security and privacy properties apply to data itself. Consequently, privacy issues in CCN warrant careful evaluation. In this paper, we present a comprehensive assessment of CCN privacy issues in the presence of various adversaries. We specify conditions sufficient to achieve different levels of privacy. We also show that data privacy is more dependent on requests than responses for data. We conclude that strong privacy necessitates some form of session- or channel-based communication, which strongly contradicts the data-centric nature of CCN. We also discuss how to implement proposed CCN privacy mechanisms in practice.","cites":"1","conferencePercentile":"97.5"},{"venue":"WPES '16","id":"bda62a7a2cde4e027d55f19c49ecd2114d2ffa3a","venue_1":"WPES '16","year":"2016","title":"PriFi: A Low-Latency and Tracking-Resistant Protocol for Local-Area Anonymous Communication","authors":"Ludovic Barman, Mahdi Zamani, Italo Dacosta, Joan Feigenbaum, Bryan Ford, Jean-Pierre Hubaux, David Wolinsky","author_ids":"1958278, 1760406, 2461431, 1751820, 1733363, 1757221, 2174353","abstract":"Popular anonymity mechanisms such as Tor provide low communication latency but are vulnerable to traffic analysis attacks that can de-anonymize users. Moreover, known traffic-analysis-resistant techniques such as Dissent are impractical for use in latency-sensitive settings such as wireless networks. In this paper, we propose PriFi, a low-latency protocol for anonymous communication in local area networks that is provably secure against traffic analysis attacks. This allows members of an organization to access the Internet anonymously while they are on-site, via privacy-preserving WiFi networking, or off-site, via privacy-preserving virtual private networking (VPN). PriFi reduces communication latency using a client/relay/server architecture in which a set of servers computes cryptographic material in parallel with the clients to minimize unnecessary communication latency. We also propose a technique for protecting against equivocation attacks, with which a malicious relay might de-anonymize clients. This is achieved without adding extra latency by encrypting client messages based on the history of all messages they have received so far. As a result, any equivocation attempt makes the communication unintelligible, preserving clients' anonymity while holding the servers accountable.","cites":"0","conferencePercentile":"47.5"}]}