{"WPESCCS.csv":[{"venue":"WPES@CCS","id":"307d98ada481ef95c69d05830474ce9afd84df34","venue_1":"WPES@CCS","year":"2015","title":"Known Unknowns: An Analysis of Twitter Censorship in Turkey","authors":"Rima S. Tanash, Zhouhan Chen, Tanmay Thakur, Dan S. Wallach, Devika Subramanian","author_ids":"2068925, 3323403, 2290909, 1798983, 1762215","abstract":"Twitter, widely used around the world, has a standard interface for government agencies to request that individual tweets or even whole accounts be censored. Twitter, in turn, discloses country-by-country statistics about this censorship in its transparency reports as well as reporting specific incidents of censorship to the Chilling Effects web site. Twitter identifies Turkey as the country issuing the largest number of censorship requests, so we focused our attention there. Collecting over 20 million Turkish tweets from late 2014 to early 2015, we discovered over a quarter million censored tweets - two orders of magnitude larger than what Twitter itself reports. We applied standard machine learning / clustering techniques, and found the vast bulk of censored tweets contained political content, often critical of the Turkish government. Our work establishes that Twitter radically under-reports censored tweets in Turkey, raising the possibility that similar trends hold for censored tweets from other countries as well. We also discuss the relative ease of working around Twitter's censorship mechanisms, although we can not easily measure how many users take such steps.","cites":"1","conferencePercentile":"64.28571429"},{"venue":"WPES@CCS","id":"5de026096da696dfeef29c31709e19c8ffd5e946","venue_1":"WPES@CCS","year":"2015","title":"UnLinked: Private Proximity-based Off-line OSN Interaction","authors":"Sky Faber, Ronald Petrlic, Gene Tsudik","author_ids":"2596635, 2236272, 1702391","abstract":"The recent decade has witnessed a rapid increase in popularity of mobile personal devices (notably, smartphones) t hat function as all-purpose personal communication portals. Concurrently, On-line Social Networks (OSNs) have continued their impressive proliferation. Meanwhile, the notion of \"OSN privacy\" remains elusive and even self-contradictory. Centralized nature of prominent OSNs is unlikely to change, which does not bode well for OSN users' privacy. However, some user privacy can be gained from making certain OSN functionality available off-line, such as discovering common contacts and other features, as well as establishing affinity- based connections. OSN providers stand to gain from this, since users could avail themselves of OSN functionality in scenarios where none currently exists, e.g., whenever Internet connectivity is unavailable, expensive or insufficient. At the same time, OSN users benefit from increased privacy because off-line interactions can be made opaque to OSN providers. This paper explores off-line private proximity-based use of OSNs. Although our approach is quite general, the proposed system (called UnLinked) is grafted atop a specific and popular OSN -- LinkedIn. One key challenge is how to ensure authenticity and privacy of users' information (e.g., connections and other profile data) when they engage in off-line interactions. This is addressed by designing an efficient technique for authorized two-way private set intersection (ATW-PSI), which allows two OSN users to jointly learn only the intersection of their input sets, while being assured of the authenticity of each others' input. The paper describes and evaluates a practical prototype that allows physically proximate LinkedIn users to commit to a connection if they have a mutually acceptable number of common connections.","cites":"1","conferencePercentile":"64.28571429"},{"venue":"WPES@CCS","id":"875bf2c062cabceb5f4262894c569d3c48f2e816","venue_1":"WPES@CCS","year":"2015","title":"Rook: Using Video Games as a Low-Bandwidth Censorship Resistant Communication Platform","authors":"Paul Vines, Tadayoshi Kohno","author_ids":"1809045, 1769675","abstract":"Censorship and surveillance is increasing in scale, sophistication, and prevalence across the globe. While most censorship circumvention systems still focus on escaping a given censored region to access Internet content outside of its control, we address a different but equally pressing problem: secure and secret chat within a censored region.\n We present Rook as a censorship and surveillance resistant platform for communication using online games as its cover application. The use of online games represents a novel form of cover application that provides several features that make them uniquely well-suited for this purpose. Rook transmits data secretly by embedding it in the network traffic of an online game. To mitigate current attacks based on deep-packet inspection and traffic shape analysis Rook uses the normal traffic used by the game, it does not generate additional packets, does not change the length of existing packets, and ensures altered packets are still valid game packets.\n For evaluation, we implement Rook using the online first-person shooter Team Fortress 2. Rook is evaluated against both active and passive attacks demonstrated in recent years including anti-mimicry probes, deep-packet inspection, traffic shape analysis, statistical analyses of packet payloads, and game-specific n-gram analyses.","cites":"4","conferencePercentile":"100"},{"venue":"WPES@CCS","id":"095b0ea68dba64de2b583febd0f81d9fa5c34924","venue_1":"WPES@CCS","year":"2015","title":"On the Privacy Practices of Just Plain Sites","authors":"Amirhossein Aleyasen, Oleksii Starov, Alyssa Phung Au, Allan M. Schiffman, Jeff Shrager","author_ids":"1834430, 2448867, 2143359, 2671201, 3319902","abstract":"In addition to visiting popular sites such as Facebook and Google, web users often visit more modest sites, such as those operated by bloggers, or by local organizations such as schools. Such sites, which we call \"Just Plain Sites\" (JPSs), are likely to inadvertently present greater privacy risks than highly popular sites, because they are unable to afford privacy expertise. To assess the prevalence of the privacy risks to which JPSs may inadvertently be exposing their visitors, we examined privacy practices that could be observed by analysis of JPS landing pages. We found that many JPSs collect a great deal of information from their visitors, and share a great deal of information about their visitors with third parties. For example, we found that an average of 7 third party organizations are informed when a user visits a JPS. Many JPSs additionally permit a great deal of tracking of their visitors. For example, we found that third party cookies are used by more than 50% of JPSs. We also found that many JPSs use deprecated or unsafe security practices. Our goal is not to scold JPS operators, but to raise awareness of these facts among both JPS operators and visitors, possibly encouraging operators to take greater care in their implementations, and visitors to take greater care in how, when, and what they share.","cites":"1","conferencePercentile":"64.28571429"}]}