{"WPMC.csv":[{"venue":"WPMC","id":"19cc61da86f888a0a43243e497ab77c47d465c48","venue_1":"WPMC","year":"2011","title":"A solution for partial video voice over IP session transfer and retrieval","authors":"Shanmugalingam Sivasothy, Vincent Verdot, Noël Crespi, Paul Labrogere","author_ids":"3077465, 2995541, 1737867, 2871497","abstract":"Ubiquitous digital devices with rich media processing and networking capabilities open an avenue for enriching user experiences, especially in video voice over IP communication sessions because a communication session can be transferred partially to multiple devices that are in the vicinity of caller and (or) callee. Then, the transferred partial session can be retrieved back to the original place. For supporting partial video voice session transfer and retrieval, the solution needs a proper orchestration for the media channels. However, existing media orchestration mechanisms are separately and independently deployed on the user side (i.e. user agent) and network side (i.e. application server); thus, they increase the development and deployment complexity. Moreover, these solutions do not completely support seamless partial session transfer and retrieval at the caller and callee side. To overcome these problems, this paper proposes a solution for partial session transfer and retrieval (PSTR) that takes advantage of natural convergence of Web and communication services. Our solution supports any number of PSTRs at the caller and callee side without adding development and deployment complexity.","cites":"0","conferencePercentile":"18.51851852"},{"venue":"WPMC","id":"b6510469997ef8e3efbd80aeace88b7342c9cd24","venue_1":"WPMC","year":"2011","title":"Investigation of scalable video delivery using H.264 SVC on an LTE network","authors":"Patrick McDonagh, Carlo Vallati, Amit Pande, Prasant Mohapatra, Philip Perry, Enzo Mingozzi","author_ids":"1910841, 1786806, 7205991, 1697868, 1733456, 1701506","abstract":"—The combination of increased data rates in 4G cellular networks (such as LTE Advanced), dedicated multicast/ broadcast services (e-MBMS) and the emergence of scalable video coding standards (H.264 SVC) allow mobile operators to offer multimedia-based services with a high quality of experience to end users. H.264 SVC offers three dimensions of scalability v.i.z. Quality (SNR), Temporal and Spatial. In this paper we investigate the use of Scalable Video Coding (SVC) for video delivery over an LTE network. In particular, we carried on a two step performance evaluation: first, we perform a static analysis on how different types of scalability influences the video quality, then, we analyze through simulations how the transmission over a wireless means further affects the quality. In our analysis, we adopted a wide range of metrics: 2 full-reference metrics, namely PSNR and SSIM, along with 2 no-reference metrics, MSU Blocking and Blurring. Our results show that no-reference evaluation metrics could be employed alongside a frame-drop metric in the place of full-reference metrics. Moreover, we show that the video scalability alone is not sufficient to avoid a degradation of quality, in some cases in the order of seconds, when caused by packet loss.","cites":"5","conferencePercentile":"87.03703704"}]}