{"WPNC.csv":[{"venue":"WPNC","id":"2b33c69137e739bc722fd40ca7fd8cef48caf5c7","venue_1":"WPNC","year":"2008","title":"GNSS quality in pedestrian applications - a eveloper perspective","authors":"Dirk Ahlers, Martin Pielot, Daniel Wichmann, Susanne Boll","author_ids":"1760837, 2884328, 2889130, 1714281","abstract":"— Localization is a vital part of mobile applications. However, the quality of predominant GNSS-based localization remains inadequate for high-precision scenarios for mobile users. Based on previous work, we discuss the relevance of GNSS for mobile applications focusing in particular on mobile pedestrians. We present selected pedestrian-oriented application types and derive quality requirements towards GNSS-based positioning technologies. Drawing from our experience, we present current shortcomings of GPS-based positioning. We discuss their impact on application design and outline exemplary strategies of how developers could address these. We argue for an integration of GNSS quality considerations into the design process to enable applications to transparently deal with inaccuracies even for future , more demanding scenarios. Then we can provide innovative pedestrian applications to users on-the-spot, enriching their daily lives.","cites":"4","conferencePercentile":"65.38461538"},{"venue":"WPNC","id":"ea2b41c3ebd3adfafbf90705add54ebb4cc99311","venue_1":"WPNC","year":"2012","title":"Node position discovery in wireless sensor networks","authors":"M. Onur Ergin, Adam Wolisz","author_ids":"2915849, 1778337","abstract":"—Wireless sensor networks (WSN) have gained a significant attention in research and carry the promise to be helpful in numerous aspects of life. For many applications, the location information of the nodes needs to be known. As this information is not necessarily available, there is a huge interest in algorithms estimating the positions of individual nodes. The precision and computational complexity of such \" localization \" algorithms is still a big issue. However, there are cases where the nodes are placed in one of a few possible predetermined positions. In those cases, computing the relative positions of nodes in relation to each other might be sufficient to determine their real positions. In this study, we introduce a methodology for discovering the sequence of nodes in a unidimensional configuration using the measured Received Signal Strength(RSS) values and allowance of frequency diversity of high frequency radio (CC2420) that is frequently used in wireless sensor networks. In the reported experimental tests, we were able to determine the node sequence correctly for the nodes that are as close as 50cm to each other, using the developed methodology.","cites":"1","conferencePercentile":"25"},{"venue":"WPNC","id":"10788141c8be8121dd1c92b02f1ac21b77f526ce","venue_1":"WPNC","year":"2007","title":"DLS: A Resource-Aware Localization Algorithm with High Precision in Large Wireless Sensor Networks","authors":"Frank Reichenbach, Jakob Salzmann, Dirk Timmermann, Alexander Born, Ralf Bill","author_ids":"2791148, 1736724, 1741106, 2252670, 1871811","abstract":"— One of the key issues in large Wireless Sensor Networks is a precise position determination of every node with minimal hardware requirements and lowest energy consumption. Exact localization techniques, which are prone to input errors, are resource-intensive and not feasible on simple sensor nodes without adaptations. The key mechanism is to effectively split the complex computation and distribute the communication load across all nodes. Therefore, we present the \" Distributed Least Squares \" (DLS)-algorithm. DLS is a resource-aware localization method that achieves 47% computation savings and 86% energy savings compared to the reference method, a \" Fully Distributed Multilateration \" on every sensor node.","cites":"3","conferencePercentile":"33.33333333"},{"venue":"WPNC","id":"8dc4b496b3fa85f98a7f72123b892e6531c3c2f3","venue_1":"WPNC","year":"2012","title":"Passive RFID tomographic imaging for device-free user localization","authors":"Benjamin Wagner, Neal Patwari, Dirk Timmermann","author_ids":"3262704, 1700521, 1741106","abstract":"– Localization of users is an important part of location aware systems and smart environments. It forms a major data source for superimposed intention recognition systems. In RF device-free localization (DFL), the person being tracked does not need to wear a RF transmitter or receiver in order to be located. Instead, they are tracked using the changes in signal strength measured on static links in a wireless network. This work presents a new algorithm for RF DFL using passive RFID networks. We formulate and show how a tomographic imaging algorithm provides both low computational complexity and highly accurate position estimates. Using measurements conducted in an indoor environment with various human positions, we find the algorithm can locate the human with as low as 30 cm mean location error.","cites":"9","conferencePercentile":"100"},{"venue":"WPNC","id":"0c8161a1f4635ef60449603a543d56d45410a2df","venue_1":"WPNC","year":"2013","title":"A pocket guide to indoor mapping","authors":"Pascal Bissig, Roger Wattenhofer, Samuel Welten","author_ids":"3345623, 1716440, 2930885","abstract":"—In this paper, we present a way to obtain accurate WLAN signal strength maps in indoor environments, without dedicated hardware, and without a time consuming and complicated training process. We need two contributions towards this end. First, we present a novel dead-reckoning technique, to gather accurate user motion estimates. This motion data is combined with information about the signal strength of access points of the wireless infrastructure. Our second contribution lies in the efficient integration of this complementary information into a system that allows for easy mapping and requires nothing but a smartphone. All the required data is gathered from people walking casually around in an area of interest while carrying a smartphone in their pocket.","cites":"1","conferencePercentile":"14.28571429"},{"venue":"WPNC","id":"133bb13d8150bf919dbea4ce0a621f3f21cf3b05","venue_1":"WPNC","year":"2008","title":"Bayesian detection and tracking for joint positioning and multipath mitigation in GNSS","authors":"Bernhard Krach, Michael Lentmaier, Patrick Robertson","author_ids":"2015821, 1787451, 1778721","abstract":"— A sequential Bayesian estimation algorithm for joint positioning and multipath mitigation in global navigation satellite systems is presented, with an underlying process model that is especially designed for dynamic user scenarios and dynamic channel conditions. In order to facilitate efficient integration into receivers it builds upon complexity reduction concepts that previously have been applied within maximum likelihood estimators. To demonstrate its capabilities simulation results are presented.","cites":"2","conferencePercentile":"46.15384615"},{"venue":"WPNC","id":"200bd0e996224588b3292efcf4d0b087323484ac","venue_1":"WPNC","year":"2008","title":"AWCL: Adaptive Weighted Centroid Localization as an efficient improvement of coarse grained localization","authors":"Ralf Behnke, Dirk Timmermann","author_ids":"1729298, 1741106","abstract":"— Localization of sensor nodes is one of the key issues in Wireless Sensor Networks. It is a precondition for a variety of scenarios as well as geographic clustering and routing. A simple approach for coarse grained localization is Weighted Centroid Localization (WCL), which, unfortunately, comes with some drawbacks. Therefore, we present the \" Adaptive WCL \" (AWCL) algorithm that outperforms the linearly weighted WCL in terms of accuracy. Moreover, AWCL achieves similar accuracy as WCL using quadratic weights, but does not rely on complex calculations like quadratic WCL. The adaptive character of AWCL leads to a small localization failure for beacon communication ranges, exceeding the beacon distance.","cites":"22","conferencePercentile":"84.61538462"},{"venue":"WPNC","id":"b58c61b65b9c3daf8728ad7b88eda9399ac496df","venue_1":"WPNC","year":"2009","title":"Beyond position - spatial context for mobile information retrieval systems","authors":"Dirk Ahlers, Susanne Boll","author_ids":"1760837, 1714281","abstract":"— Within context-aware mobile applications, location information usually plays a major role for information selection and adaptivity. In this paper, we explore the geospatial dimension between simple position-aware and fully context-aware information systems by examining in-depth the features of spatial context beyond mere position. We describe how these features can be used to create spatial queries in a mobile information retrieval system and further discuss the influence of spatial context to select and adapt the query results and its relation to mobile user's information needs.","cites":"3","conferencePercentile":"62.5"},{"venue":"WPNC","id":"b98d1a7318efee670cd12d1ff8314c2af06ac0c9","venue_1":"WPNC","year":"2008","title":"Moment based CNR estimators for BOC/BPSK modulated signal for Galileo/GPS","authors":"A. K. M. Najmul Islam, Elena Simona Lohan, Markku Renfors","author_ids":"8712190, 1697970, 1717580","abstract":"—Estimation of the Carrier to Noise Ratio (CNR) is one of the most important functionalities of the GPS/Galileo receivers. However, the conventional GPS receivers are not able to satisfy the CNR estimation requirements for the location based services, E-911, and moderate indoor reception. In this paper we derive a total of seven moment based CNR estimators and present the results for the simulation based BOC (Binary Offset carrier) modulated signal and the measurement based BPSK (Binary Phase Shift Keying) modulated signal. We compare the results of the different estimators and find the most robust estimator. I. INTRODUCTION GPS system operates currently based on 30 satellites. With the development of the European navigation system, Galileo, the number of satellites will increase to approximately 60. BPSK modulation is used in current C/A and P(Y) GPS signals. The Binary Offset Carrier (BOC) modulation has been considered for the modernized military GPS signal in L1 and L2 bands and also for the future European Navigation System, Galileo[1]. GPS/Galileo receivers should have the capability to estimate the CNR as accurate as possible. Although the topic of CNR estimation in the GPS receivers is addressed in the literature[1],[2],[3], not much of the analysis are published based on the correlation of the incoming signal. Also few moment based CNR estimators are found in literature but these estimators are not developed based on the correlation function of the BPSK/BOC modulated signals[4]. In this paper, we present a channel model for BOC/BPSK modulated signals and derive seven moment based CNR estimators considering the correlation between the incoming BOC/BPSK modulated signal and the reference BOC/BPSK modulated code. We present the results of these CNR esti-mators for the simulation based BOC modulated signal and also for the satellite based measurement data that contains the BPSK modulated signal. The sequel of the paper is organized as follows. In Section II, the underlying signal model is described. Based on the signal model the moment based CNR estimators are derived in Section III. Section IV discusses the limitations of the CNR estimators. In Section V, we present the results for the single path static channel for the simulation based BOC modulated signal. Section VI is dedicated to the mappings between different coherent and non-coherent integration times. The satellite based measurement campaign is described in","cites":"0","conferencePercentile":"19.23076923"},{"venue":"WPNC","id":"71a0ede6b839afa353c973999bee6f2e0e010721","venue_1":"WPNC","year":"2008","title":"Distributed selection of references for localization in wireless sensor networks","authors":"Dominik Lieckfeldt, Jiaxi You, Dirk Timmermann","author_ids":"1753990, 1804487, 1741106","abstract":"—The main purpose of wireless sensor networks is to provide information about an area of interest. In order to fulfill this task, physical parameters have to be measured by as many sensors as possible to improve the knowledge on the sensed area. In contrast, due to the resource-limited nature of sensor networks, the number of actively participating nodes should be kept to a minimum. This paper investigates the trade-off between the two conflicting requirements with special focus on localization of sensor nodes. A distributed algorithm to select subsets of sensor nodes for localization is analyzed regarding the accuracy of localization.","cites":"2","conferencePercentile":"46.15384615"},{"venue":"WPNC","id":"3d64daa8f4c0d46b55fd3d6c6c6b71d64fc690d5","venue_1":"WPNC","year":"2008","title":"Integration of foot-mounted inertial sensors into a Bayesian location estimation framework","authors":"Bernhard Krach, Patrick Robertson","author_ids":"2015821, 1778721","abstract":"— An algorithm for integrating foot-mounted inertial sensors into a Bayesian location estimation framework is presented. The proposed integration scheme is based on a cascaded estimation architecture. A lower Kalman filter is used to estimate the step-wise change of position and direction of the foot. These estimates are used in turn as measurements in an upper particle filter, which is able to incorporate nonlinear map-matching techniques. Experimental data is used to verify the proposed algorithm. I. INTRODUCTION The use of inertial sensors is becoming widespread for pedestrian navigation, especially for indoor applications. Basically two approaches can be distinguished. The pedometer-approach employs an accelerometer for detecting individual steps whilst the stride length and stride direction are themselves estimated using additional sensors, such as global navigation satellite systems (GNSS), or a priori information. Given a detected step, its length and its direction, a person's position can be determined by dead-reckoning [1] [2] [3]. Other methods have been studied in [4]. The latest approaches are based on full six degree of freedom (6DOF) inertial navigation. A foot-mounted 6DOF strapdown inertial platform comprising triads of accelerometers and gyroscopes is used to dead reckon via a conventional strapdown navigation algorithm. An indirect feedback extended Kalman filter runs in parallel to the strapdown algorithm. Rest phases of the foot, which are detected from the accelerometer signals, trigger zero-velocity (virtual) measurements that are used to update the filter (ZUPT). Due to the regular ZUPT measurements we can estimate and correct the drift errors, which accumulate in the strapdown solution [5] [6] [7] [8]. It was shown in [5] that this approach can achieve very good performance even with today's low-cost micro-electro-mechanical (MEMS) sensors because the ZUPTs are so frequent that errors build up only slowly during each step the pedestrian makes. Nevertheless, the proposed Kalman filter approach is not optimal, as the algorithm does not take into account prior dynamic knowledge about the motion of the pedestrian or the motion of her foot and there is no mathematically sound procedure when considering the incorporation of nonlinear map-matching techniques or additional nonlinear / non-Gaussian sensors typically used in an indoor scenario. To address this here we propose a cascaded estimation architecture: To estimate the navigation parameters of the","cites":"29","conferencePercentile":"92.30769231"}]}