{"WRAC.csv":[{"venue":"WRAC","id":"e8b3b1127767f00a7d596914a6ada30b8f0ace9a","venue_1":"WRAC","year":"2002","title":"AlphaWolf: Social Learning, Emotion and Development in Autonomous Virtual Agents","authors":"Bill Tomlinson, Bruce Blumberg","author_ids":"2481377, 3272601","abstract":"We present research in synthetic social behavior for interactive virtual characters. We describe a model from the natural world, the gray wolf (Canis lupus), and the social behavior exhibited by packs of wolves, to use as the target for an interactive installation entitled AlphaWolf, which was shown at SIGGRAPH 2001. We offer a computational model that captures a subset of the social behavior of wild wolves, involving models of learning, emotion and development. There is a range of real-world applications of synthetic social behavior, from short-term possibilities such as autonomous characters for computer games, to long-term applications such as computer interfaces that can interact more appropriately with humans by utilizing human social abilities. Our research offers initial steps toward computational systems with social behavior, in hope of making interactions with them more functional and more inherently rewarding.","cites":"19","conferencePercentile":"90"},{"venue":"WRAC","id":"f789a35704db4f90516de7d469f1b32e87e128e0","venue_1":"WRAC","year":"2002","title":"Learning Communication for Multi-agent Systems","authors":"C. Lee Giles, Kam-Chuen Jim","author_ids":"1749125, 2712002","abstract":"We analyze a general model of multi-agent communication in which all agents communicate simultaneously to a message board. A genetic algorithm is used to learn multi-agent languages for the predator agents in a version of the predator-prey problem. The resulting evolved behavior of the communicating multi-agent system is equivalent to that of a Mealy machine whose states are determined by the evolved language. We also constructed non-learning predators whose capture behavior was designed to take advantage of prey behavior known a priori. Simulations show that introducing noise to the decision process of the hard-coded predators allow them to significantly ourperform all previously published work on similar preys. Furthermore, the evolved communicating predators were able to perform significantly better than the hard-coded predators, which indicates that the system was able to learn superior communicating strategies not readily available to the human designer.","cites":"6","conferencePercentile":"70"},{"venue":"WRAC","id":"61485f04ee7aec0084d1c7d6a9bfa37eff593f11","venue_1":"WRAC","year":"2005","title":"Institutionalization Through Reciprocal Habitualization and Typification","authors":"Eric Baumer, Bill Tomlinson","author_ids":"1735899, 2481377","abstract":"When constructing multiagent systems, the designer may approach the system as a collection of individuals or may view the entire system as a whole. In addition to these approaches, it may be beneficial to consider the interactions between the individuals and the whole. Borrowing ideas from the notion of social construction and building on previous work in synthetic social construction, this paper presents a framework wherein autonomous agents engage in a dialectic relationship with the society of agents around them. In this framework, agents recognize patterns of social activity in their societies, group such patterns into institutions, and form computational representations of those institutions. The paper presents a design framework describing this method of institutionaliza-tion, some implementation suggestions, and a discussion of possible applications .","cites":"4","conferencePercentile":"95.45454545"}]}