{"WREN.csv":[{"venue":"WREN","id":"aaba89dc882c46cf0ff3e18ab663792a964f2272","venue_1":"WREN","year":"2009","title":"Resonance: dynamic access control for enterprise networks","authors":"Ankur Kumar Nayak, Alex Reimers, Nick Feamster, Russell J. Clark","author_ids":"2677787, 2147088, 1800154, 2097507","abstract":"Enterprise network security is typically reactive, and it relies heavily on host security and middleboxes. This approach creates complicated interactions between protocols and systems that can cause incorrect behavior and slow response to attacks. We argue that imbuing the network layer with mechanisms for dynamic access control can remedy these ills. We propose <i>Resonance</i>, a system for securing enterprise networks, where the network elements themselves enforce dynamic access control policies based on both flow-level information and real-time alerts. Resonance uses programmable switches to manipulate traffic at lower layers; these switches take actions (e.g., dropping or redirecting traffic) to enforce high-level security policies based on input from both higherlevel security policies and distributed monitoring and inference systems. We describe the design of Resonance, apply it to Georgia Tech's network access control system, show how it can both overcome the current shortcomings and provide new security functions, describe our proposed deployment, and discuss open research questions.","cites":"62","conferencePercentile":"75"},{"venue":"WREN","id":"6c2b5f6bea40a0a10a712be80e17247978fcb72b","venue_1":"WREN","year":"2009","title":"Practical declarative network management","authors":"Timothy L. Hinrichs, Natasha Gude, Martín Casado, John C. Mitchell, Scott Shenker","author_ids":"1746859, 3304063, 2864986, 1685743, 1753148","abstract":"We present Flow-based Management Language (FML), a declarative policy language for managing the configuration of enterprise networks. FML was designed to replace the many disparate configuration mechanisms traditionally used to enforce policies within the enterprise. These include ACLs, VLANs, NATs, policy-routing, and proprietary admission control systems. FML balances the desires to express policies naturally and enforce policies efficiently. We have implemented FML and have used it to manage multiple operational enterprise networks for over a year.","cites":"71","conferencePercentile":"83.33333333"},{"venue":"WREN","id":"3297087d405d3da640a4e388d86b92aa072834f7","venue_1":"WREN","year":"2009","title":"Delegating network security with more information","authors":"Jad Naous, Ryan Stutsman, David Mazières, Nick McKeown, Nickolai Zeldovich","author_ids":"1709624, 3087426, 2506126, 1708241, 1789973","abstract":"Network security is gravitating towards more centralized control. Strong centralization places a heavy burden on the administrator who has to manage complex security policies and be able to adapt to users' requests. To be able to cope, the administrator needs to delegate some control back to end-hosts and users, a capability that is missing in today's networks. Delegation makes administrators less of a bottleneck when policy needs to be modified and allows network administration to follow organizational lines. To enable delegation, we propose ident++ - a simple protocol to request additional information from end-hosts and networks on the path of a flow. ident++ allows users and end-hosts to participate in network security enforcement by providing information that the administrator might not have or rules to be enforced on their behalf. In this paper we describe ident++ and how it provides delegation and enables flexible and powerful policies.","cites":"6","conferencePercentile":"50"},{"venue":"WREN","id":"72ad51bad58a55f6fd0a8e4f41e1c655462cb0d1","venue_1":"WREN","year":"2009","title":"Change is hard: adapting dependency graph models for unified diagnosis in wired/wireless networks","authors":"Lenin Ravindranath, Paramvir Bahl, Ranveer Chandra, David A. Maltz, Jitendra Padhye, Parveen Patel","author_ids":"1725773, 2897351, 2299171, 6103581, 1695132, 1682324","abstract":"Organizations world-wide are adopting wireless networks at an impressive rate, and a new industry has sprung up to provide tools to manage these networks. Unfortunately, these tools do not integrate cleanly with traditional wired network management tools, leading to unsolved problems and frustration among the IT staff. We explore the problem of unifying wireless and wired network management and show that simple merging of tools and strategies, and/or their trivial extension from one domain to another does not work. Building on previous research on network service dependency extraction, fault diagnosis, and wireless network management, we introduce <i>MnM</i>, an end-to-end network management system that unifies wired and wireless network management. MnM treats the physical location of end devices as a core component of its management strategy. It also dynamically adapts to the frequent topology changes brought about by end-node mobility. We have a prototype deployment in a large organization that shows that MnM's rootcause analysis engine out-performs systems that do not take user mobility into account when localizing faults or attributing blame.","cites":"0","conferencePercentile":"8.333333333"}]}