{"WSAN.csv":[{"venue":"WSAN","id":"9821ed8f67d6513f6f1c079369da5a7c7e5589ee","venue_1":"WSAN","year":"2008","title":"Energy-Efficient Location-Independent k -connected Scheme in Wireless Sensor Networks","authors":"Xiaofeng Liu, Liusheng Huang, Wenbo Shi, Hongli Xu","author_ids":"1993732, 1807672, 1796392, 1779748","abstract":"The reliability of communication can be enhanced by increasing the network connectivity. Topology control and node sleep scheduling are used to reduce the energy consumption. This paper considers the problem of maintaining k-connectivity of WSN at minimum energy level while keeping only a subset of sensor nodes active to save energy. In our proposed scheme, each node is assumed to have multiple power levels and neighbor proximity not exact location information is adopted. Firstly the network partition is attained by power based clustering, and next nodes are divided into equivalent classes according to the role of data forwarding to different adjacent clusters. Then Node Scheduling and Power Adjustment (NSPA) algorithm selects a subset of nodes with different power levels to construct the local minimum energy graph while maintaining network connectivity. If the number of intra-cluster nodes which have adjacent clusters exceeds a certain threshold, k-NSPA is employed. Finally, a k-connected topology can be obtained. The simulation shows that our scheme can obtain the redundant nodes while maintaining network k-connected and it is more energy efficient compared with previous work. 1 Introduction Wireless sensor networks (WSNs) are being increasingly deployed in severe areas to monitor the environment [1, 2]. In these applications, the network must be maintained connected to ensure the availability and reliability of communication. WSNs systems always contain a large number of nodes, due to the distributed area is large and the environment around is complicated, changing the batteries to renew the node energy is not practical. So sensors are required to be redundantly deployed to accommodate unexpected failures and extend the network lifetime. If idle sensors are not asleep, then redundant node deployment does not necessarily improve the connected coverage time of the field. So an important challenge of WSNs is how to maintain network communication connectivity and utilize the redundant nodes to extend the","cites":"0","conferencePercentile":"15.2173913"},{"venue":"WSAN","id":"18a122a8fc2320b8cef54e5f19349bb7686a1757","venue_1":"WSAN","year":"2007","title":"Low Overhead Assignment of Symbolic Coordinates in Sensor Networks","authors":"Matthias Gauger, Pedro José Marrón, Daniel Kauker, Kurt Rothermel","author_ids":"2280140, 1755985, 1800455, 1700118","abstract":"Approximate information on the location of nodes in a sensor network is essential to many types of sensor network applications and algorithms. In many cases, using symbolic coordinates is an attractive alternative to the use of geographic coordinates due to lower costs and lower requirements on the available location information during coordinate assignment. In this paper, we investigate different possible methods of assigning symbolic coordinates to sensor nodes. We present a method based on broadcasting coordinate messaging and filtering using sensor events. We show in the evaluation that this method allows a reliable assignment of symbolic coordinates while only generating a low overhead.","cites":"2","conferencePercentile":"75"},{"venue":"WSAN","id":"c8f757742ca665a8f0d1172bf021383740f0fa69","venue_1":"WSAN","year":"2008","title":"Designing incentive packet relaying strategies for wireless ad hoc networks with game theory","authors":"Lu Yan, Stephen Hailes","author_ids":"1787885, 1718391","abstract":"In wireless ad hoc networks, nodes are both routers and terminals, and they have to cooperate to communicate. Cooperation at the network layer means routing (finding a path for a packet), and forwarding (relaying packets for others). However, because wireless nodes are usually constrained by limited power and computational resources, a selfish node may be unwilling to spend its resources in forwarding packets that are not of its direct interest, even though it expects other nodes to forward its packets to the destination. In this paper, we propose a game-theoretic model to facilitate the study of the non-cooperative behaviors in wireless ad hoc networks and analyze incentive schemes to motivate cooperation among wireless ad hoc network nodes to achieve a mutually beneficial networking result.","cites":"5","conferencePercentile":"82.60869565"},{"venue":"WSAN","id":"513668add2b454407b3a0d42c4189af462a9ab5a","venue_1":"WSAN","year":"2007","title":"Wireless communication system for a wide area sensor network","authors":"Magali Cortez, Jaime Sánchez","author_ids":"2724724, 1803525","abstract":"In this paper, the design and implementation of a wireless communication system specific to wide area sensor network capable of establishing ad hoc connections is presented. First, the application to which this system is applied is explained, and then a brief description of the system is made. In this system two routing algorithms were implemented , one based on a static links routing table and the other is the M to 1 algorithm proposed by Lou W. in [1]. Tests were carried out with the designed system and the routing algorithms mentioned, accomplishing satisfactory communication between nodes in a test scenario for the first case.","cites":"0","conferencePercentile":"27.5"}]}