{"WSC.csv":[{"venue":"WSC","id":"8757684e3f5dae8b738010dad0fe6905879f50ab","venue_1":"WSC","year":"2004","title":"Communication Method for Chaotic Encryption in Remote Monitoring Systems for Product e-Manufacturing and e-Maintenance","authors":"Chengliang Liu, Kun Xie, Y. B. Miao, Xuan F. Zha, Zhengjin Feng, Jay Lee","author_ids":"1699591, 2106510, 3335634, 3145972, 2542625, 4333318","abstract":"In chaotic cryptosystems, it is recognized that using (very) high dimensional chaotic attractors for encrypting a given message may improve the privacy of chaotic encoding. In this paper, we study a kind of hyperchaotic systems using some classical methods. The results show that besides the high dimension, the sub-Nyquist sampling interval is also an important factor that can improve the security of the chaotic cryptosystems. We use the method of time series analysis to verify the result.","cites":"0","conferencePercentile":"23.68421053"},{"venue":"WSC","id":"9a3e23c9407d4f336488607974d3db07ed0bd588","venue_1":"WSC","year":"2004","title":"Internet Server Controller Based Intelligent Maintenance System for Products","authors":"Chengliang Liu, Xuan F. Zha, Yubin Miao, Jay Lee","author_ids":"1699591, 3145972, 3295031, 4333318","abstract":"This paper presents the development of an Internet server controller based intelligent maintenance system for products. It also discusses on how to develop products and manufacturing systems using Internet-based intelligent technologies and how to ensure the product quality, coordinate the activities, reduce costs and change maintenance practice from breakdown reaction to breakdown prevention. In the paper, an integrated approach using hardware and software agents (watchdog agent) is proposed to develop the Internet server controller based integrated intelligent maintenance system. The effectiveness of the proposed scheme is verified by developing a real system for the washing machine.","cites":"0","conferencePercentile":"23.68421053"},{"venue":"WSC","id":"e0a84f0c4f276091638bb29e6b84f961c40494e2","venue_1":"WSC","year":"2004","title":"Analyzing Magnification Factors and Principal Spread Directions in Manifold Learning","authors":"Junping Zhang, Li He, Zhi-Hua Zhou","author_ids":"8214747, 1744814, 1692625","abstract":"Great amount of data under varying intrinsic features is thought of as high dimensional nonlin-ear manifold in the observation space. How to analyze the mapping relationship between the high dimensional manifold and the corresponding intrinsic low dimensional one quantitatively is important to machine learning and cognitive science. In this paper, we propose SVD (singular value decomposition) based magnification factors and spread direction for quantitative analyzing the relationship. The result of conducting experiments on several databases show the advantages of this proposed SVD-based approach in manifold learning. 1 Introduction The subspace learning based approach (Turn and Pentland 1991, Nayar et al. 1995) has achieved significant success in pattern recognition and computer vision. While current algorithms deal with linear subspaces such as using principal component analysis (PCA)(Turn and Pentland 1991), images of an object under varying illumination, pose, and non-rigid deformation are empirically thought to constitute highly nonlinear manifold in the observation space, as generated by intrinsic variables. However, these linear methods are bound to ignore subtleties of manifolds such as concavities and protrusions, which is bottleneck to achieve more accurate recognition. This problem should be solved before we can reach high performance recognition system. It is shown empirically that image manifolds may have large curvature (Hau-Minn et al. 1998, Seung and Daniel 2000). We therefore assume that an effective, high performance object recognition system should be based on the manifolds of the objects. Meanwhile, the quantitative analysis of mapping relationship from intrinsic low-dimensional manifold to corresponding high-dimensional manifold and manifold-based matching are the keys to the success. During these years progresses have been achieved in modelling nonlinear subspaces or manifolds. Rich literature exists on manifold learning. On the basis of different representations of manifold learning, this can be roughly classified into four major classes: projection methods, generative methods, embedding methods, and mutual information methods. 1. The first is to find principal surfaces passing through the middle of data, such as the principal curves (Hastie and Stuetzle 1988, Kégl et al. 2000). Though geometrically intuitive, this one has difficulty in generalizing the global variable–arc-length parameter– into higher dimensional surface. 2. The second adopts generative topology models (Bishop et al. 1998, Chang and Ghosh 2001, Smola et al. 1999), and hypothesizes that observed data is generated from the evenly spaced low-dimensional latent nodes. And then the mapping relationship between the observation space and the latent space can be mod-eled. Resulting from the inherent …","cites":"0","conferencePercentile":"23.68421053"}]}