{"WSC_13.csv":[{"venue":"WSC '13","id":"0984bdb2ab6895e1a39cdf64eeeb2bf8503eb44c","venue_1":"WSC '13","year":"2013","title":"Upper bounds on the Bayes-optimal procedure for ranking &#38; selection with independent normal priors","authors":"Jing Xie, Peter I. Frazier","author_ids":"5035226, 2884935","abstract":"We consider the Bayesian formulation of the ranking and selection problem, with an independent normal prior, independent samples, and a cost per sample. While a number of procedures have been developed for this problem in the literature, the gap between the best existing procedure and the Bayes-optimal one remains unknown, because computation of the Bayes-optimal procedure using existing methods requires solving a stochastic dynamic program whose dimension increases with the number of alternatives. In this paper, we give a tractable method for computing an upper bound on the value of the Bayes-optimal procedure, which uses a decomposition technique to break a high-dimensional dynamic program into a number of low-dimensional ones, avoiding the curse of dimensionality. This allows calculation of the optimality gap for any given problem setting, giving information about how much additional benefit we may obtain through further algorithmic development. We apply this technique to several problem settings, finding some in which the gap is small, and others in which it is large.","cites":"0","conferencePercentile":"40.24390244"},{"venue":"WSC '13","id":"8c1e24ed2753c073e70aca59b42b45b39221d088","venue_1":"WSC '13","year":"2013","title":"DEVSMO: an ontology of DEVS model representation for model reuse","authors":"Yunping Hu, Jun Xiao, Hao Zhao, Gang Rong","author_ids":"7741441, 2781973, 2319570, 1881132","abstract":"There are numerous modeling and simulation environments based on DEVS formalism. Due to the incompatible modeling grammars, it has been a challenge to reuse models in different DEVS implementations. Existing XML-based model representations lack general expressions of the behavior of DEVS models and only support one type of DEVS formalism. In this paper, a modeling ontology named DEVSMO is proposed. DEVSMO uses structured programming theory to express the programming logic and uses MathML to express the mathematical models in the model behavior. Structured programming theory and MathML provide a set of standard terminologies, so the generality of model representation is improved. Furthermore, DEVSMO supports both classic and parallel DEVS formalisms and has good reusability for other formalisms. Three cases are developed to test DEVSMO in the usability of expressing model structure and model behavior and in the reusability for further extension.","cites":"0","conferencePercentile":"40.24390244"},{"venue":"WSC '13","id":"17a8f8066f4632923a85b9488e255445a08a22b8","venue_1":"WSC '13","year":"2013","title":"Towards composing ML-Rules models","authors":"Danhua Peng, Alexander Steiniger, Tobias Helms, Adelinde M. Uhrmacher","author_ids":"3195752, 3287126, 2881665, 1743841","abstract":"In cell biology, particularly to describe intra-cellular dynamics, network centered models prevail. Reusing those models requires additional effort as it often prevents a traditional black box based composition, i.e., aggregation, but asks for a fusion of models, where the internals of the models to be composed (not only their interfaces) are accessible as well. This is particularly the case if multi-level models, as those defined in ML-Rules, shall be composed. Still declarative interfaces that are separated from the concrete models help in retrieving suitable models for composition, whether those are aggregated or fused at the end. Here, we present a concept for composing multi-level network centered models.","cites":"2","conferencePercentile":"98.7804878"},{"venue":"WSC '13","id":"0850c17abb119c40ccf9f0e18b49ff14746f979f","venue_1":"WSC '13","year":"2013","title":"An integrated simulation, Markov decision processes and game theoretic framework for analysis of supply chain competitions","authors":"Dong Xu, Young-Jun Son","author_ids":"1714390, 3644385","abstract":"The proposed framework is composed of 1) simulation-based game platform, 2) game solving and analysis module, and 3) Markov decision processes (MDP) module, which are illustrated for a supply chain system under the newsvendor setting through two different phases. At phase 1, the simulation-based game platform is firstly constructed to formulate both the supply chain horizontal and vertical competitions. A novel game solving and analysis procedure is proposed to include 1) strategy refinement, 2) data sampling, 3) gaming solving, and 4) solution quality evaluation. At phase 2, the problem is extended into multi-period setting, in which discrete-time MDP with the discounted criterion is employed. The influences of each agent's competitor decision are incorporated so a stochastic game is formulated, in which a multi-agent reinforcement learning technique is applied as a solution approach. Experimental results demonstrate the system performance, MDP solving effectiveness and efficiency, equilibrium strategies and properties.","cites":"0","conferencePercentile":"40.24390244"}]}