{"WSCD_09.csv":[{"venue":"WSCD '09","id":"3ca7848a43ea96943ab506f377894b13cf05575b","venue_1":"WSCD '09","year":"2009","title":"Query suggestions using query-flow graphs","authors":"Paolo Boldi, Francesco Bonchi, Carlos Castillo, Debora Donato, Sebastiano Vigna","author_ids":"1733343, 1705764, 3747087, 2485865, 1737624","abstract":"The query-flow graph [Boldi et al., CIKM 2008] is an aggregated representation of the latent querying behavior contained in a query log. Intuitively, in the query-flow graph a directed edge from query <i>q</i><sub><i>i</i></sub> to query <i>q</i><sub><i>j</i></sub> means that the two queries are likely to be part of the same search mission. Any path over the query-flow graph may be seen as a possible search task, whose likelihood is given by the strength of the edges along the path. An edge (<i>q</i><sub><i>i</i></sub>, <i>q<sub>j</sub></i>) is also labelled with some information: e.g., the probability that user moves from <i>q</i><sub><i>i</i></sub> to <i>q</i><sub><i>j</i></sub>, or the type of the transition, for instance, the fact that <i>q</i><sub><i>j</i></sub> is a specialization of <i>q</i><sub><i>i</i></sub>.\n In this paper we propose, and experimentally study, query recommendations based on short random walks on the query-flow graph. Our experiments show that these methods can match in precision, and often improve, recommendations based on query-click graphs, without using users' clicks. Our experiments also show that it is important to consider transition-type labels on edges for having good quality recommendations.\n Finally, one feature that we had in mind while devising our methods was that of providing diverse sets of recommendations: the experimentation that we conducted provides encouraging results in this sense.","cites":"79","conferencePercentile":"100"},{"venue":"WSCD '09","id":"a97051c1039c5c8638a801d927212774bfc02899","venue_1":"WSCD '09","year":"2009","title":"Tailoring click models to user goals","authors":"Fan Guo, Lei Li, Christos Faloutsos","author_ids":"2717299, 4236221, 1702392","abstract":"Click models provide a principled way of understanding user interaction with web search results in a query session and a statistical tool for leveraging search engine click logs to analyze and improve user experience. An important component in all existing click models is the user behavior assumption -- how users scan, examine and click web documents listed in the result page. Usually the average user behavior pattern is summarized in a small set of global parameters. Can we fit multiple models with different user behavior parameters on a click data set? A previous study showed that the mixture modeling approach did not lead to better performance despite extra computational cost.\n In this paper, we present how to tailor click models to user goals in web search through query term classification. We demonstrate that better predicative power could be achieved by fitting two click models for navigational queries and informational queries respectively, as evidenced by the likelihood and perplexity evaluation results on a subset of the MSN 2006 RFP data which consists of 121,179 distinct query terms and over 2.8 million query sessions. We also propose search relevance score (SRS) as a flexible evaluation metric of search engine performance. This metric can be derived as summary statistics under any click model, and is applicable to a single query session, a particular query term and the search engine overall.","cites":"20","conferencePercentile":"85.71428571"},{"venue":"WSCD '09","id":"30027f3ee10f35b6ea868a6fee276f5e5b68737b","venue_1":"WSCD '09","year":"2009","title":"Topic-specific analysis of search queries","authors":"Judit Bar-Ilan, Zheng Zhu, Mark Levene","author_ids":"2196262, 6323134, 1722499","abstract":"The analysis of search engine logs is important in order to understand how users interact with a search engine. Conventional analysis of search engine log data looks at various metrics such as query and session length aggregated over the full data set. Here we segment the data according to a top-level ontology of web search and compute the metrics on a topic by topic basis. Our results show that although for a given metric, such as query length, the statistics of most classes are similar to the aggregate statistic; there are usually some outlier classes which exhibit deviant behavior.","cites":"8","conferencePercentile":"50"},{"venue":"WSCD '09","id":"556167b08b9bc1e5df1b6a4e8ac7fbe41542bf3c","venue_1":"WSCD '09","year":"2009","title":"Optimising topical query decomposition","authors":"Marcin Sydow, Francesco Bonchi, Carlos Castillo, Debora Donato","author_ids":"3329147, 1705764, 3747087, 2485865","abstract":"Topical query decomposition (TQD) is a paradigm recently introduced in [1], which, given a query, returns to the user a set of queries that cover the answer set of the original query. The TQD problem was studied as a variant of the set-cover problem and solved by means of a greedy algorithm.\n This paper aims to strengthen the original formulation by introducing a new global objective function, and thus formalising the problem as a combinatorial optimisation one. Such a reformulation defines a common framework allowing a formal evaluation and comparison of different approaches to TQD. We apply simulated annealing, a sub-optimal meta-heuristic, to the problem of topical query decomposition and we show, through a large experimentation on a data sample extracted from an actual query log, that such meta-heuristic achieves better results than the greedy algorithm.","cites":"1","conferencePercentile":"14.28571429"},{"venue":"WSCD '09","id":"26154cff9f15cadc40e84ea90a88b92920e4bda3","venue_1":"WSCD '09","year":"2009","title":"Intentional query suggestion: making user goals more explicit during search","authors":"Markus Strohmaier, Mark Kr&#246;ll, Christian K&#246;rner","author_ids":"1743043, , ","abstract":"The degree to which users' make their search intent explicit can be assumed to represent an upper bound on the level of service that search engines can provide. In a departure from traditional query expansion mechanisms, we introduce <i>Intentional Query Suggestion</i> as a novel idea that is attempting to <i>make users' intent more explicit</i> during search. In this paper, we present a prototypical algorithm for Intentional Query Suggestion and we discuss corresponding data from comparative experiments with traditional query suggestion mechanisms. Our preliminary results indicate that intentional query suggestions 1) diversify search result sets (i.e. it reduces result set overlap) and 2) have the potential to yield higher click-through rates than traditional query suggestions.","cites":"13","conferencePercentile":"71.42857143"}]}