{"WSCG.csv":[{"venue":"WSCG","id":"e4b1d33d99e0ce7a03bcb3ec42dfcc9dafbfbf20","venue_1":"WSCG","year":"2001","title":"An Animation System for User interface Agents","authors":"Marc Alexa, Uwe Berner, Michael Hellenschmidt, Thomas Rieger","author_ids":"1751554, 2386650, 1775344, 3053697","abstract":"With the advent of software agents and assistants, the concept of so called conversational user interfaces evolved, incorporating natural language interaction, dialogue management, and anthropomorphic representations. Today's challenge is to build a suitable visualization architecture for anthropomorphic conversational user interfaces, and to design believable and appropriate face-to-face interaction imitating human attributes such as emotions. The system is designed as an autonomous agent enabling easy integration into a variety of scenarios. Architecture, protocols, and graphical output are discussed.","cites":"7","conferencePercentile":"79.41176471"},{"venue":"WSCG","id":"68df60cf5816f1ac31ef72c79f8a02d9e1ee6ad2","venue_1":"WSCG","year":"2005","title":"Planning with Smart Objects","authors":"Tolga Abaci, Ján Cíger, Daniel Thalmann","author_ids":"3084564, 2371572, 1689760","abstract":"This paper presents a novel method of employing \"smart objects\" for problem solving in virtual environments. Smart objects were primarily used for behavioral animation in the past. The paper demonstrates how to use them for AI and planning purposes as well. We formally define which operations can be performed on a smart object in terms of their requirements and their effects. A planner uses this information to determine the correct sequence of actions needed to achieve a goal. This approach enables intelligent agents to solve problems requiring a collaboration of several agents and complex interactions with objects.","cites":"28","conferencePercentile":"100"},{"venue":"WSCG","id":"3c35b1dcd9b23046122c89712f6cc71ed5c14037","venue_1":"WSCG","year":"2000","title":"Line Art Rendering of Triangulated Surfaces Using Discrete Lines of Curvatures","authors":"Christian Rössl, Leif Kobbelt, Hans-Peter Seidel","author_ids":"3236596, 1763010, 1746884","abstract":"In recent years, several techniques have been proposed for automatically producing line-art illustrations. In this paper a new non photo-realistic rendering scheme for triangulated surfaces is presented. In contrast to prior approaches with parametric surfaces, there is no global parame-terization for triangle meshes. So a new approach is made to automatically generate a direction field for the strokes. Discrete curvature analysis on such meshes allows to estimate differential parameters. Lines of curvature are then constructed to be used as strokes. Using triangulated surfaces allows to render aesthetically pleasing line drawings from a huge class of models. Besides, experiments show that even real time visualization is possible.","cites":"1","conferencePercentile":"32.69230769"},{"venue":"WSCG","id":"2ea9a631563554591dac4639aaffe157d775a150","venue_1":"WSCG","year":"2002","title":"Curvature Measures of 3D Vector Fields and their Applications","authors":"Tino Weinkauf, Holger Theisel","author_ids":"1730185, 1728378","abstract":"Tangent curves are a powerful tool for analyzing and visualizing vector fields. In this paper two of their most important properties are examined: their curvature and torsion. Furthermore, the concept of normal surfaces is introduced to the theory of 3D vector fields, and their Gaussian and mean curvature are analyzed. It is shown that those four curvature measures tend to infinity near critical points of a 3D vector field. Applications utilizing this behaviour for the (topological) treatment of critical points are discussed.","cites":"28","conferencePercentile":"94.30379747"},{"venue":"WSCG","id":"32e523ee43d4dc4fd4ecd9b0563ca484f11a99ea","venue_1":"WSCG","year":"2002","title":"Human Pose Estimation from Silhouettes - A Consistent Approach Using Distance Level Sets","authors":"Cristian Sminchisescu, Alexandru Telea","author_ids":"1781120, 1686665","abstract":"We present a novel similarity measure (likelihood) for estimating three-dimensional human pose from image silhouettes in model-based vision applications. One of the challenges in such approaches is the construction of a model-to-image likelihood that truly reflects the good configurations of the problem. This is hard, commonly due to the violation of consistency principle resulting in the introduction of spurious, unrelated peaks/minima that make the search for model localization difficult. We introduce an entirely continuous formulation which enforces model estimation consistency by means of an attraction/explanation silhouette-based term pair. We subsequently show how the proposed method provides significant consolidation and improved attraction zone around the desired likelihood configurations and elimination of some of the spurious ones. Finally, we present a skeleton-based smoothing method for the image silhouettes that stabilizes and accelerates the search process.","cites":"45","conferencePercentile":"97.46835443"},{"venue":"WSCG","id":"47d087c282190936ca3bcd7b10399b17ea09d526","venue_1":"WSCG","year":"2003","title":"Piecewise Circular Approximation of Spirals and Polar Polynomials","authors":"Francesca Taponecco, Marc Alexa","author_ids":"1940365, 1751554","abstract":"Spirals are surprisingly common in science, nature, physics, astronomy, flora and fauna, and the arts. In Cartesian coordinates they are typically transcendental functions, which makes the evaluation on Cartesian grids an inefficient process. We propose a construction scheme for piecewise circular approximations. The algorithm is convergent and consists of generating center coordinates and radii for quarter circles given an arbitrary monotone polynomial, exponential, or logarithmic function in polar coordinates. Evaluating quarter circles as well as generating the parameters can be done incrementally with few integer operations, thus, the algorithm is fast and stable.","cites":"1","conferencePercentile":"21.8487395"},{"venue":"WSCG","id":"c84546bbbcdce4000708a73953f3b0945b474e9f","venue_1":"WSCG","year":"2013","title":"High-Definition Texture Reconstruction for 3D Image-based Modelling","authors":"Minh Hoang Nguyen, Burkhard Wünsche, Patrice Delmas, Christof Lutteroth, Wannes van der Mark, Eugene Zhang","author_ids":"2239366, 8634193, 1696132, 2990849, 2990819, 1785634","abstract":"Image-based modeling is becoming increasingly popular as a means to create realistic 3D digital models of real-world objects. Applications range from games and e-commerce to virtual worlds and 3D printing. Most research in computer vision has concentrated on the precise reconstruction of geometry. However, in order to improve realism and enable use in professional production pipelines digital models need a high-resolution texture map. In this paper we present a novel system for creating detailed texture maps from a set of input images and estimated 3D geometry. The solution uses a mesh segmentation and charting approach in order to create a low-distortion mesh parameterization suitable for objects of arbitrary genus. Texture maps for each mesh segment are created by back-projecting the best-fitting input images onto each surface segment, and smoothly fusing them together using graph-cut techniques. We investigate the effect of different input parameters, and present results obtained for reconstructing a variety of different 3D objects from input images acquired using an unconstrained and uncalibrated camera.","cites":"1","conferencePercentile":"79.16666667"},{"venue":"WSCG","id":"538e12768a97e3ecd1f0dd09251d37764463501f","venue_1":"WSCG","year":"2002","title":"Layered Relief Textures","authors":"Sergey Parilov, Wolfgang Stuerzlinger","author_ids":"2381464, 3342964","abstract":"In this paper we present an Image-Based Rendering method for post-warping LDI's in real-time on existing systems. The algorithm performs accurate splatting at low computational costs, reduces memory-access bottlenecks, enables us to trade-off the quality for the speed, and is simple to implement.","cites":"6","conferencePercentile":"65.18987342"},{"venue":"WSCG","id":"f84b0e59f67a42ec641e3ec660386e56be4f9d0c","venue_1":"WSCG","year":"2002","title":"Vector Field Metrics Based on Distance Measures of First Order Critical Points","authors":"Holger Theisel, Tino Weinkauf","author_ids":"1728378, 1730185","abstract":"Topological methods have been proven to be useful both for the visualization and the definition of distance measures of vector fields. This paper introduces and assesses a new distance measure for first order critical points of 2D vector fields. This distance measure forms the foundation of the definition of vector field metrics. Based on this we give an advanced and complete classification of all first order critical points.","cites":"18","conferencePercentile":"91.7721519"},{"venue":"WSCG","id":"5a723ac5203bf5e124b53703160b11d4a2ebcd4f","venue_1":"WSCG","year":"2004","title":"Linking Scientific and Information Visualization with Interactive 3D Scatterplots","authors":"Robert Kosara, Gerald N. Sahling, Helwig Hauser","author_ids":"1774937, 3195195, 1699740","abstract":"3D scatterplots are an extension of the ubiquitous 2D scatterplots that is conceptually simple, but so far proved hard to use in practice. But by combining them with a state-of-the-art volume rendering engine, multiple views, and interaction between these views, 3D scatterplots become usable and, in fact, useful. 3D scatterplots can not only show abstract data dimensions, but also the physical layout of points, and thus provide a link between feature space and the actual object. Brushing reveals connections between parts and features that otherwise are hard to find. This link also works not only from feature space to the spatial display, but also vice versa, which gives the user more freedom in exploring the data.","cites":"29","conferencePercentile":"98.98648649"},{"venue":"WSCG","id":"697c470780bd64b32a2f30ee0ebdfd249673ac4e","venue_1":"WSCG","year":"2003","title":"Direction Fields over Point-Sampled Geometry","authors":"Marc Alexa, Tobias Klug, Carsten Stoll","author_ids":"1751554, 1699856, 1835746","abstract":"We describe techniques to establish local frames over point-sampled manifold surfaces. The tangential alignment of local frames is determined using a wave front algorithm starting from a set of pre-defined directions and conquering the remaining points. The repeated application of this algorithm is a relaxation procedure that maximizes coherence along the surface and minimizes the discrepancy to user defined or surface features. The resulting direction field serves as a parameterization for subsequent processes.","cites":"4","conferencePercentile":"52.5210084"},{"venue":"WSCG","id":"0a66ce3992ff6451399c5019f4ce7ad6f4f2d88e","venue_1":"WSCG","year":"2002","title":"Scan Converting Spirals","authors":"Francesca Taponecco, Marc Alexa","author_ids":"1940365, 1751554","abstract":"Scan-conversion of Archimedes' spiral (a straight line in polar coordinates) is investigated. It is shown that an exact algorithm requires transcendental functions and, thus, cannot have a fast and exact integer implementation. Piecewise polynomial approximations are discussed and a simple algorithm based on piecewise circular approximation is derived. Variations of the algorithms allow to scan convert other types of spirals.","cites":"1","conferencePercentile":"22.15189873"},{"venue":"WSCG","id":"593c2f9f942601a947b785683f32f9068267ab51","venue_1":"WSCG","year":"2000","title":"Interactive Focus and Context Display of Large Raster Images","authors":"Uwe Rauschenbach, Tino Weinkauf, Heidrun Schumann","author_ids":"1990188, 1730185, 1729669","abstract":"This paper presents the RECTANGULAR FISHEYE VIEW, an interactive focus–and–context presentation technique for large raster images on mobile computers with small displays and limited processing power. Both the viewing of locally available images and the demand–driven display and transmission of remotely– stored images are supported by the technique. The underlying geometry calculations are explained, and the design decisions for supporting rapid interactive feedback are discussed. A scenario is described which demonstrates the performance of the method.","cites":"7","conferencePercentile":"78.84615385"},{"venue":"WSCG","id":"0950d211b50da8a715433898c779c3621a45edc1","venue_1":"WSCG","year":"2003","title":"The Escritoire: A Personal Projected Display","authors":"Mark Ashdown, Peter Robinson","author_ids":"2564873, 1780152","abstract":"The Escritoire is a horizontal desk surface that uses two overlapping digital projectors to create a foveal display – a large interactive surface that has a high-resolution area to accommodate the user's focus of attention. In contrast to high cost, multi-projector display walls for group presentations or scientific visualization, it is an augmentation of the personal computer, designed for common tasks such as document viewing and annotation. The system is calibrated using planar homographies, and then warps the projected images in real time to compensate for the unconstrained positions of the projectors. To allow documents to be shared by multiple clients, the software is divided into a hardware-specific client driving the display, and a platform-independent server controlling the desk contents.","cites":"12","conferencePercentile":"82.77310924"},{"venue":"WSCG","id":"9b7101321d656516e7d355909ef1d24ed999fb3c","venue_1":"WSCG","year":"2003","title":"Mesh Simplification Based on Shading Characteristic","authors":"Hui Zhang, Huazhong Shu, Limin Luo","author_ids":"1688592, 1691417, 1732408","abstract":"Mesh simplification is a key research area in scientific visualization and virtual reality. The paper presents a new method of polyhedral model simplification based on vision characteristic and edge collapse. This method determines model's vision characteristic by computing the maximum product of angle between normal of vertex and adjacent triangles with area of these triangles. It can achieve a high decimation rate, while keeping the details of vision. This algorithm can also be extended to triangle decimation criterion easily.","cites":"0","conferencePercentile":"7.142857143"},{"venue":"WSCG","id":"d498dd3d8aa39f18f333366c86144cda5d70932a","venue_1":"WSCG","year":"2003","title":"Automatic Text Detection In Video Frames Based on Bootstrap Artificial Neural Network and CED","authors":"Hao Yan, Yi Zhang, Zeng-Guang Hou, Min Tan","author_ids":"3227933, 1738506, 1728395, 1804524","abstract":"In this paper, one novel approach for text detection in video frames, which is based on bootstrap artificial neural network (BANN) and CED operator, is proposed. This method first uses a new color image edge operator (CED) to segment the image and achieve the elementary candidate text block. And then the neural network is introduced into the further classification of the text blocks and the non-text blocks in video frames. The idea of bootstrap is introduced into the training of the ANN, thus improving the effectiveness of the neural network greatly. Experiments results proved that this method is effective.","cites":"16","conferencePercentile":"90.33613445"},{"venue":"WSCG","id":"1cab48238564002240169e8df163224e7af84785","venue_1":"WSCG","year":"2004","title":"External Camera Calibration for Synchronized Multi-video Systems","authors":"Ivo Ihrke, Lars Ahrenberg, Marcus A. Magnor","author_ids":"1749103, 1742056, 1686739","abstract":"We present a method for external camera calibration that is simple to use and offers generality in the positioning of the cameras. This makes it very suitable for the calibration of mobile, synchronized camera setups. We use a camera graph to perform global registration which helps lifting restrictions on the camera setup imposed by other calibration methods. A further advantage is that all information is taken into account simultaneously. The method is based on a virtual calibration object which is constructed over time by tracking an easily identifiable object through three-dimensional space. This implies that no calibration object must be visible simultaneously in all cameras.","cites":"15","conferencePercentile":"93.24324324"},{"venue":"WSCG","id":"731e6bb78131ab7ce94e9773790ef656b4d23f2b","venue_1":"WSCG","year":"2001","title":"A Digital Teletext Service","authors":"Chengyuan Peng, Petri Vuorimaa","author_ids":"1713109, 1704368","abstract":"Digital Teletext is one of the most important interactive services of emerging digital television. As an enhanced version of existing analogue Teletext service, it's a resident application of the set-top box. Its information will be stored in a data carousel and transmitted via broadcasting network. The new service can display smooth graphics and images, have page links and a menu driven navigation method. However, there is no standard specification available for the content format. This paper presents a content format based on Extensible Markup Language (XML). A prototype of digital Teletext system is implemented using the Java programming language.","cites":"4","conferencePercentile":"67.64705882"},{"venue":"WSCG","id":"3c2167d0374f5a6832e0fdfe10dde98f55f70f99","venue_1":"WSCG","year":"2003","title":"Combined Partial Motion Clips","authors":"N. Al-Ghreimil, James K. Hahn","author_ids":"1991751, 3112131","abstract":"We present a motion editing method for articulated figures using Combined Partial Motion Clips (CPMCs). CPMCs contain detailed motion information for some parts of the articulated figure. They can be used to edit base motions in such a way that the parts that are not defined in detail will still be affected thereby emulating the correlation that exists naturally between joint movements. This is achieved through the inclusion of equations in the CPMC that capture the effects of the detailed motion on other degrees of freedom of the articulated figure.","cites":"8","conferencePercentile":"71.8487395"},{"venue":"WSCG","id":"2073371b3abd75d11cbd05fa8521241338ef465e","venue_1":"WSCG","year":"2003","title":"Online Accelerated Rendering of Visual Hulls in Real Scenes","authors":"Ming Li, Marcus A. Magnor, Hans-Peter Seidel","author_ids":"2171049, 1686739, 1746884","abstract":"This paper presents an online system which is capable of reconstructing and rendering dynamic objects in real scenes. We reconstruct visual hulls of the objects by using a shape-from-silhouette approach. During rendering, a novel blending scheme is employed to compose multiple background images. Visibility artifacts on the dynamic object are removed by using opaque projective texture mapping. We also propose a dynamic texture packing technique to improve rendering performance by exploiting region-of-interest information. Our system takes multiple live or pre-recorded video streams as input. It produces realistic real-time rendering results of dynamic objects in their surrounding natural environment in which the user can freely navigate.","cites":"14","conferencePercentile":"87.39495798"},{"venue":"WSCG","id":"f652eaf79dfb1557b3193fe3b4a13e7cf9111858","venue_1":"WSCG","year":"2000","title":"Human Movement Instruction System that Utilizes Avatar Overlays Using Stereoscopic Images","authors":"Masayuki Ihara, Yoshihiro Shimada, Kenichi Kida, Shinichi Shiwa, Satoshi Ishibashi, Takeshi Mizumori","author_ids":"2085754, 2557218, 2268977, 2098107, 1853132, 3240285","abstract":"In the Mixed Reality environment that combines the real world and the virtual world it is important to control the 'place' that comprises both real and virtual objects. In this paper, we study the overlay of humans and avatars in virtual space in the creation of an immersive human movement instruction system that works through a network. In this system, users wear stereoscopic glasses and motion capture devices and perform within an immersive virtual space experience system called CAVE T M. A user can look at a stereoscopic image of an avatar that is displayed over his or her own body. In this project, the authors connected two CAVE T M systems to a network to develop a system that enables model movement instruction and judgment of movement skills to be implemented by people in remote locations. This paper will introduce the setup and configuration of this system.","cites":"1","conferencePercentile":"32.69230769"},{"venue":"WSCG","id":"234f3f5af703090278229d5a1cb9c42fab3e7d13","venue_1":"WSCG","year":"2000","title":"Development of JAVA User Interface for Digital Television","authors":"Chengyuan Peng, Petri Vuorimaa","author_ids":"1713109, 1704368","abstract":"The digital television development is one of the most important events in the history of television broadcasting. This paper highlights the user interface issue in digital television environment. We will not discuss the usability of user interface design, but rather the implementation of user interface for interactive television services. The background of Multimedia Home Platform (MHP) and Application Programming Interface (API) is introduced. The paper describes how to develop a Java user interface, which includes not only graphics but also time-based media (e.g., video). Many functions and effects behind the TV visual image have to be implemented. The special features of digital TV user interface are presented by giving an example (i.e., screen information service for ice hockey). Finally, the future possible research topics are briefly addressed.","cites":"6","conferencePercentile":"73.07692308"},{"venue":"WSCG","id":"ee816b8ac31c33b2c1f2aaea72a5d687e709f246","venue_1":"WSCG","year":"2002","title":"Interaction with Content-Augmented Video via Off-Screen Hyperlinks for Direct Information Retrieval","authors":"Matthias Finke, Dirk Balfanz","author_ids":"2453820, 2465882","abstract":"Video presentation systems currently available provide users with only a few functionality options. With the introduction of an Internet-based back channel, the way is now open for widespread interactive video systems. The convergence of the Internet with broadcast services gives rise to a variety of new application types. It extends the opportunity for a client to retrieve additional video content-related information or to affect the content of a video presentation itself, whether it is a live broadcast or a video-on-demand. The system presented in this paper represents such an interactive application with a number of new options concerning local and global functionalities. To influence video content, a \"off-screen\" hyperlink technique is introduced. This technique enables the annotation of hyperlinks on a separate display from the actual information with which it is linked. In the following, a scenario is given demonstrating the advantages of such a technique.","cites":"3","conferencePercentile":"44.93670886"},{"venue":"WSCG","id":"625935f885cfd6bc6333494a91c866a2f11b8baf","venue_1":"WSCG","year":"2004","title":"Detection of Collisions and Self-collisions Using Image-space Techniques","authors":"Bruno Heidelberger, Matthias Teschner, Markus H. Gross","author_ids":"2119419, 1759233, 1743207","abstract":"Image-space techniques have shown to be very efficient for collision detection in dynamic simulation and animation environments. This paper proposes a new image-space technique for efficient collision detection of arbitrarily shaped, watertight objects. In contrast to existing approaches that do not consider self-collisions, our approach combines the image-space object representation with information on face orientation to overcome this limitation. While image-space techniques are commonly implemented on graphics hardware, software solutions have been neglected so far. In this paper, the performance of two GPU-based implementations and one CPU-based implementation of the proposed collision detection algorithm are compared. Results suggest, that graphics hardware accelerates collision detection in geometrically complex environments, while the CPU-based implementation provides more flexibility and better performance in case of small environments.","cites":"62","conferencePercentile":"100"},{"venue":"WSCG","id":"8510a0049d4fa38f6894dd269bb8e7db3616261f","venue_1":"WSCG","year":"2004","title":"Iterative Stripification of a Triangle Mesh: Focus on Data Structures","authors":"Massimiliano B. Porcu, Riccardo Scateni","author_ids":"2426322, 3204853","abstract":"In this paper we describe the data structure and some implementation details of the tunneling algorithm for generating a set of triangle strips from a mesh of triangles. The algorithm uses a simple topological operation on the dual graph of the mesh, to generate an initial stripification and iteratively rearrange and decrease the number of strips. Our method is a major improvement of a proposed one originally devised for both static and continuous level-of-detail (CLOD) meshes and retains this feature. The usage of a dynamical identification strategy for the strips allows us to drastically reduce the length of the searching paths in the graph needed for the rearrangement and produce loop-free triangle strips without any further controls and post-processing, while requiring a more sophisticated implementation to manage the search and undo operations.","cites":"0","conferencePercentile":"16.89189189"},{"venue":"WSCG","id":"44de296039da6001660dfcd57393c946360b2b89","venue_1":"WSCG","year":"2004","title":"A Hybrid Approach to Rendering Handwritten Characters","authors":"Sara L. Su, Chenyu Wu, Ying-Qing Xu, Harry Shum","author_ids":"3292898, 2408131, 1742571, 1698102","abstract":"With the growing popularity of pen-based computers comes the need to display clear handwritten characters at small sizes on low-resolution displays. This paper describes a method for automatically constructing hinted TrueType fonts from on-line handwriting data. Hints add extra information to glyph outlines in the form of imperative constraints overriding side effects of the rasterization process. We use an aggressive matching strategy to find correspondences between an input glyph and a previously-hinted template, considering both global and local features to allow hinting even when they differ in shape and topology. Recognizing that stroke width statistics are among features that characterize a person's handwriting, we recalculate global values in the control value table (CVT) before transfer to preserve the characteristics of the original handwriting.","cites":"0","conferencePercentile":"16.89189189"},{"venue":"WSCG","id":"d97bdecaf8f9b2bdf8c2793bb3dfa38a1b516ab5","venue_1":"WSCG","year":"2002","title":"A Rotor Platform Assisted System for 3D Hairstyles","authors":"Chia-Ying Lee, Wei-Ru Chen, Eugenia Leu, Ming Ouhyoung","author_ids":"1706365, 1684338, 2655557, 1744863","abstract":"Figure 1: By interactively editing hair, various realistic hairstyles can be created. ABSTRACT This paper presents an interactive system for creating natural looking 3D hairstyles, by which users can cut, comb and perm the hair model and generate realistic hair images. The system contains three stages: modeling, styling and rendering. In the first phrase, the system produces a physical hair model using a cantilever beam simulation with collision detection. Then the styling phrase is a hair editing process, performing styling operations to change the lengths, positions and curvatures of hair strands. Seven operations are developed for styling. A special hardware rotor platform is developed to aid the hair cut process, so that manipulation by two hands that simulate the real styling is made possible. Users can interact with tools and create various convincing hairstyles. Our system together with the rotor platform increases the ease of hairstyling 60% time saving and can render natural hair images with shadow and back-lighting effects.","cites":"6","conferencePercentile":"65.18987342"},{"venue":"WSCG","id":"c0ebb8a39a9a979a7c43aacbd652b10daa190a74","venue_1":"WSCG","year":"2003","title":"Use of Hybrid Rendering Styles for Presentation","authors":"Roland Jesse, Tobias Isenberg","author_ids":"2528669, 3008483","abstract":"This paper presents hybrid rendering that combines the use of photorealistic and non-photorealistic rendering styles in the same image. This allows to extend the set of expression dimensions available in a visualization environment. To provide general applicability, this use of hybrid rendering styles is controlled by an XML-based scene description. We discuss the according schema definition and present an architecture for implementing the presented methods as well as two exemplary applications.","cites":"11","conferencePercentile":"78.57142857"},{"venue":"WSCG","id":"dc6377ab0ba2cbf2382eb095ee03cf7b0f5b2cf5","venue_1":"WSCG","year":"2000","title":"XML Based Mobile Services","authors":"Outi Marttila, Petri Vuorimaa","author_ids":"2441265, 1704368","abstract":"The most remarkable trends in communication have been the huge popularity of Internet and the growth of digital cellular telephony usage. There is a strong demand to combine these two in the form of mobile Internet access. This paper discusses the service implementation issues for the wireless environment. The requirements placed on the services and service development by the mobility are presented, and the usage of the next generation, XML based modeling languages in the wireless services is analyzed. The results are based on the experiments gained from the implementation of three demonstration services.","cites":"5","conferencePercentile":"65.38461538"},{"venue":"WSCG","id":"67505e27327bc6c30ee8fd6cac0a22db2e0e387d","venue_1":"WSCG","year":"2002","title":"Fuzzy Linking Models for Pyramidal Edge Detection","authors":"Zhi-Gang Wang, Wei Wang, Xiao-Ming Xu","author_ids":"3589845, 1706612, 2418703","abstract":"This paper presents a novel approach to multiresolution edge detection, which combines the grayscale morphological filtering, pyramid data structure and fuzzy technique. It mainly addresses the linking of edge nodes at adjacent levels in image pyramid. In previous pyramidal approaches, linking is based on linear relationship and intensity proximity only. The approach proposed here contains multiple linking mechanisms and introduces fuzzy technique. It considers the parent-child linking relationship of edge nodes between the two adjacent levels as fuzzy model, which is trained offline using real image data. Through this fuzzy linking model, the coarse, low-resolution edge map is propagated and refined to the fine, high-resolution edge map in the pyramid. The validation experiment is carried out on one synthetic image and two real images, and the results show that our approach has better performance on the localization and detection of continuous large-scale object boundaries than Canny's edge detector and other previous multiresolution approaches. In addition, the proposed approach has high computational efficiency.","cites":"0","conferencePercentile":"8.860759494"},{"venue":"WSCG","id":"c0dab032cbe6c5e7da321970427552888daac580","venue_1":"WSCG","year":"2004","title":"User-Centric Transfer Function Specification in Augmented Reality","authors":"Bernhard Reitinger, Christopher Zach, Alexander Bornik, Reinhard Beichel","author_ids":"1696492, 1713941, 1742270, 1749679","abstract":"The quality of a 3D volume visualization heavily depends on a representative transfer function which is responsible for mapping the original density values to color and opacity. Finding a suitable transfer function is often a tedious task if done manually in a trial-and-error fashion by specifying piecewise linear functions for each color and opacity channel. Contrary, image-based models exploring features like gradient magnitude, histogram, or edge detection do not consider much user interaction as performed almost autonomously. Hence, we propose a new paradigm which integrates the user into the transfer function specification process. This allows an intuitive specification within an Augmented Reality environment by providing different predefined shape functions which can easily be adjusted. Moreover, a new approach is introduced which utilizes spatial information as an additional transfer function. This opens a completely new way of exploration in volume visualization.","cites":"8","conferencePercentile":"85.13513514"},{"venue":"WSCG","id":"2871a6307238118052cacfca462c84b0774af322","venue_1":"WSCG","year":"2003","title":"Progressive Compression of Visibility Data for View-dependent Multiresolution Meshes","authors":"Christopher Zach, Konrad F. Karner","author_ids":"1713941, 1814788","abstract":"In this paper we present a lossless and optionally lossy compression method for precomputed visibility data for view-dependent multiresolution meshes, which supports out-of-core rendering and progressive transmission through slow connections. Our approach has the feature, that visibility information can be stored directly in the nodes of the multiresolution structure and only necessary parts of visibility data need to be transmitted. Nevertheless our lossless compression method performs better than well-known general purpose solid compressors which inhibit selective access of required data. Even higher compression can be achieved when lossy preprocessing is performed. We evaluate our method on several artificial and real datasets.","cites":"0","conferencePercentile":"7.142857143"},{"venue":"WSCG","id":"a9670a80314870c6de4f26540a9b1e4b34ef76e1","venue_1":"WSCG","year":"2002","title":"Prefetching Policies for Remote Walkthroughs","authors":"Christopher Zach, Konrad F. Karner","author_ids":"1713941, 1814788","abstract":"We present a 3D data streaming approach for remote walkthroughs, that integrates local optimization techniques for realtime rendering with prefetching techniques for remote scene graphs. Especially culling methods, that don't possess frame to frame coherence, can successfully be combined with remote scene databases, if the prefetching algorithm is adapted accordingly. We present a quantitative transmission policy , that takes the limited bandwidth of the network and the limited memory available at the client computer into account.","cites":"7","conferencePercentile":"72.78481013"},{"venue":"WSCG","id":"2f699d7a0a2d4a46a04a94928b7600b7c2526bc1","venue_1":"WSCG","year":"2005","title":"Implementing Multi-Viewer Stereo Displays","authors":"Bernd Fröhlich, Roland Blach, Oliver Stefani, Jan Hochstrate, Jörg Hoffmann, Karsten Klüger, Matthias Bues","author_ids":"5399927, 2872976, 1778636, 2287274, 1829029, 3271955, 2854299","abstract":"In this paper we describe our implementations of multiuser stereo systems based on shuttered LCD-projectors and polarization. The combination of these separation techniques allows the presentation of more than one stereoscopic view on a single projection screen. We built two shutter configurations and designed a combined LC-shutter/polarization setup. Our first test setup was a combination of mechanical shutters for the projectors with liquid crystal (LC) shutters for the users' eyes. The second configuration used LC-shutters only. Based on these configurations we have successfully implemented shuttering of four projectors to support two users with individual perspectively correct stereoscopic views. To improve brightness conditions and to increase the number of simultaneous users, we have designed a combined LC-shutter/polarization filter based projection system, which shows the most promising properties for real world applications.","cites":"21","conferencePercentile":"97.76119403"},{"venue":"WSCG","id":"13998724ca32fc0b31acd65b547b91c26e968e31","venue_1":"WSCG","year":"2001","title":"Fast Polygonization of Implicit Surfaces","authors":"Frédéric Triquet, Philippe Meseure, Christophe Chaillou","author_ids":"2632245, 1797780, 1774410","abstract":"Our work is centered on the use of implicit surfaces in interactive applications (at least 10 frames per sec) running on high-end consumer architecture (modeling, simulation, deformable body animation, games). We focus on the Marching Cubes algorithm that we tried to implement in an optimized way. We restrict our work to blended iso-surfaces generated by skeletons, since this kind of implicit surfaces is the most handy to use for animations. Our implementation optimizations deal with the following features: simplifying the field function, accelerating its evaluation for each point (voxel-based technique), generating automatically the triangles for any case of the Marching Cubes. Another point we have considered concerns tesselation ambiguities often resulting in holes appearing in the surface. We have coded a library which is very easy to use and can be downloaded freely. All these optimizations allow us to sample implicit surfaces composed of 200 points in 45 ms on a 450 MHz Pentium II Xeon.","cites":"23","conferencePercentile":"98.52941176"},{"venue":"WSCG","id":"06b81cd82a23df1775b31c7e4906880c8be9662d","venue_1":"WSCG","year":"2005","title":"Paving Procedural Roads with Pixel Shaders","authors":"Jörn Loviscach","author_ids":"1745536","abstract":"Modern graphics hardware can be used to create procedural geometry. Our proposal details an optimized method to form roads and similar 3D objects by cookie-cutting them from slightly oversized polygons. The roads follow spline-like curves on a plane. The curves and their offset variants are cast into an approximated, implicit description. This can efficiently be evaluated within a pixel shader to discard pixels that are part of the oversized polygons but not part of the roads. Our method guarantees smooth geometry and smooth texturing. To achieve comparable results with roads formed from polygons in the usual way requires level-of-detail or similar mechanisms which not only complicate development and scene management, but also add load on the CPU.","cites":"0","conferencePercentile":"14.92537313"},{"venue":"WSCG","id":"3a292afe5c2a99d8935d91edc45a78802353d91b","venue_1":"WSCG","year":"2004","title":"Emulating an Offline Renderer by 3D Graphics Hardware","authors":"Jörn Loviscach","author_ids":"1745536","abstract":"3D design software has since long employed graphics chips for low-quality real-time previewing. But their dramatically increased computing power now paves the way to accelerate the final high-quality rendering, too. While as yet only one major 3D software package offers a dedicated \" hardware renderer \" for final output, a small number of design applications can leverage the graphics card to support game creation: They display vertex and pixel shader effects in the same way as they appear on the game's screen. We present an approach unifying the use of graphics cards for game design and for final rendering. It is implemented as a plug-in for Maxon Cinema 4D, a standard commercial software package for modelling, animation, and rendering. We examine which factors determine the performance of this solution and discuss corresponding improvements.","cites":"0","conferencePercentile":"16.89189189"},{"venue":"WSCG","id":"aae9540d3a45da55ba4125787d34961f21443a58","venue_1":"WSCG","year":"2003","title":"Complex Water Effects at Interactive Frame Rates","authors":"Jörn Loviscach","author_ids":"1745536","abstract":"Due to the complexity of the effects, it is difficult to achieve photorealism and physically correct motion in interactive 3-D water simulations. We present a simulation and visualization method which goes a long way towards physical reality, e. g. by producing Kelvin ship waves and displaying images of real caustics on the water surface. Using efficient approximations and employing the specialized 3-D and CPU features of modern PCs, this simulation runs at rates of several frames per second. Part of this solution is the emulation of a hardware accumulation buffer on consumer 3-D graphics cards with the help of texture shaders.","cites":"13","conferencePercentile":"85.71428571"},{"venue":"WSCG","id":"13dfa42bc5e279f2d03add01961a38caddd21767","venue_1":"WSCG","year":"2005","title":"Multimodal Interaction Metaphors for Manipulation of Distant Objects in Immersive Virtual Environments","authors":"Frank Steinicke, Timo Ropinski, Klaus H. Hinrichs","author_ids":"1740244, 1703058, 1685162","abstract":"In this paper we discuss direct interaction metaphors for selection and manipulation of distant objects in immer-sive virtual environments and we propose extensions of the improved virtual pointer (IVP) metaphor. In particular , we describe how the process of object selection with the IVP metaphor can be enhanced by modifying the distance calculation used to determine the closest object to be selected. Furthermore we introduce direct 6 DOF manipulations of virtual objects using the IVP metaphor. We demonstrate how the task of object selection can be improved by combining existing interaction metaphors with multimodal feedback.","cites":"10","conferencePercentile":"85.07462687"},{"venue":"WSCG","id":"6888b058e84bc35cad7ee7cbc10704240e132411","venue_1":"WSCG","year":"2005","title":"Towards real-time Body Pose Estimation for Presenters in Meeting Environments","authors":"Ronald Poppe, Dirk Heylen, Anton Nijholt, Mannes Poel","author_ids":"1754666, 1678537, 1745198, 1688157","abstract":"This paper describes a computer vision-based approach to body pose estimation. The algorithm can be executed in real-time and processes low resolution, monocular image sequences. A silhouette is extracted and matched against a projection of a 16 DOF human body model. In addition, skin color is used to locate hands and head. No detailed human body model is needed. We evaluate the approach both quantitatively using synthetic image sequences and qualitatively on video test data of short presentations. The algorithm is developed with the aim of using it in the context of a meeting room where the poses of a presenter have to be estimated. The results can be applied in the domain of virtual environments.","cites":"21","conferencePercentile":"97.76119403"},{"venue":"WSCG","id":"a9d3e727be9ab727fdf1960691629e2ce0f0c165","venue_1":"WSCG","year":"2004","title":"Real-Time Rendering of 3D Magic Lenses having arbitrary convex Shapes","authors":"Timo Ropinski, Klaus H. Hinrichs","author_ids":"1703058, 1685162","abstract":"We present a real-time algorithm for rendering volumetric 3D Magic Lenses™ having arbitrary convex shapes. During fragment processing the algorithm performs a second depth test using a shadow map. Exploiting the second depth test we are able to classify each fragment, with respect to its position relative to the lens volume. Using this classification we first render the geometry behind the lens volume, then the geometry intersecting the lens volume using a different visual appearance and finally the parts in front of the lens volume. Regardless of the shape of the lens volume just two additional rendering passes are needed. Furthermore there are no limitations to the choice of visual appearance used to enhance expressiveness of the virtual world. We will describe theoretical and practical aspects of the algorithm and our implementation, which is accelerated by current graphics hardware.","cites":"17","conferencePercentile":"94.25675676"},{"venue":"WSCG","id":"65fcca5b8fa1958d4cb828fd5214dde826f04905","venue_1":"WSCG","year":"2002","title":"A Graphical User Interface Framework for Digital Television","authors":"Pablo César, Petri Vuorimaa","author_ids":"1743507, 1704368","abstract":"Currently, the number of non-PC devices used for interactive applications is increasing. Digital television set-top boxes, PDAs, and mobile phones are typical examples. Interactive applications are controlled via a Graphical User Interface (GUI). Consequently, a GUI framework is required. The objective is a unified GUI framework for all these new devices. Since one of the new devices is digital television, an implementation of a digital television GUI framework is presented. It has been developed following the HAVi specifications. Its main characteristics are use of Java, separation of look and feel, and lightweight widgets. The implementation is tested with a digital television application. The main conclusion proposed is that new devices should use a device-oriented GUI framework implementation. Moreover, specific implementations can be obtained by modifying the look or feel of the widgets.","cites":"7","conferencePercentile":"72.78481013"},{"venue":"WSCG","id":"897b0dc78a9682e726a5455bafb42e16516f0527","venue_1":"WSCG","year":"2013","title":"Semi-Automatic Synthesis of Videos of Performers Appearing to Play User-Specified Music","authors":"Tomohiro Yamamoto, Makoto Okabe, Yusuke Hijikata, Rikio Onai","author_ids":"2861930, 3102663, 3071700, 2086194","abstract":"We propose a method to synthesize the video of a user-specified band music, in which the performers appear to play it nicely. Given the music and videos of the band members as inputs, our system synthesizes the resulting video by semi-automatically cutting and concatenating the videos temporarily so that these synchronize to the music. To compute the synchronization between music and video, we analyze the timings of the musical notes of them, which we estimate from the audio signals by applying techniques including short-time Fourier transform (STFT), image processing, and sound source separation. Our video retrieval technique then uses the estimated timings of musical notes as the feature vector. To efficiently retrieve a part of the video that matches to a part of the music, we develop a novel feature matching technique more suitable for our feature vector than dynamic-time warping (DTW) algorithm. The output of our system is the project file of Adobe After Effects, on which the user can further refine the result interactively. In our experiment, we recorded videos of performances of playing the violin, piano, guitar, bass and drums. Each video is recorded independently for each instrument. We demonstrate that our system helps the non-expert performers who cannot play the music well to synthesize its performance videos. We also present that, given an arbitrary music as input, our system can synthesize its performance video by semi-automatically cutting and pasting existing videos. Figure 1: We want to synthesize the video of our favorite music (a) played by our band members. We have recorded the performance videos of our band members (b), but they were not perfect. So, we developed a system (c) that takes the music and the videos as inputs, and synthesizes the video composite (d) in which all the members appear to play the music nicely.","cites":"0","conferencePercentile":"29.16666667"},{"venue":"WSCG","id":"daac203f01305d728da43025a8a49600215dc736","venue_1":"WSCG","year":"2005","title":"Realistic Solar Disc Rendering","authors":"Andrei Lintu, Jörg Haber, Marcus A. Magnor","author_ids":"1771477, 1722980, 1686739","abstract":"This paper concentrates on rendering the solar disc considering Rayleigh scattering, Mie scattering, absorption, and refraction. The atmosphere is modeled in layers, each layer having a set of individual optical properties. Based on different atmospheric temperature profiles and climates, the solar disc is rendered in realistic shape and color. In particular, we replicate optical phenomena such as the red and the green flash, limb darkening, and refractive distortions of the solar disc.","cites":"5","conferencePercentile":"66.41791045"},{"venue":"WSCG","id":"4a207685125b658b6978108d0c263d6ac93c0a79","venue_1":"WSCG","year":"2004","title":"Modelling Effects of Wind Fields in Cloth Animation","authors":"Michael Keckeisen, Stefan Kimmerle, Bernhard Thomaszewski, Markus Wacker","author_ids":"1681777, 2163519, 1784345, 2283945","abstract":"In this paper we show how to incorporate effects of wind fields in cloth animations. We discuss two different approaches to model force fields describing air motion and show how these models can be augmented to exhibit interaction with deformable thin objects such as textiles. The first model is based on the Navier-Stokes equations, while the second method extends simple particle tracing methods by the effect of lee. In each case, we present a method for simulating the interaction of cloth movements with the wind field. Both methods have been integrated in an existing cloth simulation system, and we compare their respective advantages and disadvantages.","cites":"5","conferencePercentile":"76.35135135"},{"venue":"WSCG","id":"a8155dbd1544d9df9dc6b79527957fcc47484b51","venue_1":"WSCG","year":"2004","title":"Color Correction Methods with Application to Digital Projection Environments","authors":"Jianfeng Yin, Jeremy R. Cooperstock","author_ids":"2993365, 2242019","abstract":"Due to differing optics, sensor characteristics, and hardware processing employed by video cameras, the resulting colors produced by two cameras can be very different, thus complicating the task of computer vision applications. While various color correction methods exist to deal with this problem, most involve strong assumptions, such as constant illumination, that are, in general, unsatisfied in complex environments. To address the problem of color correction in a less restrictive manner, we propose the use of neural networks, which can easily be trained and which produce excellent results. We compare these results with other methods.","cites":"9","conferencePercentile":"88.17567568"},{"venue":"WSCG","id":"bf97c6ba99222304964d8020663f2044083b5ebb","venue_1":"WSCG","year":"2004","title":"Improving Depth Maps by Nonlinear Diffusion","authors":"Jianfeng Yin, Jeremy R. Cooperstock","author_ids":"2993365, 2242019","abstract":"Dense depth maps, typically produced by stereo algorithms, are essential for various computer vision applications. For general configurations in which the cameras are not necessarily parallel or close together, it often proves difficult to obtain reasonable results for complex scenes, in particular in occluded or textureless regions. To improve the depth map in such regions, we propose a post-processing method and illustrate its benefits to applications such as 3D reconstruction or foreground segmentation of a user in a scene.","cites":"3","conferencePercentile":"62.5"},{"venue":"WSCG","id":"a80993605d9b44bfc4ae13feb78ee5f6cf910d17","venue_1":"WSCG","year":"2002","title":"An Intelligent Hybrid Approach for Design-by-Features","authors":"Lian Ding, Yong Yue","author_ids":"3274828, 2758714","abstract":"This paper presents a new methodology for design-by-features. After a brief background study of design-by-features, a new architecture with a feature library, feature-based model, feature library management and feature-based model management is introduced. A standard feature class is defined for the feature library. Automatic feature-based model management covering interactive functions, identification of feature interaction and maintenance of the model validity is described. Implementation of the work and testing with sample components are presented. Finally, conclusions are drawn and further research summarised.","cites":"0","conferencePercentile":"8.860759494"},{"venue":"WSCG","id":"b273325642cc973e5b952f57f629adeb82dee9d6","venue_1":"WSCG","year":"2004","title":"An Image-Based Multiresolution Model for Interactive Foliage Rendering","authors":"Javier Lluch, Emilio Camahort, Roberto Vivó","author_ids":"1804402, 1694942, 1697249","abstract":"This paper presents a new method for realistic real-time rendering of tree foliage. Some approaches to this problem have been presented before but the quality of their results was not maintainable with respect to changes in view vector and observer distance. Our method is based on a hierarchy of images obtained from pre-processing the botanical tree structure (an L-system) and storing the information in a texture data tree without increasing rendering time. The texture tree is traversed for each frame and an appropriate set of images is extracted and blended with the previous image set. The number of polygons is dramatically reduced – thus enabling interactive visualization and smooth transition between levels of detail. Our method can be easily applied to computer games and visual interactive applications containing vegetation.","cites":"9","conferencePercentile":"88.17567568"},{"venue":"WSCG","id":"6ed842495d9e3a460d67247a11c58d319bd44f67","venue_1":"WSCG","year":"2013","title":"Fast Compression of Meshes for GPU Ray-Tracing","authors":"Vasco Costa, João Madeiras Pereira, Joaquim A. Jorge","author_ids":"1766082, 2832355, 1776503","abstract":"We present a novel and expedite way to compress triangles meshes, fans and strips for ray-tracing on a GPU. Our approach improves on the state of the art by allowing the lossless compression of all connectivity information without changing the mesh configuration, while using linear time and space with the number of primitives. Furthermore , the algorithm can be run on a stream processor and any compressed primitive can be indexed in constant time, thus allowing fast random-access to geometry data to support ray-tracing on a GPU. Furthermore, both triangle and quad meshes compress particularly well, as do many type-specialized mesh structures where all primitives have an equal number of vertexes. Our results show that the compression algorithm allows storing and ray-tracing meshes with tens of millions of triangles on commodity GPUs with only 1GB of memory.","cites":"0","conferencePercentile":"29.16666667"},{"venue":"WSCG","id":"85e20d7b6116916a03d954d9a44b992c67dafbdc","venue_1":"WSCG","year":"2001","title":"Tour Into the Picture Revisited","authors":"Nan Li, Zhiyong Huang","author_ids":"1736069, 6829976","abstract":"TIP (Tour Into the Picture) was introduced by Horry et al. HAA97]. Given only one picture, a viewer can tour into the scene as painted on the picture. Based on our implementation of TIP, we noticed a problem: the visual quality drops drastically when the viewpoint tours into the scene. It contradicted the real world experience. We addressed this problem by introducing the use of multiresolution representation of the picture. We have achieved the goal that the visual quality keeps nearly unchanged in the touring. Moreover, we have integrated the 3D models into TIP. By estimating the light sources, we generated shadows into the scene.","cites":"6","conferencePercentile":"76.47058824"},{"venue":"WSCG","id":"4084b0427e440e82f6bcff3dfeaee11dabacc8bf","venue_1":"WSCG","year":"2001","title":"Modelling Solids and Surfaces with Sketches - an Empirical Evaluation","authors":"Manuel Oliveira, Vladimiro Colaço, Joaquim A. Jorge, Manuel J. Fonseca","author_ids":"2979510, 2368861, 1776503, 1774352","abstract":"This paper presents and evaluates a simple editor for modeling solids and surfaces. The editor uses sketches and gestures as the main interaction paradigm. We want to show that sketch-based interaction for creating 3D scenes is more natural and intuitive than conventional approaches. 1. INTRODUCTION Creating 3D scenes using conventional applications based on the WIMP (Windows, Icons, Mouse and Pointing) paradigm, is mostly a hand and unusual task. Nearly all direct-manipulation based applications use too many menus with too many options, making their use less intuitive and the interactions tedious and time-consuming. To overcome this problem we developed a 3D-scene editor based on sketches. The created scenes can be saved in Quake format. Our application uses the paper and pencil metaphor, offering a set of gestures as the principal way of interaction. Gestures are drawn using a pen and a digitizing tablet expressing graphic primitives (e.g. cones, spheres, etc.) or commands such as delete, copy, etc. We intend to show that interaction techniques based on sketches in drawing applications are faster and more intuitive than menu-and forms-driven interfaces. To this end we have conducted us-ability tests of our prototype comparing its performance with more conventional approaches.","cites":"2","conferencePercentile":"48.52941176"},{"venue":"WSCG","id":"4c6fffae5b16aa01a5004ae9959cc59908ba4749","venue_1":"WSCG","year":"2003","title":"Real-time Animation of Underbrushes","authors":"Luis Carlos Yano Endo, Carlos Hitoshi Morimoto, Antonio Elias Fabris","author_ids":"1692819, 1739048, 1698884","abstract":"Modeling natural phenomena is a problem that has been studied for a long time in Computer Graphics. A problem that currently arises is how to render and animate realistically natural phenomena in real-time. This paper presents a technique to model underbrush with fast and realistic animation. Pre-computations and a simplified physically based model were developed to achieve the work's proposal.","cites":"1","conferencePercentile":"21.8487395"},{"venue":"WSCG","id":"686b6e155b327774e70268d3e2cffd36229a472f","venue_1":"WSCG","year":"2003","title":"Quality Issues of Hardware-Accelerated High-Quality Filtering on PC Graphics Hardware","authors":"Markus Hadwiger, Helwig Hauser, Torsten Möller","author_ids":"1761518, 1699740, 1743737","abstract":"This paper summarizes several quality issues of an approach for high-quality filtering with arbitrary filter kernels on PC graphics hardware that has been presented previously. Since this method uses multiple rendering passes, it is prone to precision and range problems related to the limited precision and range of intermediate computations and the color buffer. This is especially crucial on consumer-level 3D graphics hardware, where usually only eight bits are stored per color component. We estimate the accumulated error of several error sources, such as filter kernel quantization and discretization, precision of intermediate computations, and precision and range of intermediate results stored in the color buffer. We also describe two approaches for improving precision at the expense of a higher number of rendering passes. The first approach preserves higher internal precision over multiple passes that are forced to store intermediate results in the less-precise color buffer. The second approach employs hierarchical summation for attaining higher overall precision by using the available number of bits in a hierarchical fashion. Additionally, we consider issues such as the order of rendering passes that is crucial for avoiding potential range problems, and a variant of hardware-accelerated high-quality filtering that is able to reduce the number of passes by four for filtering single-valued data, thus improving both performance and precision.","cites":"5","conferencePercentile":"59.24369748"},{"venue":"WSCG","id":"75fcbb01bc7e53e9de89cb1857a527f97ea532ce","venue_1":"WSCG","year":"2005","title":"Detection of Facial Landmarks from Neutral, Happy, and Disgust Facial Images","authors":"Ioulia Guizatdinova, Veikko Surakka","author_ids":"2396729, 1718377","abstract":"Automated analysis of faces showing different expressions has been recently studied to improve the quality of human-computer interaction. In this framework, the expression-invariant face segmentation is a crucial step for any vision-based interaction scheme. A method for detecting facial landmarks from neutral and expressive facial images was proposed. In present study, a particular emphasis was given to handling expressions of happiness and disgust. The impact of these expressions on the developed method was tested using dataset including neutral, happiness and disgust images. The results demonstrated a high accuracy in detecting landmarks from neutral images. However, the expressions of happiness and disgust had a deteriorating effect on the landmark detection.","cites":"5","conferencePercentile":"66.41791045"},{"venue":"WSCG","id":"49ac102809645449a1d1c4df74d050ac537971c7","venue_1":"WSCG","year":"2003","title":"The Second Order Particle System","authors":"Tommi Ilmonen, Janne Kontkanen","author_ids":"3051103, 1682553","abstract":"In this paper we present an extension to the classical particle system. We unify particles, particle sources, and force generators into a second order particle system. In the second order particle system the particle sources and force generators are subject to the forces as well as visual particles. This fundamental change, along with suitable set of force classes, enables us to create better real-time simulations of fire, smoke, clouds, and explosions. We use hierarchical spatial subdivision to reduce the computational workload. INTRODUCTION Particle systems h ave been used for computer graphics for decades. During this time minor changes have been made to the fundamental paradigm laid out by Reeves [Ree83]. The classical particle system has particle sources, particles, and forces that affect the particles. Traditional particle systems have several problems due to their overall architecture. Animations made with classical particle systems tend to be rather static – the particles fly around the system, but since the forces are stationary the trajectories of the particles do not change. Typically, this results to animations that look artificial. It is possible to build quite convincing particle effects using the traditional method, but this requires special purpose software, a lot of manual tuning, and a sufficient amount of artistic insight to overcome the limitations of the classical particle system. On the contrary, our approach generates procedural perceptually valid non-static force fields and the animator does not need to animate the behavior of each force manually. Typically particle systems do not have a sufficient number of forces to create lively, organic animations. This problem is demonstrated in figure 1(a) that has valid forces acting on the particles, but only i n the macro level. One could make the animation more realistic by adding vortices, for example, but they would have to be animated since a stationary vortex would not look realistic. (a) Fire with traditional particle system (88 fps) (b) Fire effect with the second order particle system (70 fps). Figure 1. Difference between fires created with the classical-and second order particle systems. Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. To copy otherwise, or republish, to post on servers or to redistribute …","cites":"12","conferencePercentile":"82.77310924"},{"venue":"WSCG","id":"1616704882c80d6d741462ebd667cdcba26335d4","venue_1":"WSCG","year":"2002","title":"The Synthesis of Trees in Chinese Landscape Painting Using Silhouette and Texture Strokes","authors":"Der-Lor Way, Yu-Ru Lin, Zen-Chung Shih","author_ids":"1718115, 2133006, 1707945","abstract":"Practiced for more than three thousand years, Chinese painting emphasizes \"implicit meaning\", and involves painters' using a minimal number of brush strokes to express their deepest feelings. Landscapes are one of the most important themes in Chinese painting. Trees are the essential painting objects. This paper presents a set of novel methods to automatically draw trees in Chinese ink painting from 3D polygonal models. Outline rendering and texture generation uses the information of the silhouette, shade and orientation of three-dimensional model's surface to draw a particular tree. Four reference maps are established to analyze the information for the bark texture. These methods can draw various styles of bark texture by defining the texture patterns. Finally, this paper demonstrates some results obtained with our method.","cites":"18","conferencePercentile":"91.7721519"},{"venue":"WSCG","id":"e98f6d68fa436bba9a11e4006519ad68284d7e56","venue_1":"WSCG","year":"2005","title":"Motion Retargeting for the Hand Gesture","authors":"Chunbao Ge, Yiqiang Chen, Changshui Yang, Baocai Yin, Wen Gao","author_ids":"2207944, 4070304, 2561520, 1714354, 3406319","abstract":"This paper presents a new technique for retargeting the sign language data captured from motion capture device to different characters with different sizes and proportions. Realistic and natural animations can be produced to express similar meanings to the original. The proposed method first defines many sensitive points on the human body and selects the key sensitive points through analyzing the importance of the sensitive points. Next a novel mapping method based on relative position is presented to adapt the original sensitive points to the target sensitive points. Finally we utilize an IK solver to realize the retargeting problem. Experimental results show that the proposed method dramatically improves the recognition rate about 30%.","cites":"2","conferencePercentile":"44.02985075"},{"venue":"WSCG","id":"3c7ac79d1f1c4acfb45aaf56b1858e668284453f","venue_1":"WSCG","year":"2000","title":"A 3D Texture-Based Octree Volume Visualization Algorithm","authors":"Imma Boada, Isabel Navazo, Roberto Scopigno","author_ids":"2264186, 2742570, 7980724","abstract":"Although 3D texture based volume rendering guarantees to obtain image quality almost interactively , it is diicult to maintain this interactivity when the technique has to be exploited on large data sets. In this paper, we propose a new texture memory management policy that substitutes the classical assignation policy of one texel per voxel, applied for the volume representation in texture space, for a more synthetical one that beneets of nearly homogeneous regions and areas of no interest of the volume. Based on this new policy a 3D texture based Octree Volume Visual-ization algorithm, that combines 3D texture hardware and hierarchical representation of volume data, is presented. The algorithm allows multiresolution renderings of very large data sets and guarantees high image quality at regions of special interest. The simpliied representation applied to the non-interesting regions of the volume improves rendering speed.","cites":"2","conferencePercentile":"47.11538462"},{"venue":"WSCG","id":"233b68df2fcf256aaaa55b4192d4f2e9c1430f56","venue_1":"WSCG","year":"2003","title":"Skewed Mirror Symmetry in the 3D Reconstruction of Polyhedral Models","authors":"Ana Piquer Vicent, Pedro C. Calleja, Ralph R. Martin","author_ids":"3307699, 2734910, 4326042","abstract":"We aim to reconstruct three-dimensional polyhedra from axonometric line drawings. Existence of mirror symmetry in polyhedra can assist the reconstruction process. We present a new approach for determining planes of mirror symmetry of such polyhedral objects based on prior detection of their planar faces and any axes of symmetry of these faces. The axes are obtained from skewed facial symmetries, for which we also give a new method of determination.","cites":"8","conferencePercentile":"71.8487395"},{"venue":"WSCG","id":"df2bb71277b07b3abbd938cbd011fca7639da9c3","venue_1":"WSCG","year":"2003","title":"From Dupin Cyclides to Scaled Cyclides","authors":"Lionel Garnier, Sebti Foufou, Marc Neveu","author_ids":"1706140, 1784025, 1767001","abstract":"Dupin cyclides are algebraic surfaces introduced for the first time in 1822 by the French mathematician Pierre-Charles Dupin. They have a low algebraic degree and have been proposed as a solution to a variety of geometric modeling problems. The circular curvature line's property facilitates the construction of the cyclide (or the portion of a cyclide) that blends two circular quadric primitives. In this context of blending, the only drawback of cyclides is that they are not suitable for the blending of elliptic quadric primitives. This problem requires the use of non circular curvature blending surfaces. In this paper, we present another formulation of cyclides: Scaled cyclides. A scaled cyclide is the image of a Dupin cyclide under an affine scaling application. These surfaces are well suited for the blending of elliptic quadrics primitives since they have elliptical lines of curvature. We also show how one can convert a scaled cyclide into a set of rational quadric B ´ ezier patches.","cites":"1","conferencePercentile":"21.8487395"}]}