{"WSFSOUPS.csv":[{"venue":"WSF@SOUPS","id":"430ec1f5b61c924a11323d1a309c9f3df1805fa9","venue_1":"WSF@SOUPS","year":"2016","title":"Comics as a Medium for Privacy Notices","authors":"Bart P. Knijnenburg, David Cherry","author_ids":"2477993, 3437919","abstract":"Online privacy and security notices are rather ineffective: Very few people read them, and those who do find them difficult to understand and remember. How can we create privacy and security notices that are inviting, engaging, com-prehensible, and memorable, even for users with dyslexia or a lower literacy level? In this paper, we propose to investigate the use of comics for privacy and security notices. We describe the ongoing development of comic notices for the \" transparency and choice \" part of Google's privacy policy, as well as a research plan to test these notices against existing notices in various different settings.","cites":"0","conferencePercentile":"57.14285714"},{"venue":"WSF@SOUPS","id":"a5396e8f47e54af0bb69c02be6db15bf2503e3b9","venue_1":"WSF@SOUPS","year":"2016","title":"Applying Cognitive Control Modes to Identify Security Fatigue Hotspots","authors":"Simon Edward Parkin, Kat Krol, Ingolf Becker, M. Angela Sasse","author_ids":"2981068, 2008824, 3438969, 1752376","abstract":"Security tasks can burden the individual, to the extent that security fatigue promotes habits that undermine security. Here we revisit a series of user-centred studies which focus on security mechanisms as part of regular routines, such as two-factor authentication. By examining routine security behaviours, these studies expose perceived contributors and consequences of security fatigue, and the strategies that a person may adopt when feeling overburdened by security. Behaviours and strategies are framed according to a model of cognitive control modes, to explore the role of human performance and error in producing security fatigue. Security tasks are then considered in terms of modes such as unconscious routines and knowledge-based ad-hoc approaches. Conscious attention can support adaptation to novel security situations, but is error-prone and tiring; both simple security routines and technology-driven automation can min-imise effort, but may miss cues from the environment that a nuanced response is required.","cites":"0","conferencePercentile":"57.14285714"},{"venue":"WSF@SOUPS","id":"7343c5aa753c7eaabe8c4b413366287336136b1f","venue_1":"WSF@SOUPS","year":"2016","title":"PriBots: Conversational Privacy with Chatbots","authors":"Hamza Harkous, Kassem Fawaz, Kang G. Shin, Karl Aberer","author_ids":"2720602, 1910642, 1730051, 1751802","abstract":"Traditional mechanisms for delivering notice and enabling choice have so far failed to protect users' privacy. Users are continuously frustrated by complex privacy policies, unreach-able privacy settings, and a multitude of emerging standards. The miniaturization trend of smart devices and the emergence of the Internet of Things (IoTs) will exacerbate this problem further. In this paper, we propose Conversational Privacy Bots (PriBots) as a new way of delivering notice and choice through a two-way dialogue between the user and a computer agent (a chatbot). PriBots improve on state-of-the-art by offering users a more intuitive and natural interface to inquire about their privacy settings, thus allowing them to control their privacy. In addition to presenting the potential applications of PriBots, we describe the underlying system needed to support their functionality. We also delve into the challenges associated with delivering privacy as an automated service. PriBots have the potential for enabling the use of chatbots in other related fields where users need to be informed or to be put in control.","cites":"0","conferencePercentile":"57.14285714"},{"venue":"WSF@SOUPS","id":"320bb084a1da77f05f9075490fd36e7ec052888a","venue_1":"WSF@SOUPS","year":"2016","title":"Drone-based Privacy Interfaces: Opportunities and Challenges","authors":"Florian Schaub, Pascal Knierim","author_ids":"1794574, 2190958","abstract":"Providing users with awareness and control about privacy-sensitive information flows is a major challenge in Internet of Things scenarios, because of constrained input and output capabilities of the involved sensors and devices. We propose the use of autonomous personal drones, specifically nanocopters, as device-independent drone-based privacy interfaces. Nanocopters have the potential to indicate privacy risks, visualize information flows, and provide tangible privacy controls within a smart environment without being tethered to specific IoT devices. We provide an overview of recent advancements in human-drone interaction and describe our vision of leveraging personal drones as privacy indicators and controls, including a discussion of opportunities and associated challenges.","cites":"0","conferencePercentile":"57.14285714"}]}