{"WSICCTVX.csv":[{"venue":"WSICC@TVX","id":"cdaa1423306ffa82dc25497974cc32a2dcb2eb49","venue_1":"WSICC@TVX","year":"2016","title":"WorldViews: Connecting the world through easy sharing of views","authors":"Don Kimber, Enock Glidden, Jennifer Marlow","author_ids":"2178004, 7592565, 1680630","abstract":"The confluence of technologies such as telepresence, immersive imaging, model based virtual mirror worlds, mobile live streaming, etc. give rise to a capability for people anywhere to view and connect with present or past events nearly anywhere on earth. This capability properly belongs to a public commons, available as a birthright of all humans, and can been seen as part of an evolutionary transition supporting a global collective mind. We describe examples and elements of this capability, and suggest how they can be better integrated through a tool we call TeleViewer and a framework called WorldViews, which supports easy sharing of views as well as connecting of providers and consumers of views all around the world.","cites":"0","conferencePercentile":"50"},{"venue":"WSICC@TVX","id":"9cc4fa4d0358620098082b50afbe94fb1cce0884","venue_1":"WSICC@TVX","year":"2015","title":"Web-Powered Virtual Site Exploration Based on Augmented 360 Degree Video via Gesture-Based Interaction","authors":"Maarten Wijnants, Gustavo Rovelo, Donald Degraen, Peter Quax, Kris Luyten, Wim Lamotte","author_ids":"2078593, 2438351, 2655932, 1794986, 1681624, 1775641","abstract":"Physically attending an event or visiting a venue might not always be practically feasible (e.g., due to travel overhead). This article presents a system that enables users to remotely navigate in and interact with a real-world site using 360° video as primary content format. To showcase the system, a demonstrator has been built that affords virtual exploration of a Belgian museum. The system blends contributions from multiple research disciplines into a holis-tic solution. Constituting technological building blocks include 360° video, the Augmented Video Viewing (AVV) methodology that allows for Web-driven annotation of video content, a walk-up-and-use mid-air gesture tracking system to enable natural user interaction with the system, Non-Linear Video (NLV) constructs to unlock semi-free visitation of the physical site, and the MPEG-DASH (Dynamic Adaptive Streaming over HTTP) standard for adaptive media delivery purposes. The system's feature list will be enumerated and a high-level discussion of its technological foundations will be provided. The resulting solution is completely HTML5-compliant and therefore portable to a gamut of devices.","cites":"0","conferencePercentile":"45"}]}