{"WSIWSOUPS.csv":[{"venue":"WSIW@SOUPS","id":"a394ec59eb036aec8a088bfb09f88c7682ebf798","venue_1":"WSIW@SOUPS","year":"2016","title":"What Questions Remain? An Examination of How Developers Understand an Interactive Static Analysis Tool","authors":"Tyler Thomas, Heather Lipford, Bill Chu, Justin Smith, Emerson R. Murphy-Hill","author_ids":"2215686, 4134931, 1743971, 5721623, 1695992","abstract":"Security vulnerabilities are often accidentally introduced as developers implement code. While there are a variety of existing tools to help detect security vulnerabilities, they are seldom used by developers due to the time or security expertise required. We are investigating techniques integrated within the IDE to help developers detect and mitigate security vulnerabilities. In previous work, we examined the questions developers ask when investigating security vulner-abilities with static analysis tools. With those questions as a lens, we now investigate our proposed approach of interactive static analysis. We evaluated the interactions and perceptions of professional developers as they interacted with warnings produced by our tool. Our results provide evidence that our approach effectively communicates security vulnerability information to software developers and provides design guidance for such tools.","cites":"0","conferencePercentile":"58.33333333"},{"venue":"WSIW@SOUPS","id":"24d620c2e85932c4589e4ba192f9dc56b61d694d","venue_1":"WSIW@SOUPS","year":"2016","title":"Preliminary Findings from an Exploratory Qualitative Study of Security-Conscious Users of Mobile Authentication","authors":"Flynn Wolf, Ravi Kuber, Adam J. Aviv","author_ids":"1732832, 1712686, 3076315","abstract":"Authentication on mobile devices is a research priority for the development of usable and trustworthy platforms. However, users may struggle to understand how to balance security and usability for the broad range of important data-driven social and financial transactions on their devices. This concern is especially prevalent in security information workers sensitized to mobile technology vulnerabilities by information about security risk. The purpose of this study is to better understand the mental models and practices of those security conscious users from academia, industry, and government, from an explorative qualitative approach, noting that mobile authentication studies have largely overlooked the mindset of users who have considered their behavior in terms of detailed knowledge of risk. A preliminary analysis of findings is presented in this paper. Participants described usability and situational impairment issues, and concern for data security arising from highly contextual combinations of technology and situational risk. Implications for development of security methods derived from these views are discussed, such as the need for authentication rigor to be driven by more contextualized understanding of task and location-based risk.","cites":"0","conferencePercentile":"58.33333333"},{"venue":"WSIW@SOUPS","id":"e9c630c96a919c7ccf39abdae5796351a1f8ee33","venue_1":"WSIW@SOUPS","year":"2016","title":"The Cybersecurity Competition Experience: Perceptions from Cybersecurity Workers","authors":"Colin Wee, Masooda Bashir, Nasir D. Memon","author_ids":"3436773, 2991298, 1719861","abstract":"How do workers within the field of cybersecurity perceive cybersecurity competitions? This study aims to address this question and investigate if competitions left a positive mark on the information security workers who participated in them. In this paper, we report on an online survey of current employees of the cybersecurity industry who had once participated in Cybersecurity Awareness Week, one of the most established cybersecurity competitions in the world. We examine their perceptions of the competition in general, the skills they learnt from the competition, and whether they felt the competition was beneficial to them. Data from 89 cybersecurity workers showed that competitions taught them useful skills related to their job, especially skills related to reverse engineering and analytic skills. Their competition experience was also a major influence in their career-decision making.","cites":"0","conferencePercentile":"58.33333333"}]}