{"WSKS.csv":[{"venue":"WSKS","id":"14d0d765c9ce4c76714ae3b1646d3e60d5fda53f","venue_1":"WSKS","year":"2010","title":"Towards Understanding IT Needs of Social Activists: The Case of the World Social Forum 2006 Organizing Process","authors":"Saqib Saeed, Markus Rohde, Volker Wulf","author_ids":"1766859, 2723041, 1722564","abstract":"Recent literature has highlighted that most civil society organizations lack IT appropriation in their work practices. There is strong need to focus on this application area to empower these organizations by IT capabilities. As there is not much literature about the specific needs assessment of voulantary organizations, there is a need to carry out ethnographic studies to better understand IT requirements of this sector. In this paper we have investigated the organizing process of the World Social Forum 2006 event in Karachi, Pakistan. World Social Forum is an important gathering of social movements and voulantary organizations across the globe, and organizing such an event requires extensive communication and effective planning skills. The objective of this paper is to highlight the need and importance of this research issue. Our intention is to introduce appropriate technology in the organizing process to facilitate social activists.","cites":"0","conferencePercentile":"30.35714286"},{"venue":"WSKS","id":"4e7e7a659f64cf6a797581967f04133d92899aa9","venue_1":"WSKS","year":"2008","title":"An Annotation-Based Access Control Model and Tools for Collaborative Information Spaces","authors":"Peyman Nasirifard, Vassilios Peristeras, Stefan Decker","author_ids":"1919677, 1695205, 1685642","abstract":"We present an Annotation-Based Access Control model supported by a Collaboration Vocabulary (CoVoc) as a more flexible and user-centric access control approach in social platforms and shared workspaces. We present also briefly two SOA-based tools for enabling our approach: Uncle-Share is a gadget that provides annotation-based access control for bookmarks and uses CoVoc for annotating collaborative relationships. Who-With-Whom uses also CoVoc and visualizes extended social networks in order to help users to select the appropriate contacts to grant access to resources.","cites":"2","conferencePercentile":"67.56756757"},{"venue":"WSKS","id":"893bef316f438ee75fe70969c06ec59c0daddbe7","venue_1":"WSKS","year":"2010","title":"An Empirical Study of IT Use in Pakistani Civil Society Organizations","authors":"Saqib Saeed, Markus Rohde, Volker Wulf","author_ids":"1766859, 2723041, 1722564","abstract":"As voulantary organizations are differnt form business and governmental organizations in terms of structure, working methodologies and decision making, we are interested in the specific IT requirements and use in this sector. In this paper we investigate the Pakistani civil society sector to analyze the involvement of technology in their work settings. The paper also discusses two successful virtual voulantary organizations to highlight the potential of new media. The findings suggest that lack of technological and financial resources hinder them to adopt innovative solutions. The technological use is mostly limited, but the realization of its importance and urge to establish ICT infrastructures exist. So there is need for appropriating technology so that this sector in collaboration with government institutions can serve the public in a better way.","cites":"1","conferencePercentile":"69.64285714"},{"venue":"WSKS","id":"a6e304792e145d8a0cdaf77761719efa7ace0a8c","venue_1":"WSKS","year":"2008","title":"Designing IT Systems for NGOs: Issues and Directions","authors":"Saqib Saeed, Markus Rohde, Volker Wulf","author_ids":"1766859, 2723041, 1722564","abstract":"IT support in voulantary organizations is an interesting emergent field of research. Recent literature has highlighted that many NGOs are still in early stage of IT adoption, in their organizational settings. In this paper we analyze types and organizational structures of voulantary organizations to find out the factors which differentiate IT support in these organizations as compared to other organizations. The paper reviews the state of the art and discusses important issues which are worth investigating for the improvement of IT support in voulantary organizations.","cites":"1","conferencePercentile":"48.64864865"},{"venue":"WSKS","id":"20c2410dcb0321455cc39dec1e77cffd94d54d73","venue_1":"WSKS","year":"2009","title":"Learning Objects Quality: Moodle HEODAR Implementation","authors":"Carlos Muñoz, Miguel Ángel Conde González, Francisco J. García-Peñalvo","author_ids":"3081908, 1687759, 1722931","abstract":"One of the most important aspects of a \" continuously in change \" society is to improve everything everywhere. In order to obtain the best products, they should be periodically evaluated and reengineering. So the evaluation task and, of course, the adequate results interpretation, can make all the difference between competitors. eLearning is similar to this products. Different issues can be evaluated to make learning process getting better and better, such as tutors, platform software and contents. In this last issue, it can be included the minimum knowledge unit: the Learning Object (LO). There exists different models and methods for LO evaluation. What is pretended with this work is to choose one model and implement a singularly tool, in order to automatically evaluate this Learning Objects and produce a set of information, that can be used to improve those Learning Objects. In this case it is implemented the evaluation model called HEODAR in the University of Salamanca framework.","cites":"1","conferencePercentile":"55"},{"venue":"WSKS","id":"2e4a880e75f3c3a539ba2b0421189e5fafb9b5b6","venue_1":"WSKS","year":"2010","title":"Usability Evaluation of Web-Based Collaboration Support Systems: The Case of CoPe_it!","authors":"Nikos Karousos, Spyridon Papaloukas, Nektarios Kostaras, Michalis Nik Xenos, Manolis Tzagarakis, Nikos I. Karacapilidis","author_ids":"1726949, 1717697, 3320789, 1748767, 1692449, 1733476","abstract":"Usability is considered as a very significant factor towards the wide acceptance of software applications. Although the usability evaluation can take place in different forms, the entire evaluation procedure usually follows prede-fined ways according to a classification of the common characteristics of software applications. However, contemporary Web 2.0 applications, which aim at both social network development and collaboration support, reveal the need for modifying the settings of the evaluation procedure. This is due to some unique characteristics of these applications, such as the support of both synchronous and asynchronous collaboration, the use of common spaces for working and information exchanging, and the advanced notification and awareness services. This paper explores these applications' particularities with respect to the way the whole usability evaluation procedure is affected and proposes a composite evaluation technique based on the development of appropriate heuristics that is suitable for such cases. The aforementioned issues are elaborated through the case of CoPe_it!, a Web 2.0 tool that facilitates and enhances argumentative collaboration.","cites":"2","conferencePercentile":"82.14285714"},{"venue":"WSKS","id":"eac7bab1960b5dc513a45f0198251e2f0f0ecfed","venue_1":"WSKS","year":"2010","title":"A Survey on Ontology Metrics","authors":"Francisco J. García-Peñalvo, Francisco J. García-Peñalvo, Roberto Therón","author_ids":"1722931, 1722931, 1713356","abstract":"Ontologies have been widely used in almost any field of application. The use of ontologies should involve the possibility of evaluation of the quality and correctness of them. Some tools and metrics have been proposed to reach this goal. ONTOMETRIC, OntoQA and Protégé represent the most important tools to evaluate ontologies. On the other hand, diverse cohesion, coupling and ranking metrics have also been proposed, as well as methodologies such as OntoClean. This paper analyses these tools and metrics, compare them and finally reviews the current state-of-the-art concerning to ontology metrics.","cites":"0","conferencePercentile":"30.35714286"}]}