{"WSM_10.csv":[{"venue":"WSM '10","id":"3b3829a4abce647291dbecccd16f2c20dbc6e409","venue_1":"WSM '10","year":"2010","title":"Automatic video archaeology: tracing your online videos","authors":"Junge Shen, Tao Mei, Xinbo Gao","author_ids":"3106835, 1788123, 1717818","abstract":"We propose in this paper an automatic video archaeology (AVA) system which is able to trace the manipulation history of online videos. The key of AVA is the construction of a video migration map, which represents the history of how videos have been copied or manipulated among a set of near-duplicates. To construct this map, we designed six kinds of video manipulation detectors, including spatial and temporal scaling detectors, spatial and temporal overlay detectors, boarder detector, and grayscale detector. There are a variety of applications based on the proposed AVA system, such as better understanding of the meaning and context conveyed by the manipulated videos, improving current video search engines by better presentation based on the migration map and better indexing scheme based on the annotation propagation. We evaluated the system over a video set with 12,790 videos and 3,481 duplicates. The experimental results show that AVA is able to effectively discover the manipulation relationship among the near-duplicate videos.","cites":"1","conferencePercentile":"22.22222222"},{"venue":"WSM '10","id":"916ce247957230ba432991cb8969b3d8d7f11dee","venue_1":"WSM '10","year":"2010","title":"Online social networks for personal informatics to promote positive health behavior","authors":"Noreen Kamal, Sidney Fels, Kendall Ho","author_ids":"1873617, 1749457, 3031954","abstract":"Social network services are becoming increasingly popular, and people are using these networks to obtain and share information. The application of social network and social media to the collection, storage and review of personal information presents opportunities for improved personal health management. This paper presents a survey of the literature on the models for the use of online social networks and models for health behavior change. These are then combined to present a framework for health behavior change through social media. This framework is then used to develop a prototype for the system design.","cites":"17","conferencePercentile":"88.88888889"},{"venue":"WSM '10","id":"e9e1cdff60a6309244a23cbd87f1ce9c543be257","venue_1":"WSM '10","year":"2010","title":"Hyper-community detection in the blogosphere","authors":"Thin Nguyen, Dinh Phung, Brett Adams, Truyen Tran, Svetha Venkatesh","author_ids":"1707147, 1749657, 1760106, 6254479, 1679520","abstract":"Most existing work on learning community structure in social network is graph-based whose links among the members are often represented as an adjacency matrix, encoding direct pairwise associations between members. In this paper, we propose a method to group online communities in blogosphere based on the topics learnt from the content blogged. We then consider a different type of online community formulation - <i>the sentiment-based grouping of online communities</i>. The problem of sentiment-based clustering for community structure discovery is rich with many interesting open aspects to be explored. We propose a novel approach for addressing hyper-community detection based on users' sentiment. We employ a nonparametric clustering to automatically discover hidden hyper-communities and present the results obtained from a large dataset.","cites":"6","conferencePercentile":"72.22222222"}]}