{"WSMAI.csv":[{"venue":"WSMAI","id":"86c70f62b6257881e2ebf561fcdde8a1cf87c7ce","venue_1":"WSMAI","year":"2003","title":"Semi-automatic Composition ofWeb Services using Semantic Descriptions","authors":"Evren Sirin, James A. Hendler, Bijan Parsia","author_ids":"1748784, 1701341, 1720331","abstract":"As web services become more prevalent, tools will be needed to help users find, filter and integrate these services. Composing existing services to obtain new functionality will prove to be essential for both business-to-business and business-to-consumer applications. We have developed a prototype that guides a user in the dynamic composition of web services. Our semi-automatic process includes presenting matching services to the user at each step of a composition, filtering the possibilities by using semantic descriptions of the services. The generated composition is then directly executable through the WSDL grounding of the services. We tested our system by generating semantic descriptions for some of the common services available on the web such as translator, dictionary and map services. We also applied our approach to a prototype sensor network environment where each sensor provides its data as a network service.","cites":"255","conferencePercentile":"100"},{"venue":"WSMAI","id":"6d9162fb285c3d53bdcf65c5756c1a7e829d47cf","venue_1":"WSMAI","year":"2003","title":"An Open Abstract Framework for Modeling Interoperability of Mobile Learning Services","authors":"Giorgio Da Bormida, Giancarlo Bo, Paul Lefrere, Josie Taylor","author_ids":"2963239, 1706360, 2792816, 1983815","abstract":"The MOBIlearn project, co-funded by the European Commission, the National Science Foundation and AU Department of Education, Science and Training, is strategically positioned to provide relevant research outcomes in the field of innovative use of mobile environments to meet the needs of learners, working by themselves and with others. The objectives are achieved by defining a set of mobile services identified and specified through an open abstract framework. This assures proper interoperability between MOBIlearn services themselves and existing services provided by third parties, such as the Open Knowledge Initiative or the IMS Global Learning Consortium. The paper introduces the MOBIlearn project and its underlying approach describing the Open Mobile Access Abstract Framework (OMAF).","cites":"5","conferencePercentile":"62.5"}]}