{"WSNA.csv":[{"venue":"WSNA","id":"bc0d6d0b0ca70e027bf0e13de31c1b99fa190883","venue_1":"WSNA","year":"2002","title":"Calibration as parameter estimation in sensor networks","authors":"Kamin Whitehouse, David E. Culler","author_ids":"1760250, 1706858","abstract":"We describe an ad-hoc localization system for sensor networks and explain why traditional calibration methods are inadequate for this system. Building upon previous work, we frame calibration as a parameter estimation problem; we parameterize each device and choose the values of those parameters that optimize the overall system performance. This method reduces our average error from 74.6% without calibration to 10.1%. We propose ways to expand this technique to a method of autocalibration for localization as well as to other sensor network applications.","cites":"180","conferencePercentile":"60"},{"venue":"WSNA","id":"4073c78622198b73c4bed4b98a6b5a521f3bba3a","venue_1":"WSNA","year":"2002","title":"The bits and flops of the n-hop multilateration primitive for node localization problems","authors":"Andreas Savvides, Heemin Park, Mani B. Srivastava","author_ids":"1988604, 1786699, 1702254","abstract":"The recent advances in MEMS, embedded systems and wireless communication technologies are making the realization and deployment of networked wireless microsensors a tangible task. Vital to the success of wireless microsensor networks is the ability of microsensors to ``collectively perform sensing and computation''. In this paper, we study one of the fundamental challenges in sensor networks, node localization. The collaborative multilateration presented here, enables ad-hoc deployed sensor nodes to accurately estimate their locations by using known beacon locations that are several hops away and distance measurements to neighboring nodes. To prevent error accumulation in the network, node locations are computed by setting up and solving a global non-linear optimization problem. The solution is presented in two computation models, centralized and a fully distributed approximation of the centralized model. Our simulation results show that using the fully distributed model, resource constrained sensor nodes can collectively solve a large non-linear optimization problem that none of the nodes can solve individually. This approach results in significant savings in computation and communication, that allows fine-grained localization to run on a low cost sensor node we have developed.","cites":"332","conferencePercentile":"73.33333333"},{"venue":"WSNA","id":"01cb625e99fb608a6bcd8b9385cc258d4c52ed2d","venue_1":"WSNA","year":"2002","title":"Sensor deployment strategy for target detection","authors":"Thomas Clouqueur, Veradej Phipatanasuphorn, Parameswaran Ramanathan, Kewal K. Saluja","author_ids":"2902821, 2871918, 4175169, 1680821","abstract":"In order to monitor a region for traffic traversal, sensors can be deployed to perform collaborative target detection. Such a sensor network achieves a certain level of detection performance with an associated cost of deployment. This paper addresses this problem by proposing path exposure as a measure of the goodness of a deployment and presents an approach for sequential deployment in steps. It illustrates that the cost of deployment can be minimized to achieve the desired detection performance by appropriately choosing the number of sensors deployed in each step.","cites":"155","conferencePercentile":"53.33333333"},{"venue":"WSNA","id":"19d9d5e14d4d3f3e4ef66e00cdbc11ff6a93e9d5","venue_1":"WSNA","year":"2002","title":"GHT: a geographic hash table for data-centric storage","authors":"Sylvia Ratnasamy, Brad Karp, Li Yin, Fang Yu, Deborah Estrin, Ramesh Govindan, Scott Shenker","author_ids":"1699297, 1803296, 1757989, 1721643, 1736486, 1747970, 1753148","abstract":"Making effective use of the vast amounts of data gathered by large-scale sensor networks will require scalable, self-organizing, and energy-efficient data dissemination algorithms. Previous work has identified data-centric routing as one such method. In an asso-ciated position paper [23], we argue that a companion method, data-centric storage (DCS), is also a useful approach. Under DCS, sensed data are stored at a node determined by the name associated with the sensed data. In this paper, we describe GHT, a Geographic Hash Table system for DCS on sensornets. GHT hashes keys into geographic coordi-nates, and stores a key-value pair at the sensor node geographically nearest the hash of its key. The system replicates stored data lo-cally to ensure persistence when nodes fail. It uses an efficient consistency protocol to ensure that key-value pairs are stored at the appropriate nodes after topological changes. And it distributes load throughout the network using a geographic hierarchy. We evaluate the performance of GHT as a DCS system in simulation against two other dissemination approaches. Our results demonstrate that GHT is the preferable approach for the application workloads predicted in [23], offers high data availability, and scales to large sensornet deployments, even when nodes fail or are mobile.","cites":"496","conferencePercentile":"93.33333333"},{"venue":"WSNA","id":"6b926c867d9ee19849a29087450056ed42d14a81","venue_1":"WSNA","year":"2002","title":"PSFQ: a reliable transport protocol for wireless sensor networks","authors":"Chieh-Yih Wan, Andrew T. Campbell, Lakshman Krishnamurthy","author_ids":"1809428, 1690035, 1783508","abstract":"We propose <i>PSFQ (Pump Slowly, Fetch Quickly</i>), a reliable transport protocol suitable for a new class of reliable data applications emerging in wireless sensor networks. For example, currently sensor networks tend to be application specific and are typically hard-wired to perform a specific task efficiently at low cost; however, there is an emerging need to be able to re-task or reprogram groups of sensors in wireless sensor networks on the fly (e.g., during disaster recovery). Due to the application-specific nature of sensor networks, it is difficult to design a single monolithic transport system that can be optimized for every application. PSFQ takes a different approach and supports a simple, robust and scalable transport that is customizable to meet the needs of different reliable data applications. To our knowledge there has been little or no work on the design of an efficient reliable transport protocol for wireless sensor networks, even though some techniques found in IP networks have some relevance to the solution space, such as, the body of work on reliable multicast. We present the design and implementation of PSFQ, and evaluate the protocol using the ns-2 simulator and an experimental wireless sensor testbed based on Berkeley motes. We show through simulation and experimentation that PSFQ can out perform existing related techniques (e.g., an idealized SRM scheme) and is highly responsive to the various error conditions experienced in wireless sensor networks, respectively.","cites":"334","conferencePercentile":"80"},{"venue":"WSNA","id":"7e359f8fa3ba07cca2458ae95b341d7937810ac3","venue_1":"WSNA","year":"2002","title":"Efficient tracing of failed nodes in sensor networks","authors":"Jessica Staddon, Dirk Balfanz, Glenn Durfee","author_ids":"2143669, 2465882, 1945610","abstract":"In sensor networks, nodes commonly rely on each other to route messages to a base station. Although this practice conserves power it can obscure the cause of a measurement outage in a portion of the network. For example, when a base station ceases to receive measurements from a region of nodes it can't immediately determine whether this is because of the destruction of all the nodes in that region (due to an enemy attack, for example) or merely the result of the failure of a few nodes bearing much of the routing load. Previous solutions to this problem typically consist of re-running the route-discovery protocol, a process that can be quite expensive in terms of the number of messages that must be exchanged. We demonstrate that the topology of the network can be efficiently conveyed to the base station allowing for the quick tracing of the identities of the failed nodes with moderate communication overhead. Our algorithms work in conjunction with the existing functions of the network, requiring the nodes to send no additional messages.","cites":"69","conferencePercentile":"20"},{"venue":"WSNA","id":"3fd7b05e1d540d65bd49d9c0749245f47604fd14","venue_1":"WSNA","year":"2002","title":"A dual-space approach to tracking and sensor management in wireless sensor networks","authors":"Jie Liu, Patrick Cheung, Feng Zhao, Leonidas J. Guibas","author_ids":"1699746, 2763330, 5164095, 1744254","abstract":"Wireless <i>ad hoc</i> sensor networks have the advantage of spanning a large geographical region and being able to collaboratively detect and track non-local spatio-temporal events. This paper presents a dual-space approach to event tracking and sensor resource management in sensor networks. The dual-space transformation maps a non-local phenomenon, <i>e.g.</i>, the edge of a half-plane shadow, to a single point in the dual space, and maps locations of distributed sensor nodes to a set of lines that partitions the dual space. The detection problem becomes finding and tracking the cell that contains the point in the arrangement defined by these lines. This mechanism can be effectively used for power management of the sensor network - nodes that will not be immediately visited by an event can be turned off to save energy required for sensing, processing, and communication. The approach has been successfully demonstrated on a laboratory testbed built using the UC Berkeley motes sensors. An implemented application of detecting and tracking light shadow edges moving over a sensor field is described.","cites":"76","conferencePercentile":"26.66666667"},{"venue":"WSNA","id":"1b04b0296dc64e8a7e42f79cc0376c03066214e8","venue_1":"WSNA","year":"2002","title":"Wireless sensor networks for habitat monitoring","authors":"Alan M. Mainwaring, David E. Culler, Joseph Polastre, Robert Szewczyk, John Anderson","author_ids":"1683001, 1706858, 1729210, 1735911, 6868026","abstract":"We provide an in-depth study of applying wireless sensor networks to real-world habitat monitoring. A set of system design requirements are developed that cover the hardware design of the nodes, the design of the sensor network, and the capabilities for remote data access and management. A system architecture is proposed to address these requirements for habitat monitoring in general, and an instance of the architecture for monitoring seabird nesting environment and behavior is presented. The currently deployed network consists of 32 nodes on a small island off the coast of Maine streaming useful live data onto the web. The application-driven design exercise serves to identify important areas of further work in data sampling, communications, network retasking, and health monitoring.","cites":"590","conferencePercentile":"100"},{"venue":"WSNA","id":"21533934935021954a598f893eb0ce10b296b157","venue_1":"WSNA","year":"2002","title":"Rumor routing algorthim for sensor networks","authors":"David Braginsky, Deborah Estrin","author_ids":"2235009, 1736486","abstract":"Advances in micro-sensor and radio technology will enable small but smart sensors to be deployed for a wide range of environmental monitoring applications. In order to constrain communication overhead, dense sensor networks call for new and highly efficient methods for distributing queries to nodes that have observed interesting events in the network. A highly efficient data-centric routing mechanism will offer significant power cost reductions [17], and improve network longevity. Moreover, because of the large amount of system and data redundancy possible, data becomes disassociated from specific node and resides in regions of the network [10][7][8]. This paper describes and evaluates through simulation a scheme we call Rumor Routing, which allows for queries to be delivered to events in the network. Rumor Routing is tunable, and allows for tradeoffs between setup overhead and delivery reliability. It's intended for contexts in which geographic routing criteria are not applicable because a coordinate system is not available or the phenomenon of interest is not geographically correlated.","cites":"116","conferencePercentile":"40"}]}