{"WSTFEUS.csv":[{"venue":"WSTFEUS","id":"a3ddf15da97478e1797d05b0803c5a3729b80298","venue_1":"WSTFEUS","year":"2004","title":"An Event Model for Real-Time Systems in Mobile Environments","authors":"René Meier, Jörg Kaiser, Barbara Hughes, Cristiano Brudna, Vinny Cahill","author_ids":"1716090, 1707047, 3042098, 2613048, 1687186","abstract":"This paper describes an event model that has been designed to address the predictability requirements of applications operating in mobile environments based on hierarchically structured WAN-of-CANs networks. The event model supports an event channel concept for modeling the guarantees provided by the underlying heterogeneous communication infrastructure. The networks that comprise such a WAN-of-CANs may provide fundamentally different degrees of quality of service and as a result can be viewed as zones within which certain guarantees can be enforced. Event channels operating in CAN-based subnetworks typically with strong timing behavior may support hard temporal and reliability attributes whereas channels interconnecting these subnetworks using wireless networks support weaker timing attributes.","cites":"4","conferencePercentile":"50"},{"venue":"WSTFEUS","id":"c82b5364a66409797c5897b436f8e0c002f28b0a","venue_1":"WSTFEUS","year":"2004","title":"Using Virtualized Operating Systems as a Ubiquitous Computing Infrastructure","authors":"Shuichi Oikawa, Midori Sugaya, Masatoshi Iwasaki, Tatsuo Nakajima","author_ids":"1684924, 2442092, 2598081, 2846273","abstract":"The Personalization of computing environments is one of the key aspects of ubiquitous computing, and such personal-ization requires isolated computing environments for better security and stability. This paper describes our ubiquitous computing infrastructure architecture that is based on vir-tualized operating systems in order to enable ubiquitous devices and servers to be shared securely and reliably. Our architecture also includes CPU resource management mechanisms to support time sensitive applications and to make the execution of applications stable on shared devices.","cites":"1","conferencePercentile":"15"}]}