{"WTAOP.csv":[{"venue":"WTAOP","id":"b04c86c200c7b044dc289881655aff15c76ee2a0","venue_1":"WTAOP","year":"2006","title":"Towards regression test selection for AspectJ programs","authors":"Jianjun Zhao, Tao Xie, Nan Li","author_ids":"2812641, 1749839, 1736069","abstract":"Regression testing aims at showing that code has not been adversely affected by modification activities during maintenance. Regression test selection techniques reuse tests from an existing test suite to test a modified program. By reusing such a test suite to retest modified programs, maintainers or testers can reduce the required testing effort. This paper presents a regression test selection technique for AspectJ programs. The technique is based on various types of control flow graphs that can be used to select from the original test suite test cases that execute changed code for the new version of the AspectJ program. The code-base technique operates on the control flow graphs of AspectJ programs. The technique can be applied to modified individual aspects or classes as well as the whole program that uses modified aspects or classes.","cites":"15","conferencePercentile":"83.33333333"},{"venue":"WTAOP","id":"712bd72885ba119028e2e7abf6ba3fef8a2dffb4","venue_1":"WTAOP","year":"2006","title":"Testing aspect-oriented programming Pointcut Descriptors","authors":"Otávio Augusto Lazzarini Lemos, Fabiano Cutigi Ferrari, Paulo César Masiero, Cristina V. Lopes","author_ids":"1815847, 2868771, 2982809, 8265496","abstract":"Pointcut Descriptors (PCDs) are used to specify sets of program join points with a common property where additional behavior should be applied. If PCDs are wrongly formulated, faults are injected into the program, because additional behavior will be applied to unintended join points or will fail to be applied to intended join points. In this paper we classify the types of faults that can occur in PCDs -- in terms of selected join points -- and present a two-step strategy to: 1) help the tester identifying extra join points selected by PCDs; and 2) help the tester identifying neglected join points that should be selected by PCDs in the first place. We focus on the first step but provide motivating examples and directions for both.","cites":"24","conferencePercentile":"100"}]}