{"WTS.csv":[{"venue":"WTS","id":"e232b003c2d0887a16d65227837c5db26324e4d3","venue_1":"WTS","year":"2013","title":"Analytical estimation of service requests capacity in LTE-A systems with heterogeneous traffic","authors":"Enrique René Bastidas-Puga, Guillermo Galaviz, Ángel G. Andrade, David Covarrubias","author_ids":"1898805, 3239615, 2024067, 7727972","abstract":"—The scheduler is the entity within Long Term Evolution wireless systems responsible for the assignment of time and frequency resources to users. In this work we present an analysis to determine the scheduling Service Requests Capacity for Long Term Evolution Advanced systems, defined as the quantity of service requests the scheduler is able to dispatch in a given period of time. This methodology can be used to evaluate scheduling algorithms along with some other metrics widely employed such as system throughput, delay or fairness. Numerical results are presented for the proposed metric including upper and lower bounds considering a specific system with heterogeneous traffic in a non line of sight urban macro cellular scenario. For the case studied, results suggest that the file size has a more significant impact on the service requests capacity than the requested data rate.","cites":"0","conferencePercentile":"37.5"},{"venue":"WTS","id":"637768b72de9cdf4bf35cd858192b01dcc093ed4","venue_1":"WTS","year":"2014","title":"WiFi iLocate: WiFi based indoor localization for smartphone","authors":"Xiang He, Shirin Badiei, Daniel N. Aloi, Jia Li","author_ids":"4944407, 2441422, 3181357, 1687366","abstract":"—In recent years, the increasing popularity of smartphones has promoted the development of location-aware applications. However, highly accurate indoor localization by smartphones remains an open problem. In this paper, we present WiFi iLocate – a system that can help track the location and movement of a smartphone user in indoor environments. The system applies Gaussian process regression to train the collected WiFi received signal strength (RSS) dataset, and particle filter for the estimation of the smartphone user's location and movement. Simulations were conducted in MATLAB to test the performance and provide more insights of the proposed approach. The experiments carried with an iOS device in typical library environment illustrate that our system is an accurate, real-time, press-to-go system.","cites":"4","conferencePercentile":"100"},{"venue":"WTS","id":"69eea30ac329844ee068ed14e055138783565ac7","venue_1":"WTS","year":"2015","title":"MobileCoach: A novel open source platform for the design of evidence-based, scalable and low-cost behavioral health interventions: Overview and preliminary evaluation in the public health context","authors":"Andreas Filler, Tobias Kowatsch, Severin Haug, Fabian Wahle, Thorsten Staake, Elgar Fleisch","author_ids":"2407249, 1793743, 2905124, 2752290, 3100752, 2801545","abstract":"—Effective and efficient behavioral interventions are important and of high interest today. Due to shortcomings of related approaches, we introduce MobileCoach (mobile-coach.eu) as novel open source behavioral intervention platform. With its modular architecture, its rule-based engine that monitors behavioral states and triggers state transitions, we assume MobileCoach to lay a fruitful ground for evidence-based, scalable and low-cost behavioral interventions in various application domains. The code basis is made open source and thus, MobileCoach can be used and revised not only by interdisciplinary research teams but also by public bodies or business organizations without any legal constraints. Technical details of the platform are presented as well as preliminary empirical findings regarding the acceptance of one particular intervention in the public health context. Future work will integrate Internet of Things services that sense and process data streams in a way that MobileCoach interventions can be further tailored to the needs and characteristics of individual participants .","cites":"1","conferencePercentile":"80"},{"venue":"WTS","id":"1a1355449d193f889a9003f638e0e3f6651b1fbd","venue_1":"WTS","year":"2008","title":"Collaborative storage with mobile devices in wireless networks for P2P media sharing","authors":"Fulu Li, David P. Reed, Andrew Lippman","author_ids":"2440608, 1739599, 1808594","abstract":"Information storage and storage sharing are key components of modern networked computer systems. Mobile devices such as PDAs and cell phones normally have very limited storage capacities compared with PCs or laptops, while storing a large number of media objects (such as e-books, pictures and videos, etc.) on mobile devices could take a lot of space. In this paper, we study collaborative storage with mobile devices, where contributory storage infrastructure is constructed among a group of mobile devices for P2P (peer-to-peer) media sharing. We analyze the design tradeoffs of the collaborative storage system with mobile devices via concrete application examples in different settings. In this study, we focus on two main performance metrics: (1) the availability rate for a stored data object in the collaborative storage system when a peer node tries to access the given item, and (2) the uploading and retrieval delay for a stored data object of different sizes in a variety of circumstances. We experimentally verify the performance and feasibility of the constructed prototype of a shared e-library with a collection of e-books, pictures and videos based upon the paradigm of collaborative storage with mobile devices.","cites":"1","conferencePercentile":"37.5"},{"venue":"WTS","id":"cd9d79a9a692507694bfc5c24448c53b62d1b16c","venue_1":"WTS","year":"2012","title":"A node scheduling based on partition for WSN","authors":"Yimei Kang, Yang Han, Jiang Hu","author_ids":"2954991, 3838342, 5498214","abstract":"WSN can have a node scheduling based on partition. Employment of such technique can reduce energy consumption of wireless sensor nodes and prolong the network lifetime. Firstly the monitoring area was partitioned into equal virtual grid, according to which the algorithm has two working mode one is monitoring mode and other one is tracking mode. In case of former only one node worked in each grid according to scheduling cycle for the reduction of energy consumption, which balances the work among the nodes and also enhances the lifetime of WSN. In case of latter more nodes were woken up to get the précised minutest details without losing the target. This is the effective lifetime that could be stressed or changed accordingly. The schedulable node set was being made in which nodes can work in their turns and the coverage and connectivity is being discussed. In order to control energy consumption as little as possible a threshold was kept for the waking up and sleeping of sensors. The simulation results show that the node scheduling brings results both in network effective lifetime and in energy consumption and this algorithm prolongs the lifetime of the network twice than PEAS.","cites":"2","conferencePercentile":"70.83333333"},{"venue":"WTS","id":"82530020bf76ddc7839450752e6968639891d5a0","venue_1":"WTS","year":"2014","title":"CrowdHelp: M-Health application for emergency response improvement through crowdsourced and sensor-detected information","authors":"Liliya I. Besaleva, Alfred C. Weaver","author_ids":"2899656, 1681571","abstract":"Preventing natural disasters is beyond our capabilities, but providing better information to disaster management professionals (DMPs) and affected persons is not. Current disaster management systems get their primary inputs from 911 calls and from observations of first responders. Typically such interactions do not follow a prescribed scenario and they do not produce uniform results. Additionally, this process is slow and cumbersome and subject to transcription error [2][12]. We propose an expanded information gathering and distribution tool which uses crowdsourcing to deliver more accurate information to disaster managers more quickly than can be done with existing systems. Using our system, CrowdHelp, people within the radius of a natural disaster are able to send text, pictures, videos, locations, and descriptions of what they see. Our software analyzes the data received, authenticates the sender, removes inputs that are likely to be malicious, clusters reports by type, urgency, or location as desired by the human operator, then displays the results on a map along with suggestions to the operator concerning what type of help is most needed. CrowdHelp also collects additional sensor information from smartphones for future analysis by professional disaster management organizations.","cites":"1","conferencePercentile":"55"},{"venue":"WTS","id":"11d16362ff77ea64823dcf8ec4d94942550fcd81","venue_1":"WTS","year":"2012","title":"Adaptive threshold for energy detector based on Discrete Wavelet Packet Transform","authors":"Zhijin Qin, Nan Wang, Yue Gao, Laurie G. Cuthbert","author_ids":"1830444, 1715792, 1744619, 8715562","abstract":"—One promising approach to achieving high precision and low complexity in a cognitive radio system is the energy detector based on the Discrete Wavelet Packet Transform (DWPT). However, the thresholds used in previous spectrum detection algorithms are fixed values determined by false alarm probability and sample points. When the Signal to Noise Ratio (SNR) is lower than 5dB, an energy detector with fixed threshold may falsely determine some unoccupied sub-channels as occupied. In this paper, a threshold adapter adopting adaptive threshold is proposed to increase the detection sensitivity, meanwhile, reduce the computational complexity. Simulation results are presented to demonstrate the effectiveness of this algorithm.","cites":"0","conferencePercentile":"29.16666667"},{"venue":"WTS","id":"566f14fd9d5e717e6802a1500eeb5a09b0725bd0","venue_1":"WTS","year":"2012","title":"Channel and traffic status aware relay selection and traffic queue analysis in wireless user-relaying networks","authors":"Xing Zhang, Jing Xiao, Yue Gao, Wenbo Wang","author_ids":"1743897, 1724419, 1744619, 1722461","abstract":"User relaying is a very effective technique to achieve cooperative diversity in wireless networks. In this paper, a new relay selection scheme is proposed jointly considering the channel conditions and traffic status of relay nodes. We introduce traffic model with MMPP (two-state Markov Modulated Poisson Process) for all users, and then jointly taking into account the different QoS (quality of service) requirements and the channel conditions for each user; according to the proposed relay selection scheme, adopt a direct transfer mode, or a user-relaying transfer mode by using AF (amplify-and-forward) strategy, in order to reduce the outage probability of source node and minimize the effects on collaborative users as well. Finally, from queuing theory point of view, according to the system equilibrium equation, we analyze traffic queue performances of source and relay nodes and evaluate the proposed relay selection scheme compared with traditional schemes. Simulation results show that the proposed relay selection scheme can significantly improve the transmission performance of the source node, while reduce queue length of the relay nodes by more than 30% when average SNR is small, and achieve a better cooperative diversity gain.","cites":"0","conferencePercentile":"29.16666667"}]}