{"WUWNet.csv":[{"venue":"WUWNet","id":"1316b68aeabafd66ddf80b051e214ed2da2e3d64","venue_1":"WUWNet","year":"2014","title":"On Capacity and Delay Scaling Laws in Underwater Acoustic Networks","authors":"Guang-yu Fan, Huifang Chen, Lei Xie, Jun-Hong Cui","author_ids":"3019777, 1810024, 4043707, 1690957","abstract":"Network capacity is a fundamental issue for terrestrial wireless networks and underwater acoustic networks (UWANs). The underwater acoustic channel, which is characterized by a path loss depending on the transmission distance and the signal frequency, is quite different from the terrestrial wireless one. And sensor nodes are usually deployed sparsely in UWANs. The capacity of UWANs is much more difficult to analyze than that of terrestrial wireless networks. Based on special characteristics of UWANs, the capacity and the delay scaling laws in different UWANs are analyzed in this paper. First, we study the capacity scaling and the delay scaling in two-dimensional extended and dense networks. Then, the results are extended to three-dimensional UWANs.","cites":"0","conferencePercentile":"37"},{"venue":"WUWNet","id":"2949a1a464b0128b002b48f65f4c547c19c9418b","venue_1":"WUWNet","year":"2012","title":"Dynamic block-cycling over a linear network in underwater acoustic channels","authors":"Zhaohui Wang, Shengli Zhou, Zhengdao Wang, Bing Wang, Peter Willett","author_ids":"4207326, 1701232, 2309374, 1718232, 1678922","abstract":"The underwater acoustic (UWA) environment is known to have large spatial and temporal variations. In this paper, we propose a dynamic cooperative relaying protocol, termed dynamic block-cycling (DBC) protocol, for a UWA linear network. Considering large channel variations, we assume one node can hear from not only its direct but also several remote neighbors. A transmission package with multiple blocks is taken as one relay unit, where an erasure-correction code and an error-correction code are used for inter-block encoding and intra-block encoding, respectively. During the relaying process, each node in the proposed protocol starts relaying immediately after it decodes the relayed message, hence a reduced end-to-end transmission latency can be achieved. Meanwhile, to avoid the overhead for relay cooperation, the relays' transmissions are cyclically synchronized, such that in each time slot, the blocks arriving at the downstream receiving nodes from all the upstream transmitting nodes have the same block index. Numerical results showthat for a one-shot transmission, the proposed protocol achieves a reduced end-to-end delay relative to existing protocols while maintaining a decent outage performance.","cites":"3","conferencePercentile":"78.57142857"},{"venue":"WUWNet","id":"4500de12f8619f41447568f46588029a4b8bfd09","venue_1":"WUWNet","year":"2011","title":"Scheduled MAC in beacon overlay networks for underwater localization and time-synchronization","authors":"Wouter van Kleunen, Nirvana Meratnia, Paul J. M. Havinga","author_ids":"2643047, 1784678, 1679046","abstract":"In this article we introduce a MAC protocol designed for underwater localization and time-synchronisation. The MAC protocol assumes a network of static reference nodes and allows blind nodes to be localized by listening-only to the beacon messages. Such a system is known to be very scalable. We show localization and time-synchronization algorithms can be designed for listen-only blind nodes by adapting the equations from GPS. We extend the set of GPS equations with angular information to reduce the number of beacons a blind node has to receive before it can determine its position.\n We evaluate scheduled and unscheduled communication for sending reference-beacon message using simulation mechanisms. Our experimental results show that when energy-consumption of the beacons is of concern or when the modulation rate is low (&#8804; 1<i>kbps</i>), scheduled communication is preferred. For systems which are not concerned with the energy-consumption of the beacons, unscheduled communication delivers more messages to the blind-nodes and localization and time-synchronization are performed faster in case of high modulation rates (5<i>kbps</i> and 10<i>kbps</i>).","cites":"3","conferencePercentile":"82.35294118"},{"venue":"WUWNet","id":"1d73f0b5922015eabfd7ce479457a52b85c4c0a6","venue_1":"WUWNet","year":"2013","title":"A new amphibious network infrastructure with hybrid acoustic and radio links","authors":"Yun Liu, Fangjiong Chen, Fei Ji, Hua Yu, Jun Zhang","author_ids":"1801632, 2976182, 7264520, 7279054, 1752214","abstract":"Due to limited bandwidth and slow propagation speed, acoustic multi-hop connections in conventional underwater networks are much less efficient than terrestrial networks. To solve these problems, we propose the concept of amphibious networks, which are composed of hybrid acoustic and radio links. A water-surface radio network is seamlessly connected with the underwater acoustic (UWA) network, and serves as the transmission backbone network. This new network infrastructure can improve underwater multi-hop communication. The underwater hop count is expected to be limited to a minimum, thus saving routing overhead and reducing mutual interference of underwater communications. Some key issues of this new network infrastructure are discussed in this paper.","cites":"0","conferencePercentile":"34.69387755"},{"venue":"WUWNet","id":"bdcdef3c3a60affd1b5425ff33b833e05e29ef3d","venue_1":"WUWNet","year":"2012","title":"Ocean-TUNE UCLA testbed for subsurface current mapping: extended abstract","authors":"Seongwon Han, Burkard Baschek, Mario Gerla","author_ids":"2534520, 1822706, 8467438","abstract":"This documentation contains future plans for the Ocean-TUNE supported deployment at UCLA of an open testbed suite, accessible to the public. The testbed will consist of U/W sensors that flow with ocean currents and allow us to map them. The UCLA subsurface current mapping testbed will be deployed \"on demand\" in the coastal region of the Southern California Bight including Santa Monica Bay, San Pedro Channel and near Catalina Island. The proposed subsurface current measurements taken simultaneously from different locations will complement existing observations. Surface currents will be compared and correlated to subsurface currents.","cites":"1","conferencePercentile":"54.08163265"},{"venue":"WUWNet","id":"6a89c9cbddb043cdda98e60ad4ed5e1683cee70a","venue_1":"WUWNet","year":"2015","title":"FRFT-based Parameter Estimation of Time-varying Wideband Underwater Acoustic Multipath Channels","authors":"Yanbo Zhao, Hua Yu, Gang Wei, Fei Ji, Fangjiong Chen, Jun Zhang","author_ids":"2202653, 7279054, 1701274, 7264520, 2976182, 1752214","abstract":"The time-varying property and wideband nature are considered as the most difficult challenges of the underwater acoustic channels. Due to the low propagation speed of the sound, the relative motion between the transmitter and receiver can result in serious Doppler effect. Even if both of the platforms stay still, the multipath signals along different eigenrays vary in angles of arrival, hence the radial velocities. Such Doppler velocities brings different time compressions or dilations to the multipath signals. In addition, as the signal bandwidth is usually comparable to the center frequency, it is more appropriate for the underwater acoustic channels to be modeled as wideband channels. In this paper, the parameter estimation of the wideband time-varying underwater acoustic channels is investigated. Linear frequency modulation signals are used as the training sequences, and the fractional Fourier transform is the key of the estimation algorithm. The communication scenario, with a fixed transmitter and a moving receiver, is built by the Bellhop software. The generated channel impulse response shows obvious time-varying property, as well as sparsity, in the multipath amplitudes and delays. The estimation result recovers the channel impulse response very well, thus confirms the effectiveness of the proposed method.","cites":"0","conferencePercentile":"46.42857143"},{"venue":"WUWNet","id":"d0a91e6f592d0ee55a517cd133897a333267d718","venue_1":"WUWNet","year":"2015","title":"WaterCom: A Multilevel, Multipurpose Underwater Communications Test Platform","authors":"Ciarán McGoldrick, Mark Matney, Enrique Segura, Youngtae Noh, Mario Gerla","author_ids":"3440647, 3374410, 7439260, 1773189, 8467438","abstract":"Underwater Communications is very much an experimental science because of the complex medium - the water - and its unpredictable propagation properties, thus mandating experiments to validate theory. The medium is particularly challenging for the transmission of acoustic and optical signals. Thus, the true performance of a transmitter/receiver system can be evaluated only in the water. It would then appear that UW research be inevitably associated with a testbed. However, this is not always the case because UW testbeds are difficult to set up, calibrate and instrument. The purpose of the recent NSF CRI Ocean-TUNE project is precisely that of deploying inexpensive UW testbeds accessible by the Community. UCLA, as a participant in the Ocean-TUNE project, has recognized that one UW testbed cannot fit all applications and therefore has been developing WaterCom, a multilevel testing platform consisting of three testbeds - small, medium and large scale. The small testbed is deployed in a tank, with two modems; it is used for point-to-point communications at close range. It is instrumented for remote access and allows the testing of variable TX power values with different obstacles, reflected rays absorption and water purity values (for optical experiments). The medium scale testbed, deployed at the Marina del Rey UCLA boathouse, will enable remotely monitored experiments of MAC and network protocols with three nodes, one of them mobile. The large scale open water testbed is deployed in the Catalina channel. It will employ OFDM Modems as well as small submersible, mobile platforms. WaterCom will enable two types of experiments: environment measurements, like subsurface currents, presence of deposits in the water, etc, and; network protocol and application measurements in the open water. The paper describes the testbeds in detail and introduces preliminary small scale testbed measurements.","cites":"2","conferencePercentile":"97.61904762"},{"venue":"WUWNet","id":"40ff054137a8de3039e0a536a5b725201eeaeccd","venue_1":"WUWNet","year":"2009","title":"Tradeoffs and design choices for a software defined acoustic modem: a case study: extended abstract","authors":"Andrew Gray, Payman Arabshahi, Sumit Roy, Newell Jensen, Leonard T. Tracy, Nathan Parrish, Chung Hsieh","author_ids":"2288388, 3137740, 1689296, 3305232, 2788216, 2990906, 2265625","abstract":"Challenges in developing high performance underwater acoustic modems can be summarized as:\n 1. <i>Lack of maturity in underwater acoustic communications technology at all layers of the communication stack</i>. This stems in part from the complex and dynamic nature of the underwater channel.\n 2. <i>Spatially and temporally dynamic nature of the underwater acoustic channel</i>. Theoretically \"high performance\" communications may not be achievable using the largely channel-specific (channel-static) processing techniques similar to those which have evolved for radio frequency and optical communications.\n 3. <i>Resources</i>. Without the expectation that the processing being implemented will reach a point of high maturity and meet a high-priority near-term operational need, it can be difficult to justify such an application specific investment.","cites":"0","conferencePercentile":"12.5"},{"venue":"WUWNet","id":"3a0e6d9a9422dd50f759a123db1e9ee38d47c46f","venue_1":"WUWNet","year":"2012","title":"Performance of pressure routing in drifting 3D underwater sensor networks for deep water monitoring","authors":"Yu Ren, Winston Khoon Guan Seah, Paul D. Teal","author_ids":"7800393, 2390462, 1862643","abstract":"Recent events such as the 2010 <i>Deepwater Horizon</i> oil spill have highlighted the need for ocean monitoring along a specific depth horizon. A mobile underwater acoustic sensor network drifting with the pollution pattern and reporting to radio-equipped surface buoys can provide wide coverage, real-time sensing and can be deployed efficiently. This paper investigates the feasibility of such a network application by evaluating the performance of two recent pressure routing protocols: Depth Based Routing and HydroCast for delivering sensed data from a depth-restricted layer of nodes. Previous work on these protocols has only focused on low-traffic scenarios with infrequent broadcasts made by nodes throughout the network, or with only one source node. A key contribution of this paper is an investigation of the effect that current drift has on networking. The performance of the routing protocols over time is measured, under a modified 3D Meandering Current Mobility model that takes into account lower current speeds with increased depth. Results show that even in a slow-moving coastal current, packet delivery in an initially dense network becomes unviable within 3 hours of drift. This work suggests controlled mobility management be investigated in future to extend network lifetime.","cites":"3","conferencePercentile":"78.57142857"},{"venue":"WUWNet","id":"471f692a6aeab59e78831c7030177f300c62311b","venue_1":"WUWNet","year":"2015","title":"Autonomous Vehicles Localization in Multi-Hop Mobile Underwater Wireless Networks","authors":"Xiaohui Wei, Xingwang Wang, Xin Bai, Sen Bai, Jun Liu","author_ids":"2291927, 3391439, 2816527, 1824178, 1843598","abstract":"Autonomous Underwater Vehicles (AUV) maintain their location information during navigation in order to reach a pre-determined destination. Most of previous underwater localization approaches assume that all AUVs are within one hop, which severely restricts the scale of the AUVs. In this paper, we localize AUVs in a multihop Mobile Underwater Wireless Network (MUWN) via surfacing a 3-dominating set of AUVs as beacons. Our scheme surfaces only beacon AUVs to obtain accurate location information from external sources such as satellites, then localizes the remaining AUVs as reference. Simulation result shows that our scheme greatly improves energy efficiency, security against detection and localization accuracy.","cites":"0","conferencePercentile":"46.42857143"},{"venue":"WUWNet","id":"5279e9f6e5aa2a0af5ad8317a764df8582b518d6","venue_1":"WUWNet","year":"2014","title":"Seamark-assisted Inertial Navigation for Autonomous Underwater Vehicles","authors":"Son N. Le, Jun Liu, Zheng Peng, Jiaxing Che, Yu Luo, Jun-Hong Cui","author_ids":"2515303, 1843598, 1693808, 3321779, 1712202, 1690957","abstract":"Recent technology advancements have enabled autonomous underwater vehicles to play a more significant role in sea exploration. The vehicles' mobility gives them advantages in many applications. It however poses new challenges that are often much less significant for fixed stations. Self localization is one such problem. This paper introduces a new technique that enables underwater vehicles with accumulated navigation error, such as those from inertial measurements, to correct their navigation information. Our method makes use of seamarks which are essentially lightweight beacons which serves as known marks at sea. Seamarks' main functionality is to echo back received signals. The main distinction from other studies is that there is no more than one seamark serving a geographical area. Accompanying algorithms to calibrate velocity and position information are presented and validated with simulations. The advantage of our method is its simplicity in both hardware and software, making it practical to use. With this technique, many applications that require long submersions are made possible.","cites":"0","conferencePercentile":"37"},{"venue":"WUWNet","id":"aa94467acc7f9c5e1c2a0e7e64a74d25a5e4c85e","venue_1":"WUWNet","year":"2009","title":"Symbol by symbol Doppler rate estimation for highly mobile underwater OFDM","authors":"Nathan Parrish, Sumit Roy, Payman Arabshahi","author_ids":"2990906, 1689296, 3137740","abstract":"We propose an OFDM receiver capable of estimating and correcting, on a symbol-by-symbol basis, the subcarrier dependent Doppler shifting due to the movement of source and receiver in an underwater acoustic network. We propose two methods of estimation: one of which is based upon the marginal maximum likelihood principle, and one of which is ad-hoc. We compare the performance of both estimators to the Cramer-Rao lower bound. We show through simulation that the proposed receiver design performs well for a source that is accelerating at 0.29 m/s<sup>2</sup>.","cites":"5","conferencePercentile":"62.5"},{"venue":"WUWNet","id":"909e36c08d99f9cecdcba72270b1505da21bea4b","venue_1":"WUWNet","year":"2011","title":"Impact analysis of different scheduling and retransmission techniques on an underwater routing protocol","authors":"Salvador Climent, Nirvana Meratnia, Juan Vicente Capella","author_ids":"3123243, 1784678, 3019102","abstract":"Despite many advances in the area of Underwater Wireless Sensor Networks (UWSN) during the last years, still many challenges need to be successfully tackled before large-scale deployment of underwater sensor networks becomes a reality. UWSNs usually employ acoustic channels for communications, which compared with radio-frequency channels, allow much lower bandwidths and have longer propagation delays.\n In the past, different methods have been proposed to define how a node must acquire the channel in order to start a transmission. Given the large propagation delays of underwater communication channels, a TDMA-based approach may need big time-guards. On the other hand, the very same large propagation delay increases the occurrence of the hidden terminal problem in a CSMA-based approach.\n In this paper, impacts of utilization of different scheduling and retransmission techniques on an underwater routing protocol will be analyzed. This analysis, in which energy consumption, packet delay, number of duplicate packets, and packet loss are considered, will be carried out by means of simulation using the <i>Network Simulator 3</i> and a subset of EDETA (Energy-efficient aDaptive hiErarchical and robusT Architecture) routing protocol recently adapted to UWSN.","cites":"0","conferencePercentile":"20.58823529"},{"venue":"WUWNet","id":"fbb916866a9d8ab63f398cdb68d8c846d0bdd2fe","venue_1":"WUWNet","year":"2009","title":"Minimizing localization cost with mobile anchor in underwater sensor networks: extended abstract","authors":"Keiji Matsumoto, Ryo Katsuma, Naoki Shibata, Keiichi Yasumoto, Minoru Ito","author_ids":"1734163, 1989711, 1781662, 1765230, 1756280","abstract":"In underwater sensor networks (UWSNs), it is important to know the position of each sensor node to identify the place of event in the target ocean field. Ling et al. proposed a localization method that estimates the positions of sensor nodes based on trilateration from distances to anchors with accurate positions and the sensor nodes whose positions have already been estimated [1]. This method lacks the accuracy of estimated positions, since the estimation error is accumulated while new anchors are generated one after another. Erol et al. proposed the localization method using special buoys that can dive and surface in water[2]. Each buoy gets the location information by GPS while it is on the water surface. It can also dive and send the information to the neighboring underwater sensor node by the acoustic beacon to measure the distance. This method achieves accurate position estimation, but takes high cost because many buoys need to be deployed.","cites":"3","conferencePercentile":"46.875"},{"venue":"WUWNet","id":"754e1112f5d8a5018fe2ae3e255e91e88817ef12","venue_1":"WUWNet","year":"2012","title":"Ocean-TUNE: a community ocean testbed for underwater wireless networks","authors":"Jun-Hong Cui, Shengli Zhou, Zhijie Jerry Shi, James O'Donnell, Zheng Peng, Mario Gerla, Burkard Baschek, Sumit Roy, Payman Arabshahi, Xi Zhang","author_ids":"1690957, 1701232, 1796182, 7144717, 1693808, 8467438, 1822706, 1689296, 3137740, 1744517","abstract":"This paper presents collective efforts from four institutions, University of Connecticut, University of Washington, University of California, Los Angeles, and Texas A&amp;M University, on a community <b>Ocean T</b>estbed for <b>U</b>nderwater <b>N</b>etworks <b>E</b>xperiments (Ocean-TUNE). This proposed community testbed will enable a wide range of research in the areas of underwater communications, networking, engineering, and marine science, and hence will promote unprecedented progress towards practical solutions in diverse aquatic applications.","cites":"6","conferencePercentile":"94.89795918"},{"venue":"WUWNet","id":"2c98df38d9137e525def94112d3551005a07e25c","venue_1":"WUWNet","year":"2015","title":"A Modified CSMA/CA Protocol for OFDM Underwater Networks: Cross Layer Design","authors":"Yanling Yin, Sumit Roy, Payman Arabshahi","author_ids":"2606459, 1689296, 3137740","abstract":"The underwater acoustic channel continues to present significant challenges to efficient throughput performance of underwater acoustic sensor networks (UASNs) in varying scenarios. As a result, cross-layer approaches that explore joint PHY/MAC strategies are worthy of further exploration. We consider a recent high-speed OFDM modem and propose a new cross-layer solution based on modified CSMA/CA, for a canonical star network topology with few nodes (the most common scenario in UASNs). Some innovations to an adaptive OFDM PHY link are developed to jointly select the modulation, convolutional coding and frequency diversity order (different transmission modes) for matching varying channel conditions. Additionally, receiver logic that disambiguates the cause of packet loss between a) that caused by channel vs. b) that due to collisions is used to modify the ARQ/backoff logic for retransmissions with CSMA/CA random access. Simulation results reveal that the cross-layer design can effectively increase network throughput.","cites":"0","conferencePercentile":"46.42857143"},{"venue":"WUWNet","id":"70771f0f356629e94117fc6fdd2b72fef1ab104e","venue_1":"WUWNet","year":"2014","title":"Real-time Video Streaming from Mobile Underwater Sensors","authors":"Seongwon Han, Roy Chen, Youngtae Noh, Mario Gerla","author_ids":"2534520, 2033574, 1773189, 8467438","abstract":"Underwater sensor networking is generally regarded as an emerging technology to conduct oceanic exploration and research in an automated and effective manner. As underwater operations become more sophisticated, there is an increasing demand for real-time video streaming. However, real-time video streaming requires high bandwidth as well as low latency. Amongst the resources, bandwidth is the most critical limitation. To help overcome this obstacle, we propose a hybrid solution that combines acoustic and optical communications. Optics provides good quality real time video. Acoustic maintains a \"thin\" channel for network topology and transmission control, and for still frame video delivery when the optical channel fails. In particular, we enable optical communications by acoustic-assisted alignment and use acoustic communications as a back up when the optical signal is interrupted. The main contribution is to enable reliable, real-time video streaming without underwater optical cables. Another important contribution is the smooth transition between the acoustic and optical video delivery mode, using popular image processing algorithms to compress the video before transmitting it on the acoustic channel.","cites":"4","conferencePercentile":"98"},{"venue":"WUWNet","id":"b50e894767a80674a8efe49b9078bcf4df24751c","venue_1":"WUWNet","year":"2011","title":"Scheduling granularity in underwater acoustic networks","authors":"Kurtis B. Kredo, Prasant Mohapatra","author_ids":"1876062, 1697868","abstract":"Underwater acoustic networks have many distinct channel characteristics when compared to terrestrial networks. Long propagation delay, one such characteristic, allows scheduling methods with varying granularity that tradeoff schedule quality with protocol overhead. This work examines several channel scheduling methods to determine at what point protocols find the best balance between performance and overhead. To accomplish this, five scheduling options are detailed and then compared through numerical and simulation results between themselves and to other protocols. The results indicate that scheduling links provides the best performance for the resource investment and that other scheduling options either require significant overhead or provide insufficient performance. While the results show that direct sequence spread spectrum techniques, common at the physical layer in underwater networks, do not yield an improved schedule, they do reduce protocol overhead and scheduling complexity by reducing conflicts in the network.","cites":"1","conferencePercentile":"58.82352941"},{"venue":"WUWNet","id":"c8181d40112407824779406b379503c936169cfa","venue_1":"WUWNet","year":"2012","title":"Near drowning pattern detection using neural network and pressure information measured at swimmer's head level","authors":"Mohamed Kharrat, Yuki Wakuda, Noboru Koshizuka, Ken Sakamura","author_ids":"1952364, 2166974, 2032849, 1706494","abstract":"It is difficult for a person who cannot swim to call for help while he face a drowning incident. This make from drowning incidents very dangerous as it can occur silently. In this research we consider the use of wearable sensors to identify victims at early drowning stage. For this we attached a pressure sensor logging unit at the head level of a professional lifeguard, then we asked him to imitate near drowning pattern. We process the obtained dataset with neural networks at 20 second time window. The trained neural network succeed to classify the near drowning and normal swimming pattern.","cites":"1","conferencePercentile":"54.08163265"},{"venue":"WUWNet","id":"ee11c706c77dd1dae7c133495f39d2ac5431358b","venue_1":"WUWNet","year":"2013","title":"A bidirectional TDMA protocol for underwater acoustic sensor networks","authors":"Guang-yu Fan, Huifang Chen, Lei Xie, Jun-Hong Cui","author_ids":"3019777, 1810024, 4043707, 1690957","abstract":"To improve the channel efficiency, a bidirectional TDMA protocol is proposed for UWASNs in the paper. In proposed protocol, each time slot is divided into two parts, the DATA transmission/reception part and the ACK transmission/reception part. Two neighboring nodes exchange their packets by transmitting in the transmission part simultaneously and receiving at the reception part. Hence, by utilizing the characteristic of the long propagation delay in UWASNs subtly, only one time slot is used when two nodes exchange their information. Performance analysis and simulation results show that the proposed protocol can achieve a higher throughput and a lower transmission delay.","cites":"0","conferencePercentile":"34.69387755"},{"venue":"WUWNet","id":"dc4fc13d8f55691227dfba904e62223f5ec9ee59","venue_1":"WUWNet","year":"2010","title":"D-sync: Doppler-based time synchronization for mobile underwater sensor networks","authors":"Feng Lu, Diba Mirza, Curt Schurgers","author_ids":"6923138, 1705929, 1697660","abstract":"Time synchronization is an essential service in underwater networks, required for many functionalities such as MAC, sleep-scheduling, localization, and time-stamping of sensor events. However, there exist two fundamental challenges to underwater synchronization, namely, large propagation delays and substantial node mobility during the synchronization process. While existing underwater time sync solutions have been proposed to address these challenges, they rely on heavy signaling, which is undesirable due to high energy costs. In this paper, we introduce a powerful new approach that incorporates physical layer information, namely an estimate of the Doppler shift. Large Doppler shift has been identified as a major challenge to underwater communication, and current systems implement sophisticated solutions to estimate and track such Doppler shift for each data exchange. While an impediment to communication, we will show that the Doppler shift contains highly useful information that can be leveraged to greatly improve time synchronization. Specifically, it provides an indication of the relative motion between nodes. Our new protocol, called D-sync, strategically exploits this feature to address the timing uncertainty due to node mobility. As such, D-sync can handle substantial mobility, without making any assumptions about the underlying motion, and without extensive signaling. Simulation results show that D-sync significantly outperforms existing time synchronization both in terms of accuracy and energy.","cites":"11","conferencePercentile":"94.73684211"},{"venue":"WUWNet","id":"657ef643f137ebdf15cdfbe11b6c199b2a558e1f","venue_1":"WUWNet","year":"2009","title":"Low-cost medium-range optical underwater modem: short paper","authors":"Feng Lu, Sammy Lee, Jeffrey Mounzer, Curt Schurgers","author_ids":"6923138, 8569300, 1735059, 1697660","abstract":"Enhancing underwater instruments with networking capabilities is opening up exciting new opportunities for remote ocean exploration. Underwater communication is essential in enabling networking, and in this work, we focus specifically on those applications that require a communication range of 5 to 10 meters. We will show that optical wireless technology is an excellent candidate when cost-efficient design is paramount and data rate requirements are modest. Our optical modem uses inexpensive components, and compensates by employing sophisticated detection algorithms. Our design is validated experimentally, establishing it as a viable cost-effective communication technology for low range underwater applications.","cites":"5","conferencePercentile":"62.5"},{"venue":"WUWNet","id":"5ad8eba7a38e394c07fb8fbaef9825a333c03550","venue_1":"WUWNet","year":"2010","title":"A biomimetic quasi-static electric field physical channel for underwater ocean networks","authors":"Jonathan Friedman, Dustin Torres, Thomas Schmid, Juyao Ivy Dong, Mani B. Srivastava","author_ids":"2008236, 2219659, 3196688, 7746688, 1702254","abstract":"Nature has had millions of years to develop and optimize life in the ocean. Nocturnal oceanic animals and those that live at depth cannot rely upon optical notions of vision to navigate, hunt, or avoid predators. Instead, many rely upon an electroreceptive capability achieved through a dense grid of electric field (Voltage) sensors. In this work, we develop and characterize an artificial system which seeks to mimic this capability. The detection range of our resulting prototype was &ap; 5<i>cm</i>. The position accuracy in the middle of the transmit axis was &#177; 5<i>cm</i> after calibration.","cites":"10","conferencePercentile":"86.84210526"},{"venue":"WUWNet","id":"040c7ee3d3ad885b4e8fa135534d4bfaf26b9050","venue_1":"WUWNet","year":"2011","title":"Considerations for the design of an epipelagic biomimetic electrostatic imaging element","authors":"Jonathan Friedman, Henry Herman, Newton Truong, Mani B. Srivastava, Juyao Ivy Dong, Dustin Torres","author_ids":"2008236, 2952300, 2241957, 1702254, 7746688, 2219659","abstract":"We discuss the development and design of a Biomimetic Electrostatic Imaging (BEI) element for use in a future multichannel imaging instrument. Inspiration for electrostatic sensing is provided by the diverse species of fish that use passive and induced electric fields for hunting, defense, localization, and communication. Designing an electrostatic sensor is not without its challenges. Hardware filter and amplifier design are analyzed since the high impedance signals require high gain and steps must be taken to minimize noise, maximizing signal to noise ratio.","cites":"1","conferencePercentile":"58.82352941"},{"venue":"WUWNet","id":"b3dff440fcaab104c25487d38c24730fc3bd70ed","venue_1":"WUWNet","year":"2009","title":"Software-defined underwater acoustic networking platform","authors":"Dustin Torres, Jonathan Friedman, Thomas Schmid, Mani B. Srivastava","author_ids":"2219659, 2008236, 3196688, 1702254","abstract":"Currently acoustics is the primary modality for underwater communication even though it presents a difficult channel. To try and cope with the challenges of the channel many MAC protocols and PHY layer techniques have been proposed. In this paper we present a research platform that allows developers to easily implement and compare their protocols in an underwater network and configure them at runtime. We have built our platform using widely supported software that has been successfully used in terrestrial radio and network development. The flexibility of development tools such as software defined radio have provided the ability for rapid growth in the community. Our platform adapts some of these tools to work well with the underwater environment while maintaining flexibility, ultimately providing an end-to-end networking approach for underwater acoustic development.","cites":"22","conferencePercentile":"93.75"},{"venue":"WUWNet","id":"070aefe17c179be711c9f2f9b7c4e588bb484ed1","venue_1":"WUWNet","year":"2012","title":"Realtime in-ocean submerged collision avoidance via biomimetic electrostatic imaging","authors":"Jonathan Friedman, Henry Herman, Newton Truong, Young H. Cho, Mani B. Srivastava","author_ids":"2008236, 2952300, 2241957, 1714258, 1702254","abstract":"This paper explores a technique to exploit Biomimetic Electrostatic Imaging (BEI) for the purposes of short-range high-speed detection and tracking of submerged obstacles based on their conductivity deviation from the background ocean environment. BEI uses conductivity and Coulomb's law rather than electromagnetic or acoustic (SONAR) principles to provide more rapid imaging at substantially reduced output powers making the technique perfect for Uncrewed Underwater Vehicles (UUV) seeking to align for docking, avoid obstacles while traversing, perform relative station keeping (formation management), or track/follow a target object. It is demonstrated to work in real-time against the type of short-range targets that pose a collision threat.","cites":"0","conferencePercentile":"21.42857143"}]}