{"WUWNet_16.csv":[{"venue":"WUWNet '16","id":"62db0597b0fa7e5e0b62e7e699539f01839f4e8c","venue_1":"WUWNet '16","year":"2016","title":"WaterCom: connecting research configurations with practical deployments: a multilevel, multipurpose underwater communications test platform","authors":"Ciar&#225;n Mc Goldrick, Enrique Segura, Tianyan Wu, Mario Gerla","author_ids":", 7439260, , 8467438","abstract":"This paper describes the ongoing evolution of the Water-Com framework developed as part of the NSF funded Ocean-TUNE CRI project. A particular challenge for connecting global researchers and the public with remote, autonomous underwater research infrastructures is that translating and bringing the requesters topology and system properties into physical existence through dynamic reconfigurability of the deployed experimental infrastructure and assets. Previous work described the overall WaterCom framework, system architecture and design. The extension of this system to enable graphical node topology definition and validation, and the procedure for defining, scheduling and deploying experimental configurations on remote hardware is articulated.","cites":"0","conferencePercentile":"51.02040816"},{"venue":"WUWNet '16","id":"85c6bcf2dcbcd0922f60e264fb2e13caa6cd0f23","venue_1":"WUWNet '16","year":"2016","title":"A simulator for swarm AUVs acoustic communication networking","authors":"Guannan Li, Jun Liu, Xue Wang, Hongli Xu, Jun-Hong Cui","author_ids":"2179025, 1843598, 5053992, 1779748, 1690957","abstract":"This paper presents a simulator for swarm operations designed to verify algorithms for a swarm of autonomous underwater robots (AUVs), specifically for constructing an underwater communication network with AUVs carrying acoustic communication devices. This simulator consists of three nodes: a virtual vehicle node (VV), a virtual environment node (VE), and a visual showing node (VS). The modular design treats AUV models as a combination of virtual equipment. An expert acoustic communication simulator is embedded in this simulator, to simulate scenarios with dynamic acoustic communication nodes. The several simulations we have performed demonstrate that this simulator is easy to use and can be further improved.","cites":"0","conferencePercentile":"51.02040816"},{"venue":"WUWNet '16","id":"ccb6252f90e07cca51eb40a5901fa2ae6a2424fe","venue_1":"WUWNet '16","year":"2016","title":"DoF-achieving distance-aligned structure for layered underwater acoustic 2x3x3 X networks","authors":"Zhijie Bao, Feng Liu, Shengming Jiang, Shuchao Jiang","author_ids":"5227496, 1734409, 1723167, 3458063","abstract":"In this paper, we investigate the degrees of freedom (DoF) of a layered 2 &#215; 3 &#215; 3 X channel for underwater acoustic networks (UANs), where each of the two source nodes sends an independent message to each of the three destination nodes via the relay layer with three nodes. The key problem is to maximize the achievable DoF with proper interference management. Using the long propagation delay property of UANs, we propose a feasible scheme based on distance-aligned structure (DAS), which achieves the DoF upper bound of 3/2. The core idea is to obtain six decodable message symbols over four time slots by proper transceiver design with an aligned interference neutralization approach.","cites":"0","conferencePercentile":"51.02040816"},{"venue":"WUWNet '16","id":"301617fbc726ae0bda8257339e5256ce021f8573","venue_1":"WUWNet '16","year":"2016","title":"Implementation and application of underwater acoustic sensor nodes","authors":"Huifang Chen, Ying Zhang, Zhongyue Chen, Wen Xu","author_ids":"1810024, 1752812, , 3925920","abstract":"Underwater sensing is envisioned using inexpensive underwater sensor nodes distributed over a wide area, deployed close to the bottom, and networked through underwater acoustic communications. In this paper, an underwater acoustic sensor node to perform the underwater sensing is designed and implemented. Specifically, we describe the design criteria, architecture and functional modules of underwater acoustic sensor node. Moreover, we give the experiment results of ocean current field estimation using the designed underwater acoustic sensor nodes at the sea area of Liuheng, Zhoushan, China.","cites":"0","conferencePercentile":"51.02040816"},{"venue":"WUWNet '16","id":"0adfb602084f4f3644e8cbee5e13c9ddd08d1b49","venue_1":"WUWNet '16","year":"2016","title":"MAC protocol for measurement signal broadcasting in distributed ocean current estimation using underwater acoustic sensor networks","authors":"Hao Chen, Huifang Chen, Min Deng, Lei Xie","author_ids":"2760958, 1810024, 5870904, 4043707","abstract":"This paper presents a media access control (MAC) protocol for distributed ocean current estimation using the underwater acoustic sensor network (UWASN). We present a spatial reuse time-division multiple access (TDMA) protocol. Based on measurement signal broadcasting process, we formulate the slot scheduling problem with a specific objective as an optimization problem that we resolve with a heuristic algorithm. We use computer simulations to analyze the proposed TDMA protocol's performance.","cites":"0","conferencePercentile":"51.02040816"},{"venue":"WUWNet '16","id":"eeb52565dd3bc2d3e40be847ccb3fc7ef6822556","venue_1":"WUWNet '16","year":"2016","title":"Real-time transceiver implementation for SC-FDE acoustic modems","authors":"Lin Li, Qunfei Zhang, Lifan Zhang, Yang Zhang","author_ids":"2045994, 8326430, 2620467, 4449904","abstract":"We have developed a real-time underwater acoustic modem with single-carrier frequency domain equalization (SC-FDE) transmission. Channel estimation operates in the time domain to improve accuracy, and equalization operates in the frequency domain to reduce complexity. The system is implemented on the floating-point OMAPL138 platform. Through optimization in the algorithm and program scheduling, the high data rate and real-time performance of the modem is guaranteed. We have tested the designed system in a lake experiment in June 2016. At a distance of 5 km, the modem achieved real-time raw data rates of 9600 bps with uncoded bit-error rates of 10<sup>&minus;3</sup> in the complex environment.","cites":"0","conferencePercentile":"51.02040816"},{"venue":"WUWNet '16","id":"44baaf7e069d04ddc6f8222c0aeb02e00e6b7d09","venue_1":"WUWNet '16","year":"2016","title":"AUV dead-reckoning navigation based on neural network using a single accelerometer","authors":"Yan-xin Xie, Jun Liu, Cheng-quan Hu, Jun-hong Cui, Hongli Xu","author_ids":", 1843598, , , 1779748","abstract":"the accuracy of the Autonomous Underwater Vehicles (AUVs) navigation system determines whether they can safely operate and return. Traditional Dead-reckoning (DR) relies on the inertial sensors such as gyroscope and accelerometer. A major challenge for DR navigation is from measurement error of the inertial sensors (gyroscope, accelerometer, etc.), especially when the AUV is near or at the ocean surface. The AUV's motion is affected by ocean waves, and its pitch angle changes rapidly with the waves. This rapid change and the measurement errors will cause great noise to the direction measured by gyroscopes, and then lead to a large error to the DR navigation. To address this problem, a novel DR method based on neural network (DR-N) is proposed to explore the time-varying relationship between acceleration measurement and orientation measurement, which leverages acoustic localization and neural network estimate timely pitch angle through the explored time-varying relationship. This method enables AUV's DR navigation with a single acceleration, without relying on both acceleration and gyroscope. Most importantly, we can improve the accuracy of AUV navigation through avoiding DR errors caused by gyroscope noise at the sea surface. Simulations show DR-N significantly improves navigation accuracy.","cites":"0","conferencePercentile":"51.02040816"},{"venue":"WUWNet '16","id":"6fad63e7389b6cdd7a7de0f852b0fe2e26eaaa65","venue_1":"WUWNet '16","year":"2016","title":"A LTE-based communication architecture for coastal networks","authors":"Yanli Xu, Shengming Jiang, Feng Liu","author_ids":"6668072, 1723167, 1734409","abstract":"Currently, the coastal communication is mainly provided by satellite networks, which are expensive with low transmission rate and unable to support underwater communication efficiently. In this work, we propose a communication architecture for coastal network based on long term evolution (LTE) cellular networks in which a cellular network architecture is designed for the maritime communication scenario. Some key technologies of next-generation cellular networks such as device-to-device (D2D) and multiple input multiple output (MIMO) are integrated into the proposed architecture to support more efficient data transmission. In addition, over-water nodes aid the transmission of underwater network to improve the communication quality. With the proposed communication architecture, the coastal network can provide high-quality communication service to traffics with different quality-of-service (QoS) requirements.","cites":"0","conferencePercentile":"51.02040816"},{"venue":"WUWNet '16","id":"fb9957a123d084f02434b70fd1911699a0f768cb","venue_1":"WUWNet '16","year":"2016","title":"Towards multi-functional light-weight long-term real-time coastal ocean observation system","authors":"Zhenfeng Jiang, Yanming Ma, Jiali Chen, Zigeng Wang, Zheng Peng, Jun Liu, Guitao Han","author_ids":"4604956, 1983958, 7558629, 2796789, 1693808, 1843598, ","abstract":"The Earth is a water planet. The ocean is used for nature resource exploitation, fishery, etc., and it also plays critical roles in global climate regulation and transportation. Consequently, it is extremely important to keep track of its condition. And thus ocean observation systems have received increasing attentions.","cites":"0","conferencePercentile":"51.02040816"}]}