{"WWIC.csv":[{"venue":"WWIC","id":"5dfd3473091b93f2dfe25c50cafd7a8ee20cacc9","venue_1":"WWIC","year":"2005","title":"Limiting Control Overheads Based on Link Stability for Improved Performance in Mobile Ad Hoc Networks","authors":"Hwee Xian Tan, Winston Khoon Guan Seah","author_ids":"3081542, 2390462","abstract":"The widespread use of Mobile Ad Hoc Networks (MANETs) in many fields of applications has led to the continuous development of routing protocols which can perform well when deployed under different scenarios, as well as offer better Quality of Service (QoS) support. In this paper, we focus on how link stability is utilized as a metric to provide accurate feedback on the network. We then introduce two mechanisms – L-REQ (Limited forwarding of Route Requests) and L-REP (Limited initiation of Route Replies by intermediate nodes) – which make use of link stability to dynamically adapt the characteristic behaviour of existing protocols to achieve better network performance. The two adaptive schemes are then applied to the Ad Hoc On Demand Distance Vector (AODV) routing protocol as proof of concept.","cites":"4","conferencePercentile":"85.71428571"},{"venue":"WWIC","id":"369b0e397a55978fc8fb1dfc47c8ef3739c48dde","venue_1":"WWIC","year":"2014","title":"An Automated Application-Independent Approach to Anomaly Detection in Wireless Sensor Networks","authors":"André Rodrigues, Jorge Sá Silva, Fernando Boavida","author_ids":"3250429, 1682382, 1687051","abstract":"As Wireless Sensor Networks (WSN) gain momentum in what concerns applications and deployment, monitoring is becoming crucial in order to guarantee that anomalies are promptly detected. Unfortunately, current WSN monitoring solutions have several limitations, such as being tailored for specific applications, requiring dedicated or specific hardware, consuming precious energy and/or processing resources, or relying on manual or offline intervention. In this paper we propose an approach to anomaly detection in WSNs that addresses these limitations. The approach is based on two very simple metrics, a logging tool, and a data-mining algorithm, thus leading to the following key characteristics: very low resource consumption, application independency, very good potential for multi-WSN monitoring, and automation and simplification of the detection process. The proposed approach was validated by implementation, which showed that it is quite effective in detecting several typical anomalies. 1 Introduction Detecting and diagnosing problems in Wireless Sensor Networks (WSNs) is now considered essential, due to the fact that the installed basis of this type of networks is growing at a fast pace. Numerous deployments exist, either of experimental or of commercial nature. One such example, pertaining to the research area, is a recent deployment by Intel, which equipped a few hundred homes with devices that enabled the collection of a set of parameter values (environmental, physiological and behavioral), with the objective of assessing the potential of the WSN technology in the study of aging and chronic diseases [1]. One of the conclusions of the study was the need for tools for managing research infrastructures characterized by a large number of geographically dispersed facilities, where their direct users (in this case the elderly) do not have enough technological expertise to assist in diagnosing and solving problems that inevitably occur in the installed systems.","cites":"0","conferencePercentile":"40"},{"venue":"WWIC","id":"f2ef637f06ee0f24d84804861775def93f97f0da","venue_1":"WWIC","year":"2011","title":"Utility-Based Analytical Model for Representing User QoE","authors":"Manzoor Ahmed Khan, Jie Lu, Muhammad Amir Mehmood","author_ids":"1972460, 1685235, 3157639","abstract":"Next Generation Mobile Networks (NGMNs) together with smart phones evolution have opened new opportunities to deliver mobile services, including voice, data and multimedia applications to the users. However this conflation has brought several challenges in terms of Quality of Experience – QoE of users. Mainly due to degradations with time-varying characteristics in the presense of link heterogeneity, varying packet loss and codec switching. In this paper we propose an analytical quality prediction model which predicts user QoE for conditions that are typically occurring in NGNMs such as network handovers, codec switching and different packet loss rates due to adverse wireless networking conditions. We augment our model with service price as another key factor in QoE representation. We validate quality prediction of our model with subjective tests. Our results show that the quality prediction by our model has correlation of r = 0.923 with subjective ratings.","cites":"0","conferencePercentile":"31.57894737"},{"venue":"WWIC","id":"67a3b18d46811a0ede0346b456f575509d5f8c69","venue_1":"WWIC","year":"2011","title":"End-to-End Adaptive Framework for Multimedia Information Retrieval","authors":"Maria Sokhn, Elena Mugellini, Omar Abou Khaled, Ahmed Serhrouchni","author_ids":"2143192, 1802011, 1799647, 2718710","abstract":"The evolution of the web in the last decades has created the need for new requirements towards intelligent information retrieval capabilities and advanced user-oriented services. The current web integrates heterogeneous and distributed data such as XML database, relational database, P2P networks etc. leading to the coexistence of different data models and consequently different query languages. In this context, effective retrieval and usage of multimedia resources have to deal with the issues of creating efficient content based indexes, developing retrieval tools and improving user-oriented visualization interfaces. To that end we put forward an end-to-end adaptive framework based on an ontological model. This framework aims at enhancing the management, retrieval and visualization of multimedia information resources based on semantic techniques.","cites":"1","conferencePercentile":"72.36842105"},{"venue":"WWIC","id":"362858669f3f836f35cfa774fef03f775d41fadc","venue_1":"WWIC","year":"2016","title":"An Efficient Geographical Addressing Scheme for the Internet","authors":"Bernd Meijerink, Mitra Baratchi, Geert J. Heijenk","author_ids":"2565826, 2847012, 1723701","abstract":"Geocast is a scheme which allows packets to be sent to a destination area instead of an address. This allows the addressing of any device in a specific region without further knowledge. In this paper we present an addressing mechanism that allows efficient referral to areas of arbitrary size. The binary representation of our addressing mechanism fits in an IPv6 address and can be used for route lookup with simple exclusive-or operations. We show that our addressing mechanism can be used to address areas accurately enough to be used as a mechanism to route packets close to their destination.","cites":"0","conferencePercentile":"66.66666667"},{"venue":"WWIC","id":"67686357b82be82a5dbec2d84bc7293a25f295b1","venue_1":"WWIC","year":"2005","title":"Lecture Notes in Computer Science: Packet Error Rate Analysis of IEEE 802.15.4 Under IEEE 802.11b Interference","authors":"Soo Young Shin, Sunghyun Choi, Hong Seong Park, Wook Hyun Kwon","author_ids":"1722248, 1720284, 1852211, 2410823","abstract":"In this paper, the packet error rate (PER) of IEEE 802.15.4 low rate wireless personal area network (WPAN) under the interference of IEEE 802.11b wireless local area network (WLAN) is analyzed. The PER is obtained from the bit error rate (BER) and the collision time. The BER is obtained from signal to noise and interference ratio. The power spectral density of the IEEE 802.11b is considered in order to determine in-band interference power of the IEEE 802.11b to the IEEE 802.15.4. The simulation results are shown to validate the numerical analysis.","cites":"3","conferencePercentile":"71.42857143"},{"venue":"WWIC","id":"acd9a80a3a943fe0c89c8d1c2768e4fe29d93b78","venue_1":"WWIC","year":"2012","title":"Analysis of the Cost of Handover in a Mobile Wireless Sensor Network","authors":"Qian Dong, Waltenegus Dargie","author_ids":"1750658, 3149184","abstract":"Declaration I hereby assure that I created the present work without inadmissible help of third parties and without use of other auxiliary means than those specified ; thoughts that are directly or indirectly taken over from other sources are marked as such. I did not make use of the assistance of a commercial dissertation consultant. Third-parties did neither directly nor indirectly receive benefits of pecuniary value for works that are related to the content of the present dissertation. Up to now, neither in Germany nor in any other country the work has been presented in this or a similar form to another examination agency, and it has not yet been published either. I confirm that I acknowledge the applicable doctorate regulations of the Abstract Handling mobility in wireless sensor networks can pose formidable challenges in protocol design, especially, at the link layer. Since most of the proposed Medium Access Control (MAC) protocols do not accommodate mobility, a node has two options to deal with a deteriorating link: (a) to continue data transmission until the link breaks and then establishes a new link with a new relay node; or (b) to seamlessly transfer the communication to a better link parallel to the data transmission over the existing link. Different from option (a) where a node can only search for a new link after the original link disrupts, option (b) enables a node to perceive the change in the quality of a link in advance. The link quality prediction is implemented by an adaptive handover mechanism. Both approaches will inevitably introduce latency. This thesis aims to quantify and compare such latency. Specifically, it investigates the latency of packet transmission in a mobile wireless sensor network with and without the support of a handover mechanism. To start with, the thesis elaborates the effect of mobility on the performance of the existing MAC protocols, and the need to maintain an unbroken link during data transmission. To implement the handover, a target MAC protocol is required to be selected first. Since the Receiver-Initiated MAC protocol (RI-MAC) uses only short beacon and data packets during communication that substantially reduce overhearing, collision probability and data recovery cost, it is chosen as the carrier for the latency evaluation. Even though RI-MAC performs well in many aspects, it has several demer-its. To address the monotonous increment in the backoff window size and to reduce the occurrence frequency of the …","cites":"3","conferencePercentile":"90"},{"venue":"WWIC","id":"356d3a2d64dcc8f8d563f1d64a31f0c3568a5330","venue_1":"WWIC","year":"2011","title":"Urban-X: A Self-organizing Cognitive Wireless Mesh Network for Dense City Environments","authors":"Wooseong Kim, Andreas Kassler, Marco Di Felice, Mario Gerla, Luciano Bononi","author_ids":"5732050, 1753559, 8129554, 8467438, 1740984","abstract":"The practical deployment of Wireless Mesh Networks (WMNs) using unlicensed ISM band within dense urban scenarios is difficult due to the increasing number of wireless devices operating in those licensed exempt frequencies. For this reason, current research on WMN is directed towards novel and more flexible network paradigms which would allow the WMN to dynamically adapt to the environmental interference conditions. Here, we propose Urban-X, which is a novel cross-layer architecture for self-organizing WMNs over urban scenarios. Urban-X combines elements from classical Multi-Radio Multi-Channel (MC-MR) technology with novel Dynamic Spectrum Access (DSA) mechanisms. The self-organizing behavior is achieved through a novel distributed channel assignment scheme, an adaptive multi-path routing scheme and a flexible layer 2.5 channel and path scheduler algorithm. Based on the current interference on each channel, Urban-X performs channel allocation among the nodes of the WMN, updates the available paths towards the gateways and distributes the internal traffic among the paths/channels in order to maximize the network throughput while minimizing interference to the external networks. Simulation results demonstrate the effectiveness of our cross-layer approach in terms of increased throughput compared to traditional routing schemes for WMNs, and its adaptiveness to the variation in channel conditions and external user traffic.","cites":"1","conferencePercentile":"72.36842105"}]}