{"WWW_Posters.csv":[{"venue":"WWW Posters","id":"cbd5daaa72a04b4f37c67ae19ac3b978dc496739","venue_1":"WWW Posters","year":"2001","title":"Information Gathering of Web pagesto Guide Concept Understanding","authors":"Seiji Yamada, Yukio Ohsawa","author_ids":"1679243, 1687480","abstract":"This paper describes navigation planning, a novel information gathering method that generates a plan for guiding concept understanding in the WWW. It also has the ability to generate operators during planning from Web pages. For understanding a concept, it is a useful way to utilize a search engine for gathering relevant Web pages. However the gathered Web pages are fractions of knowledge explaining a target concept directly. To cope with this problem, we propose navigation planning to generate a sequence of Web pages by which a user systematically understand a concept.","cites":"0","conferencePercentile":"22.43589744"},{"venue":"WWW Posters","id":"84d088dc2ee25c196881347aee42d03cfe8c3cac","venue_1":"WWW Posters","year":"2001","title":"Improving Web Site's Accessibility","authors":"John D. Garofalakis, Panagiotis Kappos, Christos Makris","author_ids":"1680221, 1706336, 8339664","abstract":"We consider the problem of improving the performance of web access by proposing a reconstruction of the internal link structure of a web site in order to match the quality of the pages (measured in terms of their link importance in the web space) with the popularity of the pages (measured in terms of their importance recognized by web users). We provide a set of simple algorithms in order to increase the access rate of popular pages by using local reorganization of the web site's pages.","cites":"0","conferencePercentile":"22.43589744"},{"venue":"WWW Posters","id":"e110b7ff4068b168d0cbe51bf256d66177892480","venue_1":"WWW Posters","year":"2001","title":"A Logic-based Framework for Mobile Intelligent Information Agents","authors":"Naoki Fukuta, Takayuki Ito, Toramatsu Shintani","author_ids":"1701012, 1679044, 1895121","abstract":"Information agents are computational software systems that provides transparent access to many different information sources in the Internet, and to be able to retrieve, analyze, manipulate, and integrate heterogeneous data and information on demand. Mobile agents are an effective choice for many applications to improve latency and band-width of client-server applications and to reduce vulnerability to network disconnection. In this paper, we propose MiLog, a logic-based mobile agent framework for constructing intelligent information agents. In the framework, inference and planning process of an agent is written in a compact logic program. A new generation logic program execution engine provides strong migration capability with reasonable execution speed. The framework has been used to develop a web-based decision support system 'Bidding-Bot'.","cites":"7","conferencePercentile":"81.41025641"},{"venue":"WWW Posters","id":"45a6044f143f55e6c9df1f541f2132dfcef6afb1","venue_1":"WWW Posters","year":"2001","title":"Classification Pruning for Web-request Prediction","authors":"Ian Tian Yi Li, Qiang Yang, Ke Wang","author_ids":"3346716, 1733090, 1751643","abstract":"N-gram and repeating pattern based prediction rules have been used for next-web request prediction. However, there is no rigorous study of how to select the best rule for a given observation. The longer patter may not be the best pattern, because such patters are also more rare. In this paper, we propose several rule-pruning methods that enable us to build efficient, compact and high-quality classifiers for web-request prediction.","cites":"16","conferencePercentile":"93.58974359"},{"venue":"WWW Posters","id":"65831c8b07bc26bce7fb1bf9f274af15a8e98ad4","venue_1":"WWW Posters","year":"2001","title":"WebGuard: A System for Web Content Protection","authors":"Magda Mourad, Jonathan Munson, Tamer Nadeem, Giovanni Pacifici, Marco Pistoia, Alaa Youssef","author_ids":"3207714, 3271627, 2459493, 1740234, 1919722, 2204772","abstract":"In this paper, we present WebGuard, a content protection system for Web documents. WebGuard allows content owners to exercise control over usage conditions governing access to their content. We first introduce the concept of transparent digital rights management, and then show how WebGuard realizes it, using existing Web browsers.","cites":"4","conferencePercentile":"72.43589744"},{"venue":"WWW Posters","id":"a195b6d0736cc567cd533f876557f1f1d77c9fbb","venue_1":"WWW Posters","year":"2001","title":"Spoken Query for Web Search and Navigation","authors":"Huixiang Gu, Jianming Li, Ben Walter, Eric Chang","author_ids":"2433906, 6379830, 2964860, 6586107","abstract":"Mobile devices will become an important platform for Internet access. Due to size constraints, in many circumstances speech is the most desirable mode of input. We have developed a system for spoken query based web navigation and searching. The spoken query is recorded by a lightweight client and transmitted to a server where the computationally intensive continuous speech recognition and query execution are performed. Lightweight clients have been developed that can either be a small downloadable Active X component running within a browser or a small application running on a handheld PocketPC. Through these interfaces, users can search for contents in an Encarta encyclopedia, content of a particular website, or navigate to popular websites.","cites":"5","conferencePercentile":"75"},{"venue":"WWW Posters","id":"4791b68de57e642a081fe095f92e296c6c069690","venue_1":"WWW Posters","year":"2001","title":"Towards a Framework to Effective Web-based Distributed Learning","authors":"Tim J. Brailsford, Adam Moore, Craig D. Stewart, Mohamed Ramzy Zakaria, B. S. Choo, P. M. C. Davies","author_ids":"1683308, 3662327, 1709841, 3287747, 3277336, 2411552","abstract":"Developing web-based learning materials gives rise to a number of pedagogic problems. Learners are highly diverse in respect to their pedagogical requirements, and the implementation of an effective web-based learning strategy must avoid placing a heavy technological burden on IT-naïve academics. A solution to both of these issues may be provided by software systems know as Integrated Learning Environments (ILE). WHURLE (Web-based Hierarchical Universal Reactive Learning Environment) is an XML-based ILE that is designed to adapt to individual learner profiles, thus redressing some of these major problems with most web-based learning.","cites":"3","conferencePercentile":"67.30769231"},{"venue":"WWW Posters","id":"949a07cdfec360e9602af0980f34c637dd447908","venue_1":"WWW Posters","year":"2001","title":"A Web Community Chart for Navigating Related Communities","authors":"Masashi Toyoda, Masaru Kitsuregawa","author_ids":"2361778, 1716799","abstract":"Recent research on link analysis has shown the existence of numerous web communities on the Web. A web community is a collection of web pages created by individuals or any kind of associations that have a common interest on a specific topic. In this paper, we propose a technique to create a web community chart, that connects related web communities, from thousands of seed pages. This allows the user to navigate through related web communities, and can be used for a `What's Related Community' service that provides not only the web community including a given page but also related web communities. Our technique is based on a related page algorithm that gives related pages to a given page using only link analysis. We show that the algorithm can be used for creating the chart by applying the algorithm to each seed, then using similarities of the results to classify seeds into clusters and to deduce their relationships. We perform experiments to create a web community chart of companies and organizations from thousands of seed pages. First, we improve the precision of an existing related page algorithm, Companion, and evaluated the improved version, Companion-, by an user study. Then the chart is created using Companion-. The result chart consists of web communities including related pages, and paths between related web communities. From the chart, we can find many web communities of companies classified by their category of business, and relationships between the communities.","cites":"53","conferencePercentile":"98.71794872"},{"venue":"WWW Posters","id":"b907ead3489e447c20fd549f5e739db257af330f","venue_1":"WWW Posters","year":"2001","title":"Who is SMILing on the Web?","authors":"Gal Ashour, Byron Dom, John Golden, Jan Pieper, Savitha Srinivasan, Dick C. A. Bulterman","author_ids":"3243379, 1786444, 2736123, 2482213, 1798827, 1726923","abstract":"INTRODUCTION The amount of streaming media available on the web is orders of magnitude less than the amount of text and the resources for locating relevant information contained in streaming media [4], such as search engines, web directories and portals are not as well developed as those for text. The indexing challenges offered by the unstructured, spatio-temporal nature of media together with the lack of universal media standards largely accounts for this. The W3 Synchronized Multimedia Integration Language (SMIL) [6] standard partially addresses these issues with the support for creation and presentation of complex streaming media across multiple formats. Our focus here is the characterization of web pages that are SMILing or streaming complex media presentations. Since exhaustive enumeration of web pages is impractical, we take a sampling approach. Experimental validation shows that less than 1% of web pages contain links to streaming media, of which 65% is RealMedia, 11% is Windows Media, 2% is SMIL and 22% is other formats. We also investigate the distribution of links from web pages to streaming media and find it skewed to small numbers of both in (to media files) and out (from web pages) links. METHODOLOGY We base our estimates for the web on a set of 60 million pages whereas the latest estimate of web size of which we are aware [2] put the size at approximately 1 billion pages. To gain confidence in our estimates we performed the following sampling experiment. We detect web pages that link to or embed streaming media on a set of 2 million pages, and then again on the entire set of 60 million pages. Web pages that link to or embed streaming media were found to be of the following types: Static page: This type of page contains the name and extension of the media file and its location. Client-side dynamic page: This type of page dynamically creates a browser page that contains media links using a scripting language Server-side dynamic page: This type of page may return a page that links to streaming media in response to user click. We view the detection of streaming media as binary classification, which can be associated with a function where are f(x) = y x 1 , x 2 , ..x d the features in a given document x. Thus a document is represented by and represents discrete target values x = (x 1 , x …","cites":"1","conferencePercentile":"51.28205128"},{"venue":"WWW Posters","id":"65cd6f77aaa3ad2180b782ef277ff9002d56e863","venue_1":"WWW Posters","year":"2001","title":"Auditing for Accessibility","authors":"Lorna Gibson, David Sloan, Peter Gregor, Paul Booth","author_ids":"2771841, 1746921, 3182217, 1687671","abstract":"The paper discusses recent web Accessibility Audits produced by the authors [8] – audits that have the dual aims of raising accessibility levels of the subject sites and the general awareness of accessible design principles. The presentation of the information has been shaped by the desire that it should be digestible by both technical and administrative/managerial audiences. It is hoped that the process will help to raise awareness of accessible web design issues and hence help to raise the general level of accessibility of web based information.","cites":"1","conferencePercentile":"51.28205128"},{"venue":"WWW Posters","id":"dc561d0b4d4cb2d8850edbdf01bdb25868c7b372","venue_1":"WWW Posters","year":"2001","title":"iMobile: An Agent-Based Platform for Mobile Services","authors":"Herman Chung-Hwa Rao, Yih-Farn Robin Chen, Di-Fa Chang, Ming-Feng Chen","author_ids":"1911878, 2231574, 2107485, 8408716","abstract":"iMobile is a platform that addresses the research issues in building mobile services. iMobile acts as a message gateway that allows mobile devices using various protocols on different access networks to relay messages to each other. It also allows these thin clients to access resources and information on the internet and various networks. iMobile implements three key abstractions: devlet, infolet, and applet. A devlet is a driver attached to iMobile that receives and sends messages through a particular protocol for mobile devices. An infolet hosted on iMobile uses a particular access method to provide an abstract view of an information space. An applet implements service or application logic by processing information from various infolets. The foundation of iMobile, the let engine, implements the basic framework for maintaining applets, devlets and infolets, supports user and device profiles for personalization and transcoding, and invokes proper applets and infolets to answer requests from a devlet. The iMobile architecture allows new access devices and protocols to be added to its framework without changes in the service logic. iMobile effectively provides a personal agent on the network that enables a user to have mobile access to the information and services available, without being limited by where the user is or whatever communication or device protocol is available.","cites":"6","conferencePercentile":"77.56410256"},{"venue":"WWW Posters","id":"199cafbd431676650ef85d2d56cfed003d710ea4","venue_1":"WWW Posters","year":"2001","title":"Crawling the Hidden Web","authors":"Sriram Raghavan, Hector Garcia-Molina","author_ids":"2736218, 1695250","abstract":"Current-day crawlers retrieve content from the publicly in-dexable Web, i.e., the set of web pages reachable purely by following hypertext links, ignoring search forms and pages that require authorization or prior registration. In particular , they ignore the tremendous amount of high quality content \" hidden \" behind search forms, in large searchable electronic databases. Our work provides a framework for addressing the problem of extracting content from this hidden Web. At Stanford, we have built a task-specific hidden Web crawler called the Hidden Web Exposer (HiWE). In this poster, we describe the architecture of HiWE and outline some of the novel techniques that went into its design.","cites":"395","conferencePercentile":"100"},{"venue":"WWW Posters","id":"8d820d37bd44ec67c061df008e008126918025ef","venue_1":"WWW Posters","year":"2001","title":"Personal WebMelody: Customized Sonification of Web Servers","authors":"Maria Barra, Tania Cillo, Antonio De Santis, Umberto Ferraro Petrillo, Alberto Negro, Vittorio Scarano, Teenie Matlock, Paul P. Maglio","author_ids":"3098120, 2993335, 2387494, 1685710, 2330380, 1786473, 7237157, 2387444","abstract":"We present Personal WebMelody, a sonified Web server that allows customization and full integration of system-generated music with external music source (audio CD, MP3, etc). Results of an experiment on the usage of sonification for monitoring Web servers are also briefly reported.","cites":"18","conferencePercentile":"94.87179487"},{"venue":"WWW Posters","id":"8abde16d4e4f266b174e410c74ebcd8633c07ddf","venue_1":"WWW Posters","year":"2001","title":"A Real-time E-Marketplace System for Advertising Opportunities on Datacasting","authors":"Kazuaki Nakajima, Takashi Oshiba, Masahiro Tabuchi, Tomonari Kamba","author_ids":"2211147, 2406243, 2439471, 2674045","abstract":"This paper describes the introduction of an e-marketplace system called \" RealtimeMarket, \" on which broadcast airtime opportunities that are made available by datacasting can be handled in real-time. Features of this system are as follows: (1) real-time information sharing on the marketplace through the usual HTML browsers is enabled, even over the HTTP proxies or firewalls, by using bi-directional HTTP tunneling and data-replication technology, (2) a real-time trading model is adopted for the ad banner ads, (3) the Web site is designed to manage of ad opportunities in Japanese datacasting in an intuitive manner. As more and more items are handled by e-marketplaces, the demand for being real-time services will increase rapidly. The system described here will work as an important reference implementation for such cases.","cites":"0","conferencePercentile":"22.43589744"},{"venue":"WWW Posters","id":"5c1ae31ed99c6c3c1aefd2c673319daf96e28099","venue_1":"WWW Posters","year":"2001","title":"WebMacros - a Proxy-based System for Recording and Replaying User Interactions with the Web","authors":"Alex Safonov, Joseph A. Konstan, John V. Carlis","author_ids":"1866130, 2478310, 1977396","abstract":"WebMacros is a proxy-based system for automating repetitive user interactions with the Web by recording and replaying user navigation. The innovations in the system include its ability to compare HTML pages based on structure, which is used to verify the correct playback, and the ability to remotely execute and share macros.","cites":"3","conferencePercentile":"67.30769231"}]}