{"WWW_Workshop_on_Application_Des":[{"venue":"WWW Workshop on Application Design, Development and Implementation Issues in the Semantic Web","id":"94e507590a21c86a78d910abc866701ffbff25d7","venue_1":"WWW Workshop on Application Design, Development and Implementation Issues in the Semantic Web","year":"2004","title":"A Lightweight Approach to Semantic Tagging","authors":"Nadzeya Kiyavitskaya, Nicola Zeni, Luisa Mich, John Mylopoulos","author_ids":"1731618, 1832068, 1722578, 1750566","abstract":"Semantic Annotation is a challenging research direction in the area of Semantic Web. Turning the web into a Semantic Web implies widespread semantic annotation of documents. But it is still need to be investigated further in order to make annotation process more efficient, automating it as far as possible. The approach described in this paper aims at semi-automatic semantic tagging by application of linguistic lightweight methods for extraction of relevant concepts and by defining appropriate semantic models.","cites":"0","conferencePercentile":"15"},{"venue":"WWW Workshop on Application Design, Development and Implementation Issues in the Semantic Web","id":"239f424babd6a258fda1b292d852acc0ce3cf618","venue_1":"WWW Workshop on Application Design, Development and Implementation Issues in the Semantic Web","year":"2004","title":"The Networked Semantic Desktop","authors":"Stefan Decker, Martin R. Frank","author_ids":"1685642, 1806486","abstract":"We present our vision of a new group collaboration infrastructure, the Networked Semantic Desktop, drawing from co-evolving research in the Semantic Web, Peer-to-Peer (P2P) Networks, and Online Social Networking.","cites":"44","conferencePercentile":"100"},{"venue":"WWW Workshop on Application Design, Development and Implementation Issues in the Semantic Web","id":"5929170fe8f744aefc66a13cfe12a3edebab8c36","venue_1":"WWW Workshop on Application Design, Development and Implementation Issues in the Semantic Web","year":"2004","title":"Lifecycle of a Casual Web Ontology Development Process","authors":"Aditya Kalyanpur, Nada Hashmi, Jennifer Golbeck, Bijan Parsia","author_ids":"1973186, 2915545, 1713898, 1720331","abstract":"Most of the existing ontology development toolkits are not catered towards 'casual web ontology development', a notion analogous to standard web page development. Key features of this process include easy and rapid creation of ontological skeletons, searching and linking to relevant existing ontologies and a natural language-based technique to improve presentation of ontologies. In this paper we elaborate the stages in a casual ontology development process, propose novel solutions to realize them and discuss implementations in an in-house ontology development toolkit – SWOOPed.","cites":"4","conferencePercentile":"65"},{"venue":"WWW Workshop on Application Design, Development and Implementation Issues in the Semantic Web","id":"82254f8c52629f77264f3a3feba10ccb21a32bfa","venue_1":"WWW Workshop on Application Design, Development and Implementation Issues in the Semantic Web","year":"2004","title":"Developing and Managing Software Components in an Ontology-based Application Server","authors":"Daniel Oberle, Andreas Eberhart, Steffen Staab, Raphael Volz","author_ids":"3101108, 1688672, 1752093, 1745369","abstract":"Application servers provide many functionalities commonly needed in the development of a complex distributed application. So far, the functionalities have mostly been developed and managed with the help of administration tools and corresponding configuration files, recently in XML. Though this constitutes a very flexible way of developing and administrating a distributed application, e.g. an application server with its components, the disadvantage is that the conceptual model lying behind the different configurations is only implicit. Hence, its bits and pieces are difficult to retrieve, survey, check for validity and maintain. To remedy such problems, we here present an ontology-based approach to support the development and administration of software components in an application server. The ontology captures properties of, relationships between and behaviors of the components that are required for development and administration purposes. The ontology is an explicit conceptual model with formal logic-based semantics. Therefore its descriptions of components may be queried, may foresight required actions, e.g. preloading of indirectly required components, or may be checked to avoid inconsistent system configurations — during development as well as during run time. Thus, the ontology-based approach retains the original flexibility in configuring and running the application server, but it adds new capabilities for the developer and user of the system. The proposed scheme has been prototypically implemented in KAON SERVER, an application server running components that support a range of various semantic technologies — thus applying semantic technologies to itself.","cites":"24","conferencePercentile":"95"},{"venue":"WWW Workshop on Application Design, Development and Implementation Issues in the Semantic Web","id":"feb37c17b4b5e8b304545f2f40a45c335302b21b","venue_1":"WWW Workshop on Application Design, Development and Implementation Issues in the Semantic Web","year":"2004","title":"Specifying Semantic Email Processes","authors":"Luke K. McDowell, Oren Etzioni, Alon Y. Halevy","author_ids":"2956720, 1741101, 1770962","abstract":"Prior work has shown that semantic email processes (SEPs) can be an effective tool for automating email-mediated tasks that are currently performed manually in a tedious, time-consuming, and error-prone manner. However , specifying a SEP can be difficult to accomplish, even for users familiar with RDF and semantic email. In response , this paper considers an approach for specifying SEP templates that can be authored once but then instantiated many times by untrained users. We describe the template language and provide a complete example, highlighting the key features needed to enable general SEPs. We then examine a number of challenges related to SEP au-thoring. In particular, we discuss the problem of verifying that a given template will always produce a valid instantia-tion and give the computational complexity of this problem. In addition, we discuss how to simplify the task of SEP au-thoring (and improve execution quality) by automatically generating explanations for the actions performed in pursuit of a SEP's goals. Finally, we report on practical experience with our fully deployed system.","cites":"1","conferencePercentile":"37.5"},{"venue":"WWW Workshop on Application Design, Development and Implementation Issues in the Semantic Web","id":"417edd351c0fc3d52033a6c81651a444021106bd","venue_1":"WWW Workshop on Application Design, Development and Implementation Issues in the Semantic Web","year":"2004","title":"Semantical Descriptions of Models for Web Design","authors":"Peter Barna, Geert-Jan Houben, Flavius Frasincar, Richard Vdovjak","author_ids":"1746460, 1703821, 1729599, 1738027","abstract":"The use of semantic web languages brings a number of advantages for web engineering methodologies. In this paper we present how in the Hera methodology the design models benefit from description in semantic web languages. We describe how the important models are expressed and how the corresponding meta-models are defined. This is illustrated for the Application Model that specifies the hyper-media navigation over the content in the application, and do so for both the static and dynamic cases. With the support of the dynamics, particularly the interaction of the user with the generated hypermedia presentation, we extend the possibilities to specify the design of a new generation of web applications.","cites":"1","conferencePercentile":"37.5"},{"venue":"WWW Workshop on Application Design, Development and Implementation Issues in the Semantic Web","id":"0bb24f67d635ce8e752ee6f2c28e70bf405dde96","venue_1":"WWW Workshop on Application Design, Development and Implementation Issues in the Semantic Web","year":"2004","title":"The Drug Ontology Project for Elsevier - An RDF Architecture Enabling Thesaurus-Driven Data Integration","authors":"Jeen Broekstra, Christiaan Fluit, Arjohn Kampman, Frank van Harmelen, Heiner Stuckenschmidt, Ravinder Bhogal, A. Scerri, Anita de Waard, Erik M. van Mulligen","author_ids":"3037266, 1928060, 2117436, 1725286, 1698459, 2687019, 2382056, 3176207, 2235083","abstract":"The DOPE project (Drug Ontology Project for Elsevier) is driven by the need to access multiple information sources through a single interface. In this paper, we describe how DOPE allows thesaurus-driven access to heterogeneous and distributed data, based on the RDF data model. The architecture allows for the easy addition of thesauri and data sources, and can facilitate explorations in ontology mapping and data integration.","cites":"4","conferencePercentile":"65"}]}