{"Xi_bao_yu_fen_zi_mian_yi_xue_za":[{"venue":"Xi bao yu fen zi mian yi xue za zhi = Chinese journal of cellular and molecular immunology","id":"c336ee162324a36bd0e148d3f1f779b820be6990","venue_1":"Xi bao yu fen zi mian yi xue za zhi = Chinese journal of cellular and molecular immunology","year":"2014","title":"[Comparison of therapeutic effects of olfactory ensheathing cells derived from olfactory mucosa or olfactory bulb on spinal cord injury mouse models].","authors":"Libin Wang, Ping Yang, Xueyun Liang, Lijun Ma, Jun Wei","author_ids":"1804936, 3489982, 8565253, 8683166, 1693790","abstract":"OBJECTIVE\nTo isolate and culture olfactory ensheathing cells from different origins, compare their different biological characteristics, and evaluate their therapeutic effect on spinal cord injury mouse models.\n\n\nMETHODS\nThe olfactory ensheathing cells from olfactory mucosa or olfactory bulb were isolated and cultured by differential adhesion method. The expressions of S100 and P75 proteins were examined by immunofluorescence staining; their growth curves were drawn by MTT colorimetric assay; the secretion of neurotrophic factors, brain-derived neurotrophic factor (BDNF), nerve growth factor (NGF), and neurotrophin-3 (NT-3) was measured by ELISA; the gene expressions of BDNF, NGF, NT-3, neurotrophin-4 (NT-4), growth-associated protein 43 (GAP-43), and microtubule-associated protein (MAP-2) were quantified by real-time PCR; the therapeutic effect on spinal cord injury mouse models was evaluated by Basso, Beattie and Bresnahan (BBB) locomotor rating scale, which had been carried out daily for 8 weeks after the olfactory ensheathing cells of the two different origins were respectively grafted to the mouse models.\n\n\nRESULTS\nThe two types of olfactory ensheathing cells showed bipolar or tripolar shape; both of them were S100 and P75 protein positive; both of them expressing the gene of BDNF, NGF, NT-3, and NT-4; the olfactory bulb-derived cells did not express MAP-2, but it highly expressed GAP-43 gene; the olfactory mucosa-derived cells displayed a low expression of MAP-2 and GAP-43; the growth speed of olfactory bulb-derived cells was faster than that of the olfactory mucosa-derived cells. Both of them could secrete BDNF, NGF, and NT-3, but the neurotrophic factor levels secreted in the olfactory mucosa-derived cells were higher. The daily neurological BBB scoring showed that the therapeutic effect of olfactory mucosa-derived cells on spinal cord injury mouse models was better than that of the olfactory bulb-derived cells.\n\n\nCONCLUSION\nThere exist biological differences between the olfactory mucosa-derived cells and the olfactory bulb-derived cells. The olfactory mucosa-derived cells showed the better therapeutic effect on spinal cord injury mouse models.","cites":"0","conferencePercentile":"66.66666667"},{"venue":"Xi bao yu fen zi mian yi xue za zhi = Chinese journal of cellular and molecular immunology","id":"4ead0f11c8941d50b61ccf8e0db24855e3989599","venue_1":"Xi bao yu fen zi mian yi xue za zhi = Chinese journal of cellular and molecular immunology","year":"2003","title":"[Preparation and characterization of monoclonal antibodies against rat Nogo molecule].","authors":"Chao-jun Song, Xi-ping Cheng, Xue-song Liu, Yong Zhu, Ping Zhang, Xiao-guang Xu, Ying Liu, Bo-quan Jin","author_ids":"7033219, 7664319, 8015447, 3140672, 1742290, 1773847, 1718041, 7182631","abstract":"AIM\nTo prepare monoclonal antibodies against rat Nogo molecule and study the distribution of Nogo in rat central nervous system (CNS).\n\n\nMETHODS\nMurine mAbs were prepared by hybridoma technique. The distribution of Nogo in rat CNS was identified by immunofluorescent histochemical staining.\n\n\nRESULTS\nThree hybridoma cell lines, FMU-Nogo1, FMU-Nogo2 and FMU-Nogo3, secreting mAbs against rat Nogo molecule were obtained. The titers of ascitic mAbs reached to 10(-6) and the Ig subclass of FMU-Nogo1, FMU-Nogo2 and FMU-Nogo3 was IgG2b(kappa), IgG1(kappa) and IgG1(kappa), respectively. Moreover, these mAbs could be used in immunofluoresent histochemical staining. The results showed that rat Nogo molecule could be detected in Purkinje cell layer and granual layer of rat cerebellum and on oligodendrocyte in white matter of rat spinal cord.Furthermore, these mAbs could be used in Western blot for detecting Nogo molecule present in rat spinal cord.\n\n\nCONCLUSION\nThree mAbs against rat Nogo molecule were successfully prepared, which can provide a useful tool in research on the structure and functions of Nogo molecule in CNS.","cites":"1","conferencePercentile":"90"},{"venue":"Xi bao yu fen zi mian yi xue za zhi = Chinese journal of cellular and molecular immunology","id":"7203f5ef0bbdee4c9b9084c6b3481f29da19b56e","venue_1":"Xi bao yu fen zi mian yi xue za zhi = Chinese journal of cellular and molecular immunology","year":"2008","title":"[NF-kappaB-mediated protective effect of erythropoitin on neuron against glutamate-induced damage].","authors":"Wen-bin Dong, Hong-mei Hou, Qiong Wang, Feng Chen, Yong-lun Hang","author_ids":"2822281, 7516242, 4151807, 1692998, 3850256","abstract":"AIM\nTo investigate protective effect and possible mechanisms of erythropoitin (EPO) on cortical neuron against damage induced by glutamate(Glu).\n\n\nMETHODS\nCortical neurons were removed from 1-day-old newborn rat and then cultured in vitro. The model of damage induced by Glu was established. The experiment was designed as: control group, Glu treatment group,the group of pretreatment with EPO, pyrrolidine dithiocarbamates(PDTC) treatment group. The changes of morphology were observed under inverted microscopy; the cell viability was detected by MTT assay; and the apoptosis rate of neuron was measured by flow cytometry.\n\n\nRESULTS\nAfter exposure to Glu, neurons were obviously damaged. Neurons morph of EPO pretreatment group was similar to that of blank group. However, in PDTC treatment group, cells were obviously damaged, and morph of cells was similar to that of Glu treatment group. Compared with control group, survival of neurons of Glu treatment group significantly decreased, while the neurons apoptotis of Glu treatment group was significantly increased (P<0h01). Compared with Glu treatment group, the neurons, survival of EPO pretreatment group significantly increased, the neurons apoptotis can significantly decrease (P<0h01)ls. Compared with EPO pretreatment group, the cells survival of PDTC treatment group was significantly decreased, while the neurons, apoptotis of Glu treatment group was significantly increased (P<0h01), and similar to that of Glu treatment group.\n\n\nCONCLUSION\nEPO could protect cortical neuron from Glu toxicity,which might related to signal transduction of NF-kappaB.","cites":"0","conferencePercentile":"50"},{"venue":"Xi bao yu fen zi mian yi xue za zhi = Chinese journal of cellular and molecular immunology","id":"0fe58146ee9df42147a1da54c26cce5c6e5996f1","venue_1":"Xi bao yu fen zi mian yi xue za zhi = Chinese journal of cellular and molecular immunology","year":"2003","title":"[Expression and significance of enkephalin and dopamine in experimental rat cerebral concussion tissue].","authors":"Rui-Yun Peng, Ya-Bing Gao, De-Wen Wang, Xing-Yi Xiao, Hao-Yu Chen, Xiao-Hong Wu, Jie Liu, Long-He Xu, Wen-Hua Hu","author_ids":"8025947, 8128243, 6126789, 7211032, 2978407, 7917252, 1699746, 5567212, 7849081","abstract":"AIM\nTo explore the expression and significance of enkephalin and dopamine in rat cerebral concussion tissue.\n\n\nMETHODS\n80 Wistar male rats were used to make animal model of cerebral concussion, which were sacrificed on 1,3,7,14 and 30 days after postconcussion and the brain tissues were taken out. The expression patterns of enkephalin and dopamine were studied in the course of cerebral concussion by immunohistochemical staining.\n\n\nRESULTS\nThe clinical manifestation with typical cerebral concussion character was seen in rat group with 100 g body weight. The mainly pathologic changes were cerebral vascular constriction and dilatation, congestion and edema of cerebral tissue, and neuronal degeneration and necrosis. Expression of enkephalin was increased on day 1 after injury and the enkephalin positive area was in the plasma of endothelial cells in cerebral cortex, hippocamp and cerebellum. The expression of enkephalin reached the peak on day 7 after injury, and the positive area was also seen in the plasma of neurons in cerebral cortex, hippocamp and cerebellum. From 14 days after injury, the expression of enkephalin decreased gradually, but until 30 days after injury it was still higher than that of controls. Expression of dopamine increased in 7 days after injury and the positive area was seen in the plasma of endothelial cells and in the vessel wall in cerebral cortex, hippocamp, thalamus and cerebellum, and had no notable changes at other time points.\n\n\nCONCLUSION\nThe mainly pathologic changes after cerebral concussion were blood circulatory disorder and denaturation and necrosis of parenchymal cells. Enkephalin and dopamine may participate in the pathophysiological course of cerebral injury after cerebral concussion, and play an important role in the blood vessel injury, regulation of blood-brain barrier and the denaturation and necrosis of nerve cells.","cites":"0","conferencePercentile":"40"}]}