{"Yakubutsu_seishin_kodo__Japanes":[{"venue":"Yakubutsu, seishin, koĚ„doĚ„ = Japanese journal of psychopharmacology","id":"73153f6fc3a81560238c1737a39a65bd63eec55a","venue_1":"Yakubutsu, seishin, koĚ„doĚ„ = Japanese journal of psychopharmacology","year":"1993","title":"[The effect of CRF antagonist on immobilization stress-induced increases in noradrenaline release in rat brain regions].","authors":"H Emoto, C Koga, H Ishii, H Yokoo, M Yoshida, M Tanaka","author_ids":"3974065, 3838229, 1749649, 2360129, 3163668, 1752907","abstract":"We investigated the effects of intracerebroventricular (i.c.v.) administration of corticotropin-releasing factor (CRF) antagonist, alpha-helical CRF9-41 (ahCRF) on stress-induced increases in noradrenaline (NA) release in rat brain regions. Pretreatment with ahCRF (50 or 100 micrograms) attenuated significantly the stress-induced increases in levels of 3-methoxy-4-hydroxyphenylethyleneglycol sulfate (MHPG-SO4), the major metabolite of NA in rat brain, in the locus coeruleus region, cerebral cortex, hippocampus, amygdala and hypothalamus. Plasma corticosterone levels were not decreased significantly by administration of ahCRF. From these results, it is suggested that stress-induced increases in NA release in the rat brain regions are attenuated by ahCRF and thus that CRF, released during the stress, cause increases in NA release in these regions.","cites":"0","conferencePercentile":"43.75"},{"venue":"Yakubutsu, seishin, koĚ„doĚ„ = Japanese journal of psychopharmacology","id":"b2b85a7e3cef8717c6f4bbdd8702aa45d23d88ea","venue_1":"Yakubutsu, seishin, koĚ„doĚ„ = Japanese journal of psychopharmacology","year":"1993","title":"Effects of long-term treatment of haloperidol on D2 dopamine receptors in various areas of rat brain.","authors":"M Watanabe, S Ohtakeno, H Watanabe, G Mamiya, N Ichinowatari","author_ids":"3804819, 5729022, 7137733, 5957762, 5793644","abstract":"Effects of long-term treatment of haloperidol on D2 dopamine receptors in various brain areas were examined. Haloperidol treatment was found to increase the number of binding sites of D2 dopamine receptors in striatum, olfactory tubercle, hypothalamus and anterior pituitary, while Bmax of D2 receptors in hippocampus was decreased by haloperidol treatment. Therefore it is suggested that D2 dopamine receptors in hippocampus and other brain areas are regulated differently.","cites":"1","conferencePercentile":"93.75"},{"venue":"Yakubutsu, seishin, koĚ„doĚ„ = Japanese journal of psychopharmacology","id":"04c44e679a09405c3bb1bc1e62db4a4969bc3c8b","venue_1":"Yakubutsu, seishin, koĚ„doĚ„ = Japanese journal of psychopharmacology","year":"1993","title":"[Effects of tubulin on beta adrenergic receptor linked to adenylyl cyclase system].","authors":"M Watanabe, T Saito, M M Rasenick","author_ids":"3804819, 4149577, 4628573","abstract":"We developed a newly devised method for receptor binding assays in permeable C6 cell suspensions, which permits investigation of beta-adrenergic receptor behavior under conditions where the receptor appears tightly coupled to Gs protein to activate adenylyl cyclase. Tubulin, the cytoskeletal element, is a G protein with similarities to other G proteins. Although dimeric tubulins have been implicated as modulators of the adenylyl cyclase system, the total mechanism of this regulation has not been clear. Guanine nucleotides have been known to modulate agonist binding affinity for G protein-linked receptors. We demonstrate that tubulin alters the coupling between receptors and G proteins involved in the stimulation or inhibition of adenylyl cyclase system via direct transfer of GTP from tubulin to Gs alpha and Gi 1 alpha. In this study, the effects of tubulin-GppNHp have been compared to those of GppNHp in changing beta-adrenergic agonist affinity in both permeable C6 cells and C6 membranes. Competitive binding studies, including time-course assays, were performed with isoproterenol and the beta-adrenergic antagonist, [125I]pindolol. These results show that tubulin-GppNHp is more effective than GppNHp in decreasing receptor affinity in both permeable C6 cells and C6 membranes. These results imply that tubulin plays a dynamic role in neuronal signal transduction system at multiple loci.","cites":"0","conferencePercentile":"43.75"}]}