{"Yakugaku_zasshi__Journal_of_the":[{"venue":"Yakugaku zasshi : Journal of the Pharmaceutical Society of Japan","id":"86917d6f778af6576643d20660e582828d54384c","venue_1":"Yakugaku zasshi : Journal of the Pharmaceutical Society of Japan","year":"2016","title":"Development of the Virtual Physical Assessment Learning Material That Allows the Learners to Check Drug Efficacy and Early Detection of Adverse Effects through Virtual Experience.","authors":"Jin Tokunaga, Norito Takamura, Yasuyuki Kourogi, Misato Imada, Ayaka Kozasa, Kanako Komori, Chisa Ono, Akie Nishimura, Kenji Ogata, Nao Setoguchi, Toshikazu Matsuoka, Mitsuhiro Kai, Keizo Sato, Kazuhiko Arimori","author_ids":"3867924, 5812993, 7578862, 8170813, 8131909, 8714878, 8282839, 7817611, 5361308, 3832166, 7217593, 7527739, 2626706, 4048184","abstract":" We utilized the information and communication technology to develop the physical assessment (PA) learning materials in the virtual experience type. This learning material consists of two parts which include case learning and basic learning. We created example scenarios about various conditions that a pharmacist may experience in medical scenes such as in a hospital ward, community pharmacy, home, and drugstore. Illustrations of a virtual patient's avatar before and after taking the medicines were incorporated in the learning materials. The virtual training includes a stethoscope that was used in examining sounds (heart, pulmonary and bowel sounds) that served as evidences in the confirmation of drug efficacy and its possible adverse effects. In addition, we included the images of each body part, the 24 format question items, the palpation (rate and rhythm) of the radial artery, brachial artery and pedal artery, the clinical data obtained from several medical equipment, the pupillary reflex, and the urine dipstick test. This way, learners are able to experience PA with reference to the subjective and objective data from patient reception and questions. The virtual patient's avatar displayed on the monitor features auscultatory sounds on the stethoscope. It also features clinical data obtained from other medical equipment that can give the learners an interactive way of learning about various medical conditions. For evaluation, we gave out questionnaires on the virtual PA to pharmacy students. As a result, a high evaluation was reflected in terms of the degree of usefulness for both case learning and basic learning.","cites":"0","conferencePercentile":"57.14285714"},{"venue":"Yakugaku zasshi : Journal of the Pharmaceutical Society of Japan","id":"e7f62a03f1ac11989c090a2484da183981234666","venue_1":"Yakugaku zasshi : Journal of the Pharmaceutical Society of Japan","year":"1992","title":"[Synthesis of 1-trans-cinnamoyl- and 1-[trans-3-(pyridyl)acryloyl]-2-pyrrolidinone derivatives and their effect on hemicholinium-induced impairment of water maze learning in mice].","authors":"T Nagasaka, K Momose, F Hamaguchi, K Yamada, H Yamada, Y Suzuki","author_ids":"4787862, 5568439, 6693130, 4420442, 7837584, 8545120","abstract":"Various 1-trans-cinnamoyl-2-pyrrolidinones (6a-k) and 1-[trans-3-(pyridyl)acryloyl]-2-pyrrolidinones (9a-c) were prepared as analogues of the notropic agent, aniracetam (2), and their effects on hemicholinium-induced impairment of water maze learning in mice were examined. 1-(trans-3-Methoxycinnamoyl)-, 1-(trans-4-methoxycinnamoyl)- and 1-(trans-4-chlorocinnamoyl)-2-pyrrolidinones (6c, d, h) and 1-[trans-3-(3-pyridyl)acryloyl]-2-pyrrolidinone (9c) were found to be more active than aniracetam in these tests. In addition, these 2-pyrrolidinones (6a-k, 9a-c) were apparently observed to lengthen mouse survival time following hemicholinium injection into the brain.","cites":"0","conferencePercentile":"66.66666667"},{"venue":"Yakugaku zasshi : Journal of the Pharmaceutical Society of Japan","id":"46fb439fe427df5a1bdf102003187fe0c2aac7c0","venue_1":"Yakugaku zasshi : Journal of the Pharmaceutical Society of Japan","year":"2010","title":"Beta-asarone attenuates neuronal apoptosis induced by Beta amyloid in rat hippocampus.","authors":"Jicheng Liu, Chengchong Li, Guihua Xing, Li Zhou, Miaoxian Dong, Yutao Geng, Xueyan Li, Jiaming Li, Gang Wang, Dejia Zou, Yingcai Niu","author_ids":"8190707, 5023868, 7241907, 4363590, 6458448, 6814404, 1989860, 8550050, 4148672, 6159345, 8368446","abstract":"Neurodegenerative disorders, such as Alzheimer's disease (AD), is associated with the loss of neuronal cells, and it has been suggested that apoptosis is a crucial pathway in neuronal loss in AD patients. Recent evidence suggests that amyloid beta peptide (Abeta) induces neuronal apoptosis in the brain and in primary neuronal cultures. In this study, we investigated the impact of beta-asarone against the apoptosis induced by Abeta in rat hippocampus. The results showed that intrahippocampal injections of Abeta (1-42) caused apoptosis in rat hippocampus. Oral administration of beta-asarone (12.5, 25, or 50 mg/kg) for 28 d reverse the increase in the number of terminal deoxynucleotidyl transferase dUTP nick-end labeling positive cells in the hippocampus tissue. Mitochondrial dysfunction is a hallmark of beta-amyloid (Abeta)-induced neuronal toxicity in AD. Therefore, we investigated nuclear translocation of apoptosis induction factors. Our results showed that beta-asarone afforded a beneficial inhibition on both mRNA and protein expression of Bad, Bax, and cleavage of caspases 9 in rat hippocampus following intrahippocampal injections of Abeta (1-42). Our further investigation revealed that ASK1, p-MKK7, and p-c-Jun were significantly decreased after beta-asarone treatment, implicating that the modulation of ASK1/c-JNK-mediated intracellular signaling cascades might be involved in therapeutic effect of beta-asarone against Abeta toxicity. Taken together, these results suggest that beta-asarone may be a potential candidate for development as a therapeutic agent for AD.","cites":"13","conferencePercentile":"100"}]}