{"Yan_ke_xue_bao__Eye_science.csv":[{"venue":"Yan ke xue bao = Eye science","id":"fb540bbea0a31536bd9347c0ffdb6e934651750a","venue_1":"Yan ke xue bao = Eye science","year":"1995","title":"The analysis of disparity evoked potentials by a new form of static random-dot stereograms.","authors":"C Hou, X Zhang, Q Fang, T Shou, L Zeng, M Yan, Y Zhou, B Hu, P Li","author_ids":"8112817, 1742695, 1879909, 2540000, 5023967, 3889650, 8644573, 1702845, 1773444","abstract":"PURPOSE\nA new form of static random-dot stereograms free of monocular clues was designed as stimulus to elicit disparity evoked potentials.\n\n\nMETHODS\nDisparity evoked potentials were recorded in 40 stereo-normal subjects. The stimulator was a white-black static random-dot stereograms generated by a computer and had no monocular clues. Every subject was tested in disparity stimulus, zero disparity stimulus, monocular stimulus and wearing prism condition.\n\n\nRESULTS\nA characteristic wide positive wave at about 250 ms was consistently recorded in disparity stimulus, which may be regarded as evidence of the presence of stereopsis. In contrast, recordings for zero disparity stimulus, monocular vision, stimulus and wearing prism condition all demonstrated a markedly difference from recording for disparity stimulus.","cites":"0","conferencePercentile":"60"},{"venue":"Yan ke xue bao = Eye science","id":"f44148943c0ef861265a5f1171db5f51a28e5e49","venue_1":"Yan ke xue bao = Eye science","year":"2002","title":"[Effects of Schwann cell-derived neurotrophic activity on cultured retinal ganglion cells survive and grow in normal and gas-deprived environment].","authors":"Wei Huang, Lin Wang, Yannian Hui, Jixian Ma","author_ids":"1730584, 2399126, 6082499, 4791806","abstract":"PURPOSE\nTo investigate the effects of Schwann cell-derived neurotrophic activity (SCNA) on cultured retinal ganglion cells (RGC) survive and the expression of growth associated protein 43 (GAP43) in normal and gas-deprived environment.\n\n\nMETHODS\nSchwann cells of new born SD rat were cultured, and remaded it into solutions containing different concentrations of SCNA. Then these solutions were added to the primarily cultured retinal cells, the activity of SCNA was determined by MTT method. The fluro-gold retrolabelled retina cells of 3d new born rats were cultured and plated on 24 well culture plate. At the 2rd day of culture, 300 mg/L SCNA were added into the medium of SCNA group. At the 5th day, liquid paraffin was added on the surface of medium of air deprived groups to lead an air deprived injury. Cultured for 12h, the liquid paraffin was discarded off, and then we observed the morphology and counted the fluro-gold labeled RGC. The effects of SCNA on the expression of GAP43 in cultured retinal cells were identified by Western Blot.\n\n\nRESULT\nSCNA could promote the survival of RGC in a protein concentration-dependent manner. Added SCNA to the medium, the retinal cells grown much better and had less floating dead cells. The number of RGC was also significantly more than the control (F = 62.89, P < 0.01). The cells of air deprived group had showed swelling change. But the cells of group with SCNA are less affected and the number of RGCs is significantly different from the control (F = 49.27, P < 0.01). The expression of GAP43 in normal and air deprived groups with SCNA were up-regulated.\n\n\nCONCLUSION\nSCNA has significantly neurotrophic effect on cultured RGC and increases the expression of GAP43. Added SCNA to the medium could reduce the injury of air deprived and promote RGC survival rate in this kind of injury environment.","cites":"0","conferencePercentile":"50"}]}