{"Yao_xue_xue_bao__Acta_pharmaceu":[{"venue":"Yao xue xue bao = Acta pharmaceutica Sinica","id":"910f785a3a8f92f6a3470ecfe8beea5c3c2866f4","venue_1":"Yao xue xue bao = Acta pharmaceutica Sinica","year":"2014","title":"[Roles of adenosine receptors in Alzheimer's disease].","authors":"Rong Yan, Zeng-Yao Hu, Wen-Xia Zhou, Qi Wang, Yong-Xiang Zhang","author_ids":"1767526, 6761708, 7670382, 4849112, 3246644","abstract":"As an important neurotransmitter, adenosine displays its functions by acting on the adenosine receptors. Recent studies have shown that the distribution, expression and balance among subtypes of adenosine receptors are closely related with cognitive activities, and changes of adenosine receptors play key roles in neurodegenerative disorders including Alzheimer's disease. It has been pointed out that prolonged activation of adenosine receptors by high level adenosine may lead to the disturbance of balance among adenosine receptor subtypes. This imbalance mainly performed as increased expression of A2a receptor and decreased expression of A1 receptor, and enhancement of the excitatory signals mediated by A2a receptor and weakened inhibitory signals mediated by A1 receptor. Changes of these two subtypes of adenosine receptors may lead to a lot of disorders of neurological activities which developed into dysfunction of cognition to the end. These findings imply that the potential of maintaining the balance among adenosine receptors on the treatment of AD would facilitate both the revealing of the mechanism and the cure of AD.","cites":"0","conferencePercentile":"50"},{"venue":"Yao xue xue bao = Acta pharmaceutica Sinica","id":"6e8f8f6afd7143e47d0191aa1d0681d8630a349d","venue_1":"Yao xue xue bao = Acta pharmaceutica Sinica","year":"2007","title":"[Effects of Panax notoginseng saponins on long-term potentiation in the CA1 region of the rat hippocampus].","authors":"Yan Zhou, Hui Song, Zong Ning, Lei Tian, Lin Xu, Ning Mo","author_ids":"8644585, 8217317, 5330261, 4959895, 8540794, 5271893","abstract":"Panax notoginseng saponins (PNS) are very important extracts from roots of medicinal herb Sanchi Ginseng which is highly regarded in China for its therapeutic ability to meliorate blood-circulation, anti-anoxia, improve memory, and anti-caducity effects. In this study, we used blind whole-cell voltage-clamp recordings to detect the effects of PNS on long-term potentiation (LTP) in the CA1 region of the hippocampus, and investigated the electrophysiological mechanisms underlying potentiating effects of PNS on learning and memory. Wistar rats (3-4 weeks) were decapitated and hippocampal slices (400 microm thick) were cut coronally. Excitatory postsynaptic currents (EPSCs) were recorded by patch clamp technique in whole-cell configuration. The Schaffer collateral/commissural pathway was stimulated by high frequency stimulation (HFS: 100 Hz) pulses to induce LTP. The findings showed that 0.1 - 0.4 g x L(-1) PNS significantly depressed the amplitude of EPSCs (P < 0.05) and had no facilitative effects on LTP of pyramidal neurons located in the CA1 region. PNS in the concentrations of 0.04 - 0.05 g x L(-1) did not appreciably affect the amplitude of EPSCs (P > 0.05) but markedly increased the amplitude of LTP (P < 0.05). In conclusion, 0.04 - 0.05 g x L(-1) PNS could facilitate LTP in the CA1 region of the rat hippocampus and it is reasonable to suggest that this action may contribute to its potentiating effects on learning and memory.","cites":"0","conferencePercentile":"33.33333333"},{"venue":"Yao xue xue bao = Acta pharmaceutica Sinica","id":"890d39c28a90020053172548f5150824626f4822","venue_1":"Yao xue xue bao = Acta pharmaceutica Sinica","year":"2012","title":"[TREK1 potassium channels and depression].","authors":"Dong-Qing Ye, Zhi-Jun Zhang, Yang Li","author_ids":"7476125, 4943034, 1678662","abstract":"Major depression disorder is an increasing heavy burden in modem society, but its pathological mechanism is still vague. Recent evidence indicated that two pore potassium channel, TREK1, is one of the important drug targets of antidepressants. The structural and functional research progress of TREK1 potassium channel were reviewed with an emphasis on its roles in anti-depression, neuronal protection, and neuronal plasticity. The complicated interactions between TREK1 potassium channel and monoamine transmitters-receptors were also reviewed and future directions to explore the underline mechanism were also discussed.","cites":"0","conferencePercentile":"50"}]}