{"Yearbook_of_medical_informatics":[{"venue":"Yearbook of medical informatics","id":"df6ec6eb50dba5fc47943bef575350f0775fbe9f","venue_1":"Yearbook of medical informatics","year":"2012","title":"Smartphone as a Personal, Pervasive Health Informatics Services Platform: Literature Review","authors":"Katarzyna Wac","author_ids":"2852578","abstract":"OBJECTIVES\nThe article provides an overview of current trends in personal sensor, signal and imaging informatics, that are based on emerging mobile computing and communications technologies enclosed in a smartphone and enabling the provision of personal, pervasive health informatics services.\n\n\nMETHODS\nThe article reviews examples of these trends from the PubMed and Google scholar literature search engines, which, by no means claim to be complete, as the field is evolving and some recent advances may not be documented yet.\n\n\nRESULTS\nThere exist critical technological advances in the surveyed smartphone technologies, employed in provision and improvement of diagnosis, acute and chronic treatment and rehabilitation health services, as well as in education and training of healthcare practitioners. However, the most emerging trend relates to a routine application of these technologies in a prevention/wellness sector, helping its users in self-care to stay healthy.\n\n\nCONCLUSIONS\nSmartphone-based personal health informatics services exist, but still have a long way to go to become an everyday, personalized healthcare-provisioning tool in the medical field and in a clinical practice. Key main challenge for their widespread adoption involve lack of user acceptance striving from variable credibility and reliability of applications and solutions as they a) lack evidence- based approach; b) have low levels of medical professional involvement in their design and content; c) are provided in an unreliable way, influencing negatively its usability; and, in some cases, d) being industry-driven, hence exposing bias in information provided, for example towards particular types of treatment or intervention procedures.","cites":"9","conferencePercentile":"100"},{"venue":"Yearbook of medical informatics","id":"1983d4768da439b7b1202d60dbea2e6899ba2b00","venue_1":"Yearbook of medical informatics","year":"2007","title":"Free and open source enabling technologies for patient-centric, guideline-based clinical decision support: a survey.","authors":"T Y Leong, K Kaiser, S Miksch","author_ids":"7469994, 7961915, 1692521","abstract":"OBJECTIVES\nGuideline-based clinical decision support is an emerging paradigm to help reduce error, lower cost, and improve quality in evidence-based medicine. The free and open source (FOS) approach is a promising alternative for delivering cost-effective information technology (IT) solutions in health care. In this paper, we survey the current FOS enabling technologies for patient-centric, guideline-based care, and discuss the current trends and future directions of their role in clinical decision support.\n\n\nMETHODS\nWe searched PubMed, major biomedical informatics websites, and the web in general for papers and links related to FOS health care IT systems. We also relied on our background and knowledge for specific subtopics. We focused on the functionalities of guideline modeling tools, and briefly examined the supporting technologies for terminology, data exchange and electronic health record (EHR) standards.\n\n\nRESULTS\nTo effectively support patient-centric, guideline-based care, the computerized guidelines and protocols need to be integrated with existing clinical information systems or EHRs. Technologies that enable such integration should be accessible, interoperable, and scalable. A plethora of FOS tools and techniques for supporting different knowledge management and quality assurance tasks involved are available. Many challenges, however, remain in their implementation.\n\n\nCONCLUSIONS\nThere are active and growing trends of deploying FOS enabling technologies for integrating clinical guidelines, protocols, and pathways into the main care processes. The continuing development and maturation of such technologies are likely to make increasingly significant contributions to patient-centric, guideline-based clinical decision support.","cites":"7","conferencePercentile":"100"}]}