{"Yi_chuan_xue_bao__Acta_genetica":[{"venue":"Yi chuan xue bao = Acta genetica Sinica","id":"e6d39416248051f33adf2ee74f79848af1b7eafc","venue_1":"Yi chuan xue bao = Acta genetica Sinica","year":"2005","title":"No association between attention-deficit hyperactivity disorder and catechol-O-methyltransferase gene in Chinese.","authors":"San-Duo Jiang, Xiao-Dong Wu, Ye Zhang, Guo-Mei Tang, Yi-Ping Qian, Dong-Xiang Wang","author_ids":"3784134, 7917095, 1783768, 8504312, 8341766, 7496623","abstract":"Previous studies suggested that the catecholaminergic systems may be involved in the pathogenesis of attention-deficit hyperactivity disorder(ADHD). Since catechel-O-methyltransferase (COMT) is an enzyme involved in the degradation of catecholaminergic neurotransmitters of the dopaminergic and noradrenergic systems,it is possible that COMT may play a role in ADHD. To test this hypothesis, we used two family-based analyses,the transmission disequilibrium test (TDT) and the haplotype-based haplotype relative risk (HHRR), to examine the possible association between COMT gene and DSM-IV-diagnosed ADHD in a Chinese sample consisting of 79 ADHD probands and their parents. Both TDT (chi2 = 1.03, df=1, P > 0.05) and HHRR (chi2 = 1.08, df = 1, P > 0.05) analyses failed to detect preferential transmission of a COMT allele to the ADHD children. Our data suggested that there was no association between ADHD and the COMT gene in the Chinese population.","cites":"1","conferencePercentile":"85.71428571"},{"venue":"Yi chuan xue bao = Acta genetica Sinica","id":"091a12e73fdb4fb9e7c98d52767c41cd2f073517","venue_1":"Yi chuan xue bao = Acta genetica Sinica","year":"2002","title":"[Molecular phylogeny of Drosophila auraria species complex].","authors":"Jian Lu, Jing Lü, Hui-Xian Chen, Wen-Xia Zhang, Zhuo-Hua Dai","author_ids":"3782814, 1920695, 4243580, 8030632, 5869181","abstract":"Drosophila auraria species complex consists of five sibling species D. auraria, D. biauraria, D. triauraria, D. quadraria and D. subauraria. The complete sequences of nuclear ITS1 (internal transcribed specer 1) and mitochondrial CO II (Cytochrome Oxdase II), and partial sequences of nuclear Adh (alcohol dehydrogenase) of these five sibling species and their closely-related species, D. rufa, were determined. Using D. rufa, D. melanogaster and D. yukuba as outgroups, both most-parsimony (MP) and neighbor-joining (NJ) trees were constructed based on the sequences of each genetic marker. In each tree, D. subauraria always branched off first within Drosophila auraria species complex. Combined sequences of ITS1, Adh and CO II are 2327 bp (excluding gaps), of which 255 sites are parsimony informative. Phylogenetic analyses based on the combined data sets can resolve the phylogenetic relationships of the five sibling species relatively well. According to the MP and NJ trees based on the combined sequences, D. subauraria was the first to emerge within Drosophila auraria species complex, thereafter D. biauraria branched off, D. auraria, D. triauraria and D. quadraria had a relatively recent speciation history. In this paper we propose a hypothesis about divergence events in Drosophila auraria species complex: The ancestor of this species complex diverged with D. rufa in warm-temperate regions about 2.33 myr ago, then they invaded into cold-temperate regions. In cold-temperate regions, D. subauraria was firstly derived from the ancestor of Drosophila auraria species complex about 0.88 myr ago, thereafter D. biauraria emerged about 0.31 myr ago. During the process the ancestor reinvading into warm-temperate and subtropical regions, speciations of D. auraria, D. triauraria and D. quadraria were gradually completed. This hypothesis does not agree on the previous opinion that D. quadraria was the ancestral species of Drosophila auraria species complex.","cites":"0","conferencePercentile":"50"}]}