{"Yi_chuan__Hereditas.csv":[{"venue":"Yi chuan = Hereditas","id":"0c5fe54456e57083f660193850d540419556010a","venue_1":"Yi chuan = Hereditas","year":"2014","title":"[Evaluating the missing heritability of bipolar disorder using the multifactorial liability threshold model].","authors":"Kang Li, Ruihuan Xu, Hongde Zhang, Qian Wang","author_ids":"4573551, 4377657, 6225558, 1729612","abstract":"In order to evaluate the missing heritability of bipolar disorder, we queried the GWAS catalog of National Human Genome Research Institute, retrieve all the susceptible gene variation of bipolar disorder, and calculate the heritability explanation degree of each susceptibility variant using the multifactorial liability threshold model. The total heritability explanation degree of bipolar disorder was obtained through summing up the heritability explanation degree of each susceptibility variant. Then, we evaluated the missing heritability of bipolar disorder based on the total heritability explanation degree. The results showed that the total heritability explanation degree of bipolar disorder explained by known susceptible variants was 38.34%, and the other 61.66% of heritability can't be explained by known susceptibility variants, which belong to the missing heritability of bipolar disorder. The total heritability explanation degree of bipolar disorder in this study was significantly increased compared to earlier similar studies abroad. With constant discovery of new bipolar disorder susceptibility variants, the missing heritability of bipolar disorder has been greatly reduced, but the missing heritability of bipolar disorder still exists and occupies a large part of the bipolar disorder heritability, indicating that the molecular genetic mechanisms of bipolar disorder need to be further clarified.","cites":"0","conferencePercentile":"62.5"},{"venue":"Yi chuan = Hereditas","id":"d077fb2cda582d6969a035825443947938297be1","venue_1":"Yi chuan = Hereditas","year":"2006","title":"[Genome-wide search for linkage to attention deficit hyperactivity disorder (ADHD) on the X chromosome].","authors":"San-Duo Jiang, Mei He, Yi-Ping Qian, Dong-Xian Wang, Ye Zhang, Fei Li, Hong-Jun Tian, Ren-E Xin, Guo-Mei Tang, Xiao-Dong Wu","author_ids":"3784134, 8362647, 8341766, 6163167, 1783768, 4641515, 8122719, 8604196, 8504312, 7917095","abstract":"Attention deficit hyperactivity disorder (ADHD) is the most common childhood-onset behavioral. Boys are more often affected than girls. Family, twin and adoption studies have supported a strong genetic basis. The etiology of this disorder is not clear. Molecular genetic and pharmacological studies suggest the involvement of dopaminergic and noradrenergic neurotransmitter systems in ADHD, e.g , Several reports have found association between ADHD and the dopamine receptor gene DRD-4.the dopamine transporter gene DAT1, and the catechol-o-methyltransferase. Our previous studies showed an association between ADHD and the DXS7 locus, which is located in closely linked to the MAO gene, and MAOA gene on chromosome X. To test this hypothesis, we used the genome scan for a predisposing locus on chromosome X to ADHD. We used the tramsmission/disequilibrium test (TDT) to test for linkage between a VNTR polymorphism at the 48 markers of chromosome X and DSM-III-R oliagnosed ADHD in 84 nuclear families of the Chinese population. The TDT analysis revealed linkage between ADHD and the DXS1214(TDT: Chi2=18.1, df=7, P<0.01), DXS8102(TDT: Chi2=7.9, df=3, P<0.05), DXS1068(TDT: Chi2=21.9, df=9, P<0.01), DXS8015(TDT: Chi2=14.6, df=7, P<0.05), DXS1059(TDT: Chi2=27.8, df=10, P<0.01) and DXS8088(TDT: Chi2=20.4, df=3, P<0.01).The data showed that susceptibility loci might reside in chromosome Xp11.4-Xp21 and Xq23 for ADHD.","cites":"1","conferencePercentile":"87.5"},{"venue":"Yi chuan = Hereditas","id":"52dc60233271503d002504a05fead84869d971bb","venue_1":"Yi chuan = Hereditas","year":"2007","title":"[An association study between GRIN1, BDNF genes and bipolar disorder].","authors":"Min Liu, Si-Hai Ling, Wen-Biao Li, Chuan-Yue Wang, Da-Fang Chen, Gang Wang","author_ids":"8649419, 6837048, 3742453, 8205533, 6086741, 4148672","abstract":"To evaluate the role of inherited gene variations in GRIN1 (glutamate receptor, ionotropic NMDA1), BDNF (brain derived neurotrophic factor) genes in human bipolar disorder, we selected 4 single nucleotide polymorphisms in GRIN1, BDNF (2 SNPs in each gene) and made SNPs analysis in 100 unrelated cases and 100 controls by TaqMan. Then we compared genotypes differences between cases and controls. The software SHEsis was also used to make haplotype analysis. The significant results were obtained, showing that the SNPs in GRIN1 gene were related to the BP (P < 0.05). In addition, the combined haplotype T/G had a significant difference in the two groups (P < 0.05). The SNPs in BDNF gene showed no statistical significance. These results confirm that the GRIN1 gene confers susceptibility to bipolar disorder.","cites":"2","conferencePercentile":"91.66666667"},{"venue":"Yi chuan = Hereditas","id":"982a589b46f11f2d642e787ea44741c282717a07","venue_1":"Yi chuan = Hereditas","year":"2006","title":"[Expression levels of APP and PS1 genes in patients with Alzheimer's disease].","authors":"Ye Zhang, Yi-Ping Qian, Kai-Da Jiang, Shun-Ying Yu, Dong-Xiang Wang, Ming-Yuan Zhang, San-Duo Jiang","author_ids":"1783768, 8341766, 7502094, 8193308, 7496623, 7979279, 3784134","abstract":"The gene expression levels of amyloid precursor protein (APP) and presenilin 1 (PS1) in the peripheral blood samples of patients with Alzheimer's disease(AD) and their association with the disease were studied. The absolute expression levels of APP and PS1 genes were quantified in 45 AD patients, 25 patients with vascular dementia (VD) and 60 healthy controls by real-time quantitative PCR using SYBR Green I. The APP expression levels in healthy controls, AD cases and VD cases are 0.026+/-0.005, 0.044+/-0.006 and 0.072+/-0.013 amol/microg cDNA, respectively; and the PS1 expression levels are 0.026+/-0.004, 0.051+/-0.011 and 0.039+/-0.005 amol/microg cDNA, respectively. Both APP and PS1 expression levels were significantly elevated in AD or in VD cases (APP, AD vs Control, t=2.639, P<0.01, VD vs Control, t=3.028P<0.01; PS1, AD vs Control, t=2.173P<0.05, VD vs Control, t=2.012P<0.05). It seems that elevated APP and PS1 gene expression is associated with dementia but not especially with AD.","cites":"0","conferencePercentile":"37.5"}]}