{"Ying_yong_sheng_tai_xue_bao__Th":[{"venue":"Ying yong sheng tai xue bao = The journal of applied ecology","id":"6c4c6849ef0bcb06db37fd36d30fa8cadb57b5ed","venue_1":"Ying yong sheng tai xue bao = The journal of applied ecology","year":"2013","title":"[Cleistogenes squarrosa population at different restorative succession stages in Inner Mongolia of China: a point pattern analysis].","authors":"Xin-Ting Wang, Wei Wang, Cun-Zhu Liang, Jun-Jiang Bao","author_ids":"4602421, 1706612, 5801726, 4936466","abstract":"In this paper, the spatial pattern of Cleistogenes squarrosa population in different restorative succession communities of the typical steppe dominated by Stipa grandis and Leymus chinensis in Inner Mongolia was measured by photography orientation, and analyzed by complete spatial randomness model, Poisson cluster process, and nested double-cluster process. In severely degraded community, C. squarrosa population fitted well nested double-cluster process for all scales, i. e., high density small clusters existed at the centers of large clusters; whereas in 5-, 8-, and 21-year-old restored communities, C. squarrosa population fitted well Poisson cluster process for all scales, i. e. , high density small clusters did not exist at the centers of the clusters. It was suggested that facilitation was the dominant interaction in severely degraded community, while competition dominated in restored communities. The differences in the spatial pattern of C. squarrosa population during the restorative succession could be induced by the shift from facilitation to competition along the gradient of grazing stress.","cites":"0","conferencePercentile":"56.25"},{"venue":"Ying yong sheng tai xue bao = The journal of applied ecology","id":"c877b48e18b3ad56e8ea5cc500c3825819aefcba","venue_1":"Ying yong sheng tai xue bao = The journal of applied ecology","year":"2002","title":"[Echolocation sound waves, morphological features and foraging strategies in Hipposideros pratti].","authors":"Min Chen, Jiang Feng, Zhenxin Li, Jiang Zhou, Huihua Zhao, Shuyi Zhang, Lianxi Sheng","author_ids":"1711628, 4222261, 7718630, 7934913, 2564114, 3351673, 2131283","abstract":"Studies on the echolocation sound waves in different states (flying and hanging), morphological features and ecological processes (foraging strategies, foraging habitat and diet type) of Hipposideros pratti showed that H. pratti had CF (constant frequency)-FM (frequency modulated) echolocation sounds. There were some differences in dominant frequency (caused by Doppler compensating effect), pulse repetition rate, pulse duration and interpulse interval between the bats at flying and hanging. The dominant frequency, FM bandwidth, pulse duration and interpulse interval were lower, while the pulse repetition rate and duty cycle were higher at flying than at hanging. All the differences indicated that H. pratti could adopt specific echolocation sounds to adapt to specific environments and conditions to detect, approach and capture their preys successfully. On the basis of echolocation sound and field observation, it was concluded that H. pratti might search the preys at flying in the period of insect fastigium, and after the period, it might search the targets at hanging. The foraging habitat was near the tree crowns, and the preys consisted mainly of relatively large insects, such as beetles.","cites":"1","conferencePercentile":"95.83333333"},{"venue":"Ying yong sheng tai xue bao = The journal of applied ecology","id":"d6656353a3b19c264d3e5df83c2d06820820a71c","venue_1":"Ying yong sheng tai xue bao = The journal of applied ecology","year":"2014","title":"[Forest landscapes' spatial point patterns and associations based on Ripley L and O-ring functions].","authors":"Ling-bo Dong, Zhao-gang Liu, Bo Zhang, Ye Yuan, Yun-xia Sun","author_ids":"7825456, 5675805, 1696318, 1681755, 6191637","abstract":"Based-on the data of forest resource inventory in Pangu Forest Farm of Great Xing' an Mountains in northeastern China, the spatial distribution pattern and associations of the main forest landscape types [natural Larix gmelini forest (NLG), natural Betula platyphylla forest (NBP), natural coniferous mixed forest (NCM) and natural mixed broadleaf-conifer forest (NCB)] were studied by the two main spatial point pattern analysis methods (Ripley L and O-ring functions). The results showed that the spatial distribution pattern of the four forest landscape types were all consistent with each other the whole, which were all significantly clumped at small scale, and then mainly the obvious characteristics of random distribution with the increase of scale. Spatial associations of the four forest landscape types differed significantly with the Ripley L and O-ring functions. The results of Ripley L function showed that NLG and NCB, NBP and NCB had the obvious negative correlations at small and medium scales, and then mainly showed the trend of non-correlations or even positive correlations at medium and large scales, however, there were significantly negative correlations for.the other forest landscape types at all the research scales. Unlike the results of Ripley L function, the results of O-ring function showed that the main forest landscape types were all significantly negative at small scale, no at medium scale, and positive at large scale with each other. Meanwhile, there were also significant differences for the spatial distribution patterns and associations for the same forest landscape type (or group) at the same level of scale with two different methods, and the rate of consistency of the two methods at all levels of scale mainly exist three forms, i.e., basically remain unchanged, reduced firstly and then increased, and almost always reduced, respectively.","cites":"0","conferencePercentile":"53.33333333"},{"venue":"Ying yong sheng tai xue bao = The journal of applied ecology","id":"daa8fe49489ca525ca2ccd244c9edb99fa113288","venue_1":"Ying yong sheng tai xue bao = The journal of applied ecology","year":"2003","title":"[Fractal properties of the spatial pattern of rare and endangered plant populations in Houhe Nature Reserve in Hubei: Box-counting dimension].","authors":"Yuqiang Tian, Xin Li, Mingxi Jiang","author_ids":"2920275, 1705796, 8333530","abstract":"The fractal properties of the spatial distribution pattern of 4 dominant plant populations and 7 rare and endangered plant populations were reflected through the box-counting dimensions. The results showed that the box-counting dimensions of 4 dominant populations ranged between 1.346 and 1.414, and occupied relatively larger ecological spaces in the community. Camellia cuspidata population occupied the largest ecological space because of its biggest box-counting dimensions. However, most of other populations occupied relatively smaller spaces due to their smaller values of the box-counting dimensions. The box-counting dimensions of 7 rare and endangered populations were smaller than 1 except Dipteronia sinensis population. The inflexion scales of 11 populations covered the range from 5 m to 12.5 m. According to the self-similarity of the fractal, the distribution pattern types under certain scales larger than the inflexion scale could be inferred as similar, and the results partly proved the ideas. The populations of Disopyros lotus, Pterostyrax psilophyllus, Davidia involucrata, Tetracentron sinense and Aesculus wilsonii were changed at the inflexion scale, and other 6 populations had the same distribution pattern types despite of the scale changed.","cites":"0","conferencePercentile":"50"},{"venue":"Ying yong sheng tai xue bao = The journal of applied ecology","id":"5957a1b8f06354791a8e888ccc97529991306bed","venue_1":"Ying yong sheng tai xue bao = The journal of applied ecology","year":"2015","title":"[Comparison on the methods for spatial interpolation of the annual average precipitation in the Loess Plateau region].","authors":"Yang Yu, Wei Wei, Li-ding Chen, Lei Yang, Han-dan Zhang","author_ids":"3839568, 1725923, 2839731, 1704442, 6926965","abstract":"Based on 57 years (1957-2013) daily precipitation datasets of the 85 meteorological stations in the Loess Plateau region, different spatial interpolation methods, including ordinary kriging (OK), inverse distance weighting (IDW) and radial-based function (RBF), were conducted to analyze the spatial variation of annual average precipitation regionally. Meanwhile, the mean absolute error (MAE), the root mean square error (RMSE), the accuracy (AC) and the Pearson correlation coefficient (R) were compared among the interpolation results in order to quantify the effects of different interpolation methods on spatial variation of the annual average precipitation. The results showed that the Moran's I index was 0.67 for the 57 years annual average precipitation in the Loess Plateau region. Meteorological stations exhibited strong spatial correlation. The validation results of the 63 training stations and 22 test stations indicated that there were significant correlations between the training and test values among different interpolation methods. However, the RMSE (IDW = 51.49, RBF = 43.79) and MAE (IDW = 38.98, RBF = 34.61) of the IDW and the RBF showed higher values than the OK. In addition, the comparison of the four semi-variagram models (Circular, Spherical, Exponential and Gaussian) for the OK indicated that the circular model had the lowest MAE (32.34) and the highest accuracy (0.976), while the MAE of the exponential model was the highest (33.24). In conclusion, comparing the validation between the training data and test results of the different spatial interpolation methods, the circular model of the OK method was the best one for obtaining accurate spatial interpolation of annual average precipitation in the Loess Plateau region.","cites":"0","conferencePercentile":"58.33333333"},{"venue":"Ying yong sheng tai xue bao = The journal of applied ecology","id":"72a7ad519c002428cd444a098f00869d0f0ed87c","venue_1":"Ying yong sheng tai xue bao = The journal of applied ecology","year":"2009","title":"[Electroantennogram responses of Maruca testulalis (Lepidoptera: Pyralidae) to plant volatiles and sex pheromone].","authors":"Xia Wang, Jing Xu, You-Lian Shen, Feng-Ying Liu, Yong-Jun Du","author_ids":"3517895, 4129787, 4519764, 7187115, 7713000","abstract":"By using cis-3-hexenyl acetate as standard chemical, the electroantennogram (EAG) responses of Maruca testulalis (Lepidoptera, Pyralididae) to plant volatiles and sex pheromone were investigated. Both the males and the females of M. testulalis showed strong EAG responses to the volatiles, but no significant difference was observed under most test concentrations. Among the test nine plant volatiles, the males and females had greater difference in the shape of EAG response to trans-2-hexenal, and their maximum EAG relative response to high concentration trans-2-hexenal was 250% and 260%, respectively. No obvious EAG responses were observed to the cedrene and cedrol from cowpea Vigna unguiculata floral. Both the male and the female moths showed clear EAG responses to sex pheromone, and significant difference was detected between males and females. The maximum EAG relative response of the males to (E10, E12)-16 CHO, a main component of sex pheromone, was 250%, while that of the females was only 53%. The difference in the EAG responses between the males and females reflected the difference in the structure, function and behavior of the males and females olfactory system.","cites":"0","conferencePercentile":"42.85714286"},{"venue":"Ying yong sheng tai xue bao = The journal of applied ecology","id":"b034c09a349856e413e64379a58417c4c2104c64","venue_1":"Ying yong sheng tai xue bao = The journal of applied ecology","year":"2002","title":"[On nest-site selection of Otic tarda].","authors":"Dongmei Wan, Wei Gao, Jiang Zhao, Haitao Wang, Jinrui Cheng","author_ids":"5970616, 1698396, 2308876, 1704379, 3978912","abstract":"During April to July in 2000 and 2001, the nest-site selection of Otis tarda was studied by direct observation and sampling method in the southeast grassland of Keyouqianqi in Inner Mongolia. The results showed that Otis tarda was one kind of big-sized bird built nests on the ground in sparse cluster, and the smallest distance between nests was 9 m. Otis tarda had a significant tendency in nest-site selection. Firstly, this tendency was represented under the scale of landscape. Most nests of Otis tarda were built on the mid-hill of grassland, the elevation range was from 190 m to 230 m, most nests built on the slopes faced to sun, and the biggest gradient was not more than 8 degree. Moreover, the nests were near to roads. Secondly, Otis tarda selected its nest-site according to vegetation structure. It tended to select nest-site with thick hay, high vegetation density and grass height from 15 cm to 35 cm, but would not select the place with over high vegetation density no nest.","cites":"0","conferencePercentile":"45.83333333"},{"venue":"Ying yong sheng tai xue bao = The journal of applied ecology","id":"38ad626e324b3b9f8e3ebec7b6082f8b7da86beb","venue_1":"Ying yong sheng tai xue bao = The journal of applied ecology","year":"2002","title":"[Effects of habitat fragmentation on nesting site selection of red-crowned crane].","authors":"Dongmei Wan, Wei Gao, Qiuyu Wang, Haitao Wang, Mingyu Liu","author_ids":"5970616, 1698396, 3669630, 1704379, 3007208","abstract":"During April and May of 1985, 1995 and 1998, red-crowned crane's nesting and variation of breeding population quantities in Shuangtaihekou National Natural Reserve in Liaoning, and also the habitat fragmentation there were investigated. Associated with previous data of the reserve, red-crowned crane's nesting habitat had been seriously fragmentated into 91 patches from one integrated reed wetland. The area of the smallest patch was 0.37 km2, and the minimum distance of two nests was 304 m. Compared with records of previous data, the minimum area of nesting habitat reduced by 0.72 km2. However, the breeding population quantities of red-crowned crane had maintained at about 30 pairs for a long period. The red-crowned crane adapted to the changed environment by the ecological adaptation strategy of reducing area of nesting habitat.","cites":"0","conferencePercentile":"45.83333333"}]}