{"Yonago_acta_medica.csv":[{"venue":"Yonago acta medica","id":"16426aa58b938948be6ddf1789224bdbebdc5927","venue_1":"Yonago acta medica","year":"2015","title":"Usefulness of Preoperative Assessment of Perigastric Vascular Anatomy by Dynamic Computed Tomography for Laparoscopic Gastrectomy","authors":"Tomohiro Osaki, Hiroaki Saito, Yuki Murakami, Kozo Miyatani, Hirohiko Kuroda, Tomoyuki Matsunaga, Youji Fukumoto, Masahide Ikeguchi","author_ids":"7492654, 7380554, 2336791, 6904867, 3569729, 4452404, 4924339, 7426827","abstract":"BACKGROUND\nLaparoscopic surgery requires a more detailed understanding of local anatomy than does conventional open surgery. The aim of this study was to examine the usefulness of dynamic computed tomography (D-CT) for identification of the location of the left gastric vein (LGV) and existence of the aberrant left hepatic artery (ALHA) compared with conventional enhanced computed tomography (E-CT).\n\n\nMETHODS\nSixty-eight patients underwent laparoscopic-assisted gastrectomy (LAG). E-CT and D-CT were performed in 32 and 36 patients, respectively, and three-dimensional computed tomographic angiography (3D-CTA) was performed in addition to D-CT. The location of the LGV and existence of the ALHA were confirmed during LAG, and these results were compared with those determined preoperatively by CT imaging.\n\n\nRESULTS\nThe location of the LGV as detected by preoperative E-CT and D-CT was consistent with that identified during LAG in 28 (87.5%) and 31 (88.9%) patients, respectively, with no statistical differences. The existence of the ALHA as detected by preoperative E-CT and D-CT was consistent with that identified during gastrectomy in 24 (75%) and 36 (100%) patients, respectively, with a statistical difference (P = 0.005). Furthermore, the type of ALHA could be identified in 10 of 12 patients (83.3%) by D-CT.\n\n\nCONCLUSION\nD-CT can produce excellent images of the vascular supply, and thus undoubtedly contributes to the preoperative planning of LAG. Preoperative D-CT might be an informative tool with which to help overcome the disadvantages of LAG.","cites":"0","conferencePercentile":"38"},{"venue":"Yonago acta medica","id":"9072d8b0484e7786b02f9b40518e64891b1e530f","venue_1":"Yonago acta medica","year":"2016","title":"Rice Bran Dietary Supplementation Improves Neurological Symptoms and Loss of Purkinje Cells in Vitamin E-Deficient Mice","authors":"Toru Takahashi, Kazuhiro Nakaso, Yosuke Horikoshi, Takehiko Hanaki, Miho Yamakawa, Masato Nakasone, Yoshinori Kitagawa, Taisuke Koike, Tatsuya Matsura","author_ids":"2288937, 4517779, 2258824, 6625365, 5447175, 4647121, 7146880, 6779516, 6947095","abstract":"BACKGROUND\nVitamin E (VE, α-tocopherol) is a fat-soluble vitamin and is well known as an antioxidant. A deficiency in VE induces oxidative stress in the brain and causes motor and memory dysfunction. The consumption of a VE-rich diet has been given much attention in recent years, in regards to anti-aging and the prevention of age-related neuronal disorders.\n\n\nMETHODS\nA VE-deficient mouse model was prepared by feeding the animals a diet lacking VE. In addition, to evaluate the effect of VE-containing rice bran (RB) on VE deficiency, a diet including RB was also provided. VE levels in the brain tissue, as well as in the RB, were measured using an HPLC system. Behavioral tests, including rotarod, wheel running activity, Y-maze, and elevated plus maze were performed. To clarify the effect of VE deficiency and RB, we investigated the induction of heme oxygenase-1 (HO-1). Histological studies were performed using HE staining and immunohistochemical studies were performed using antibodies against glial fibrillary acidic protein (GFAP) and ionized calcium binding adaptor molecule 1 (Iba1).\n\n\nRESULTS\nVE in the mouse brain under a VE-deficient diet was decreased, and recovered α-tocopherol levels were observed in the brain of mice fed an RB diet. Motor behavioral scores were decreased in VE-deficient conditions, while the supplementation of RB improved motor function. HO-1, a marker of oxidative stress, was upregulated in the mouse brain under VE deficiency, however, RB supplementation inhibited the increase of HO-1. Histological analyses showed neuronal degeneration of Purkinje cells and decreased GFAP-immunoreactivity of Bergmann glia in the cerebellum. In addition, activated astrocytes and microglia were observed in mice fed the VE-deficient diet. Mice fed the RB diet showed improvement in these histological abnormalities.\n\n\nCONCLUSION\nA VE-deficient diet induced motor dysfunction in mice due to the degeneration of Purkinje cells in the cerebellum. Oral supplementation of RB increases VE in the brain and improved the motor dysfunction caused by VE deficiency. Thus, RB or unpolished rice may be a promising VE supplement.","cites":"0","conferencePercentile":"46.875"},{"venue":"Yonago acta medica","id":"d542042c271d22a2f599e054341f611e97e3a896","venue_1":"Yonago acta medica","year":"2016","title":"Intra-Abdominal Complications after Curative Gastrectomies Worsen Prognoses of Patients with Stage II–III Gastric Cancer","authors":"Kader A.T.M. Abdul, Yuki Murakami, Miwa Yoshimoto, Kazunari Onishi, Hirohiko Kuroda, Tomoyuki Matsunaga, Yoji Fukumoto, Shuichi Takano, Naruo Tokuyasu, Tomohiro Osaki, Hiroaki Saito, Masahide Ikeguchi","author_ids":"8078531, 2336791, 8142506, 4638353, 3569729, 4452404, 3704732, 3441634, 5984557, 7492654, 7380554, 7426827","abstract":"BACKGROUND\nPostoperative complications have been shown to worsen prognoses of various cancer types.\n\n\nMETHODS\nWe retrospectively analyzed 265 patients with stage II-III gastric cancer who underwent curative gastrectomies between 1991 and 2010 at Tottori University Hospital to determine the effect of postoperative intra-abdominal complication (IAC) on prognosis.\n\n\nRESULTS\nOf the 265 patients, 38 (14.3%) developed postoperative IACs of grade ≥ 2, of whom significantly more patients were male. Patients in the IAC group were significantly older than patients in the non-complication (NC) group. The NC group had significantly better survival than did the IAC group (P < 0.0001). Within the IAC group, 5-year survival rates did not significantly differ between patients with infectious complication subgroup (24.6%) and the non-infectious subgroup (46.2%). Grade of complication was not related to prognosis. Lengths of time before starting adjuvant chemotherapy (AC) after surgery were significantly longer for the IAC group (55.3 ± 34.7 days) than for the NC group: (26.6 ± 11.9 days; P = 0.0023). Prognosis of patients who took AC within 6 weeks after surgery tended to be better than that of patients who took AC > 6 weeks after surgery (P = 0.071). In multivariate analysis, IAC was an independent predictor of prognosis, as were age, invasion depth, and lymph node metastasis.\n\n\nCONCLUSION\nPostoperative IACs were related to poorer survival for patients with stage II-III gastric cancer.","cites":"0","conferencePercentile":"46.875"},{"venue":"Yonago acta medica","id":"04ff18a28e0ae62c96364fe2114cd550deaa7ebc","venue_1":"Yonago acta medica","year":"2016","title":"Usefulness of T-Shaped Gauze for Precise Dissection of Supra-Pancreatic Lymph Nodes and for Reduced Postoperative Pancreatic Fistula in Patients Undergoing Laparoscopic Gastrectomy for Gastric Cancer","authors":"Tomoyuki Matsunaga, Hiroaki Saito, Yuki Murakami, Hirohiko Kuroda, Yoji Fukumoto, Tomohiro Osaki","author_ids":"4452404, 7380554, 2336791, 3569729, 3704732, 7492654","abstract":"BACKGROUND\nSupra-pancreatic lymph node dissection is important in patients undergoing laparoscopic gastrectomy (LG) for gastric cancer. A clear view of the supra-pancreatic area is necessary for precise dissection of supra-pancreatic lymph nodes without injury to the pancreas. This retrospective study assessed the efficacy of T-shaped gauze (TSG) in retracting the pancreas during supra-pancreatic lymph node dissection.\n\n\nMETHODS\nThe study cohort consisted of 80 patients who underwent LG for gastric cancer. Of these, 44 patients underwent pancreatic retraction with TSG (TSG group) and 36 without TSG (non-TSG group). The efficacy of TSG for pancreatic retraction was evaluated by comparing all grade and Clavien-Dindo grade ≥ III postoperative pancreatic fistula (POPF) and the total number of dissected supra-pancreatic lymph nodes in the TSG and non-TSG groups.\n\n\nRESULTS\nThe rates of all grade (6.8% vs. 11%) and of Clavien-Dindo grade ≥ III (2.2% vs. 5.5%) POPF were lower in the TSG than in the non-TSG group. The total number of supra-pancreatic lymph nodes harvested by Dissection 1+ (D1+) lymph node dissection was significantly higher in TSG than in non-TSG patients (P = 0.0078).\n\n\nCONCLUSION\nTSG may be useful for safe and efficient performance of supra-pancreatic lymph node dissection.","cites":"0","conferencePercentile":"46.875"},{"venue":"Yonago acta medica","id":"96b5eb7798248fb8403d1f0cb41805796ae5e03c","venue_1":"Yonago acta medica","year":"2016","title":"Preconditioning by Low Dose LPS Prevents Subsequent LPS-Induced Severe Liver Injury via Nrf2 Activation in Mice","authors":"Masato Nakasone, Kazuhiro Nakaso, Yosuke Horikoshi, Takehiko Hanaki, Yoshinori Kitagawa, Toru Takahashi, Yoshimi Inagaki, Tatsuya Matsura","author_ids":"4647121, 4517779, 2258824, 6625365, 7146880, 2288937, 3676994, 6947095","abstract":"BACKGROUND\nSepsis is a syndrome triggered by endotoxin lipopolysaccharide (LPS) during bacterial infection. Sepsis sometimes recurs, with the second sepsis giving rise to a different phenotype because of disease modification by the preceding sepsis. Such a protective modification is called a preconditioning (PC) effect. PC is an endogenous protective mechanism by which sublethal damage confers tolerance to a subsequent lethal load. Oxidative stress is one of the important pathogenetic mechanisms that occur in sepsis. The nuclear factor erythroid 2 (NF-E2)-related factor-2 (Nrf2) system is a key regulatory transcription factor that protects organs and cells against oxidative stress and may be associated with the PC effect in repeated sepsis.\n\n\nMETHODS\nThe effect of PC induced by low-dose LPS on survival rate and liver injury against subsequent high-dose LPS stimulation was examined using a mouse model of sepsis. In order to understand the detailed mechanism(s) involved in the PC effect within the liver, gene expression array was performed. As a candidate mechanism of PC, the activation of the Nrf2 system was analyzed using Nrf2 reporter mice. Furthermore, the induction of heme oxygenase-1 (HO-1), one of the main targets of Nrf2, in the liver was examined by immunoblotting and immunohistochemistry. The PC effect on liver injury induced by LPS was further examined using Nrf2-deficient mice.\n\n\nRESULTS\nPC by LPS (1.7 or 5.0 mg/kg body weight, intraperitoneally) increased the survival rate of mice and decreased liver injury in response to a subsequent injection of a lethal level of LPS (20 mg/kg body weight). DNA array revealed that the gene ontology term \"antioxidant activity\" as one of the candidate mechanisms of the PC effect by LPS. In Nrf2 reporter mice, PC immediately and intensely enhanced luminescence that indicated Nrf2 activation after subsequent LPS injection. The induction of HO-1 by LPS was also enhanced by preceding PC, and its induction was observed mainly in Kupffer cells of the liver. In Nrf2-deficient mice, the induction of HO-1 in Kupffer cells and the hepatoprotective effect of PC were decreased as compared with wild-type mice.\n\n\nCONCLUSION\nOur results suggest that activation of the Nrf2 system is, at least in part, one of the mechanisms of a PC effect in the mouse liver in the case of repeated LPS stimulation.","cites":"0","conferencePercentile":"46.875"}]}