{"Yonsei_medical_journal.csv":[{"venue":"Yonsei medical journal","id":"c91857ac4114403d0f17fe239e7fd94fc9b45555","venue_1":"Yonsei medical journal","year":"2016","title":"Long-Term Outcome and Surveillance Colonoscopy after Successful Endoscopic Treatment of Large Sessile Colorectal Polyps","authors":"Bun Kim, A Ra Choi, Soo Jung Park, Jae Hee Cheon, Tae Il Kim, Won Ho Kim, Sung Pil Hong","author_ids":"5675809, 2064722, 8652244, 7446117, 8249000, 7891226, 4643447","abstract":"PURPOSE\nAlthough there is a consensus about the need for surveillance colonoscopy after endoscopic resection, the interval remains controversial for large sessile colorectal polyps. The aim of this study was to evaluate the long-term outcome and the adequate surveillance colonoscopy interval required for sessile and flat colorectal polyps larger than 20 mm.\n\n\nMATERIALS AND METHODS\nA total of 204 patients with large sessile and flat polyps who received endoscopic treatment from May 2005 to November 2011 in a tertiary referral center were included.\n\n\nRESULTS\nThe mean age was 65.1 years and 62.7% of the patients were male. The mean follow-up duration was 44.2 months and the median tumor size was 25 mm. One hundred and ten patients (53.9%) received a short interval surveillance colonoscopy (median interval of 6.3 months with range of 1-11 months) and 94 patients (46.1%) received a long interval surveillance colonoscopy (median interval of 13.6 months with range of 12-66 months). There were 14 patients (6.9%) who had local recurrence at the surveillance colonoscopy. Using multivariate regression analysis, a polyp size greater than 40 mm was shown to be independent risk factor for local recurrence. However, piecemeal resection and surveillance colonoscopy interval did not significantly influence local recurrence.\n\n\nCONCLUSION\nEndoscopic treatment of large sessile colorectal polyps shows a favorable long-term outcome. Further prospective study is mandatory to define an adequate interval of surveillance colonoscopy.","cites":"0","conferencePercentile":"45.07389163"},{"venue":"Yonsei medical journal","id":"1a35d97c18edb19d1ac0c40fbc620353b908a878","venue_1":"Yonsei medical journal","year":"2016","title":"Efficacy and Safety of Infliximab Therapy and Predictors of Response in Korean Patients with Crohn's Disease: A Nationwide, Multicenter Study","authors":"Chang Hwan Choi, In Do Song, Young-Ho Kim, Ja Seol Koo, You Sun Kim, Joo Sung Kim, Nayoung Kim, Eun Soo Kim, Jae Hak Kim, Ji Won Kim, Tae Oh Kim, Hyun Soo Kim, Hyo Jong Kim, Young Sook Park, Dong Il Park, Soo Jung Park, Hyun Joo Song, Sung Jae Shin, Suk-Kyun Yang, Byong Duk Ye, Kang-Moon Lee, Bo In Lee, Sun-Young Lee, Chang Kyun Lee, Jong Pil Im, Byung Ik Jang, Tae Joo Jeon, Yu Kyung Cho, Sae Kyung Chang, Seong Ran Jeon, Sung-Ae Jung, Yoon Tae Jeen, Jae Myung Cha, Dong Soo Han, Won Ho Kim","author_ids":"8736763, 7507963, 8639589, 4039853, 7653005, 1756491, 5067456, 1692721, 8656023, 3429745, 1917138, 2826621, 6442812, 6336727, 2390160, 8652244, 4124120, 3878730, 4041368, 3699884, 6713567, 4448202, 5710612, 5640155, 5265450, 5898033, 4686461, 7238030, 4365261, 5667023, 6669495, 7781886, 6799761, 4183106, 7891226","abstract":"PURPOSE\nInfliximab is currently used for the treatment of active Crohn's disease (CD). We aimed to assess the efficacy and safety of infliximab therapy and to determine the predictors of response in Korean patients with CD.\n\n\nMATERIALS AND METHODS\nA total of 317 patients who received at least one infliximab infusion for active luminal CD (n=198) and fistulizing CD (n=86) or both (n=33) were reviewed retrospectively in 29 Korean referral centers. Clinical outcomes of induction and maintenance therapy with infliximab, predictors of response, and adverse events were evaluated.\n\n\nRESULTS\nIn patients with luminal CD, the rates of clinical response and remission at week 14 were 89.2% and 60.0%, respectively. Male gender and isolated colonic disease were associated with higher remission rates at week 14. In week-14 responders, the probabilities of sustained response and remission were 96.2% and 93.3% at week 30 and 88.0% and 77.0% at week 54, respectively. In patients with fistulizing CD, clinical response and remission were observed in 85.0% and 56.2% of patients, respectively, at week 14. In week-14 responders, the probabilities of sustained response and remission were 94.0% and 97.1%, respectively, at both week 30 and week 54. Thirty-nine patients (12.3%) experienced adverse events related to infliximab. Serious adverse events developed in 19 (6.0%) patients including seven cases of active pulmonary tuberculosis.\n\n\nCONCLUSION\nInfliximab induction and maintenance therapy are effective and well tolerable in Korean patients with luminal and fistulizing CD. However, clinicians must be aware of the risk of rare yet critical adverse events.","cites":"0","conferencePercentile":"45.07389163"},{"venue":"Yonsei medical journal","id":"32480d631a8b32f8df1df6334bd9452c1dcb6a8c","venue_1":"Yonsei medical journal","year":"2007","title":"The Value of Routinely Culturing for Tuberculosis During Bronchoscopies in an Intermediate Tuberculosis-Burden Country","authors":"Myung Hoon Kim, Gee Young Suh, Man Pyo Chung, Hojoong Kim, O Jung Kwon, Jang Ho Lee, Nam Yong Lee, Won-Jung Koh","author_ids":"4608525, 7331578, 4983337, 6148702, 2420951, 8153266, 3300806, 5602681","abstract":"PURPOSE\nMany medical centers routinely culture bronchoscopy samples for Mycobacterium tuberculosis, even when tuberculosis is not strongly suspected. The value of this practice, however, is controversial. We evaluated the role of that procedure in the diagnosis of pulmonary tuberculosis in an intermediate tuberculosis-burden country.\n\n\nPATIENTS AND METHODS\nA prospective, observational study was conducted in a tertiary referral center and included 733 consecutive patients who underwent bronchoscopy examination.\n\n\nRESULTS\nM. tuberculosis was isolated in 47 patients (6.4%). According to radiographic features, the rate of positive culture for M. tuberculosis was relatively high in patients with atelectasis (5/33, 15.2%) and those with pulmonary infiltrations of suspicious infections (26/183, 14.2%). M. tuberculosis was isolated even in patients with pulmonary masses (9/266, 3.4%) and those with pulmonary nodules (5/175, 2.9%). In 16/47 (34.0%) patients with positive cultures for M. tuberculosis, active pulmonary tuberculosis was not suspected at the time of bronchoscopy.\n\n\nCONCLUSION\nThese results suggest that routinely culturing for M. tuberculosis during bronchoscopy is still useful in the diagnosis of pulmonary tuberculosis in an intermediate tuberculosis-burden country.","cites":"2","conferencePercentile":"69.18238994"},{"venue":"Yonsei medical journal","id":"e16378418d3af8b53ec19913bc4e16f2211ccb52","venue_1":"Yonsei medical journal","year":"2016","title":"Clinical Prognostic Factors in 86 Chinese Patients with Primary Myelodysplastic Syndromes and Trisomy 8: A Single Institution Experience","authors":"Qing-Fang Yue, Lei Chen, Xiao-Mei She, Bin Hu, Yu Hu, Ping Zou, Xin-Yue Liu","author_ids":"7568195, 1690673, 3814097, 1702845, 1752415, 7880529, 8015987","abstract":"PURPOSE\nThe objective was to determine the characteristics and prognostic factors of 86 Chinese patients with trisomy 8 aberrations and compare the prognostic value of International Prognostic System (IPSS) and Revised IPSS (IPSS-R) in this cohort.\n\n\nMATERIALS AND METHODS\nA total of 86 cases diagnosed with primary myelodysplastic syndromes (MDS) with isolated tr8 or with tr8 and other additional cytogenetic aberrations diagnosed and treated at the Union Hospital, Tongji Medical College of Huazhong University of Science and Technology between July 2002 and March 2013 were reviewed.\n\n\nRESULTS\nThe median survival of the entire group was 23.0 months, and acute myeloid leukemia (AML) developed in 43% (37/86) patients within the follow up time. The univariate analysis revealed that overall survival (OS) was correlated with age, thrombocytopenia, absolute neutrophil count, marrow blasts, cytogenetic status and red blood cell transfusion at diagnosis, and the multivariate analysis revealed that age, marrow blasts, cytogenetic status and transfusion dependence were independent parameters for the OS. The cytogenetic complexity and marrow blasts had the strongest impact on the AML transformation by multivariate analysis. Comparing the two prognostic systems, both two systems could successfully discriminate risk groups for survival. IPSS-R was more refined than IPSS for predicting OS, but had no advantage in predicting the risk of AML development.\n\n\nCONCLUSION\nThis study confirmed the influence of clinical factors on the prognosis of 86 Chinese MDS patients with trisomy 8. In addition, IPSS-R can further refine prognostic discrimination in the IPSS risk categories.","cites":"0","conferencePercentile":"45.07389163"},{"venue":"Yonsei medical journal","id":"cc544265e5057fbab2a48362548dc4104b08a6f6","venue_1":"Yonsei medical journal","year":"2012","title":"A Modified Extraction Method of Circulating Free DNA for Epidermal Growth Factor Receptor Mutation Analysis","authors":"Haihua Yuan, Zhong-Zheng Zhu, Yachao Lu, Feng Liu, Wenying Zhang, Gang Huang, Guanshan Zhu, Bin Jiang","author_ids":"6354769, 8129617, 1710206, 1734409, 8711079, 3234839, 5859751, 1718125","abstract":"PURPOSE\nCirculating free DNA (cfDNA) in plasma is promising to be a surrogate for tumor tissue DNA. However, not all epidermal growth factor receptor (EGFR) mutations in tumor tissue DNA has been detected in matched cfDNA, at least partly due to inefficient cfDNA extraction method. The purpose of this study was to establish an efficient plasma cfDNA extraction protocol.\n\n\nMATERIALS AND METHODS\nThe yield of plasma cfDNA extracted by our modified phenol-chloroform (MPC) method from non-small-cell lung cancer (NSCLC) patients was compared with that by QIAamp MinElute Virus Spin kit (Qiagen kit) as control, using the Wilcoxon rank-sum test. TaqMan quantitative polymerase chain reaction (qPCR) assays were used to quantify the plasma cfDNA extracted. Both Mutant-enriched PCR (ME-PCR) coupled sequencing and DxS EGFR mutation test kit were used to evaluate the impact of extraction method on EGFR mutation analysis.\n\n\nRESULTS\nMPC method extracted more plasma cfDNA than Qiagen kit method (p=0.011). The proportion of longer fragment (≥ 202 bp) in cfDNA extracted by MPC method was significantly higher than by Qiagen kit method (p=0.002). In the sequencing maps of ME-PCR products, a higher mutant peak was observed on plasma cfDNA extracted by MPC method than by Qiagen kit method. In DxS EGFR mutation test kit results, plasma cfDNA extracted by MPC method contained more tumor-origin DNA than by Qiagen kit method.\n\n\nCONCLUSION\nAn improved plasma cfDNA extraction method of MPC is provided, which will be beneficial for EGFR mutation analysis for patients with NSCLC.","cites":"1","conferencePercentile":"50"},{"venue":"Yonsei medical journal","id":"39552416d312d08d346c7126ca6a7e124c745e73","venue_1":"Yonsei medical journal","year":"2011","title":"Parameters Measuring Beta-Cell Function Are Only Valuable in Diabetic Subjects with Low Body Mass Index, High Blood Glucose Level, or Long-Standing Diabetes","authors":"Seung Won Lee, Sangheun Lee, Se Hwa Kim, Tae Ho Kim, Byung Soo Kang, Seung Hoon Yoo, Min Kyung Lee, Won Jun Koh, Won Sik Kang, Hyeong Jin Kim","author_ids":"8568389, 8569806, 5110631, 1932607, 4546340, 7291770, 1774842, 7938788, 4799441, 2874444","abstract":"PURPOSE\nThe aim of this study was to identify the most precise and clinically practicable parameters that predict future oral hypoglycemic agent (OHA) failure in patients with type 2 diabetes, and to determine whether these parameters are valuable in various subgroups.\n\n\nMATERIALS AND METHODS\nWe took fasting blood samples from 231 patients for laboratory data and standard breakfast tests for evaluation of pancreatic beta-cell function. Hemoglobin A1c (HbA1c) levels were tested, and we collected data related to hypoglycemic medications one year from the start date of the study.\n\n\nRESULTS\nFasting C-peptide, postprandial insulin and C-peptide, the difference between fasting and postprandial insulin, fasting beta-cell responsiveness (M0), postprandial beta-cell responsiveness (M1), and homeostasis model assessment-beta (HOMA-B) levels were significantly higher in those with OHA response than in those with OHA failure. The area under the curve (AUC) of the receiver operating characteristic (ROC) measured with postprandial C-peptide to predict future OHA failure was 0.720, and the predictive power for future OHA failure was the highest of the variable parameters. Fasting and postprandial C-peptide, M0, and M1 levels were the only differences between those with OHA response and those with OHA failure among diabetic subjects with low body mass index, high blood glucose level, or long-standing diabetes.\n\n\nCONCLUSION\nIn conclusion, postprandial C-peptide was most useful in predicting future OHA failure in type 2 diabetic subjects. However, these parameters measuring beta-cell function are only valuable in diabetic subjects with low body mass index, high blood glucose level, or long-standing diabetes.","cites":"1","conferencePercentile":"41.82389937"},{"venue":"Yonsei medical journal","id":"16b2c274474082705cac8ba1efaf5b49821b9182","venue_1":"Yonsei medical journal","year":"2014","title":"Long-Term Survival Analysis of Korean Breast Cancer Patients at a Single Center: Improving Outcome Over Time","authors":"Sung Gwe Ahn, Hak Min Lee, Seung Ah Lee, Joon Jeong, Hy-De Lee","author_ids":"1815656, 8385431, 2599552, 4190132, 5332355","abstract":"PURPOSE\nThe prognosis of breast cancer has been consistently improving. We analyzed our cohort of breast cancer patients with a long-term follow up at a single center over time.\n\n\nMATERIALS AND METHODS\nA total of 1889 patients with known cancer stages were recruited and analyzed between January 1991 and December 2005. Patients were classified according to the time periods (1991-1995; 1996-2000; 2001-2005). To determine intrinsic subtypes, 858 patients whose human epidermal growth receptor-2 status and Ki67 were reported between April 2004 and December 2008 were also analyzed.\n\n\nRESULTS\nAt a median follow up of 9.1 years, the 10-year overall survival (OS) rate was 80.5% for the entire cohort. On multivariate analysis for OS and recurrence-free survival (RFS), the time period was demonstrated to be a significant factor independent of conventional prognostic markers. In the survival analysis performed for each stage (I to III), OS and RFS significantly improved according to the time periods. Adoption of new agents in adjuvant chemotherapy and endocrine therapy was increased according to the elapsed time. In the patients with known subtypes, OS and RFS significantly differed among the subtypes, and the triple-negative subtype showed the worst outcome in stages II and III.\n\n\nCONCLUSION\nIn the Korean breast cancer cohort with a long-term follow up, our data show an improved prognosis over the past decades, and harbor the contribution of advances in adjuvant treatment. Moreover, we provided new insight regarding comparison of the prognostic impact between the tumor burden and subtypes.","cites":"1","conferencePercentile":"58.78661088"},{"venue":"Yonsei medical journal","id":"43f64f96dc0ebbf26e4fe6412d74072d88f480ca","venue_1":"Yonsei medical journal","year":"2014","title":"Does Liver Resection Provide Long-Term Survival Benefits for Breast Cancer Patients with Liver Metastasis? A Single Hospital Experience","authors":"Jee Ye Kim, Joon Seong Park, Seung Ah Lee, Jae Keun Kim, Joon Jeong, Dong Sup Yoon, Hy-De Lee","author_ids":"6624942, 3796417, 2599552, 2160799, 4190132, 3303207, 5332355","abstract":"PURPOSE\nLiver resection with colorectal liver metastasis widely accepted and has been considered safe and effective therapeutic option. However, the role of liver resection in breast cancer with liver metastasis is still controversial. Therefore, we reviewed the outcome of liver resection in breast cancer patients with liver metastases in a single hospital experiences.\n\n\nMATERIALS AND METHODS\nBetween January 1991 and December 2006, 2176 patients underwent breast cancer surgery in Gangnam Severance Hospital. Among these patients, 110 cases of liver metastases were observed during follow-up and 13 of these patients received liver resection with potential feasibility to achieve an R0 resection.\n\n\nRESULTS\nThe median time interval between initial breast cancer and detection of liver metastasis was 62.5 months (range, 13-121 months). The 1-year and 3-year overall survival rates of the 13 patients with liver resection were 83.1% and 49.2%, respectively. The 1-year and 3-year overall survival rates of patients without extrahepatic metastasis were 83.3% and 66.7% and those of patients with extrahepatic metastasis were 80.0% and 0.0%, respectively (p=0.001).\n\n\nCONCLUSION\nLiver resection for metastatic breast cancer results in improved patient survival, particularly in patients with solitary liver metastasis and good general condition.","cites":"3","conferencePercentile":"92.05020921"},{"venue":"Yonsei medical journal","id":"8733a13d21ddffa2f44dd75546f036b3fe92bd91","venue_1":"Yonsei medical journal","year":"2009","title":"Characteristics of Glottic Closure Reflex in a Canine Model","authors":"Young-Ho Kim, Ju Wan Kang, Kwang-Moon Kim","author_ids":"8639589, 4330373, 4184258","abstract":"PURPOSE\nThe most important function of the larynx is airway protection which is provided through a polysynaptic reflex closure triggered by the receptors in the glottic and supraglottic mucosa, evoking the reflex contraction of the laryngeal muscles especially by strong adduction of vocal cords. Based on the hypotheses that central facilitation is essential for this bilateral adductor reflex and that its disturbance can result in weakened laryngeal closure, we designed this study to elucidate the effect of central facilitation on this protective reflex.\n\n\nMATERIALS AND METHODS\nSeven adult, 20 kg mongrel dogs underwent evoked response laryngeal electromyography under 0.5 to 1.0 MAC (minimum alveolar concentration) isoflurane anesthesia. The internal branch of the superior laryngeal nerve was stimulated through bipolar platinum-iridium electrodes, and recording electrodes were positioned in the ipsilateral and contralateral thyroarytenoid muscles.\n\n\nRESULTS\nIpsilateral reflex closure was consistently recorded regardless of anesthetic levels. However, contralateral reflex responses disappeared as anesthetic levels were deepened. Additionally, late responses (R2) were detected in one animal at lower level of anesthesia.\n\n\nCONCLUSIONS\nDeepened level of anesthesia affects central facilitation and results in the loss of the crossed adductor reflex, predisposing to a weakened glottic closure response. Precise understanding of this effect may possibly provide a way to prevent aspiration in unconscious patients.","cites":"0","conferencePercentile":"16.55172414"},{"venue":"Yonsei medical journal","id":"52fb2bd74f6efd293296000707502a4a76f1fd6a","venue_1":"Yonsei medical journal","year":"2016","title":"Antibody to FcεRIα Suppresses Immunoglobulin E Binding to High-Affinity Receptor I in Allergic Inflammation","authors":"Jung Yeon Hong, Jong-Hwan Bae, Kyung Eun Lee, Mina Kim, Min Hee Kim, Hyun Jung Kang, Eun Hye Park, Kyung Sook Yoo, Se Kyoo Jeong, Kyung Won Kim, Kyu-Earn Kim, Myung Hyun Sohn","author_ids":"4850030, 7237316, 3192736, 2613415, 7591291, 2566043, 2168997, 8236109, 5416481, 7826267, 7825991, 3723591","abstract":"PURPOSE\nHigh-affinity receptor I (FcεRI) on mast cells and basophils plays a key role in the immunoglobulin E (IgE)-mediated type I hypersensitivity mediated by allergen cross-linking of the specific IgE-FcεRI complex. Thus, prevention of IgE binding to FcεRI on these cells is an effective therapy for allergic disease. We have developed a strategy to disrupt IgE binding to FcεRI using an antibody targeting FcεRIα.\n\n\nMATERIALS AND METHODS\nFab fragment antibodies, which lack the Fc domain, with high affinity and specificity for FcεRIα and effective inhibitory activity against IgE-FcεRI binding were screened. IgE-induced histamine, β-hexosaminidase and Ca²⁺ release in basophils were determined by ELISA. A B6.Cg-Fcer1a(tm1Knt) Tg(FCER1A)1Bhk/J mouse model of passive cutaneous anaphylaxis (PCA) was used to examine the inhibitory effect of NPB311 on allergic skin inflammation.\n\n\nRESULTS\nNPB311 exhibited high affinity to human FcεRIα (KD=4 nM) and inhibited histamine, β-hexosaminidase and Ca²⁺ release in a concentration-dependent manner in hFcεRI-expressing cells. In hFcεRIα-expressing mice, dye leakage was higher in the PCA group than in controls, but decreased after NPB311 treatment. NPB311 could form a complex with FcεRIα and inhibit the release of inflammation mediators.\n\n\nCONCLUSION\nOur approach for producing anti-FcεRIα Fab fragment antibody NPB311 may enable clinical application to a therapeutic pathway in IgE/FcεRI-mediated diseases.","cites":"0","conferencePercentile":"45.07389163"},{"venue":"Yonsei medical journal","id":"3e0edfdd23ced65db19c36cad4da2ebe79b4d071","venue_1":"Yonsei medical journal","year":"2014","title":"Surgical Outcomes of Robotic Radical Hysterectomy Using Three Robotic Arms versus Conventional Multiport Laparoscopy in Patients with Cervical Cancer","authors":"Ga Won Yim, Sang Wun Kim, Eun Ji Nam, Sunghoon Kim, Hee Jung Kim, Young Tae Kim","author_ids":"7188550, 8364531, 7700729, 6810135, 2206211, 2800946","abstract":"PURPOSE\nTo compare surgical outcomes of robotic radical hysterectomy (RRH) using 3 robotic arms with those of conventional laparoscopy in patients with early cervical cancer.\n\n\nMATERIALS AND METHODS\nA retrospective cohort study included 102 patients with stage 1A1-IIA2 cervical carcinoma, of whom 60 underwent robotic and 42 underwent laparoscopic radical hysterectomy (LRH) with pelvic lymph node dissection performed between December 2009 and May 2013. Perioperative outcomes were compared between two surgical groups.\n\n\nRESULTS\nRobotic approach consisted of 3 robotic arms including the camera arm and 1 conventional assistant port. Laparoscopic approach consisted of four trocar insertions with conventional instruments. There were no conversions to laparotomy. Mean age, body mass index, tumor size, cell type, and clinical stage were not significantly different between two cohorts. RRH showed favorable outcomes over LRH in terms of estimated blood loss (100 mL vs. 145 mL, p=0.037), early postoperative complication rates (16.7% vs. 30.9%, p=0.028), and postoperative complications necessitating intervention by Clavien-Dindo classification. Total operative time (200.5±61.1 minutes vs. 215.6±83.1 minutes, p=0.319), mean number of lymph node yield (23.3±9.3 vs. 21.7±9.8, p=0.248), and median length of postoperative hospital stay (11 days vs. 10 days, p=0.129) were comparable between robotic and laparoscopic group, respectively. The median follow-up time was 44 months with 2 recurrences in the robotic and 3 in the laparoscopic cohort.\n\n\nCONCLUSION\nSurgical outcomes of RRH and pelvic lymphadenectomy were comparable to that of laparoscopic approach, with significantly less blood loss and early postoperative complications.","cites":"0","conferencePercentile":"22.17573222"},{"venue":"Yonsei medical journal","id":"0b6e81c8344c7c8eddc57070757a2b97fe4d1f4c","venue_1":"Yonsei medical journal","year":"2015","title":"Insulin Resistance Is an Important Risk Factor for Cognitive Impairment in Elderly Patients with Primary Hypertension","authors":"Lina Ma, Ming Feng, Yuying Qian, Wei Yang, Jia Liu, Rui Han, Hong Zhu, Yun Li","author_ids":"1689473, 2169097, 6754158, 1742383, 7136836, 1788779, 6869596, 1724845","abstract":"PURPOSE\nInsulin resistance plays a role in the development of dementia and hypertension. We investigated a possible relationship between cognitive impairment and insulin resistance in elderly Chinese patients with primary hypertension.\n\n\nMATERIALS AND METHODS\nOne hundred and thirty-two hypertensive elderly patients (>60 years) were enrolled in this study, and assigned into either the cognitive impairment group (n=61) or the normal cognitive group (n=71). Gender, age, education, body mass index (BMI), waist hip ratio (WHR), total cholesterol (TC), triglyceride (TG), C-reactive protein (CRP), high density lipoprotein cholesterol (HDL-C), low density lipoprotein cholesterol (LDL-C), creatinine (Cr), fasting plasma glucose (FPG), fasting insulin (FINS), homeostasis model of assessment for insulin resistance index (HOMA-IR), systolic blood pressure, diastolic blood pressure, smoking history, atherosclerosis and the proportion of uncontrolled hypertension were compared between the two groups. Multi-factorial logistic regression analysis was performed.\n\n\nRESULTS\nNo significant differences were found in gender, age, TC, CRP, HDL-C, LDL-C, Cr, BP, smoking history, atherosclerosis and the proportion of uncontrolled hypertension between the two groups. The cognitive impairment group had lower education levels, and higher BMI, WHR, TG, FPG, FINS, and HOMA-IR levels than the control group. Logistic regression analysis revealed the levels of education, BMI, WHR, and HOMA-IR as independent factors that predict cognitive impairment in patients.\n\n\nCONCLUSION\nOur study demonstrates that poor education and increased BMI, WHR, and HOMA-IR are independent risk factors for cognitive impairment in elderly patients with hypertension. Insulin resistance plays an important role in the development of cognitive impairment in primary elderly hypertensive patients.","cites":"1","conferencePercentile":"75.86956522"},{"venue":"Yonsei medical journal","id":"0214bc2aa4b8cf1ad6de0452087882340ae98770","venue_1":"Yonsei medical journal","year":"2005","title":"Aberrant Cell Cycle Regulation in Cervical Carcinoma","authors":"Young Tae Kim, Min Zhao","author_ids":"2800946, 3069559","abstract":"Carcinoma of the uterine cervix is one of the most common malignancies among women worldwide. Human papillomaviruses (HPV) have been identified as the major etiological factor in cervical carcinogenesis. However, the time lag between HPV infection and the diagnosis of cancer indicates that multiple steps, as well as multiple factors, may be necessary for the development of cervical cancer. The development and progression of cervical carcinoma have been shown to be dependent on various genetic and epigenetic events, especially alterations in the cell cycle checkpoint machinery. In mammalian cells, control of the cell cycle is regulated by the activity of cyclin-dependent kinases (CDKs) and their essential activating coenzymes, the cyclins. Generally, CDKs, cyclins, and CDK inhibitors function within several pathways, including the p16(INK4A)-cyclin D1-CDK4/6-pRb-E2F, p21(WAF1)- p27(KIP1)-cyclinE-CDK2, and p14(ARF)-MDM2-p53 pathways. The results from several studies showed aberrant regulation of several cell cycle proteins, such as cyclin D, cyclin E, p16(INK4A), p21(WAF1), and p27(KIP1), as characteristic features of HPV- infected and HPV E6/E7 oncogene-expressing cervical carcinomas and their precursors. These data suggested further that interactions of viral proteins with host cellular proteins, particularly cell cycle proteins, are involved in the activation or repression of cell cycle progression in cervical carcinogenesis.","cites":"9","conferencePercentile":"95.11278195"},{"venue":"Yonsei medical journal","id":"e1aa5e1187ad627a73d919be51704a3a76066a2a","venue_1":"Yonsei medical journal","year":"2015","title":"Chemokine Signaling Pathway Involved in CCL2 Expression in Patients with Rheumatoid Arthritis","authors":"Lin Zhang, Min Yu, Jiayin Deng, Xing Lv, Jun Liu, Yu Xiao, Wenjie Yang, Yuru Zhang, Changyi Li","author_ids":"1708615, 1756727, 6008071, 3298675, 1843598, 4291334, 6036220, 6027208, 2224816","abstract":"PURPOSE\nRheumatoid arthritis (RA) is an inflammatory joint disorder, the progression of which leads to the destruction of cartilage and bone. Chemokines are involved in RA pathogenesis. In this study, we investigated the chemokine signaling pathway associated with CCL2 in peripheral blood (PB) and synovial tissues (ST) of RA patients based on our previous work about chemokine signaling pathway involved in the activation of CCL2 production in collagen-induced arthritis rat ST.\n\n\nMATERIALS AND METHODS\nTotal RNA was isolated from PB leukocytes and synovium of the knee joint in both RA patients and control populations. Real-time polymerase chain reaction was used to determine CCL4, CCR5, c-Jun, c-Fos, and CCL2 expressions. Serum level of CCL2 was assessed by enzyme-linked immunosorbent assay, and the production of CCL2 in ST was analyzed immunohistochemically.\n\n\nRESULTS\nThe expressions of CCL4, CCR5, c-Jun, c-Fos, and CCL2 messenger RNA in RA patients were significantly higher than those in healthy controls, both in ST and on PB leukocyte. Serum CCL2 levels were elevated in RA patients. Histological examination of rheumatoid joints revealed extensive CCL2 expression in RA ST.\n\n\nCONCLUSION\nCCL2, CCL4, c-Jun, c-Fos, and CCR5 may play an important role in the recruitment of PB leukocytes into the RA joints. These data provide evidence that the chemokine signaling pathway is involved in CCL2 expression in RA patient tissues, which may contribute to chronic inflammation associated with RA. Targeting this signaling pathway may provide a novel therapeutic avenue in RA.","cites":"1","conferencePercentile":"75.86956522"},{"venue":"Yonsei medical journal","id":"8a7281aa82472e71c2d37bb5581e13683b201f30","venue_1":"Yonsei medical journal","year":"2005","title":"Clinical Usefulness of Cervicogram as a Primary Screening Test for Cervical Neoplasia","authors":"Young Tae Kim, Jae Wook Kim, Sung Hoon Kim, Yu Ri Kim, Jae Hoon Kim, Bo Sung Yoon, Yong Won Park","author_ids":"2800946, 1785915, 4338379, 7652945, 2652149, 4173435, 2317244","abstract":"The purpose of this study is to evaluate the clinical usefulness of the cervicogram as a primary screening test for cervical neoplasia. A total of 294 women who had undergone a cervicogram and a Pap test between January and July 2003, were selected. The diagnostic accuracy of the Pap test, cervicogram, and the Pap test combined with a cervicogram were compared with the histopathologic diagnosis. Among 294 women, the Pap test was negative in 130 cases and positive in 164 cases. Among patients with positive Pap test, cervicogram were negative in 101 cases (61.6%) and positive in 63 cases (38.4%). The diagnostic accuracy between cervicogram with positive Pap test and histology was as follows; sensitivity 44.9%, specificity 78.3%, positive predictive value 84.1%, negative predictive value 32.7%, false positive rate 15.9%, and false negative rate 67.3%. Although the adjunctive use of cervicogram with the Pap test in the initial screening of cervical neoplasia showed a higher specificity and higher positive predictive value compared to the Pap test alone, consideration in terms of lower sensitivity, lower positive predictive value, higher false positive rate and cost-effectiveness should be given in lieu of clinically applying cervicogram with the pap test as an initial screening test.","cites":"0","conferencePercentile":"16.16541353"},{"venue":"Yonsei medical journal","id":"522bbc7a56f5190f47a13271e923fdffd08e1fa9","venue_1":"Yonsei medical journal","year":"2015","title":"Noninfectious Complications of Peritoneal Dialysis in Korean Children: A 26-Year Single-Center Study","authors":"Ji Eun Kim, Se Jin Park, Ji Young Oh, Ji Hong Kim, Jae Seung Lee, Pyung Kil Kim, Jae Il Shin","author_ids":"1763923, 2387342, 5915742, 7951434, 5391932, 2531777, 8247810","abstract":"PURPOSE\nThe aim of this study was to investigate noninfectious complications of peritoneal dialysis (PD), including mechanical and metabolic complications, at a single center in Korea.\n\n\nMATERIALS AND METHODS\nWe analyzed data from 60 PD patients aged ≤18 years (40 boys and 20 girls) during the period between 1986 and 2012. The collected data included gender, age, causes of PD, incidence of noninfectious complications, and treatment for the complications.\n\n\nRESULTS\nThe mean duration of PD therapy was 28.7±42.1 months (range 1-240 months). The most common cause of end-stage renal disease was glomerular disease (43.3%). There were no statistically significant differences between patients with and without mechanical complications regarding gender, age at the start of PD, and total duration of PD. Outflow failure was the most common catheter-related complication (14.3%), followed by leakage (10.0%) and hernia (8.6%). Metabolic complications, such as hyperglycemia and hypokalemia, were observed in three of 16 patients. The frequency of noninfectious complications of PD in our study was comparable with those in previous pediatric studies. PD was switched to hemodialysis (HD) in only three patients.\n\n\nCONCLUSION\nOur results indicate that noninfectious complications of PD are common, though they hardly lead to catheter removal or HD in pediatric patients on PD.","cites":"2","conferencePercentile":"93.69565217"},{"venue":"Yonsei medical journal","id":"fda20eb1098f106f32ef88ce7140517dbb8422e1","venue_1":"Yonsei medical journal","year":"2016","title":"Anti-Proliferative and Apoptotic Activities of Müllerian Inhibiting Substance Combined with Calcitriol in Ovarian Cancer Cell Lines","authors":"Yeon Soo Jung, Hee Jung Kim, Seok Kyo Seo, Young Sik Choi, Eun Ji Nam, Sunghoon Kim, Sang Wun Kim, Hyuck Dong Han, Jae Wook Kim, Young Tae Kim","author_ids":"4848508, 2206211, 3826871, 3504376, 7700729, 6810135, 8364531, 1747885, 1785915, 2800946","abstract":"PURPOSE\nThis study aimed to investigate whether Müllerian inhibiting substance (MIS) in combination with calcitriol modulates proliferation and apoptosis of human ovarian cancer (OCa) cell lines (SKOV3, OVCAR3, and OVCA433) and identify the signaling pathway by which MIS mediates apoptosis.\n\n\nMATERIALS AND METHODS\nOCa cell lines were treated with MIS in the absence or presence of calcitriol. Cell viability and proliferation were evaluated using the Cell Counting Kit-8 assay and apoptosis was evaluated by DNA fragmentation assay. Western blot and enzyme-linked immunosorbent assay were used to determine the signaling pathway.\n\n\nRESULTS\nThe cells showed specific staining for the MIS type II receptor. Treatment of OCa cells with MIS and calcitriol led to dose- and time-dependent inhibition of cell growth and survival. The combination treatment significantly suppressed cell growth, down-regulated the expression of B-cell lymphoma 2 (Bcl-2), and up-regulated the expressions of Bcl-2 associated X protein, caspase-3, and caspase-9 through the extracellular signal-regulated kinase signaling pathway.\n\n\nCONCLUSION\nThese results, coupled with a much-needed decrease in the toxic side effects of currently employed therapeutic agents, provide a strong rationale for testing the therapeutic potential of MIS, alone or in combination with calcitriol, in the treatment of OCa.","cites":"0","conferencePercentile":"45.07389163"},{"venue":"Yonsei medical journal","id":"6ea6051651249d614cfe6a801de7a6d488cf53b8","venue_1":"Yonsei medical journal","year":"2015","title":"Effect of Subthalamic Deep Brain Stimulation on Levodopa-Induced Dyskinesia in Parkinson's Disease","authors":"Ji Hee Kim, Won Seok Chang, Hyun Ho Jung, Jin Woo Chang","author_ids":"2226300, 6125233, 5210971, 2359453","abstract":"PURPOSE\nTo evaluate the effect of bilateral subthalamic nucleus (STN) deep brain stimulation (DBS) on levodopa-induced peak-dose dyskinesia in patients with Parkinson's disease (PD).\n\n\nMATERIALS AND METHODS\nA retrospective review was conducted on patients who underwent STN DBS for PD from May 2000 to July 2012. Only patients with levodopa-induced dyskinesia prior to surgery and more than 1 year of available follow-up data after DBS were included. The outcome measures included the dyskinesia subscore of the Unified Parkinson's Disease Rating Scale (UPDRS) part IV (items 32 to 34 of UPDRS part IV) and the levodopa equivalent daily dose (LEDD). The patients were divided into two groups based on preoperative to postoperative LEDD change at 12 months after the surgery: Group 1, LEDD decrease >15%; Group 2, all other patients. Group 2 was further divided by the location of DBS leads.\n\n\nRESULTS\nOf the 100 patients enrolled, 67 were in Group 1, while those remaining were in Group 2. Twelve months after STN DBS, Groups 1 and 2 showed improvements of 61.90% and 57.14%, respectively, in the dyskinesia subscore. Group 1 was more likely to experience dyskinesia suppression; however, the association between the groups and dyskinesia suppression was not statistically significant (p=0.619). In Group 2, dyskinesia was significantly decreased by stimulation of the area above the STN in 18 patients compared to stimulation of the STN in 15 patients (p=0.048).\n\n\nCONCLUSION\nLevodopa-induced dyskinesia is attenuated by STN DBS without reducing the levodopa dosage.","cites":"1","conferencePercentile":"75.86956522"},{"venue":"Yonsei medical journal","id":"2769a1386afe75954538349591d80e921f7a6501","venue_1":"Yonsei medical journal","year":"2015","title":"Perioperative Complications of Robot-Assisted Laparoscopic Surgery Using Three Robotic Arms at a Single Institution","authors":"Ga Won Yim, Sang Wun Kim, Eun Ji Nam, Sunghoon Kim, Young Tae Kim","author_ids":"7188550, 8364531, 7700729, 6810135, 2800946","abstract":"PURPOSE\nThe aim of this study was to evaluate perioperative complications of robot-assisted laparoscopic surgery in gynecology.\n\n\nMATERIALS AND METHODS\nPatients who underwent elective robot-assisted laparoscopic surgery between February 2006 and December 2013 were identified. Robotic procedures were performed using the da Vinci robotic system. Patient demographic data and operative outcomes were prospectively collected in a computerized database and extracted for this study.\n\n\nRESULTS\nTwo hundred and ninety eight patients were identified during the study period. One case was converted to conventional laparoscopy due to mechanical failure of the robot system before the procedure and excluded from review. The median age and body mass index of patients were 48 years and 23.0 kg/m², respectively. The majority (n=130, 43.6%) of operative procedures was radical hysterectomy, followed by endometrial cancer staging (n=112, 37.6%), total hysterectomy (n=39, 13.1%), and myomectomy (n=17, 5.7%). The median operative time, estimated blood loss, and postoperative hospital stay were 208.5 min, 184.8 mL, and 8.9 days, respectively. The overall complication rate was 18.8% and that for only oncologic cases was 16.1%. Intraoperative complications (n=5, 1.7%) consisted of three vessel injuries, one bowel content leakage during an appendectomy during endometrial cancer staging and one case of bladder injury during radical hysterectomy. Early and late postoperative complications were 14.4% and 2.7%, respectively. Five patients (1.7%) experienced grade 3 complications according to Clavien-Dindo classification and therefore needed further intervention.\n\n\nCONCLUSION\nRobot-assisted laparoscopic surgery is a feasible approach in gynecology with acceptable complications.","cites":"2","conferencePercentile":"93.69565217"},{"venue":"Yonsei medical journal","id":"c6b0a115755142bf9c822752a22841fc3e349a9b","venue_1":"Yonsei medical journal","year":"2015","title":"Clinical Characteristics and Impact of Diabetes Mellitus on Outcomes in Patients with Nonvalvular Atrial Fibrillation","authors":"Bi Huang, Yanmin Yang, Jun Zhu, Yan Liang, Han Zhang, Li Tian, Xinghui Shao, Juan Wang","author_ids":"6666019, 7608322, 1748711, 1796524, 1723911, 1733354, 5649072, 1771075","abstract":"PURPOSE\nStudies have shown that diabetes mellitus (DM) is a risk factor for cardiovascular disease, including atrial fibrillation (AF); however, the clinical characteristics and prognostic impact of DM in patients with nonvalvular AF have not been well understood in China.\n\n\nMATERIALS AND METHODS\nIncluded were 1644 consecutive patients with nonvalvular AF. Endpoints included all-cause mortality, cardiovascular mortality, stroke, major bleeding, and combined endpoint events (CEE) during a 1-year follow-up.\n\n\nRESULTS\nThe prevalence of DM was 16.8% in nonvalvular AF patients. Compared with non-diabetic AF patients, diabetic AF patients were older and tended to coexist with other cardiovascular diseases. Most patients with DM (93.5%) were eligible for anticoagulation, as determined by CHADS2 scores. However, only 11.2% of patients received anticoagulation. During a 1-year follow-up, the all-cause mortality and CEE rate in the DM group were significantly higher than those of the non-DM group, while the incidence of stroke was comparable. After multivariate adjustments, DM was still an independent risk factor for 1-year all-cause mortality [hazard ratio (HR)=1.558; 95% confidence interval (CI) 1.126-2.156; p=0.007], cardiovascular mortality (HR=1.615; 95% CI 1.052-2.479; p=0.028), and CEE (HR=1.523; 95% CI 1.098-2.112; p=0.012), yet not for stroke (HR=1.119; 95% CI 0.724-1.728; p=0.614).\n\n\nCONCLUSION\nDM is a common morbidity coexisting with nonvalvular AF and is associated with an increased risk of 1-year all-cause mortality, cardiovascular mortality, and CEE. However, no increased risk of stroke was found during a 1-year follow-up in patients with AF and DM.","cites":"0","conferencePercentile":"31.08695652"},{"venue":"Yonsei medical journal","id":"c460925dade85e1f0670e46bc5e09704711a1556","venue_1":"Yonsei medical journal","year":"2016","title":"Simple Purification of Adeno-Associated Virus-DJ for Liver-Specific Gene Expression","authors":"Jingjing Liu, Young-Ah Moon","author_ids":"3889747, 6624986","abstract":"Recombinant gene expression using adeno-associated viruses (AAVs) has become a valuable tool in animal studies, as they mediate safe expression of transduced genes for several months. The liver is a major organ of metabolism, and liver-specific expression of a gene can be an invaluable tool for metabolic studies. AAV-DJ is a recombinant AAV generated by the gene shuffling of various AAV serotypes and shares characteristics of AAV2 and AAV8. AAV-DJ contains a heparin-binding domain in its capsid, which suggests that a heparin column could be used for the purification of the AAV. Given that AAV-DJ has been only recently available, relatively little is known about the optimal preparation/purification and application of AAV-DJ. Here, we present a simple large-scale preparation method that can generate 3×10¹³ viral particles for in vivo experiments and demonstrate liver-specific gene expression via systemic injection in mice.","cites":"0","conferencePercentile":"45.07389163"},{"venue":"Yonsei medical journal","id":"c5398b225a762dbfb2914cbcf4797ab5a133c7b5","venue_1":"Yonsei medical journal","year":"2007","title":"An Ovarian Steroid Cell Tumor Causing Virilization and Massive Ascites","authors":"Young Tae Kim, Sang Wun Kim, Bo Sung Yoon, Sung Hoon Kim, Jae Hoon Kim, Jae Wook Kim, Nam Hoon Cho","author_ids":"2800946, 8364531, 4173435, 4338379, 2652149, 1785915, 5066142","abstract":"Steroid cell tumors, not otherwise specified (NOS), are rare ovarian sex cord-stromal tumors with malignant potential. The majority of these tumors produce several steroids, particularly testosterone. Various virilizing symptoms such as hirsutism, temporal balding, and amenorrhea are common in these patients; however massive ascites is an infrequent symptom. A 52-year-old woman with the sudden onset of virilization and massive ascites presented for treatment at Severance Hospital. After clinical evaluation, the patient underwent an exploratory laparotomy and a complete surgical staging procedure. She recovered from the surgery uneventfully and was discharged from the hospital five days after surgery. We present here an unusual case of an ovarian steroid cell tumor, NOS, and a brief review of the literature regarding these types of tumors.","cites":"9","conferencePercentile":"97.48427673"},{"venue":"Yonsei medical journal","id":"503fc216103fb35e8b8aba5e96343e5d471895aa","venue_1":"Yonsei medical journal","year":"2016","title":"Impact of Angiotensin Converting Enzyme Inhibitor versus Angiotensin Receptor Blocker on Incidence of New-Onset Diabetes Mellitus in Asians","authors":"Ji Young Park, Seung-Woon Rha, Byoung Geol Choi, Se Yeon Choi, Jae Woong Choi, Sung Kee Ryu, Se Jin Lee, Seunghwan Kim, Yung-Kyun Noh, Raghavender Goud Akkala, Hu Li, Jabar Ali, Ji Bak Kim, Sunki Lee, Jin Oh Na, Cheol Ung Choi, Hong Euy Lim, Jin Won Kim, Eung Ju Kim, Chang Gyu Park, Hong Seog Seo, Dong Joo Oh","author_ids":"8289188, 4625168, 6188487, 4694050, 7629523, 4501075, 6738933, 1791973, 3001360, 3811975, 1701433, 3696639, 6063034, 3775623, 2314494, 7942220, 2215214, 2716720, 6396784, 3360424, 1719583, 4989843","abstract":"PURPOSE\nAngiotensin converting enzyme inhibitor (ACEI) and angiotensin receptor blocker (ARB) are associated with a decreased incidence of new-onset diabetes mellitus (NODM). The aim of this study was to compare the protective effect of ACEI versus ARBs on NODM in an Asian population.\n\n\nMATERIALS AND METHODS\nWe investigated a total of 2817 patients who did not have diabetes mellitus from January 2004 to September 2009. To adjust for potential confounders, a propensity score matched (PSM) analysis was performed using a logistic regression model. The primary end-point was the cumulative incidence of NODM, which was defined as having a fasting blood glucose ≥126 mg/dL or HbA1c ≥6.5%. Multivariable cox-regression analysis was performed to determine the impact of ACEI versus ARB on the incidence of NODM.\n\n\nRESULTS\nMean follow-up duration was 1839±1019 days in all groups before baseline adjustment and 1864±1034 days in the PSM group. After PSM (C-statistics=0.731), a total 1024 patients (ACEI group, n=512 and ARB group, n=512) were enrolled for analysis and baseline characteristics were well balanced. After PSM, the cumulative incidence of NODM at 3 years was lower in the ACEI group than the ARB group (2.1% vs. 5.0%, p=0.012). In multivariate analysis, ACEI vs. ARB was an independent predictor of the lower incidence for NODM (odd ratio 0.37, confidence interval 0.17-0.79, p=0.010).\n\n\nCONCLUSION\nIn the present study, compared with ARB, chronic ACEI administration appeared to be associated with a lower incidence of NODM in a series of Asian cardiovascular patients.","cites":"0","conferencePercentile":"45.07389163"},{"venue":"Yonsei medical journal","id":"549e9f21f2cf57498874bab4d050f0d45ab13086","venue_1":"Yonsei medical journal","year":"2013","title":"The Impact of High Sensitivity C-Reactive Protein Level on Coronary Artery Spasm as Assessed by Intracoronary Acetylcholine Provocation Test","authors":"Ji Young Park, Seung-Woon Rha, Yong-Jian Li, Kang-Yin Chen, Byoung Geol Choi, Se Yeon Choi, Sung Kee Ryu, Jae Woong Choi, Tae Kyun Kim, Jeong Min Kim, Yoon Suk Bak, Jae Hoon Lee, Sung Il Im, Sun Won Kim, Jin Oh Na, Cheol Ung Choi, Hong Euy Lim, Jin Won Kim, Eung Ju Kim, Chang Gyu Park, Hong Seog Seo, Dong Joo Oh","author_ids":"8289188, 4625168, 3117078, 8336554, 6188487, 4694050, 4501075, 7629523, 3977599, 3878092, 5032408, 8667032, 3754111, 4705618, 2314494, 7942220, 2215214, 2716720, 6396784, 3360424, 1719583, 4989843","abstract":"PURPOSE\nHigh sensitive C-reactive protein (hs CRP) is well known as a strong risk factor of cardiovascular disease (CVD). The aim of this study is to evaluate the impact of elevated hs CRP on coronary artery spasm (CAS) as assessed by intracoronary acetylcholine (ACh) provocation test.\n\n\nMATERIALS AND METHODS\nA total of 1729 consecutive patients without significant CVD who underwent coronary angiography and intracoronary ACh test between November 2004 and August 2010 were analyzed. The patients were divided into five groups according to quintiles of hs CRP levels.\n\n\nRESULTS\nAt baseline, the prevalence of elderly, hypertension, diabetes mellitus, current smoking, and lipid levels were higher in patients with higher hs CRP. During ACh test, the incidences of significant CAS, ischemic electrocardiography (EKG) change, multivessel, and diffuse CAS were higher in patients with higher hs CRP. Multivariate analysis showed that the old age (OR=1.01, CI; 1.0-1.02, p=0.0226), myocardial bridge (OR=3.34, CI; 2.16-5.17, p<0.001), and highest quintile hs CRP (OR=1.54, CI; 1.12-2.18, p=0.008) were independent predictors of ACh induced CAS. However, there was no difference in clinical outcomes up to 12 months.\n\n\nCONCLUSION\nIn conclusion, higher hs CRP was associated with higher incidence of CAS, worse angiographic characteristics and ischemic EKG change, but was not associated with clinical outcomes.","cites":"2","conferencePercentile":"73.91304348"},{"venue":"Yonsei medical journal","id":"bb76df0f516a81ae0c1cc147b87e1bebd83d9fbd","venue_1":"Yonsei medical journal","year":"2016","title":"Preclinical Study of Cell Therapy for Osteonecrosis of the Femoral Head with Allogenic Peripheral Blood-Derived Mesenchymal Stem Cells","authors":"Qiang Fu, Ning-Ning Tang, Qian Zhang, Yi Liu, Jia-Chen Peng, Ning Fang, Li-Mei Yu, Jin-Wei Liu, Tao Zhang","author_ids":"3650116, 6252354, 1737486, 1691635, 3607490, 7441438, 8547922, 8190506, 1743147","abstract":"PURPOSE\nTo explore the value of transplanting peripheral blood-derived mesenchymal stem cells from allogenic rabbits (rPBMSCs) to treat osteonecrosis of the femoral head (ONFH).\n\n\nMATERIALS AND METHODS\nrPBMSCs were separated/cultured from peripheral blood after granulocyte colony-stimulating factor mobilization. Afterwards, mobilized rPBMSCs from a second passage labeled with PKH26 were transplanted into rabbit ONFH models, which were established by liquid nitrogen freezing, to observe the effect of rPBMSCs on ONFH repair. Then, the mRNA expressions of BMP-2 and PPAR-γ in the femoral head were assessed by RT-PCR.\n\n\nRESULTS\nAfter mobilization, the cultured rPBMSCs expressed mesenchymal markers of CD90, CD44, CD29, and CD105, but failed to express CD45, CD14, and CD34. The colony forming efficiency of mobilized rPBMSCs ranged from 2.8 to 10.8 per million peripheral mononuclear cells. After local transplantation, survival of the engrafted cells reached at least 8 weeks. Therein, BMP-2 was up-regulated, while PPAR-γ mRNA was down-regulated. Additionally, bone density and bone trabeculae tended to increase gradually.\n\n\nCONCLUSION\nWe confirmed that local transplantation of rPBMSCs benefits ONFH treatment and that the beneficial effects are related to the up-regulation of BMP-2 expression and the down-regulation of PPAR-γ expression.","cites":"0","conferencePercentile":"45.07389163"},{"venue":"Yonsei medical journal","id":"d87b0b680c371ee79258d2f28cfeada489c74dad","venue_1":"Yonsei medical journal","year":"2014","title":"ATP-Based Chemotherapy Response Assay in Primary or Recurrent Ovarian and Peritoneal Cancer","authors":"Maria Lee, Sang Wun Kim, Eun Ji Nam, Hanbyoul Cho, Jae Hoon Kim, Young Tae Kim, Sunghoon Kim","author_ids":"2403230, 8364531, 7700729, 3807488, 2652149, 2800946, 6810135","abstract":"PURPOSE\nTo investigate chemosensitivity with an adenosine triphosphate-based chemotherapy response assay in patients with epithelial ovarian or peritoneal cancer according to tumor histology, grade, and disease status.\n\n\nMATERIALS AND METHODS\nOne hundred specimens were collected during primary or secondary debulking from 67 patients with primary ovarian cancer, 24 patients with recurrent ovarian cancer, 5 patients with primary peritoneal cancer, and 4 patients with recurrent peritoneal cancer; samples were collected between August 2006 and June 2009. Tumor cells were isolated and cultured for 48 hours in media containing chemotherapy. The chemosensitivity index (CI) was calculated as 300 minus the sum of the cell death rate at 0.2×, 1×, and 5× drug concentrations, and the CI values were compared.\n\n\nRESULTS\nCI values were obtained from 93 of 100 patients. The most active agents against primary disease were ifosfamide and paclitaxel. For primary serous adenocarcinoma, paclitaxel and irinotecan were the most active, followed by ifosfamide. For clear cell carcinoma, ifosfamide was the most active, followed by paclitaxel and irinotecan. Although not statistically significant, the CIs of cisplatin, carboplatin, paclitaxel, and docetaxel decreased as tumor grade increased. In 14 cases of recurrent disease, paclitaxel was the most active, followed by ifosfamide and cisplatin.\n\n\nCONCLUSION\nIfosfamide and paclitaxel were the most active drugs for primary and recurrent disease. Therefore, we recommend further clinical studies to confirm the efficacy of paclitaxel, ifosfamide, and cisplatin combination chemotherapy for recurrent and primary ovarian cancer.","cites":"0","conferencePercentile":"22.17573222"},{"venue":"Yonsei medical journal","id":"f9b1c3d287dc8b361618e945e2cd603cb60ff2dc","venue_1":"Yonsei medical journal","year":"2008","title":"Robotic Surgery in Gynecologic Field","authors":"Young Tae Kim, Sang Wun Kim, Yong Wook Jung","author_ids":"2800946, 8364531, 2310812","abstract":"Operative laparoscopy was initially developed in the field of gynecology earlier on and the advent of laparoscopic surgery led to advances in general surgery as well. In the last few years, a number of articles have been published on the performance of surgical procedures using the robot-assisted laparoscopy. The shortcomings of conventional laparoscopy have led to the development of robotic surgical system and future of telerobotic surgery is not far away, enabling a surgeon to operate at a distance from the operating table. The complete loss of tactile sensation is often quoted as a big disadvantage of working with robotic systems. Although the first generation da Vinci robotic surgical system provides improved imaging and instrumentation, the absence of tactile feedback and the high cost of the technology remain as limitations. New generations of the robotic surgical systems have been developed, allowing visualization of preoperative imaging during the operation. Though the introduction of robotics is very recent, the potential for robotics in several specialties is significant. However, the benefit to patients must be carefully evaluated and proven before this technology can become widely accepted in the gynecologic surgery.","cites":"3","conferencePercentile":"73.50993377"},{"venue":"Yonsei medical journal","id":"92373dcd7202c5362134933d4bf7a182630cae51","venue_1":"Yonsei medical journal","year":"2014","title":"FIGO Staging for Uterine Sarcomas: Can the Revised 2008 Staging System Predict Survival Outcome Better?","authors":"Ga Won Yim, Eun Ji Nam, Sang Wun Kim, Young Tae Kim","author_ids":"7188550, 7700729, 8364531, 2800946","abstract":"PURPOSE\nThe aim of this study was to compare survival of patients with uterine sarcomas using the 1988 and 2008 International Federation of Gynecologists and Obstetricians (FIGO) staging systems to determine if revised 2008 staging accurately predicts patient survival.\n\n\nMATERIALS AND METHODS\nA total of 83 patients with leiomyosarcoma and endometrial stromal sarcoma treated at Yonsei University Health System between March of 1989 and November of 2009 were reviewed. The prognostic validity of both FIGO staging systems, as well as other factors was analyzed.\n\n\nRESULTS\nLeiomyosarcoma and endometrial stromal sarcoma comprised 47.0% and 53.0% of this study population, respectively. Using the new staging system, 43 (67.2%) of 64 eligible patients were reclassified. Among those 64 patients, 45 (70.3%) patients with limited uterine corpus involvement were divided into stage IA (n=14) and IB (n=31). Univariate analysis demonstrated a significant difference between stages I and II and the other stages in both staging systems (p<0.001) with respect to progression-free survival and overall survival (OS). Age, menopausal status, tumor size, and cell type were significantly associated with OS (p=0.011, p=0.031, p=0.044, p=0.009, respectively). In multivariate analysis, revised FIGO stage greater than III was an independent poor prognostic factor with a hazard ratio of 9.06 [95% confidence interval (CI) 2.49-33.0, p=0.001].\n\n\nCONCLUSION\nThe 2008 FIGO staging system is more valid than the previous FIGO staging system for uterine sarcomas with respect to its ability to distinguish early-stage patients from advanced-stage patients.","cites":"13","conferencePercentile":"99.58158996"},{"venue":"Yonsei medical journal","id":"f89413181f213a7a61c259d567c734926ea5ba76","venue_1":"Yonsei medical journal","year":"2006","title":"[6]-Gingerol Induces Cell Cycle Arrest and Cell Death of Mutant p53-expressing Pancreatic Cancer Cells","authors":"Yon Jung Park, Jing Wen, Seungmin Bang, Seung Woo Park, Si Young Song","author_ids":"4999278, 1726071, 3509908, 3463946, 1682724","abstract":"[6]-Gingerol, a major phenolic compound derived from ginger, has anti-bacterial, anti-inflammatory and anti-tumor activities. While several molecular mechanisms have been described to underlie its effects on cells in vitro and in vivo, the underlying mechanisms by which [6]-gingerol exerts anti-tumorigenic effects are largely unknown. The purpose of this study was to investigate the action of [6]-gingerol on two human pancreatic cancer cell lines, HPAC expressing wild- type (wt) p53 and BxPC-3 expressing mutated p53. We found that [6]-gingerol inhibited the cell growth through cell cycle arrest at G1 phase in both cell lines. Western blot analyses indicated that [6]-gingerol decreased both Cyclin A and Cyclin-dependent kinase (Cdk) expression. These events led to reduction in Rb phosphorylation followed by blocking of S phase entry. p53 expression was decreased by [6]-gingerol treatment in both cell lines suggesting that the induction of Cyclin-dependent kinase inhibitor, p21cip1, was p53-independent. [6]-Gingerol induced mostly apoptotic death in the mutant p53-expressing cells, while no signs of early apoptosis were detected in wild type p53-expressing cells and this was related to the increased phosphorylation of AKT. These results suggest that [6]-gingerol can circumvent the resistance of mutant p53- expressing cells towards chemotherapy by inducing apoptotic cell death while it exerts cytostatic effect on wild type p53- expressing cells by inducing temporal growth arrest.","cites":"11","conferencePercentile":"98.86363636"},{"venue":"Yonsei medical journal","id":"7cfa596e3b3de86c0baabf07969d6ea26bfcf1a0","venue_1":"Yonsei medical journal","year":"2014","title":"A Comparison of Receptive-Expressive Language Profiles between Toddlers with Autism Spectrum Disorder and Developmental Language Delay","authors":"Kyeong In Seol, Seung Ha Song, Ka Lim Kim, Seung Taek Oh, Young Tae Kim, Woo Young Im, Dong Ho Song, Keun-Ah Cheon","author_ids":"5320820, 4343656, 5992733, 5511619, 2800946, 3844868, 2527836, 4036671","abstract":"PURPOSE\nIt is well known that expressive language impairment is commonly less severe than receptive language impairment in children with autism spectrum disorder (ASD). However, this result is based on experiments in Western countries with Western language scales. This study tries to find whether the result above is applicable for toddlers in a non-Western country; more specifically, in Korea with non-Western language scales.\n\n\nMATERIALS AND METHODS\nThe participants were 166 toddlers aged between 20 months and 50 months who visited the clinic from December 2010 to January 2013. The number of toddlers diagnosed as ASD and developmental language delay (DLD) was 103 and 63, respectively. Language development level was assessed using Sequenced Language Scale for Infants (SELSI), a Korean language scale. Using SELSI, each group was divided into 3 sub-groups. Moreover, the group difference by age was observed by dividing them into three age groups. Chi-square test and linear-by-linear association was used for analysis.\n\n\nRESULTS\nReceptive language ability of the DLD group was superior to that of the ASD group in all age groups. However, expressive language ability in both groups showed no difference in all age groups. A greater proportion of expressive dominant type was found in ASD. The 20-29 months group in ASD showed the largest proportion of expressive language dominant type in the three age groups, suggesting that the younger the ASD toddler is, the more severe the receptive language impairment is.\n\n\nCONCLUSION\nThese findings suggest that receptive-expressive language characteristics in ASD at earlier age could be useful in the early detection of ASD.","cites":"2","conferencePercentile":"81.58995816"},{"venue":"Yonsei medical journal","id":"47599f4ddec8a7ad69bedbaeb188068f3049e763","venue_1":"Yonsei medical journal","year":"2014","title":"Diagnostic Algorithm to Reflect Regressive Changes of Human Papilloma Virus in Tissue Biopsies","authors":"Min Jin Lhee, Youn Jin Cha, Jong Man Bae, Young Tae Kim, Nam Hoon Cho","author_ids":"5139957, 6381578, 4856994, 2800946, 5066142","abstract":"PURPOSE\nLandmark indicators have not yet to be developed to detect the regression of cervical intraepithelial neoplasia (CIN). We propose that quantitative viral load and indicative histological criteria can be used to differentiate between atypical squamous cells of undetermined significance (ASCUS) and a CIN of grade 1.\n\n\nMATERIALS AND METHODS\nWe collected 115 tissue biopsies from women who tested positive for the human papilloma virus (HPV). Nine morphological parameters including nuclear size, perinuclear halo, hyperchromasia, typical koilocyte (TK), abortive koilocyte (AK), bi-/multi-nucleation, keratohyaline granules, inflammation, and dyskeratosis were examined for each case. Correlation analyses, cumulative logistic regression, and binary logistic regression were used to determine optimal cut-off values of HPV copy numbers. The parameters TK, perinuclear halo, multi-nucleation, and nuclear size were significantly correlated quantitatively to HPV copy number.\n\n\nRESULTS\nAn HPV loading number of 58.9 and AK number of 20 were optimal to discriminate between negative and subtle findings in biopsies. An HPV loading number of 271.49 and AK of 20 were optimal for discriminating between equivocal changes and obvious koilocytosis.\n\n\nCONCLUSION\nWe propose that a squamous epithelial lesion with AK of >20 and quantitative HPV copy number between 58.9-271.49 represents a new spectrum of subtle pathological findings, characterized by AK in ASCUS. This can be described as a distinct entity and called \"regressing koilocytosis\".","cites":"0","conferencePercentile":"22.17573222"},{"venue":"Yonsei medical journal","id":"59ad5f0367606fb4cf8d429aa41860ae634837b7","venue_1":"Yonsei medical journal","year":"2014","title":"Perioperative Psychological and Music Interventions in Elderly Patients Undergoing Spinal Anesthesia: Effect on Anxiety, Heart Rate Variability, and Postoperative Pain","authors":"Yisha Wang, Youjing Dong, Yang Li","author_ids":"7707741, 3948772, 1678662","abstract":"PURPOSE\nThe aim of this study was to evaluate the effects of perioperative psychological and music interventions in elderly patients undergoing elective surgery on anxiety, post-operative pain, and changes in heart rate variability (HRV) to ascertain if perioperative psychological and music interventions can affect overall anxiety levels.\n\n\nMATERIALS AND METHODS\nFourty elderly patients undergoing elective surgery were randomized to two groups; one group received psychological and music intervention, and the other was the control. The intervention group underwent psychological intervention and listening to music for 30 min before surgery.\n\n\nRESULTS\nThe mean change in HRV as determined by low frequency (LF) power measurements. After the intervention, the ratio of mean LF to high frequency (HF) power decreased significantly in the intervention group compared to before the intervention (p<0.05). In the control group, mean LF measurements and the ratio of LF:HF did not change significantly. In the intervention group, mean HF power was significantly higher after the procedure than before (p<0.01). Moreover, the mean self-rating anxiety score of the intervention group decreased after the procedure compared to before (p<0.05). The mean visual analogue score of the intervention group 6 hours after surgery was significantly lower than that of the control group (p<0.01).\n\n\nCONCLUSION\nPerioperative psychological and music interventions can reduce anxiety and postoperative pain in elderly patients.","cites":"1","conferencePercentile":"58.78661088"},{"venue":"Yonsei medical journal","id":"5f24cf399a06ac01574667d74430379b1537a1ec","venue_1":"Yonsei medical journal","year":"2006","title":"Management Strategy for Congenital Choledochal Cyst with Co-existing Intrahepatic Dilation and Aberrant Bile Duct As Well As Other Complicated Biliary Anomalies","authors":"Qian Dong, Buxian Jiang, Hong Zhang, Zhong Jiang, Hongting Lu, Chuanmin Yang, Yu Cheng, Xiwei Hao","author_ids":"1750658, 7864280, 1734058, 6769885, 5433080, 8100155, 2885935, 5062084","abstract":"The purpose of this study was to investigate and discuss imaging methods and management strategies for congenital choledochal cyst with co-existing intrahepatic dilation and aberrant bile duct as well as other complicated biliary anomalies. In this study we reviewed and analyzed 72 patients with congenital choledochal cyst, ranging in age from 15 days to 12 years old and who were seen at our hospital during the past 12 years, from January 1993 to October 2005. The image manifestation and clinical significance of patients with co- existing intrahepatic biliary dilation and aberrant bile duct were carefully examined during operation via MRCP, cholangiography and choledochoscope. Twenty-two cases (30.1%) presented with intrahepatic bile duct dilation and 12 of these were of the cystic type. That is, the orifice of the dilated intrahepatic tract that converged into the common hepatic duct showed membrane or septum-like stenosis. In 10 cases the dilation tapered off from the porta hepatis to the initiating terminals of the intra-hepatic bile ducts and was not accompanied by stenosis. An aberrant bile duct was observed in 2 of the cases. In 3 cases, the right and left hepatic ducts converged at the choledochal cyst. In conclusion, the imaging methods for intrahepatic bile duct dilation possess important clinical significance. Further, for hepatojejunostomy with radical excision of a choledochal cyst, additional operative procedures for intrahepatic stenosis, possible bile duct malformation and pancreaticobiliary common duct calculi can potentially reduce postoperative complications.","cites":"2","conferencePercentile":"55.3030303"},{"venue":"Yonsei medical journal","id":"1097112b2241fa10c3c4b11b379568ea0f3a1445","venue_1":"Yonsei medical journal","year":"2011","title":"Related Factors of Age-Appropriate Immunization among Urban-Rural Children Aged 24-35 Months in a 2005 Population-Based Survey in Nonsan, Korea","authors":"Eun-Young Kim, Moo-Sik Lee","author_ids":"3678816, 3509083","abstract":"PURPOSE\nThis study was aimed to determine the status and related factors of age-appropriate immunization among urban-rural children aged 24-35 months in a 2005 population-based survey in Nonsan, Korea.\n\n\nMATERIALS AND METHODS\nWe conducted household survey and provider check using questionnaire and checklist to obtain data on immunization status for children, aged 24-35 months. Age-appropriate immunization was defined as status of receiving the fourth diphtheria-tetanus-pertussis (4 DTP), 3 Polio, the first measles-mumps-rubella (1 MMR) doses, and the 4 : 3 : 1 series.\n\n\nRESULTS\nAge-appropriate immunization rates were 51.7% for 4 DPT, 88.0% for 3 Polio, 87.9% for 1 MMR, and 50.3% for the 4 : 3 : 1 series. First-born children, lower perceived barrier scores, and higher perception of immunization data were significantly related to age-appropriate immunization.\n\n\nCONCLUSION\nThe findings indicated that age-appropriate immunization rate could be improved by implementing reminder/recall service and providing the knowledge about immunization. Identification and consideration related factors would improve immunization rate and age-appropriate immunization.","cites":"2","conferencePercentile":"62.89308176"},{"venue":"Yonsei medical journal","id":"ecffc4082fd729ca4780eaa480b5cd88200fa635","venue_1":"Yonsei medical journal","year":"2012","title":"EGFR Polymorphism as a Predictor of Clinical Outcome in Advanced Lung Cancer Patients Treated with EGFR-TKI","authors":"Minkyu Jung, Byoung Chul Cho, Chul Ho Lee, Hyung Soon Park, Young Ae Kang, Se Kyu Kim, Joon Chang, Dae Jun Kim, Sun Young Rha, Joo Hang Kim, Ji Hyun Lee","author_ids":"1842157, 6861777, 7496530, 8043424, 8332397, 4198135, 6147429, 7183839, 3141474, 4629936, 8153129","abstract":"PURPOSE\nMutations in the epidermal growth factor receptor (EGFR) have been confirmed as predictors of the efficacy of treatment with EGFR-tyrosine kinase inhibitors (TKIs). We investigated whether polymorphisms of the EGFR gene were associated with clinical outcomes in non-small cell lung cancer (NSCLC) patients treated with EGFR-TKI.\n\n\nMATERIALS AND METHODS\nA polymorphic dinucleotide repeat in intron 1 [CA simple sequence repeat in intron 1(CA-SSR1)] in intron 1 and single nucleotide polymorphisms (SNP-216) in the promoter region of the EGFR gene were evaluated in 71 NSCLC patients by restriction fragment length polymorphism and DNA sequencing. The relationship between genetic polymorphisms and clinical outcomes of treatment with EGFR-TKIs was evaluated.\n\n\nRESULTS\nSNP-216G/T polymorphisms were associated with the efficacy of EGFR-TKI. The response rate for the SNP-216G/T tended to be higher than that for G/G (62.5% vs. 27.4%, p=0.057). The SNP-216G/T genotype was also associated with longer progression-free survival compared with the GG genotype (16.7 months vs. 5.1 months, p=0.005). However, the length of CA-SSR1 was not associated with the efficacy of EGFR-TKI.\n\n\nCONCLUSION\nSNP-216G/T polymorphism was a potential predictor of clinical outcomes in NSCLC patients treated with EGFR-TKI.","cites":"2","conferencePercentile":"65.51724138"},{"venue":"Yonsei medical journal","id":"6dd7e31e422ed96e68bbb0b3dcc9f1236f7c2cc5","venue_1":"Yonsei medical journal","year":"2012","title":"Prognostic and Predictive Value of Carcinoembryonic Antigen and Cytokeratin-19 Fragments Levels in Advanced Non-Small Cell Lung Cancer Patients Treated with Gefitinib or Erlotinib","authors":"Minkyu Jung, Se Hyun Kim, Soojung Hong, Young Ae Kang, Se Kyu Kim, Joon Chang, Sun Young Rha, Joo Hang Kim, Dae Joon Kim, Byoung Chul Cho","author_ids":"1842157, 4374021, 5453995, 8332397, 4198135, 6147429, 3141474, 4629936, 3443155, 6861777","abstract":"PURPOSE\nThe prognostic and predictive value of pretreatment serum levels of carcinoembryonic antigen (CEA) and cytokeratin-19 fragments (CYFRA 21-1) were assessed in advanced non-small cell lung cancer (NSCLC) patients treated with gefitinib or erlotinib.\n\n\nMATERIALS AND METHODS\nPretreatment CEA and CYFRA 21-1 were measured in 123 advanced NSCLC patients receiving gefitinib or erlotinib. High CEA levels (h-CEA) were significantly associated with females, patients with adenocarcinoma, and non-smokers.\n\n\nRESULTS\nLow CYFRA 21-1 levels (l-CYFRA) were significantly associated with a good performance status (ECOG PS 0-1). The overall response rate (RR) was 27.6%, and higher RR was associated with adenocarcinoma, h-CEA, and epidermal growth factor receptor (EGFR) mutation. Patients with h-CEA had significantly longer progression-free survival (PFS) (p=0.021). Patients with l-CYFRA had significantly longer PFS and overall survival (p=0.006 and p<0.001, respectively). Of note, h-CEA and l-CYFRA had good prognosis in patients with unknown EGFR mutation status or patients with squamous cell carcinoma (p=0.021 and p=0.015, respectively). A good ECOG PS (HR=0.45, p=0.017), h-CEA (HR=0.41, p=0.007), l-CYFRA 21-1 (HR=0.52, p=0.025), and an EGFR mutation (HR=0.22, p<0.001) were independently predictive of a longer PFS.\n\n\nCONCLUSION\nh-CEA and l-CYFRA 21-1 may be prognostic and predictive serum markers for higher response and longer survival in patients with advanced NSCLC receiving gefitinib or erlotinib, especially in patients with unknown EGFR mutation status or patients with squamous cell carcinoma.","cites":"7","conferencePercentile":"93.3908046"},{"venue":"Yonsei medical journal","id":"0e3933f9ae061e9c9002f5e0427aea7e41ef5f12","venue_1":"Yonsei medical journal","year":"2014","title":"Increased Serum Cathepsin K in Patients with Coronary Artery Disease","authors":"Xiang Li, Yuzi Li, Jiyong Jin, Dehao Jin, Lan Cui, Xiangshan Li, Yanna Rei, Haiying Jiang, Guangxian Zhao, Guang Yang, Enbo Zhu, Yongshan Nan, Xianwu Cheng","author_ids":"1737850, 4764479, 6863212, 4240925, 7385711, 3904212, 4405966, 7566717, 4941458, 1710915, 4646306, 6247078, 5974352","abstract":"PURPOSE\nCathepsin K is a potent collagenase implicated in human and animal atherosclerosis-based vascular remodeling. This study examined the hypothesis that serum CatK is associated with the prevalence of coronary artery disease (CAD).\n\n\nMATERIALS AND METHODS\nBetween January 2011 and December 2012, 256 consecutive subjects were enrolled from among patients who underwent coronary angiography and percutaneous coronary intervention treatment. A total of 129 age-matched subjects served as controls.\n\n\nRESULTS\nThe subjects' serum cathepsin K and high sensitive C-reactive protein (hs-CRP) and high-density lipoprotein cholesterol were measured. The patients with CAD had significantly higher serum cathepsin K levels compared to the controls (130.8±25.5 ng/mL vs. 86.9±25.5 ng/mL, p<0.001), and the patients with acute coronary syndrome had significantly higher serum cathepsin K levels compared to those with stable angina pectoris (137.1±26.9 ng/mL vs. 102.6±12.9 ng/mL, p<0.001). A linear regression analysis showed that overall, the cathepsin K levels were inversely correlated with the high-density lipoprotein levels (r=-0.29, p<0.01) and positively with hs-CRP levels (r=0.32, p<0.01). Multiple logistic regression analyses shows that cathepsin K levels were independent predictors of CAD (odds ratio, 1.76; 95% confidence interval, 1.12 to 1.56; p<0.01).\n\n\nCONCLUSION\nThese data indicated that elevated levels of cathepsin K are closely associated with the presence of CAD and that circulating cathepsin K serves a useful biomarker for CAD.","cites":"2","conferencePercentile":"81.58995816"},{"venue":"Yonsei medical journal","id":"a3c466b1928cd92dd41f75880654ee9e7938fa16","venue_1":"Yonsei medical journal","year":"2013","title":"Prognostic Factors for Patients with Bone-Only Metastasis in Breast Cancer","authors":"Sung Gwe Ahn, Hak Min Lee, Sang-Hoon Cho, Seung Ah Lee, Seung Hyun Hwang, Joon Jeong, Hy-De Lee","author_ids":"1815656, 8385431, 6958960, 2599552, 5788508, 4190132, 5332355","abstract":"PURPOSE\nBone is the most frequent site of metastasis among breast cancer patients. We investigated prognostic factors affecting survival following bone-only metastasis in breast cancer patients.\n\n\nMATERIALS AND METHODS\nThe medical records of breast cancer patients who were treated and followed at Gangnam Severance Hospital retrospectively reviewed to identify patients with bone-only metastasis.\n\n\nRESULTS\nThe median time from the diagnosis of bone-only metastasis to the last follow-up or death was 55.2 [95% confidence interval (CI), 38.6-71.9] months. The Kaplan-Meier overall survival estimate at 10 years for all patients was 34.9%. In the multivariate Cox regression model, bisphosphonate treatment [hazard ratio=0.18; 95% CI, 0.07-0.43], estrogen receptor positivity (hazard ratio=0.51; 95% CI, 0.28-0.94), and solitary bone metastasis (hazard ratio=0.32; 95% CI, 0.14-0.72) were significantly associated with longer overall survival in the bone-only recurrence group. Among the treatment modalities, only bisphosphonate treatment was identified as a significant prognostic factor.\n\n\nCONCLUSION\nIdentifying the factors influencing breast cancer mortality after bone-only metastasis will help clarify the clinical course and improve the treatment outcome for patients with breast cancer and bone-only metastasis. Bisphosphonates, as a significant prognostic factor, warrant further investigation.","cites":"9","conferencePercentile":"99.13043478"},{"venue":"Yonsei medical journal","id":"fcaeb46c91518fcfab4a123f438028c74ad42646","venue_1":"Yonsei medical journal","year":"2006","title":"Malignancies in Korean Patients with Inflammatory Myopathy","authors":"Sang-Won Lee, Sang Youn Jung, Min-Chan Park, Yong-Beom Park, Soo-Kon Lee","author_ids":"3191413, 4997345, 3729826, 8664511, 6417803","abstract":"The aim of this study was to assess the prevalence and the common type of malignancies in Korean patients with polymyositis (PM) and dermatomyositis (DM) and to evaluate the differences of clinical and laboratory findings between patients with malignancy and those without malignancy. Forty-one Korean patients, who were diagnosed as PM or DM, were enrolled in this study. They fulfilled the Bohan and Peter's criteria for a definite diagnosis of PM and DM. Patients with PM were 25 and those with DM were 16. Eleven out of 41 patients (26.8%) had malignancies. The malignancy was diagnosed simultaneously or later in 81.8% of patients with inflammatory myopathy (IM). The breast cancer was the most common malignancy. In this study, forty three years old as a screening age for malignancy had 88.9% sensitivity and 50.2% specificity. The serum levels of creatine kinase (CK) were significantly lower in patients with malignancy than those without malignancy.","cites":"3","conferencePercentile":"69.31818182"},{"venue":"Yonsei medical journal","id":"e3d56dcde6fd204b131d5ef616235cc43e6fe876","venue_1":"Yonsei medical journal","year":"2014","title":"Delta Neutrophil Index as an Early Marker for Differential Diagnosis of Adult-Onset Still's Disease and Sepsis","authors":"Hee-Jin Park, You-Jung Ha, Jung-Yoon Pyo, Yong-Beom Park, Soo-Kon Lee, Sang-Won Lee","author_ids":"3051632, 4008276, 6970171, 8664511, 6417803, 3191413","abstract":"PURPOSE\nTo investigate clinical implications of delta neutrophil index (DNI) to discriminate adult onset Still's disease (AOSD) from sepsis.\n\n\nMATERIALS AND METHODS\nWe reviewed the medical records of 13 patients with AOSD and 33 gender and age-matched patients with sepsis. In all subjects, microbial tests were performed to exclude or confirm sepsis. All laboratory data were measured two or three times during the first 3 days and represented by their mean levels. DNI was measured automatically by ADVIA 2120 for the first 3 days.\n\n\nRESULTS\nThere were no significant differences in white blood cell counts, neutrophil proportion, erythrocyte sedimentation rate and C-reactive protein between two groups. AOSD patients had notably lower DNI than sepsis patients regardless of the presence of bacteremia or not. However, both DNI and ferritin were not significant independent factors for predicting sepsis in the multivariate logistic regression analysis. Meanwhile, the area under the receiver operating characteristic curve (AUROC) of DNI was slightly higher than that of ferritin. When we set DNI of 2.75% as the cut-off value for predicting sepsis, 11 (84.6%) of AOSD patients had a DNI value below 2.75% and 2 (15.4%) of them had a DNI over 2.75% (relative risk for sepsis 176).\n\n\nCONCLUSION\nWe suggest that DNI may be a useful marker for differential diagnosis of AOSD from sepsis in the early phase as supplementary to ferritin.","cites":"0","conferencePercentile":"22.17573222"},{"venue":"Yonsei medical journal","id":"c3b253eeb5848d818c5c64bbac60b6dce8339bd4","venue_1":"Yonsei medical journal","year":"2013","title":"Pharmacogenomic Assessment of Outcomes of Pemetrexed-Treated Patients with Adenocarcinoma of the Lung","authors":"Minkyu Jung, Chul Ho Lee, Hyung Soon Park, Ji Hyun Lee, Young Ae Kang, Se Kyu Kim, Joon Chang, Dae Joon Kim, Sun Young Rha, Joo Hang Kim, Byoung Chul Cho","author_ids":"1842157, 7496530, 8043424, 8153129, 8332397, 4198135, 6147429, 3443155, 3141474, 4629936, 6861777","abstract":"PURPOSE\nThe main objective of this study was to evaluate the association between polymorphisms of the target genes of pemetrexed and clinical outcomes in non-small cell lung cancer (NSCLC) patients treated with pemetrexed.\n\n\nMATERIALS AND METHODS\nWe assessed polymorphisms at 8 sites in 4 genes [thymidylate synthase (TS), dihydrofolate reductase (DHFR; 1610, 680, 317, intron 1), methylenetetrahydrofolate reductase (MTHFR; 677, 1298), glycinamide ribonucleotide formyl transferase (GARFT; 2255)] associated with pemetrexed metabolism using polymerase chain reaction, gene scanning, and restriction fragment length polymorphism analysis in 90 patients with adenocarcinoma of the lung.\n\n\nRESULTS\nSurvival was significantly longer with pemetrexed in patients with TS 3RGCC/3RGCC or 3RGGC/3RGGC compared with the other groups (PFS; 5.2 months vs. 3.7 months, p=0.03: OS; 31.8 months vs. 18.5 months, p=0.001). Patients with DHFR 680CC experienced fatigue more frequently (50% vs. 8.6%, p=0.008). Polymorphisms of MTHFR and GARFT were not significantly associated with clinical outcomes of pemetrexed.\n\n\nCONCLUSION\nThe TS genotype was associated with survival and one DHFR polymorphism was associated with fatigue in NSCLC patients treated with pemetrexed. Further large prospective studies are required to identify other biomarkers that affect patients being treated with pemetrexed for adenocarcinoma of the lung.","cites":"1","conferencePercentile":"51.73913043"},{"venue":"Yonsei medical journal","id":"7ef01c0050b12f91e8aa20224cae276e9f89c422","venue_1":"Yonsei medical journal","year":"2008","title":"Clinical Significance of Microsatellite Instability in Sporadic Epithelial Ovarian Tumors","authors":"Bo-Sung Yoon, Young-Tae Kim, Jae-Hoon Kim, Sang-Wun Kim, Eun-Ji Nam, Nam-Hoon Cho, Jae-Wook Kim, Sunghoon Kim","author_ids":"7683219, 7652365, 1776512, 8364456, 7700767, 2313273, 2249656, 6810135","abstract":"PURPOSE\nWe evaluated the expression of microsatellite instability (MSI) in sporadic ovarian tumors using 5 standard and 9 new MSI markers to determine the clinical significance of MSI in sporadic epithelial ovarian tumors.\n\n\nMATERIALS AND METHODS\nMSI was examined in 21 borderline and 25 malignant ovarian tumors. Polymerase chain reaction (PCR) was performed using the 5 markers recommended by the National Cancer Institute (NCI) for colon cancer and 9 additional markers. MSI was determined using fractional analysis by mixing the PCR products and size markers.\n\n\nRESULTS\nUsing the 5 conventional MSI markers, MSI was found in 4 of 46 (8.6%) ovarian tumors, including 2 of 21 (9.5%) borderline ovarian tumors and 2 of 25 (8%) malignant ovarian tumors. Using the 9 additional MSI markers, MSI was observed in 7 of 46 (15.2%) ovarian tumors, including 3 of 21 (14.3%) borderline ovarian tumors and 4 of 25 (16%) malignant ovarian tumors. There was no statistically significant difference between MSI and clinicopathological factors, including histology and stage, although there was a trend toward an increased incidence of MSI in the serous type.\n\n\nCONCLUSION\nMSI was infrequent in ovarian tumors, including both borderline and malignant tumors. MSI was found to be uncommon in sporadic ovarian tumors, even by using additional MSI markers. The clinical significance of MSI is not strong in patients with sporadic ovarian tumors.","cites":"1","conferencePercentile":"39.40397351"}]}