{"Zebrafish.csv":[{"venue":"Zebrafish","id":"423e02c9dc32068c7570de49fc2c93d6960aa657","venue_1":"Zebrafish","year":"2004","title":"Evolutionary analysis and expression of teleost Thy-1.","authors":"Alexander Reuter, Edward Málaga-Trillo, Ulrike Binkle, Eric Rivera-Milla, Rosanna Beltre, Yi Zhou, Martin Bastmeyer, Claudia A O Stuermer","author_ids":"2527346, 7779799, 3972361, 8310650, 6200813, 4017197, 4180885, 7423168","abstract":"Thy-1 is a developmentally regulated, immunoglobulin superfamily member (IgSF), glycosylphosphatidylinositol (GPI)-anchored cell surface glycoprotein expressed most strongly in neurons and lymphocytes. Thy-1 is expressed in all vertebrates and has been implicated in a variety of processes, including axon regeneration and transmembrane signaling, but its specific function remains elusive. A Thy-1-like molecule in teleost fish was recently identified, with evidence for its role in lipid-raft based signal transduction linked to optic nerve regeneration. For a better characterization of Thy-1, the evolutionary relationships between novel fish homologues and other vertebrate Thy-1s were analyzed. Although the sequence similarity between fish and mammals is very low, there appeared conservation of gene structure and disrupted but recognizable synteny. In addition, the detailed expression analysis of teleost Thy-1 showed nervous system Thy-1 mainly in sensory systems. Strong Thy-1 expression was detected in the youngest retinal ganglion cells and in some neurons in deeper retinal layers, probably amacrine cells. From the olfactory bulbs, Thy-1-positive cells extended axons into the telencephalon. The vagal lobe stained intensively as well as facial and glossopharyngeal lobes and nerves. Outside the CNS, skin cells, blood vessels, kidney macrophages, swim bladder, spleen, gut-associated nerve fibers and the palatal organ were labeled.","cites":"1","conferencePercentile":"40"},{"venue":"Zebrafish","id":"04e798f1cf54b1cd9a545d9cf391ba86962bdfc2","venue_1":"Zebrafish","year":"2014","title":"Circadian clock mediates light/dark preference in zebrafish (Danio rerio).","authors":"Ju Wang, Changhong Liu, Fei Ma, Wei Chen, Jian Liu, Bing Hu, Lei Zheng","author_ids":"3114530, 7531568, 7285081, 3207592, 2106964, 2971583, 1744827","abstract":"Zebrafish (Danio rerio) has been a widely used vertebrate animal model in developmental biology and behavioral neuroscience, but knowledge about some of its basic behaviors, for example, light/dark preference, is still controversial. Appropriate preference for light or dark environments can be crucial for an animal's survival, so we hypothesize that zebrafish may have its light/dark preference varied with the circadian clock. In this present work, we tested the hypothesis by recording the light/dark preference in a two-compartment tank continuously for over 60 h. We found that the light avoidance of fish generally increases with time from morning (8:00am) to midnight (2:00am), and then decreases with time from midnight (2:00am) to morning (8:00am), exhibiting a clear circadian-like trend in the light/dark preference. As melatonin can mediate circadian clock output and promote sleep in zebrafish, by adding extra melatonin at around 9:00am on the third day, the mean proportion of time fish spent in the dark area was increased significantly. Our results demonstrate that the circadian clock plays a significant role in regulating the light/dark preference in zebrafish, which provides valuable insights into understanding the metabolism mechanism underlying the neurobehavior, and facilitate further studies related to the neurobiology of normal and pathological behavior.","cites":"0","conferencePercentile":"18.18181818"}]}