{"Zeitschrift_fur_Psychosomatisch":[{"venue":"Zeitschrift für Psychosomatische Medizin und Psychotherapie","id":"cc008fb9ba0f523b85d3ac08234829019496445a","venue_1":"Zeitschrift für Psychosomatische Medizin und Psychotherapie","year":"2010","title":"[Operationalized psychodynamic diagnostics (OPD) in patients in a prodromal state of schizophrenia--an explorative study].","authors":"Dorota Uzdawinis, Marc-Andreas Edel, Seza Ozgürdal, Dorothea von Haebler, Marta Hauser, Henning Witthaus, Yehonala Gudlowski, Andreas Heinz, Georg Juckel","author_ids":"7702908, 3975570, 5085181, 6465612, 3455050, 4622878, 2025488, 7137811, 2161957","abstract":"OBJECTIVES\nTo obtain data and hypotheses regarding the amelioration of risk estimation and preventive psychotherapy in patients in a prodromal state of schizophrenia by using OPD.\n\n\nMETHODS\n20 participants with a prodromal condition--6 subjects far from psychosis and 14 close to psychosis--along with 10 patients with paranoid schizophrenia as reference group were examined using the first four OPD axes.\n\n\nRESULTS\nBoth groups differed considerably in all four axes. Compared to the schizophrenic participants, prodromal probands appear to have more favourable preconditions for therapy. Moreover, they experienced the interaction partners, including the investigator, as less aversive and induced less distanced behaviour in the investigator. Conflicts of self-esteem were prominent in both prodromal subgroups. However, patients farther from psychosis showed less conflicts of autonomy versus dependence and displayed a higher integration in structures such as \"defence\" and \"attachment\" when compared to participants closer to psychosis.\n\n\nCONCLUSIONS\nParticularly the differences between the prodromal subgroups suggest that application of the OPD may positively complement previous approaches of early detection, prevention,and psychotherapy for prodromal conditions. The hypotheses obtained should be tested in longitudinal studies with larger sample sizes.","cites":"0","conferencePercentile":"32.14285714"}]}