{"Zentralblatt_fur_Chirurgie.csv":[{"venue":"Zentralblatt fur Chirurgie","id":"8af37f78bae36e623aec630af5d29716d55e8a28","venue_1":"Zentralblatt fur Chirurgie","year":"2008","title":"[Clinical accuracy of fluoroscopic navigation at the thoracic and lumbar spine].","authors":"M Arand, S Teller, F Gebhard, M Schultheiss, P Keppler","author_ids":"6571669, 1720894, 3104078, 6923534, 2886349","abstract":"The aim of the present study was the verification of the accuracy of 2D fluoroscopy-based navigated pedicle screw placements at the thoracic and lumbar spine in a case series of traumatised patients. Within 36 months 111 pedicle screws were instrumented using C-arm based navigation in 29 patients, 60 at the thoracic and 51 at the lumbar spine. All screw positions were evaluated postoperatively by a routine thin-slice CT scan using multiplanar reconstruction. The position of a screw in relation of its pedicle was classified as: a) screw completely intraosseous, b) screw perforated less than thread level and c) screw perforated over thread level. In 34 thoracic (56.7%) and 32 lumbar (62.7%) screws complete intraosseous placement was observed, 14 thoracic screws (23.3%) and 14 lumbar screws (27.5%) perforated less than thread level. Perforations over thread level were found in 12 thoracic (20%) and 5 lumbar (9.8%) screws. Only medial and lateral perforations of the pedicle were documented (without neurological signs), cranial or caudal perforations did not occur. Segmentation of the C-arm navigation into two comparable treatment periods showed a learning curve with a reduction of perforations in the second sequence (after 57 pedicle instrumentations) of about 15%, this was not found to be statistically significant. The fluoroscopic navigation of pedicle screws is a safe procedure at the lumbar spine with equal accuracy compared to the non-navigated conventional instrumentation. Application of C-arm navigation at the thoracic spine showed more inaccuracies, so that 3D-based navigation seems to be more advantageous in this region.","cites":"0","conferencePercentile":"100"}]}