{"Zhejiang_da_xue_xue_bao._Yi_xue":[{"venue":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","id":"8173f309f38b50c5de67793bf89bdf5862481086","venue_1":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","year":"2003","title":"[Surface expression of NMDA receptors composed of NR1 subunit and NR2A subunit mutants with partially deleted C-terminus in HEK293 cells].","authors":"Chan-ying Zheng, Jian-hong Luo, Ting Fu, Wei Yang, Hai-qing Shen","author_ids":"3891393, 2158192, 7994736, 1742383, 7969306","abstract":"OBJECTIVE\nTo examine the potential function of NMDA receptor NR2A subunit C-terminus in assembling and surface expression of the receptor in HEK293 cells.\n\n\nMETHODS\nFive vectors GFP- NR2ADeltaC1- DeltaC5 were constructed for expressing N-terminally GFP-tagged NR2A with C-terminal deletion at different regions by using conventional techniques of molecular cloning. The deleted region for NR2ADeltaC1-Delta C5 was 897L-1017S, 1024D-1142P, 1149D-1347G, 1354S-1464V, and 897L-1464V. These plasmids were transfected alone or co-transfected with NR1-1a into HEK293 cells. The surface NMDA receptors were immuno-stained using rabbit antibody against GFP and Cy3 conjugated secondary antibody in living cells.\n\n\nRESULT\nThe vectors GFP-NR2ADeltaC1-DeltaC5 were generated and all of them expressed GFP fluorescence in the transfected cells. Surface NMDA receptors were detected by immuno-labeling with anti-GFP in the cells co-transfected by NR1-1a and any one of GFP-NR2ADeltaC1-DeltaC5. However, no surface expression of NR2A proteins was found in the transfected cells with any one of these plasmids alone.\n\n\nCONCLUSION\nWithin the region downstream from the 897L of NR2A subunit, neither a particular domain directly interacted with ER retention domain in NR1-1a C1 cassette, nor that determining ER retention of NR2A subunit itself has been found, indicating that more complicated mechanisms might exist in which the subunit assembling and targeting to plasma membrane of NMDA receptors undergo.","cites":"0","conferencePercentile":"42.85714286"},{"venue":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","id":"15af8a6883a918d30d6405c240ffc2550d779042","venue_1":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","year":"2015","title":"[Roles of protein synthesis inhibitors in long-term potentiation and depotentiation in hippocampal CA1 region of adult rats].","authors":"Wen Xie, Kai Meng, Hong Jia, Li Zhang","author_ids":"5754653, 1993889, 1801040, 1712838","abstract":"OBJECTIVE\nTo study the roles of protein synthesis inhibitors in long-term potentiation(LTP) and depotentiation(DP) in hippocampal CA1 region of adult rats.\n\n\nMETHODS\nStandard extracellular recording technique was used to record field EPSP(fEPSP) evoked by Schaffer collateral stimulation from the CA1 subfield of adult rat hippocampal slices. Paired-pulse low-frequency stimulation(PP-LFS) or high-intensity paired-pulse low-frequency stimulation(HI-PP-LFS) was delivered to induce depotentiation 2 h after LTP induction induced by six theta-burst stimulations. Protein synthesis inhibitors were applied before and after LTP induction to study their roles in LTP and DP in hippocampal CA1 region of adult rats.\n\n\nRESULTS\nWhen HI-PP-LFS was applied at 2 h after LTP induction, the depotentiation was induced. The mean fEPSP slopes reduced from 346.2%±26.3% to 207.1%±21.6%. This depotentiation was named as partial LTP depotentiation and maintained at least for 30 min. The percentage of depotentiation was 59.81%. Application of protein synthesis inhibitors, anisomycin and cycloheximide prior to tetanus resulted in smaller LTP compared to control group, and almost complete depotentiation was induced by HI-PP-LFS. With application of protein synthesis inhibitors anisomycin and cycloheximide 90 min after LTP induction, HI-PP-LFS still induced partial LTP depotentiation. However, there was no significant difference in the percentage of depotentiation between this group and control group.\n\n\nCONCLUSION\nHI-PP-LFS partially reverses late phase LTP. When protein synthesis inhibitors are applied prior to tetanus, LTP amplitude is markedly reduced, and HI-PP-LFS completely reverses late-phase LTP. Application of protein synthesis inhibitors after LTP induction does not significantly affect either the amplitude or depotentiation of LTP.","cites":"0","conferencePercentile":"58.33333333"},{"venue":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","id":"29563500eec117289e6ebd7a0a093144bb73c9a7","venue_1":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","year":"2003","title":"[Construction of expression vectors for C-terminally deleted NR2B subunit mutants and their application in the study of assembling of NMDA receptors].","authors":"Wei Yang, Jian-hong Luo, Ying Gao, Man Huang, Chan-ying Zheng","author_ids":"1742383, 2158192, 1765333, 2382939, 3891393","abstract":"OBJECTIVE\nTo investigate the role of NR2B subunit C-terminus in assembling and surface expression of NMDA receptor subtype composed of NR1-1a/NR2B subunits.\n\n\nMETHODS\nEight vectors NR2BDelta1-Delta8) expressing GFP-tagged NR2B subunit mutants with various deletion in the carboxyl-terminal region were generated by conventional molecular cloning techniques. Each of these vectors was transfected alone, or co-transfected with NR1-1a into HEK293 cells. NR1-1a/GFP-NR2B receptors on membrane surface of the living transfected cells were immuno-stained using rabbit antibody against GFP followed by Cy3 conjugated secondary antibody.\n\n\nRESULTS\nThe eight vectors NR2BDelta1-Delta8 were successfully constructed. No surface labeling of GFP-tagged NMDA receptor was found for those transfected cells with NR1-1a, GFP-NR2B, and GFP-NR2BDelta1-Delta8 alone. GFP-tagged NMDA receptors were immuno-stained by anti-GFP for those cells co-transfected by NR1-1a and GFP-NR2B or GFP-NR2BDelta1-Delta6, which were mutants with partially deleted c-terminus at different region. However, positive stained was not found for those cells co-transfected by NR1-1a and GFP-NR2BDelta 7 (lack of most C-terminus and with PDZ binding motif fused with TM4) or GFP-NR2BDelta8 (lack of whole C-terminus).\n\n\nCONCLUSIONS\nThe formation of NR1-1a/NR2B sub-type NMDA receptor requires co-expression and assembling of NR1-1a and NR2B subunits. Shield or inhibition of ER retention motif within C1 cassette of NR1-1a subunit by NR2B subunit when assembling is not dependent on any particular region in NR2B C-terminus.","cites":"0","conferencePercentile":"42.85714286"},{"venue":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","id":"5d2566412ca9d6e3a6e02b695ef501370190fe94","venue_1":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","year":"2003","title":"[Surface expression and co-localization of NMDA receptor and AMPA receptor on dendritic tree of hippocampal neurons in culture].","authors":"Man Huang, Jian-hong Luo, Wei Wang, Shuang Qiu, Wei Yang, Zhan-yan Fu","author_ids":"2382939, 2158192, 1776760, 8309109, 1742383, 7676556","abstract":"OBJECTIVE\nTo investigate the developmental profiles on surface expression and co-localization of NMDA receptor clusters and AMPA receptor clusters on dendrite in cultured hippocampal neurons of rats.\n\n\nMETHODS\nGreen fluorescent protein tagged GluR2 subunit (GFP-GluR2) and FLAG tagged NR2B subunit (FLAG-NR2B) were transfected into cultured hippocampal neurons at 5 days in vitro (DIV5). FLAG-NR2B containing NMDA receptor clusters and GFP-GluR2 containing AMPA receptor clusters expressed on membrane surface were then labeled in living neurons using anti  FLAG mAb/Cy3-conjugated anti-mouse antibody and anti-GFP pAb/Alex488-conjugated anti-rabbit antibody.\n\n\nRESULT\nThe numbers of receptor cluster per 100 microm dendrite in the neurons at DIV7 and DIV19 were 39.7+/-5.0 and 64.7+/-6.1 (P<0.01) for NR2B-NMDAR, 59.1+/-3.3 and 99.7+/-6.4 (P<0.01) for GluR2-AMPAR, and 29.9+/-4.5 and 37.5+/-2.5(P<0.05) for the co-localized, respectively. At DIV7 and DIV19, 75.4% and 57.9% NR2B-NMDAR clusters were co-localized with GluR2-AMPAR; and 50.6% and 37.6% GluR2-AMPAR clusters were co-localized with NR2B-NMDAR, respectively.\n\n\nCONCLUSION\nThe density of NR2B-NMDAR containing and GluR2-AMPAR containing receptor clusters increases during development of hippocampal neurons in culture. Although the co-localized clusters are increased as well in an unit length of dendrite, the extent to which the two receptor clusters are co-localized decreases. These data imply a possible change in the partnership of AMPA receptor subtype and NMDA receptor subtype at newly formed synapses during development.","cites":"0","conferencePercentile":"42.85714286"},{"venue":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","id":"113bbd04c3f739f7275e01cecfdb0b22886a20ad","venue_1":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","year":"2012","title":"[K83 site affects PICK1 PDZ binding ability].","authors":"Yong Feng, Mu Qiao, Yu-ting Lu, Ya-jian Jiang, Na Wang, Li-jun Zhu","author_ids":"8061640, 3047084, 6789342, 7912112, 1806730, 8301663","abstract":"OBJECTIVE\nTo investigate the role of 83 site in interaction of GluR2 C-terminal and PICK1 PDZ domain.\n\n\nMETHODS\nDocking structure of PICK1 PDZ domain with GluR2 C terminal PDZ binding motif was built with computer software. After K83 site was substituted by other amino acid, the structure and binding energy were recalculated; meanwhile, site specific mutants were constructed using wild type full length cDNA as template. Mutants were co-transfected with GluR2 into HEK293T cells. After staining, the distribution of PICK1 and GluR2 were observed under confocal microscope.\n\n\nRESULTS\nWild type PICK1 and GluR2 formed many co-clusters in HEK293T cells as reported by other research groups; but different K83 mutant had different distribution in HEK293T cells.\n\n\nCONCLUSION\nThe K83 site in PDZ domain of PICK1 is important for the interaction between PICK1 and GluR2. Altering lysine will probably change the hydrophobic interactions, the hydrogen bonds or the electrostatic interactions formed between PICK1 PDZ domain and GluR2 C terminal; accordingly, that will change the binding capacity between PICK1 and GluR2 in varying degrees.","cites":"0","conferencePercentile":"45.83333333"},{"venue":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","id":"582803e6669d0293867d620118fc4d51cdf8d2c3","venue_1":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","year":"2012","title":"[Age variations of head-face morphological traits of Hakka in Guangdong province].","authors":"Lian-bin Zheng, Shun-hua Lu, Jin-ping Bao, Yang Wang, Xiao-rui Zhang, Hong Xue, Wen-guo Rong","author_ids":"4192271, 5400741, 4089687, 1747927, 8443839, 2013278, 5037597","abstract":"OBJECTIVE\nTo investigate the age variations of head-face morphological traits of Hakka in Guangdong Province.\n\n\nMETHODS\nThirty-eight physical indices of head and face of 671 Hakka adults (151 urban males, 181 urban females, 162 rural males and 177 rural females) from Meizhou city of Guangdong were investigated. Twelve physical indices of head and face were calculated and counted its indices distributions. The age changes of morphological traits of head and face were analyzed.\n\n\nRESULTS\nWith the age growing, the rate of eyefold of the upper eyelid was increased, and the Mongoloid fold decreased, the direction of eyeslits tended to level, nasal root height dropped, the zygomatic projection was more projected, the eye color turned to lighter, the upper red lips became thinner; medium-sized facial height, nasal height, upper lip skin height, physiognomic ear length, physiognomic ear breadth and breadth of alae nasi were decreased. The index of mouth breadth, morphological facial skin fold were positively correlated with the age. The index of minimum frontal breadth, face breadth, bigonial diameter, interocular breadth, external biocular breadth, lip height, thickness of lips and horizontal head circumference were negatively correlated with the age. With the age growing, morphological facial index and vertical cephalo-facial index was ascending. Moreover, length-height index of head, transverse frontoparietal index, zygomatico-frontal index and lip index were declining.\n\n\nCONCLUSION\nWith the age growing, the head and face measurements, physical indices and the proportion of observed indices have changed in Hakka in Guangdong province.","cites":"0","conferencePercentile":"45.83333333"},{"venue":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","id":"65fc46d75abca2eb5f90197004e590e7c4ffd803","venue_1":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","year":"2011","title":"[Repetitive transcranial magnetic stimulation combined with antidepressant medication in treatment of first-episode patients with major depression].","authors":"Man-li Huang, Yi Xu, Jian-bo Hu, Wei-hua Zhou, Ning Wei, Shao-hua Hu, Hong-li Qi, Ben-yan Luo","author_ids":"2935041, 1734114, 8520680, 7670317, 1683408, 8060005, 5952312, 5436552","abstract":"OBJECTIVE\nTo assess the early therapeutic and cognitive effect of repetitive transcranial magnetic stimulation (rTMS) combined with antidepressant medication in treatment of first-episode patients with major depression.\n\n\nMETHODS\nSixty first-episode depressed inpatients aged 18-45 y, who met the DSM-IV clinical criteria for major depressive episode were randomly assigned to citalopram treatment (20 mg/d) in combination with a two-week period of either rTMS (study group)or sham procedure (control group) on left dorsal-lateral prefrontal cortex (10 Hz, 90% motor threshold). The Hamilton Depression Rating Scale (HAMD) was used to assess the severity of depression. The Wisconsin Card Sorting Test (WCST) and Continuous Performance Test (CPT) were used to assess cognitive function of depression.\n\n\nRESULT\nThe response rate was significantly greater in the study group compared to the control group after treatment (57% compared with 29%,P<0.05). The HAMD scores significantly declined after treatment in two groups, and the study group showed lower scores compared to the control group after 2 weeks (P<0.01). Neuropsychological assessments showed that there was no significant difference between the two groups except for the significant improvement in the categories on WCST in study group compared to the baseline (P<0.05) and the control group (P<0.05)after 2 weeks treatment. No serious event occurred in the patients during the rTMS study.\n\n\nCONCLUSION\n10 Hz rTMS enhances early effects of citalopram and improves cognitive function in first-episode major depressive patients.","cites":"0","conferencePercentile":"45.45454545"},{"venue":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","id":"844cbeb1c9d6f9ee784e5755ca6c96105e4c43e9","venue_1":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","year":"2008","title":"[Different patterns of aversive emotion regulation in homosexual and heterosexual men].","authors":"Shao-hua Hu, Yi Xu, Peng Li, Qi-dong Wang, Jian-bo Hu, Ning Wei, Min-ming Zhang","author_ids":"8060005, 1734114, 1722268, 2230373, 8520680, 1683408, 7979666","abstract":"OBJECTIVE\nTo compare the differences between homosexual and heterosexual men in the pattern of induced aversive emotion regulation.\n\n\nMETHODS\nTen healthy homosexual men and 10 heterosexual men were investigated by functional magnetic resonance imaging under three types of visual sexual stimuli designed by Block. SPM2 software was used for data analysis.\n\n\nRESULTS\nSame levels of negative emotions of homosexual men and heterosexual were induced by female-female and male-male erotic stimuli respectively. Activations of same brain regions including prefrontal gyrus, temporal gyrus, occipital gyrus and cerebellum were observed in two groups. However, there were significant differences in the side of hippocampus and precuneus. Activations of right cingulate cortex were observed in homosexual men, but not in heterosexual men.\n\n\nCONCLUSION\nThere are some differences in the patterns of aversive emotion regulation between homosexual and heterosexual men.","cites":"0","conferencePercentile":"50"},{"venue":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","id":"b858fa17cb3f335e0dc9ef389cf802c48471b8fb","venue_1":"Zhejiang da xue xue bao. Yi xue ban = Journal of Zhejiang University. Medical sciences","year":"2008","title":"[Effect of exogenous androgen on structures of sexually dimorphism nucleus in preoptic area and anteroventral periventricular nucleus before sexual differentiation in female rats].","authors":"Man-li Huang, Ning Wei, Jian-bo Hu, Yi Xu","author_ids":"2935041, 1683408, 8520680, 1734114","abstract":"OBJECTIVE\nTo investigate the effects of androgen on sexually dimorphism nucleus in preoptic area (SDN-POA) and anteroventral periventricular nucleus (AVPV) before sexual differentiation of the brain in female rats.\n\n\nMETHODS\nNeonatal female SD rats (n=12) were randomly divided into two groups: androgen group and control group. Twenty-four hours after birth animals were subjected to intraperitoneal injection of 50 microl of testosterone propionate (TP,10.0 g/L) or aseptic oil as control. The rats were sacrificed 60 days after the injection and the brains were collected for crystal violet staining. LEICA Q Win system was applied in detecting the boundaries of SDN-POA and AVPV, then the volumes of SDN-POA and AVPV were calculated.\n\n\nRESULTS\nThe volumes of SDN-POA in androgen group were significantly larger than those in control group [(16.77+/-2.68) vs (8.99+/-1.42)mm(3)x10(-3), P<0.01], while the volumes of AVPV in androgen group were significantly smaller than those in control group [(9.14+/-1.16) vs (14.62+/-2.80)mm(3)x10(-3), P<0.01].\n\n\nCONCLUSION\nExogenous androgen rendered before sexual differentiation in female rats results in enlargement of SDN-POA volumes and reduction of AVPV.","cites":"0","conferencePercentile":"50"}]}