{"Zhen_ci_yan_jiu__Acupuncture_re":[{"venue":"Zhen ci yan jiu = Acupuncture research","id":"dcae043200a139f7d381e57d97e49643a1d10a55","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2014","title":"[Development of studies on influence of patients' expectations on therapeutic effects of acupuncture and moxibustion interventions].","authors":"Qian Xu, Guang-Xia Shi, Zhao-Xin Li, Lin-Peng Wang, Cun-Zhi Liu","author_ids":"3218981, 5524356, 7718526, 3533815, 7531507","abstract":"The patient's expectations (placebo effects) refer to the anticipation or the belief about what is to be encountered in a consultation in the healthcare system. Currently, it is a hot-spot for researching its influence on clinical outcomes of acupuncture and moxibustion interventions. How to evaluate the magnitude of patients'expectations is a problem needing to be solved urgently at the moment. The authors of the present paper make a summary about researches on the mechanism of expectations. For example, placebo analgesia was related to decreased brain activity in pain-sensitive brain regions (thalamus, insula, and anterior cingulate cortex), and to the increased activity of the prefrontal cortex showed by fMRI, and to the release of endogenous opioids. In addition, the authors also introduce some methods (psychological scales) for assessing expectations and related influencing factors (physicians or acupuncturists, and medical environment) for future research in this area. In the coming clinical trials on acupuncture or moxibustion treatment of clinical disorders, we should further better our experimental design, and try our best to exclude placebo effect-associated or expectation-induced bias of clinical outcomes for confirming the therapeutic effects in the treatment of different clinical problems.","cites":"0","conferencePercentile":"32.35294118"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"398e9abd70ba414145060c8f2e001e679aa37df8","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2013","title":"[Comparative study on effects of electroacupuncture stimulation of Shenmen (HT 7) and Taiyuan (LU 9) on P 300 of event-related potentials and brain electrical activity mapping in healthy young adults].","authors":"Wu-Bin Hu, Ling Hu, Chao-Yang Dong, Rong-Lin Cai, Yi-Ping Zhou, Ke-Ming Wang, Cheng Zhang, Feng Zhou","author_ids":"4160830, 8419146, 3370251, 8006067, 7743178, 7200838, 3585347, 5845482","abstract":"OBJECTIVE\nTo observe the effect difference of electroacupuncture (EA) stimulation of Shenmen (HT 7) and Taiyuan (LU 9) on P 300 of event-related potentials (ERPs) in volunteer subjects, so as to explore functional specificity of acupoints in processing cerebral information.\n\n\nMETHODS\nSixty healthy volunteer college students were randomly and equally divided into Shenmen (HT 7) group and Taiyuan (LU 9) group (30 persons/group). EA (2 Hz, 1 mA) was applied to bilateral Shenmen (HT 7) and Taiyuan (LU 9) for 15 min. The ERPs were acquired by averaging EEG activity following Oddba II auditory tone-double stimuli and brain electrical activity mapping (BEAM) acquired by means of Scan 4.5 collection and analysis system. Data were calculated and analyzed with SPSS 17.0 for Windows. After testing, the subjects were inquired about the perception for acupuncture stimulation and other sensations or psychological activities.\n\n\nRESULTS\nFollowing EA stimulation of both HT 7 and LU 9, the amplitude of P 300 in the ERPs were significantly decreased in comparison with pre-EA stimulation in the same one group (P < 0.01, P < 0.05). No significant changes were found in the latencies of P 300 after EA stimulation of both HT 7 and LU 9 (P > 0.05). But, EA of HT 7 had a slightly stronger effect in shortening P 300 latency. With regard to the potential intensity distribution of BEAM, there were some differences between HT 7 and LU 9 groups. The high potential responses for HT 7 were found mainly in the occipital lobe, and in the left parietal lobe and the right temporal lobe, whereas those for LU 9 were found to mainly disperse in the left occipital lobe and the parietal lobe.\n\n\nCONCLUSION\nEA stimulation of HT 7 and LU 9 has a slight difference on lowering P 300 amplitude of ERPs, and may result in different distribution of the high potential responses in different lobes of the cerebral cortex in healthy subjects. The functional specificity of EA stimulation of different acupoints needs further study.","cites":"0","conferencePercentile":"37.5"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"8b482b1a734a681ddd2f598880bf0f5fb099be8d","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2011","title":"[Effect of acupuncture on heroin cue-induced functional magnetic resonance images in heroin-addicted human subjects].","authors":"Xiao-ge Song, Chuan-fu Li, Ling Hu, Ning Ma, Jian Wang, Nan Li, Xi-liang Li","author_ids":"7499919, 7430804, 8419146, 4476703, 1970312, 1736069, 7824242","abstract":"OBJECTIVE\nTo observe heroin cue-induced changes of cerebral functional magnetic resonance images (fMRI) and the effect of acupuncture of Zusanli (ST 36) on them under craving state in heroin-addicted volunteers.\n\n\nMETHODS\nFourteen male volunteer heroin addicts were recruited in the present study. Brain images were acquired before, during (2 min) and after visualizing heroin (placed in a transparent glass mug) and acupuncture of Zusanli (ST 36) on a 1.5-T Siemens Symphony MRI system equipped with a standard head coil. Acupuncture stimulation was applied to bilateral Zusanli (ST 36) by manipulating a filiform needle at a frequency of about 60 cycles/min and an angle of about 180 degrees for 2 min. The acquired neuroimaging data were analyzed by AlphaSim, AFNI.\n\n\nRESULTS\nDuring heroin-visual stimulation, the markedly activated brain areas (increase of blood oxygen level-dependent signal) of fMRI were bilateral middle frontal gyrus, left cingulate gyrus, bilateral insula, occipital cortex, left cuneus, cerebellum, bilateral thalamus, right hippocampus and right amygdala etc. which are closely related to the human's craving psychological activities. When acupuncture given, meaning processing stronger sensory task, the heroin-addicted subjects showed apparent activation of the brain areas including the right anterior cingulate gyrus, right insula, thalamus, right hippocampal gyrus etc. which activation degrees were significant lower than those of heroin related visual stimulation.\n\n\nCONCLUSION\nAcupuncture of Zusanli (ST 36) can lessen heroin cue-induced activation degree of the brain areas involving psychological craving, suggesting that acupuncture is able to suppress the heroin addiction patients' drug abuse craving.","cites":"0","conferencePercentile":"25"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"1ee3200ba590f55f00f2c339bc2549444730144b","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2009","title":"[Effect of \"Xiusanzhen\" on learning-memory ability and hippocampal somatostatin and arginine vesopressin contents in vascular dementia rats].","authors":"Wen-Min Niu, Zhi-Bin Liu, Xiao-Hang Yang, Xiao-Mei Niu, Yuan Wang","author_ids":"5715883, 1899450, 4226790, 8486150, 1724874","abstract":"OBJECTIVE\nTo observe the effect of electroacupuncture (EA) of \"Xiusanzhen\" [bilateral \"Yingxiang\" (LI 20) + \"Yintang\" (GV 29)] on learning-memory ability and hippocampal somatostatin (SS) and arginine vasopressin (AVP) contents in vascular dementia (VD) rats.\n\n\nMETHODS\nForty SD rats were randomly divided into control, VD model, VD plus olfactory bulb lesion (OBL, destroyed by electro-coagulation) and EA groups, with 10 cases in each. VD model was established by 4-vessel occlusion. Morris maze tests were conducted for evaluating the rats' learning and memory ability. EA (1-3 mA, 80/100 Hz) was applied to bilateral LI 20 and GV 29 in VD + OBL and EA groups for 10 min, once daily (except Saturdays and Sundays) for 6 weeks. The contents of SS and AVP in hippocampus tissue were measured by radioimmunoassay.\n\n\nRESULTS\nIn comparison with control group, the average escape latency (AEL) prolonged significantly and the target-platform crossing times (TPCT) decreased remarkably in VD model group (P < 0.01). In comparison with VD model group, the AEL was shortened and TPCT increased remarkably in EA group (P < 0.01). No significant differences were found between VD model and VD + OBL groups in the AEL and the TPCT (P > 0.05). Hippocampal SS and AVP contents in VD model group were significantly lower than those in control group (P < 0.05), while those in EA group were markedly higher than those in VD model group (P < 0.05). No significant differences were found between VD model and VD + OBL groups in SS and AVP contents (P > 0.05).\n\n\nCONCLUSION\nEA of \"Xiusanzhen\" can improve VD rats' learning-memory ability, which may be related to its effects in raising hippocampal SS and AVP contents and to the intact olfactory pathway.","cites":"1","conferencePercentile":"50"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"2f9eaf9fac70f5aee8059d1513c863af2cdd4dec","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2009","title":"[Effect of \"Xiusanzhen\" on learning-memory ability and hippocampal ChAT and AChE activity in Alzheimer disease rats].","authors":"Zhi-bin Liu, Wen-min Niu, Xiao-hang Yang, Xiao-mei Niu, Yuan Wang","author_ids":"4958525, 8604728, 8314696, 8486166, 1724874","abstract":"OBJECTIVE\nTo explore the effect of \"Xiusanzhen\" [bilateral \"Yingxiang\" (LI 20) + \"Yintang\" (EX-HN 3)] on learning-memory ability and choline acetyl transferase (ChAT) and acetyl cholinesterase (AChE) activity of hippocampus tissue in Alzheimer Disease (AD) rats.\n\n\nMETHODS\nA total of 40 Sprague Dawley rats were randomly divided into control, AD model, AD + olfactory-bulb lesion (OBL, induced by electrocoagulation method) + EA and \"Xiusanzhen\" (AD + EA) groups. AD model was established by 4-vessel occlusion. Morris water maze tests were conducted for evaluating the rat's learning-memory ability. The activity of ChAT and AChE of hippocampus tissue was detected by colorimetric method.\n\n\nRESULTS\nIn comparison with control group, the average escape latency (AEL) prolonged significantly and the target-platform crossing times decreased remarkably in AD model group (P<0.01). In comparison with AD model group, the AEL shortened and the target-platform crossing times increased remarkably in AD + EA group (P<0.01). No significant differences were found between AD model and AD + OBL + EA groups in AEL and the target-platform crossing times (P>0.05). The ChAT and AChE activity of hippocampus in AD model group was significantly lower than that of control group (P<0.05), while that of ChAT and AChE in AD + EA group was significantly higher than that in AD model group (P<0.05). No significant difference was found between AD model and AD + OBL + EA groups in ChAT and AChE activity of hippocampus (P>0.05).\n\n\nCONCLUSION\nEA of \"Xiusanzhen\" can markedly raise the learning-memory ability in AD rats, which may be related to its effect in increasing the ChAT and AChE activity of hippocampus in AD rats. Its therapeutical effect also depends on the intact of the olfactory pathway.","cites":"1","conferencePercentile":"50"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"bb4c9c86e573f2ac7d652b23903ffaa07a86578b","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2012","title":"[Comparison of brain effects of electroacupuncture at Zusanli (ST 36) and Guanyuan (CV 4) shown by fMRI in 21 healthy volunteers].","authors":"Ji-Liang Fang, Xiao-Ling Wang, Yin Wang, Yang Hong, He-Sheng Liu, Jun Liu, Lei Wang, Chao Xue, Ke-Hua Zhou, Ming Song, Bao-Yan Liu, Bing Zhu","author_ids":"7295189, 8415409, 7707864, 1690765, 8424788, 1843598, 1743559, 7503273, 7234888, 1874295, 7648389, 1706560","abstract":"OBJECTIVE\nTo observe different brain effects of electroacupuncture (EA) stimulation of Guanyuan (CV 4) and Zusanli (ST 36) in the normal subjects by using functional magnetic resonance image (fMRI).\n\n\nMETHODS\nTwenty-one healthy volunteers were recruited in the present study. fMRI was used to investigate brain responses [blood-oxygenation-level-dependent (BOLD) signals] to EA stimulation of CV 4 and ST 36. A filiform silver needle was inserted into CV 4 or the left ST 36 randomly in two consecutive fMRI tests, and then manipulated with uniform reducing-reinforcing methods to induce \"Deqi\". fMRI scan was performed before needling, during needle retention, during EA stimulation, and post-EA. Volunteer's subjective needling sensations were recorded after EA. Data of fMRI were analyzed by using software SPM 2 and fMRI was mapped by Degree Centrality Measure method for whole brain correlation. The activation, deactivation, short-distance and long-distance functional connectivity maps of cerebral regions were investigated.\n\n\nRESULTS\nThe fullness and numbness feelings of the subjects were stronger during EA at ST 36 than at CV 4. EA at ST 36 or CV 4 induced apparent similar deactivation effects in the anterior cingulate and medial prefrontal cortices. The default mode of the brain at rest state was modified by needle retention and EA stimulation, respectively. The functional brain network was significantly changed after EA. The instant post-acupuncture effects (enhancement of the shortdistance functional connectivity) were mainly found in the ventral medial prefrontal cortex (VMPF) and ventral anterior cingulate cortex (vACC) in the limbic-paralimbic-neocortical network, and there were a little bit stronger signals in ST 36 than in CV 4. CONCLUSION\" EA stimulation of CV 4 and ST 36 induces a similar modulation effect in the limbic-medial prefrontal network in healthy subjects.","cites":"1","conferencePercentile":"60.52631579"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"fb44c32c037cf8da7c222ed2ca6c2a9976a05922","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2013","title":"[Effect of electroacupuncture stimulation of \"Huantiao\" (GB 30) on walking ability and touch sensation in rabbits with lumbar intervertebral disc protrusion].","authors":"Zong-Bao Yang, Xiang Wu, Yu-Feng Xie, An Gong, Qing Yang, Chen-Guang Wang, Qiong Liu","author_ids":"8387320, 7917109, 7767681, 7828752, 1719352, 8205809, 1794500","abstract":"OBJECTIVE\nTo observe the effect of electroacupuncture (EA) stimulation of \"Huantiao\" (GB 30) on the walking ability and touch sensation in rabbits with lumbar intervertebral disc protrusion (LIDP).\n\n\nMETHODS\nForty New Zealand rabbits were equally randomized into normal control, model, EA-GB 30 and EA-non-acupoint groups. The LIDP model was established by surgical operation under anesthesia. EA (30 Hz/100 Hz, 2-4 V, 0.5 ms in pulse duration) was applied to bilateral \"Huantiao\" (GB 30) or non-acupoint. The rabbits' walking ability was assessed according to a 4-points scoring standard: 0 point: complete paralysis; 1 point: paralysis with muscular contraction and mild joint movement; 2 points: weaker strength of the affected limbs with bradykinesia and instable walking; 3 points: able to walk with only interphalangeal joint dyskinesia; 4 points: complete recovery. The rabbit's touch sensation was assessed according to another 4-points scoring standard: 0 point: no any response to cotton swab stimulation; 1 point: very mild response; 2 points: sluggish response; 3 points: relatively swifter response but weaker than the healthy limb; 4 points: normal. The ultrostructure changes of the sciatic nerve were analyzed by transmission electron microscope.\n\n\nRESULTS\nFollowing modeling, the scores for walking ability and touch sensation were significantly reduced in the model, EA-GB 30 and EA-non-acupoint groups (P < 0.01). While compared with the model group, both walking ability score and touch sensation score of the EA-GB 30 group were obviously increased (P < 0.01), rather than in the EA-non-acupoint group. Outcomes of the ultrastructure showed that in the model group, extensive onion-like state of the myelin sheath of the sciatic nerve fibers, shrink or disappearance of the axon, kytoplasm edema or lysis of Schwann cells tending to necrosis, and mitochondrium vacuolization of the Schwann cells were found. In the EA-GB 30 group, majority of the nerve fibers and vascular endothelium were normal, with delamination and vacuolization of partial myelin sheath, edema of partial mitochondria and vacuolization of Schwann cells were found. In the EA-non-acupoint group, delamination and twist of partial myelin sheath, Schwann cellular plasma edema and mitochondrial edema of the axon with vacuolization change were found, suggesting a poorer effect of EA of non-acupoint.\n\n\nCONCLUSION\nEA-GB 30 can improve LIDP rabbits' walking ability and touch sensation function and reduce ultrastructure of sciatic nerve.","cites":"0","conferencePercentile":"37.5"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"ecca414495bb8b01a0269072ccdb9e118dd51bc9","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2014","title":"[Effect of electroacupuncture intervention on levels of SOD, GSH, GSH-Px, MDA, and apoptosis of dopaminergic neurons in substantia Nigra in rats with Parkinson's disease].","authors":"Jing Li, Li-Na Wang, Hong-Ling Xiao, Xia Li, Ji-Jun Yang","author_ids":"1742253, 7974697, 7917439, 1698137, 7788115","abstract":"OBJECTIVE\nTo observe the effect of electroacupuncture (EA) on superoxide (SOD), glutathione peroxidase (GSH-Px) activity, contents of glutathione (GSH) and malondiadehyde (MDA), and expression of tyrosine hydroxylase (TH) and apoptosis of Dopaminergic (DA) neurons in Substantia Nigra of rats with Parkinson's disease (PD).\n\n\nMETHODS\nAdult male Wistar rats were randomly divided into normal (10 rats), model (11 rats), EA (11 rats) and medication (11 rats) groups. The PD model was established by i.h. of Rotenone (0.8 mg/kg) for 28 days. EA stimulation (2 Hz/80 Hz, 2 mA) was applied at \"Baihui\" (GV 20), \"Sanyinjiao\" (SP 6) and \"Taichong\" (LR 3) acupoints for 10 min, once per day for 14 times. For rats in the medication group, Madopar suspension fluid (1.67 mg/kg) was given by gavage for 14 days. Xanthine oxidase method and colorimetric ana- lysis method were used to examine the SOD, GSH-Px activity and contents of GSH and MDA in the Substantia Nigra tissue of the right brain, respectively. Immunohistochemical technique was used to detect the TH positive neurons and TUNEL method was used to examine the apoptosis of DA neurons of the Substantia Nigra in the left brain.\n\n\nRESULTS\nFollowing the intervention, the decreased SOD and GSH-Px activity, GSH contents, and the increased MDA content of the Substantia Nigra in PD rats were obviously reversed by EA intervention (P < 0.05) but not by medication except MDA content (P > 0.05). In comparison with the model group, the decreased TH immunoactivity, and the increased numbers of apoptotic cells of DA neurons were apparently suppressed in both EA and medication groups (P < 0.05), but without significant differences between the EA and the medication groups (P > 0.05). In addition, HE stain showed that EA intervention could improve PD-induced impairment of Substantia Nigra neurons (mild swelling of neurons with large nucleus and deranged fibers).\n\n\nCONCLUSION\nEA intervention can reduce pathological changes of Substantial Nigra in PD rats, which is probably associated with its effects in up-regulating the SOD and GSH-Px activity, GSH contents, and down-regulating MDA level, and reducing the apoptosis of DA neurons of the Substantia Nigra, suggesting an anti-oxidative stress effect of EA therapy.","cites":"1","conferencePercentile":"82.35294118"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"8271e05141b6bde1f79fb6e49171abac7e26d951","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2013","title":"[Review of studies on Deqi of acupuncture mainly in foreign countries].","authors":"Chi Lin, Hong-wen Yuan, Peng Zhang, Yu-qi Liu, Chun-hua Li, Jing Li, Si-yuan Xin, Dan-dan Qi, Jiang Zhu","author_ids":"7528951, 7740793, 1678443, 7894815, 4423009, 1742253, 8485757, 7418646, 1789246","abstract":"UNLABELLED\nDeqi (needle sensation), is closely related to clinical therapeutic effect of acupuncture in the treatment of different clinical conditions. In the present paper, the authors summarized various components or concepts of Deqi mainly in the foreign studies collected from Pubmed database. At present, foreign researches about Deqi mainly include 1) the subjects' subjective qualitative and quantitative descriptions about Deqi, 2) correlation between acupuncture stimulation induced Deqi and clinical therapeutic effects, and 3) responses of different brain regions or the connectivity of brain network shown by functional magnetic resonance imaging (fMRI) during Deqi by needling different acupoints. According to the current commonly used 6 questionnaires, aching, tingling, numbness, heaviness, dull pain, throbbing, and deep pressure sensation are the most frequently seen components of Deqi of acupuncture stimulation. The factors influencing Deqi are psychological state, personal previous experience and cultural background. Regarding the degree of Deqi and clinical effects or outcomes, the conclusions are controversial.\n\n\nRESULTS\nof fMRI analysis shows that in spite of extensive deactivation of the limbic system has been found in many studies, and the connectivity of the intrinsic brain functional networks is increased during acupuncture-induced Deqi, the significance of activation or deactivation of some brain regions remains unclear, and the related mechanisms need to be studied further. No matter activation or deactivation of different brain regions during Deqi, the most important issue is the relationship between Deqi and clinical therapeutic effects. Further studies are definitely needed.","cites":"0","conferencePercentile":"37.5"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"88393f4099f697438d27c6418ade39c323aea1a2","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2014","title":"[Effect of acupoint catgut-embedding therapy on changes of structure of hippocampal neurons in senile chronic stress rats].","authors":"Xin-Hui Bian, Hong Zhang","author_ids":"4938293, 1734058","abstract":"OBJECTIVE\nTo observe the effect of chronic stress stimulation on aging and the effect of acupoint catgut-embedding therapy on structural changes of hippocampal pyramidal neurons in senile chronic stress rats, so as to reveal its mechanisms underlying resisting senility.\n\n\nMETHODS\nForty-eight male SD rats were randomly divided into normal control, senility model, senility + stress and senility + stress + catgut-embedding (catgut-embedding) groups (n = 12 in each group). Senility model was established by intraperitoneal injection of D-galactose liquor, once daily for 8 weeks; and chronic stress was produced by restricting the rat in an inmovable cylinder for 1-4 h progressively, once daily for 4 weeks. Catgut embedment (0.4-0.6 cm in length) was applied to \"Baihui\" (GV 20) and \"Shenshu\" (BL 23), \"Neiguan\" (PC 6) and \"Ganshu\" (BL 18) alternatively by using a surgical needle, once a week, 8 weeks altogether. The brain tissue containing hippocampus was cut into sections to be stained with H.E. technique, and the number of the hippocampal pyramidal neurons of CA 3 region was counted under optical microscope. The ultrastructure of pyramidal neurons in the left CA 3 region of the hippocampus was observed by electron microscope (2 rats for each group).\n\n\nRESULTS\nCompared with the normal control group, the numbers of hippocampal pyramidal neurons in the senility model group and senility + stress group were remarkably decreased (P < 0.05, P < 0.01). The number of pyramidal neurons was obviously fewer in the senility + stress group than in the senility model group (P < 0.01). In comparison with the senility + stress group, the number of pyramidal neurons in the catgut-embedding group was considerably increased (P < 0.01). Results of optical microscope showed that the pyramidal cells were sparse in the senility model and very sparse in the senility + stress group, and relatively richer in the catgut-embedding group. Findings of the electron microscope displayed that the pyramidal neurons presented an injured state including shrank soma, pyknosis of the cellular nucleus, atrophia of nucleoli, onglobation of intranuclear caryotin, decreased glycogen granules, etc. in the senility model group, and an extremely irregular shape, partial apoptosis, severer pyknosis of the cellular nucleus, more edema blank regions, etc. in the senility + stress group. These situations of pyramidal cells in the hippocampal CA 3 region were relatively milder in the catgut-embedding group.\n\n\nCONCLUSION\nChronic stress may aggravate the damage of hippocampal pyramidal neurons in senile rats, which can be improved by catgut-embedding therapy.","cites":"0","conferencePercentile":"32.35294118"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"5089686ab65e51afa664d6ea628b96b892266cbc","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2014","title":"[Achievements and enlightenment of modern acupuncture therapy for stroke based on the neuroanatomy].","authors":"Li-Fang Chen, Jian-Qiao Fang, Lu-Ni Chen, Chao Wang","author_ids":"2946155, 1960913, 7628324, 6250419","abstract":"Up to now, in the treatment of stroke patients by acupuncture therapy, three main representative achievements involving scalp acupuncture intervention, \"Xing Nao Kai Qiao\" (restoring consciousness and inducing resuscitation) acupuncture technique and nape acupuncture therapy have been got. Regarding their neurobiological mechanisms, the scalp acupuncture therapy is based on the functional localization of the cerebral cortex, \"Xing Nao Kai Qiao\" acupuncture therapy is closely related to nerve stem stimulation, and the nape acupuncture therapy is based on the nerve innervation of the regional neck-nape area in obtaining therapeutic effects. In fact, effects of these three acupuncture interventions are all closely associated with the modern neuroanatomy. In the treatment of post-stroke spastic paralysis, cognitive disorder and depression with acupuncture therapy, modern neuroanatomical knowledge should be one of the key theoretical basis and new therapeutic techniques should be explored and developed continuously.","cites":"1","conferencePercentile":"82.35294118"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"63a0bdaf375e4e2c600305e6244d7d44f4688cd6","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2014","title":"[Effect of manual acupuncture stimulation of \"Baihui\" (GV 20) and \"Dazhui\" (GV 14) on contents of 5-HT, dopamine and ACh and expression of 5-HT mRNA, DA mRNA and AChE mRNA in the hippocampus in methamphetamine addiction rats].","authors":"Shuang Yu, Ling Chen, Xing-hui Cai, Xiao-ge Song, Yue Zhang, Yang Zhang, Rui Song, Yi-fang Li","author_ids":"8193246, 1717165, 7298119, 7499919, 2764445, 8633909, 2090171, 7771471","abstract":"OBJECTIVE\nTo observe the effect of manual acupuncture stimulation on changes of hippocampal monoamine neurotransmitter levels and expression of 5-hydorxytryptamine (5-HT) mRNA, dopamine (DA) mRNA and acetylcholine esterase (AChE) mRNA in methamphetamine addiction rats, so as to explore its mechanism underlying improvement of drug addiction.\n\n\nMETHODS\nSD rats were randomly divided into normal control, model and manual acupuncture groups (n=10 in each group). Drug addiction model was established by i.p. of methamphetamine (5 mg/kg), once a day for 15 days. Manual acupuncture stimu- lation was applied to \"Baihui\" (GV 20) and \"Dazhui\" (GV 14) once daily for 10 days. The contents of hippocampal 5-HT, DA, acetylcholine (ACh), AChE were measured by ELISA. The expressive Ilieels of hippocampal 5-HT mRNA, DA mRNA and AChE mRNA were determined by fluorescence quantitative RT-POR.\n\n\nRESULTS\nIn comparison with the normal control group, the con- tents of 5-HT, DA, ACh and AChE and the expression levels of 5-HT mRNA, DA mRNA and AChE mRNA were significantly increased in the model group (P<0.01, P<0.05). After acupuncture intervention, the levels of the above-mentioned 7 indexes were uniformly and significantly down-regulated in the manual acupuncture group (P<0.01, P<0.05).\n\n\nCONCLUSION\nManual acupuncture stimulation of GV 20 and GV 14 can adjust methamphetamine addiction-induced changes of some hippocampal monoa- mine neurotransmitters and expression levels of 5-HT, DA and AChE genes.","cites":"0","conferencePercentile":"32.35294118"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"144839a931d3b943fd47cc53af9cbcf359c901e1","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2012","title":"[Effects of acupuncture clinical practice on finger fine touch of practitioners].","authors":"Jing Li, Xiao Sun, Mary X Wu","author_ids":"1742253, 1685943, 2436943","abstract":"OBJECTIVE\nTo observe the effect of clinical acupuncture practice on practitioners finger fine touch, so as to analyze the perceptive procedure of the arrival of qi and to explore its key factors.\n\n\nMETHODS\nFifteen healthy acupuncturists and 15 healthy non-acupuncturists volunteers were recruited in the present study. All the participants were ordered to take a sitting position in a quiet room and to have their eyes covered with two eyeshades first. Then, they were asked to receive two general sensory-perceptual acuity tests: the von Frey hair tests for measuring their cutaneous sensation threshold and two-point discrimination tests of the thumb, index and middle fingers of both hands.\n\n\nRESULTS\nIn acupuncturists, the average cutaneous sensation thresholds of the thumb and index finger of the handedness and the average two-point discrimination thresholds of the thumb, index finger and the middle finger of the handedness were lower than those of the handedness in non-acupuncturists in spite of no significant differences (P > 0.05). In addition, in acupuncturists, the average cutaneous sensation thresholds of the thumb and index finger and the average two-point discrimination thresholds of the thumb, index finger and the middle finger of the handedness were also slightly lower than those of their non-handedness. While in the non-acupuncturists, both the average cutaneous sensation thresholds and the average two-point discrimination thresholds of the thumb, index finger and the middle finger of the handedness and non-handedness were comparable.\n\n\nCONCLUSION\nThe acupuncturists' finger fine touch of the handedness is relatively more sensitive than that of non-acupuncturists, suggesting an increase of the sensitivity of fingers in perceiving \"Deqi\" through long-term acupuncture clinical practice.","cites":"1","conferencePercentile":"60.52631579"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"f50d5f456aba6a0470e23d5c5a081f98ebd3585f","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"1993","title":"[Preliminary observations on junctional intercellular communication in the epidermis of the adult mammal skins].","authors":"D Chen, L Wang, Y Zheng, B Wu, X Hu","author_ids":"1684578, 2584011, 1713117, 2901500, 2455540","abstract":"1. Shown by the sagittal cryostat-microsections, the epidermis of the adult mouse and rabbit skins consisted of 3-4 layers of cells, occupying about 40 mu in thickness. When advancing a penetrating microelectrode from the surface of the epidermis vertically downward into its depth, the cell membrane potentials of these layers in series, being -4---8mv, -6---20mv, -12---20mv, -12---20mv, respectively, could be got. These potentials, in turn, could be used to mark the proper insertion of the electrode in cell of a desired layer. Beyond the depth of 40 mu usually no membrane potential was met. 2. Microinjection of carboxyfluorescein (CoF) into cell in the first (shallowest) epidermal layer, no matter how long the injection time was, produced restricted dye transfer-only to 1 or 2 neighbor cells. Transfer to 3-5 neighbor cells would be seen in 15 min. after 7 min. of CoF injection into cell in the 2nd layer, and this number would slowly increased if the injection time was further prolonged. Similar CoF injection into cell in the 3rd or 4th (Malpighi) layer resulted in dye transfer to 20-40 neighbor cells. Most testing injections in this work have been done to cells in the 3rd epidermal layer.(ABSTRACT TRUNCATED AT 250 WORDS)","cites":"0","conferencePercentile":"37.80487805"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"a91c448b4a87781338ab840dc1bdbf2b84652e0f","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2013","title":"[Effect of acupuncture stimulation of Zusanli (ST 36) on cerebral regional homogeneity in volunteer subjects with different constitutions: a resting-state fMRI study].","authors":"La-Mei Li, Fa-Jin Lü, Zhong-Jie Guo, Yun-E Song, Hong-Wu Xie, Xi Tang, Yi Ren, Xue-Zhi Li","author_ids":"8447432, 5819487, 8163095, 8280807, 8304246, 8573862, 1695032, 7823576","abstract":"OBJECTIVE\nTo observe the synchronism difference of brain region activities in response to acupuncture stimulation of Zusanli (ST 36) in healthy volunteer subjects with different acupuncture analgesia sensitivity, so as to study the central factors influencing acupuncture intervention outcomes.\n\n\nMETHODS\nForty-five healthy volunteer subjects with different constitutions (different sensitivities in response to needling stimulation) were divided into insensitive group, normal group and sensitive group (n = 15). The pressure pain threshold (PPT) of the Zusanli (ST 36) region before and after acupuncture stimulation of ST36 was assessed using visual analog scale (VAS). Two weeks later after acupuncture stimulation of ST 36, resting-state fMRI images were acquired by using a nuclear magnetic resonance imaging system and analyzed by using DPARSFV 2.1 software package, software SPM 8 and REST 1.7. The cerebral regional homogeneity (ReHo) of the subjects was then calculated by Resting-State fMRI Data Analysis Toolkit (REST).\n\n\nRESULTS\nCompared with pre-acupuncture, PPT levels of the normal and sensitive groups were significantly increased after acupuncture of ST 36 (P < 0.05), and that of the insensitive group had no significant change (P > 0.05). Following acupuncture stimulation of ST 36, the insensitive group only showed a significant decreased ReHo in the left fusiform gyrus, left inferior temporal gyrus, bilateral postcentral gyrus, and left anterior central gyrus. In the normal group, a significantly increased ReHo was found in left brainstem, the right cerebellum posterior lobe, right parahippocampa gyrus, right fusiform gyrus, left angular gyrus, temporal lobe and the left frontal lobe; and a significantly decreased ReHo in the occipital lobes and the right superior temporal gyrus after acupuncture stimulation of ST 36. In the sensitive group, a markedly increased ReHo was found in the left brainstem, bilateral cerebellum posterior lobes, left inferior temporal gyrus, basal ganglia, the left insular lobe, anterior cingutate, frontal lobe, inferior parietal lobule, and the right supplementary motor area, and an obviously decreased ReHo found in the bilateral occipital lobes, fusiform gyrus, posterior central gyrus, the right posterior cingutate, the left temporal lobe and the left paracentral lobule, etc. after acupuncture of ST 36.\n\n\nCONCLUSION\nConstitution-associated needling sensation may be an important influential factor for acupuncture analgesia in normal subjects. The change of ReHo in different cerebral areas is probably responsible for the difference of acupuncture analgesia in different constitution people.","cites":"0","conferencePercentile":"37.5"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"7edea773b857648d924c6808d050fa918705451a","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2009","title":"[Dense innervation of acupoints and its easier reflex excitatory character in rats].","authors":"Ke Liu, Ai-hui Li, Wei Wang, Yi-kuan Xie","author_ids":"1710608, 7532111, 1706612, 2248445","abstract":"OBJECTIVE\nTo study the innervating character of tissues around the acupoints and along the meridian course and to analyze the reflex activity correlation between acupuncture points in a given meridian in the rat.\n\n\nMETHODS\nForty Wistar and 15 SD rats were used in this study. Electrical activities of microfilaments of the afferent nerves (deep tibial nerve, peroneal nerve and the lateral cutaneous nerve of the leg) were observed for identifying their receptive field and the type of nerve fibers. Nerve stem-antidromic stimulation induced Evan's blue extravasation method was employed to compare the difference of the nerve ending distribution in the acupoint area and non-acupoint area. The reflex activities evoked by electric stimulation of the acupoint were used to analyze the interrelation between acupoint and meridian.\n\n\nRESULTS\nFindings showed that a great majority of the afferent nerve endings supplying the tibialis anterior/rectus femoris muscle and the foot skin distributed in an uneven pattern in the sites being in accord with acupoints or with the orbit of meridians. Antidromic stimulation of C-fibers in the deep tibial nerve evoked extravasation of Evan's blue from the plasma into the interstitial fluid, blue foci appeared at the acupoints of the Stomach Meridian and along the orbit of the Stomach Meridian. The special distribution of the afferent nerve endings in the acupoint was also associated with the special reflex activity originating from the acupoints of the muscle group of a given meridian.\n\n\nCONCLUSION\nThe acupoint is an excitable muscle/skin-nerve complex with greatest concentration of nerve endings. The meridian consists of acupoints that possess a close interaction in physiological reflex activities.","cites":"2","conferencePercentile":"85.29411765"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"aec22d085377559cebc1f59da8415fa448b4b2cd","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2011","title":"[Electroacupuncture at Guanyuan (CV 4) and Zhongwan (CV 12) modulates functional connectivity of the brain network in healthy volunteers].","authors":"Ji-liang Fang, Yang Hong, Xiao-ling Wang, He-sheng Liu, Yin Wang, Jun Liu, Lei Wang, Chao Xue, Ke-hua Zhou, Ming Song, Bao-yan Liu, Bing Zhu","author_ids":"7295189, 1690765, 8415502, 8425045, 7707864, 1843598, 1743559, 7503273, 7235022, 1874295, 7648395, 1706560","abstract":"OBJECTIVE\nTo observe the specific brain effects of electroacupuncture (EA) stimulation of Guanyuan (CV 4) and Zhongwan (CV 12).\n\n\nMETHODS\nTwenty-one healthy volunteers were recruited in the present study. Two silver filiform needles were separately inserted into Guanyuan (OV 4) or Zhongwan (CV 12), and manipulated with uniform reducing-reinforcing method to induce \"Deqi\". fMRI scan was performed before needling, during needle retention, EA stimulation, and post-EA. Data of fMRI was analyzed by using software SPM 2. The volunteer subjective needling sensations were recorded. The activation, deactivation, short-distance and long-distance functional connectivity maps of different cerebral regions were analyzed by using whole brain correlation analysis.\n\n\nRESULTS\nComparison between the two acupoints showed that fullness feeling was stronger in CV 4 than in CV 12. EA at CV 4 and CV 12 induced a similar stronger and prevalent deactivation in the ventral medial prefrontal cortex and the anterior cingulated cortex (ACO). The deactivation of the ACC was stronger in the CV 4 group than in the CV 12 group. The default BOLD mode of the brain at rest was modified by needle retention and EA, respectively. The short-distance functional connection brain network was significantly changed after EA. Interestingly, the ventral medial prefrontal cortex and anteroinferior portion of the anterior cingulate cortex in the limbic-paralimbic-neocortical network (LPNN) were involved in the instant post-effects of EA. Relatively smaller differences in the brain functional activity and short-distance functional connectivity were found between these two acupoints.\n\n\nCONCLUSION\nEA of CV 4 and CV 12 can modulate short-distance functional connectivity of the LPNN, and have fewer differences in inducing needling sensation and deactivation of ACC, etc.","cites":"2","conferencePercentile":"88.88888889"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"6625853d95b2dc96ac6a45b1783ff4f49483639a","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2009","title":"[Effect of electroacupuncture of different acupoints on the excitability of detrusor muscle and the expression of BDNF and TrkB in the spinal cord of rats with urinary retention due to spinal cord injury].","authors":"Jun-hua Wang, Bang-guo Chen, Jing Yin, Gang Wang, Wei-Geng Zou, Xiao-juan Luo","author_ids":"7897941, 8567698, 8307145, 4148672, 8533135, 8104281","abstract":"OBJECTIVE\nTo observe the effect of electroacupuncture (EA) of different acupoints on the expression of brain-derived neurotrophic factor (BDNF) and tropomyosine receptor kinase B (TrkB) in the spinal cord and the excitability of detrusor muscle of the uninary bladder in rats with urinary retention owing to spinal cord injury (SCI).\n\n\nMETHODS\nA total of 100 female SD rats were randomly divided into normal, sham-operation (sham), model, EA-Guanyuan (CV 4), and EA-Shuidao (ST 28) groups, with 20 cases in each. SCI induced urinary retention model was established by using weight dropping method. EA (1 mA, 2 Hz/15 Hz) was applied to \"Guanyuan\" (CV 4) and \"Shuidao\" (ST 28) respectively for 20 min, once a day for 10 days. The excitability (tone, contraction frequency) of the detrusor muscle of the bladder was detected in vitro by using electrophysiological method, and the expression of BDNF and TrkB in spinal cord was determined by immunohistochemistry staining.\n\n\nRESULTS\nIn comparison with normal control and sham groups, the tension and the contraction frequency of detrusor muscle in model group lowered significantly (P<0.05), while compared with model group, both the tension and contraction frequency of detrusor muscle increased pronouncedly in EA-CV 4 and EA-ST 28 groups (P<0.05), and the effect of EA-CV 4 was apparently superior to that of EA-ST 28 (P<0.05). In comparison with normal and sham groups, the BDNF and TrkB immunoreaction positive cells in the spinal cord were significantly more in model group (P<0.05). Compared with model group, those of EA-CV 4 and EA-ST 28 groups were obviously further increased (P<0.05), and the effect of EA-CV 4 group was markedly superior to that of EA-ST 28 group (P<0.05).\n\n\nCONCLUSION\nEA of CV 4 and ST 28 can raise the excitability of the smooth muscle of the uninary bladder in rats with SCI-induced urinary retention, which may be related to its effects in upregulating the expression of BDNF and TrkB in the spinal cord. The effects of EA of CV 4 were evidently superior to those of EA of ST 28.","cites":"4","conferencePercentile":"100"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"c6c66fbe410a9b28ee337adf9cb471b9afed93d8","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2015","title":"[Effect of Electroacupuncture Stimulation of \"Baihui\" (GV 20) , etc. on Changes of Behavior and Plasma Ghrelin Content in Depression Rats].","authors":"Xiao-cang Zhu, Hui-jie Huang, Qiu-qin Han, Na Yue, Bing Li, Liu Yang, Qiong Liu, Gen-cheng Wu, Jin Yu","author_ids":"8361790, 7192737, 7825059, 5309018, 7137749, 1745614, 1794500, 2805857, 3692953","abstract":"OBJECTIVE\nTo observe the effect of electroacupuncture (EA) stimulation of \"Baihui\" (GV 20) + \"Anmian\" (EX-HN 16) and \"Baihui\" (GV 20) + \"Zusanli\" (ST 36) on behavior reactions and plasma ghrelin level in depression rats, so as to explore the correlation between its antidepressant effect and plasma ghrelin level.\n\n\nMETHODS\nA total of 45 SD rats were randomly divided into 5 groups: normal control, model, Baihui (GV 20) + Anmian (EX-HN 16), Baihui (GV 20) + Zusanli (ST 36) and medication (clomipramine) groups, with 9 rats in each group. The depression model (unpredictable chronic mild stresses, UC-MS) was established by giving the animals with higher temperature environment (45 °C, 5 min), forced ice-water swimming (0- 4 °C, 5 min) , day and night reversal environment (12 h), stroboflash stimulation (12 h), noisy stimulation (12 h), rocking-bed movement (30 min) and damp pad dwelling (6-24 h), etc. for 4 weeks. EA was applied to GV 20-EX-HN 16, and GV 20-ST 36 for 30 min once every other day for 4 weeks after modeling. For rats of the medication group, clomipramine (5 mg/kg) was given (i. p. ) once a day for 4 weeks after modeling. The forced swimming test, sucrose preference test and open field test were used to evaluate the rats depressive-like behavior. Plasma ghrelin content was assayed by ELISA.\n\n\nRESULTS\nAfter exposure to UCMS for 4 weeks, the immobility time was significantly increased, and the struggling time was significantly decreased in the model group (P < 0.05, P < 0.01). In comparison with the model group, the immobility time levels were obviously decreased, while the struggling time and sucrose preference were markedly increased in the Baihui (GV 20) + Anmian (EX-HN 16) , Baihui (GV 20) + Zusanli (ST 36) and medication groups (P < 0.05, P < 0.01). No significant changes were found in the rearing times and total distance of open-field test (locomotor activity) and plasma ghrelin content among the 5 groups among all the groups (P > 0.05). No significant differences were found among the two EA and medication groups in the decreased immobility time and the increased struggling times and sucrose preference levels (P > 0.05).\n\n\nCONCLUSION\nEA intervention can improve the depression rats' hopeless behavior of forced swimming test and anhedonia behavior (sucrose preference test) , which may be not correlated to plasma ghrelin level at the late-stages and the antidepressant effect of EA intervention.","cites":"0","conferencePercentile":"54.54545455"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"cf0fa3ca7d62b3e7562b9e1ace6fe1f7e15b1a74","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2013","title":"[Research on action features of acupuncturist experts' acupuncture needle twirling skills].","authors":"Jing Li, Lawrence Grierson, Mary X Wu, Ronny Breuer, Bin Zhou, Heather Carnahan","author_ids":"1742253, 2284899, 2436943, 6526293, 1740033, 2325307","abstract":"OBJECTIVE\nTo observe the features of acupuncture needle twirling manipulations in order to promote the development of objective and quantitative performance standards of acupuncture manipulation.\n\n\nMETHODS\nTwelve expert acupuncturists and 12 novices were enrolled in this study. Everyone of them was instructed to perform 10 trials of the uniform reinforcing and reducing technique of acupuncture on an artificial skin-pad that was mounted to a six-axis force transducer and each subject had his or her dominant hand index finger affixed with an infrared light emitting diode for acquiring parameters of acupuncture needle manipulation. The force transducer was used to measure the force the participant applied as they held an acupuncture needle to stimulate the skin-pad, and at the mean time, an optoelectric camera was employed to measure the position of the diode.\n\n\nRESULTS\nIn comparison with the expert acupuncturist group, the straggling coefficient of needle-twirling frequency was significantly bigger in the novice group (P < 0.01), suggesting a higher consistency in the trial-by-trial needle-twirling operation of the expert acupuncturists. Comparison of the needle-twirling force showed that the force values of the Z-axis in both expert group and novice group were considerably higher than those of the X-axis and Y-axis in the same one group (P < 0.01). The time of pre-needle-twirling of the novice group was markedly longer than that of the expert group (P < 0.01), suggesting a skilled operation technique of the expert acupuncturists. No significant differences were found between the expert acupuncturist group and novice group in the needle-twirling amplitude, frequency, force and total operation time (P > 0.05).\n\n\nCONCLUSION\nMovement frequency consistency and temporal efficiency are the action features of expert acupuncturists in performing the uniform reducing-reinforcing twirling skill, which differentiates the performances of experts from novices. The assessment and training of this acupuncture skill should focus on these kinematic features.","cites":"1","conferencePercentile":"85.41666667"},{"venue":"Zhen ci yan jiu = Acupuncture research","id":"8a5c5e062def082a5c8e51776cb8040e7b3591d6","venue_1":"Zhen ci yan jiu = Acupuncture research","year":"2013","title":"[Effect of electroacupuncture on expression of phosphorylated P 38 MAPK and IL-1beta in frontal lobe and hippocampus in rats with Alzheimer's disease].","authors":"Jian-Qiao Fang, Shu-Xiu Zhu, Ying Zhang, Fang Wang, Qing-Yan Zhu","author_ids":"1960913, 5910074, 1752812, 1713374, 7703049","abstract":"OBJECTIVE\nTo observe the effect of electroacupuncture (EA) intervention on expression of phosphorylated mitogen activated protein kinase-P 38 (p-P 38 MAPK) protein and Interleukin 1beta (IL-1beta)mRNA in the frontal lobe and hippocampus in Alzheimer's disease (AD) rats so as to explore its mechanisms underlying improvement of AD in clinic.\n\n\nMETHODS\nThirty-two SD rats were equally and randomly divided into normal control (normal), sham-operation (sham), model and EA groups. AD model was established by microinjection of Abeta(1-40) (10 microg/microL, 1 microL) into bilateral Meynert nucleus (AP: 1. 4 mm, L: 3 mm, H: 7 mm) and validated by water maze tests. Rats of the sham group were treated by microinjection of the same dose of normal saline into the bilateral Meynert Nucleus. EA (1 mA, 2 Hz) was applied to bilateral \"Baihui\" (GV 20), \"Taixi\" (KI 3) and \"Zusanli\" (ST 36) for 15 min, once daily for 12 sessions. Expression levels of p-P 38 MAPK protein and IL-1beta mRNA in the hippocampus and frontal lobe tissues were detected by Western blot and RT-PCR, respectively.\n\n\nRESULTS\nIn comparison with the normal group, the expression levels of p-P 38 MAPK protein and IL-1beta mRNA in the hippocampus and frontal lobe tissues were upregulated significantly in the model group (P < 0.01). After 12 sessions of EA intervention, the expression levels of both p-P 38 MAPK protein and IL-1beta mRNA were down-regulated significantly (P < 0.01, P < 0.05) in spite of being still higher than those of the normal group. No significant differences were found between the normal and sham groups in the expression levels of both p-P 38 MAPK protein and IL-1beta mRNA (P > 0.05).\n\n\nCONCLUSION\nEA intervention can reduce the over expression of both p-P 38 MAPK protein and IL-1beta mRNA in the hippocampus and frontal cortex in AD rats, suggesting an improvement of AD after EA intervention by restraining the inflammatory reaction.","cites":"1","conferencePercentile":"85.41666667"}]}