{"Zhonghua_er_bi_yan_hou_tou_jing":[{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"335a6e1e27a4f5997aa57fbd188d2177e1fd9c85","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2014","title":"[Development of Mandarin tonal identification in noise test materials].","authors":"Bo Liu, Beier Qi, Andreas Krenmayr, Xueqing Chen, Shuo Wang, Reinhold Schatzer, Clemens Zierhofer, Demin Han","author_ids":"1724237, 7516472, 6462674, 2409440, 5994097, 3122137, 2662880, 3186099","abstract":"OBJECTIVE\nThe aim of this study was to develop comprehensive test material for Mandarin tone identification in noise (M-TINT) based on the linguistic characteristics in Chinese.\n\n\nMETHODS\nIn keeping with both the reliability and efficiency in clinical practice, a primary list consisted of 320 words(80 syllables in four tones each) was designed according to the following principles: shortness of the lists, word familiarity and with a meaning in all four tones. The digital sound file was recorded by a male speaker and a female speaker (both of them are radio broadcaster).\n\n\nRESULTS\nThe tonal identification material database, which included 288 items (72 loudness-balanced syllables in all 4 Mandarin tones) was established by digital filler and balanced for equal loudness. The complete material was recorded in two CDs in a male version and a female version. The speaker-specific masking noises were generated by filtering Gaussian white noise to the speaker's long-term average speech spectrum (LTASS) and by scaling the masking noises to the same RMS amplitudes, as those of the speech, in order to acquire the effective sound masking. The speaker-specific masking noises could be able or disable during the word presentation. The sound pressure level could be selected concerning on the test setting.\n\n\nCONCLUSIONS\nThe mandarin tonal identification materials were designed by both the tonal acoustic properties and the psychophysics characteristic of adults. It is an useful speech test in clinical work and research, and can potentially be used as the basic list for other tonal language identification test in the future.","cites":"0","conferencePercentile":"53.84615385"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"0a241bb6f87cc0d159b038164d3a7390699ab3a8","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2012","title":"[Roles of spectral cues in Mandarin tone perception for sensorineural hearing-impaired patients].","authors":"Shuo Wang, Robert Mannell, Philip Newall, Bo Liu, Hua Zhang, De-min Han","author_ids":"5994097, 3092013, 8108844, 1724237, 2739980, 7883221","abstract":"OBJECTIVE\nThis study aimed to evaluate the role of spectral fine structure and envelope information in Mandarin tone perception for sensorineural hearing-impaired patients.\n\n\nMETHODS\nThe linear predictive coding technique was applied to synthesize 128 tokens having spectral fine structure from one tone of a monosyllabic word and spectral envelope from other tones with the same syllable. There after, the tone response performance was assessed using these 128 speech materials for 20 normal-hearing and 48 sensorineural hearing-impaired patients, including 20 with moderate, 20 with moderate to severe, and 8 with severe hearing loss.\n\n\nRESULTS\n99.7%, 97.7%, 96.3% and 83.0% of the mean tone responses were consistent with spectral fine structure for the normal hearing, moderate, moderate to severe, and severely hearing-impaired groups, respectively. No tone recognition responses were observed in consistent with spectral envelope cues. There was a significant difference in tone recognition among the normal hearing group and three hearing impaired groups (χ(2) = 59.2, P < 0.001). The negative correlation between the averages for pure-tone hearing thresholds at frequencies of 500, 1000, and 2000 Hz and tone responses that were in consistent with spectral fine structure for the hearing-impaired subjects (r = -0.643, P < 0.001).\n\n\nCONCLUSIONS\nFor both normal-hearing and hearing-impaired subjects, spectral fine structure plays an important role in tone recognition, and the impact of changing spectral envelope cues on tone recognition is negligible, when spectral fine structure cues are present. Sensorineural hearing impaired patients showed a progressive decrease in the recognition of lexical tones based on spectral fine structure cues, as their hearing loss becomes more severe.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"b0f9da62b3239d4a0b77be18fc1d4afb55b62daa","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2006","title":"[Functional localization of vestibular cerebral representations in human using functional magnetic resonance imaging].","authors":"Xia Gong, Wei-ning Huang, Zhi Wang, Min Chen, Bo Gao, Jin-mei Zhou","author_ids":"8122183, 2221225, 1794476, 1711628, 4515308, 7934683","abstract":"OBJECTIVE\nTo study human vestibular cerebral representations by combining right-sided ice-water stimulation at 0 degree C with blood oxygenation level dependent functional magnetic resonance imaging (BOLD-fMRI) and to evaluate the value of this method in the functional localization of human vestibular cortex.\n\n\nMETHODS\nTwenty right-handed volunteers (12 men and 8 women) received unilateral irrigation of the right external auditory meatu for 15 s with 15 ml of water at 0 degrees C during fMRI in complete darkness. The functional imaging of brain cortex was acquired with a 1.5-T MRI scanner (Signa Infinity Twin + Excite; General Electric Co., USA). The successive functional images from each subject were analyzed as a group with statistical parametric mapping software (SPM 99).\n\n\nRESULTS\nUltimately, data obtained from 17 subjects were analyzed (3 subjects were eliminated from data because of head movement exceeding 2 mm). The group analysis showed bilateral (particularly left-sided) cortical activation, associated with caloric stimulus involving in temporoparietal junction extending into the posterior insula, supramarginal gyrus in the inferior parietal lobe, precuneus, supplementary motor area (SMA), the ventrolateral portion of the occipital lobe, cuneus and lingual gyrus, superior temporal gyrus and cingular cortex.\n\n\nCONCLUSIONS\nIce-water stimulation at 0 degree C in fMRI reveals a widespread cortical network involved in vestibular signal processing in human. As the functional localization of vestibular cortex could be determined precisely, ice-water stimulation at 0 degree C in fMRI would hold great promise as a sensitive and reproducible tool for the research in human vestibular cortex.","cites":"0","conferencePercentile":"41.17647059"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"8ef53c8663c7639c3a7c225f9ca79de3ed0b6442","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2006","title":"[Auditory capability evaluation for children after cochlear implantation using meaningful auditory integration scale].","authors":"Xue-qing Chen, Liang Wang, Ying Kong, Sha Liu, Bo Liu, Ling-yan Mo, Shuo Wang, Yan-jun Wu, Na Han, Li-hui Meng, Hai-zhen Li","author_ids":"2409440, 1745316, 7218957, 1777681, 1724237, 8456950, 5994097, 3238243, 5122305, 7959074, 4191809","abstract":"OBJECTIVE\nTo analyze the auditory capability of preschool children before and after cochlear implantation using meaningful auditory integration scale (MAIS) questionnaire.\n\n\nMETHODS\nEighty-two prelingually deaf patients participated in this study. They received a cochlear implant at the age of 3 to 6 years and 11 months. The audiologists who were trained for the research used the MAIS questionnaire. Audiologists asked for the parents' answers and recorded all the information about the device using (Q1,2) and the patient's spontaneous auditory behavioural responses including spontaneous alerting to sound Q3 approximately 6 and deriving meaning from sound (Q7 approximately 10). The evaluation was performed before operation and 1 , 3, 6 months, 1, 1.5, 2 years after switch-on.\n\n\nRESULTS\nThe scores of question 1a and 1b were not significantly different among the different periods after switch-on. The scores of question 2 to 10 were significantly different among the different periods after switch-on.\n\n\nCONCLUSIONS\nConsiderable variability across subjects' auditory ability after cochlear implantation was noted. Most of the patients showed no consistent response to sound in everyday life before implantation. After cochlear implantation, a significant increase in auditory capability occurred. The children demonstrated faster development of device using relative to spontaneous alerting to sound and deriving meaning from sound.","cites":"0","conferencePercentile":"41.17647059"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"f5c3515b6e7efd8058a441ace187a1642411eb9f","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2006","title":"[Observation of auditory brainstem response and distortion product otoacoustic emission on the animal model of autoimmune auditory neuropathy].","authors":"Hong-jian Liu, Jing Wang, Ming-min Dong, Fang-lu Chi","author_ids":"5937068, 1697912, 6677199, 7997574","abstract":"OBJECTIVE\nTo set up an animal model of autoimmune auditory neuropathy and to observe the auditory brainstem response (ABR) and distortion product otoacoustic emission (DPOAE) in guinea pigs.\n\n\nMETHODS\nThe spiral ganglion and the cochlear nerve were obtained and purified by electrophoresis from 250 normal guinea pigs. The purified cochlear nerve antigen was mixed with an equal volume of complete Freunds adjuvant for immunization. Seventy guinea pigs were divided into three groups: experiment group (50 guinea pigs), control group (10 guinea pigs), normal group (10 guinea pigs). ABR, DPOAE, serum IgG levels, and morphological changes of spiral ganglion cells and the cochlear nucleus were observed. The protein expressions of the antigen were examined by immunohistochemistry and the super-structure of the auditory nerve were observed.\n\n\nRESULTS\nThe threshold of ABR response increased ranged from 10 to 25 dB in 32% (32/100 ears) of the guinea pigs. The peak latencies of waves I , III and the interpeak latency I approximately III were prolonged in the hearing loss group of guinea pigs. Prolonged peak latency of wave III was noted in hearing loss group at 2 and 3 weeks post immunization and slowly decreased to normal peak latency. The amplitude of DPOAE was no difference in the guinea pigs. The levels of serum IgG increased significantly compared with those of the control group. Inflammatory cell infiltration was observed in the cochlear nerve and the number of spiral ganglion cells detected. On the contrary, inflammatory cell infiltration was not observed in the cochlear nucleus. The cell densities and the across-sectional areas of neurons in anteroventral cochlear nucleus and posteroventral cochlear nucleus were no difference in the guinea pigs. The antigen protein distributed strictly in cochlear nerve and the spiral ganglion. Some demyelinated areas in cochlear nerve was observed in this group. The threshold of ABR response in 68% guinea pigs (68/100 ears) did not increase. The data of DPOAE and the serum IgG levels show no difference compared with the control group. There were not pathological observation in spiral ganglion cells, cochlear nucleus and cochlear nerve.\n\n\nCONCLUSION\nAn animal model of autoimmune auditory neuropathy has been set up successfully and the character of the ABR and DPOAE was observed.","cites":"0","conferencePercentile":"41.17647059"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"8737dd6da14d584025e5023ff8151d7f8fe8498b","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2014","title":"[Effects of temporal fine structure stimulation on Mandarin identification in cochlear implant users].","authors":"Beier Qi, Bo Liu, Ruijuan Dong, Andreas Krenmayr, Xueqing Chen, Shuo Wang","author_ids":"7516472, 1724237, 3918531, 6462674, 2409440, 5994097","abstract":"OBJECTIVE\nTo assess the contribution of the temporal fine structure cues on speech recognition, especially tone perception of cochlear implant users whose native language is Mandarin Chinese.\n\n\nMETHODS\nTwelve Mandarin speaking users of the MED-EL COMBI 40+ cochlear implants with the standard COMBI 40+ electrode array participated in the study. The subjects were followed up and studied using the longitudinal method for six weeks to compare the difference in speech identification results between fine structure processing (FSP) and continuous interleaved sampler (CIS). The test battery comprised two objective speech tests, including tone identification in quiet as well as a sentence recognition task in quiet and noise.\n\n\nRESULTS\nThe scores of acute speech test: after replacing FSP strategy, the acute tone test results were similar to that of daily used CIS strategy(male version t = 0.791, P = 0.446;female version t = 0.679, P = 0.511), but the scores of MHINT were decreased significantly (t = -4.365, P = 0.001). The scores of long-lasting speech test were as follows the scores of tone identification test were sharply increased after subjects used the new coding strategy for six weeks continuously(male version t = 3.023, P = 0.018;female version t = 3.883, P = 0.003) and the MHIN results were similar to that of daily used CIS strategy(t = 1.475, P = 0.173).\n\n\nCONCLUSION\nThe extraction of temporal fine structure cues supplemented in speech processing strategy of cochlear implant benefits the improvements in tone perception and the understanding of speech in cochlear implant recipients, which can further promotes their quality of life.","cites":"0","conferencePercentile":"53.84615385"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"0c3cf95802c1e751ae8c7c6c2ff9181e4968e04b","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2008","title":"[Outcome of cochlear implantation in prelingual pediatric auditory neuropathy].","authors":"Yong-Xin Li, Shuang Liang, Lian-Sheng Guo, Ying Kong, Hai-Hong Liu, Xiao-Tian Zhao, Jun Zheng, Xue-Qing Chen, Bo Liu, Li-Hui Huang, Ling-Yan Mo, Hua Zhang, De-Min Han","author_ids":"7770758, 1729017, 8334458, 7218957, 8681645, 8343898, 1737694, 2106980, 1724237, 7535760, 5226098, 2739980, 7883383","abstract":"OBJECTIVE\nTo explore the electrophysiological results and rehabilitation outcome of two prelingually deafened pediatric cochlear implant patients with auditory neuropathy.\n\n\nMETHODS\nPreoperative audiological evaluation, intra-postoperative electrically evoked auditory brainstem response (EABR) and neural response telemetry (NRT) record for the two cases were conducted in Beijing Tongren Hospital. A one year follow-up was performed. Data collected before and at 6,12-month intervals after implantation were compared with that from control pediatric cochlear implant patients matched for the same duration of implant use as this two cases.\n\n\nRESULTS\nThe two children implanted had not had any postoperative medical or cochlear implant device complications. Intraoperative EABR and NRT were elicited in case 1 with unrepeatable waveforms. After 12 months of training, Case 1 had shown significant improvements in sound detection, speech perception abilities and communication skills, which was better than the control group, and the electrophysiological results became normal. Case 2 had also benefited from cochlear implantation, even though no recognizable NRT was found until he returned 12 month after the operation. CONTUSIONS: The desynchronization of auditory path had been changed after the electrical stimulation ongoing 12 months for children with auditory neuropathy. The two children had not had any complications postoperatively, and each child had shown improved listening and communication skills. Cochlear implantation could help patients with auditory neuropathy to improve their communication skill and go back to the main stream.","cites":"0","conferencePercentile":"53.33333333"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"39d5b788361a274b0b8e43962ef4dad8fa666d5c","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2006","title":"[Landmark of facial nerve in middle ear surgery].","authors":"Fang-Lu Chi, Jing Wang, Ya-Sheng Yuan, Hong-Jiang Liu, Jun Gu, Ting Huang, Ying Gu","author_ids":"7997574, 1697912, 7809857, 8424705, 1742782, 2297324, 2378318","abstract":"OBJECTIVE\nTo re-evaluate landmarks for facial nerve in middle ear surgery through temporal bone dissection and facial nerve surgery.\n\n\nMETHODS\nSome relative landmarks were found through 44 facial nerves dissection in cadaver and 106 cases of facial nerve decompression surgery.\n\n\nRESULTS\n(1) Landmarks for vertical segment of the facial nerve: the vertical line in combined point between posterior and middle 1/3 horizontal semicircular canal clews the posterior edge of facial nerve; the prolong line of superior radian of incus short process clues to the anterior edge of the facial nerve, the facial nerve and horizontal semicircular canal are almost in the same plane. (2) Landmarks for horizontal segment of the facial nerve: the facial nerve tracks forward inferior to short process of incus and anterior to horizontal semicircular canal carina in 30 angel. The facial nerve, locating posterior and superior to cochleariform process and parallel with it, forms the step of middle-superior tympanic cavity and tracks forward to geniculate ganglion. (3) location of geniculate ganglion: The same distance prolong line of stapes head to cochleariform process clues to geniculate ganglion. (4) Location of the chorda tympani nerve: chorda tympani nerve, leaving tympanic sulcus at 3 clock of bone canaline left ear and at 9 clock of bone canaline right ear, tracks forward along tympani sulcus and then cross between long process of incus and manubrium. It lies in the border of pars tensa and pars flaccid and is about 5 - 8 mm from the stylomastoid foramen to where the chorda tympani nerve leaves the facial nerve. There is no difference of facial nerve structure in temporal bone dissection and in surgery.\n\n\nCONCLUSIONS\nThe fixed landmarks of middle ear are the frame of reference of facial nerve, in which horizontal semicircular canal is most invariable; and the safety of surgery will be improved by the reference of the facial nerve.","cites":"0","conferencePercentile":"41.17647059"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"b6948842510067166a0783fa8e9711f69d654d12","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2014","title":"[Functional evaluation of auditory cortex by functional magnetic resonance before cochlear implantation: a pilot study].","authors":"Lan Cheng, Jun Yang, Hao Wu, Qi Huang, Wenjun Cao, Yuhua Li","author_ids":"8267042, 2814025, 1739602, 2936526, 2035928, 5786232","abstract":"OBJECTIVE\nTo investigate the functional evaluation of auditory cortex by functional magnetic resonance imaging (fMRI) before cochlear implantation (CI).\n\n\nMETHODS\nTwenty-one children with severe to profound sensorineural hearing loss (SNHL) (7 cases with normal inner ear structure, 3 cases with large vestibular aqueduct syndrome, 1 case with cochlear nerve hypoplasia) and 7 children with normal hearing were examined by fMRI under sedation. The subjects received acoustic stimuli at four random frequencies (500, 1 000, 2 000, 4 000 Hz) during fMRI examination. Tones were interleaved with silence in a block-periodic fMRI design with 16-second on-off intervals.Each stimulus repeated twice and the total acquisition time was 4 minutes and 28 seconds.\n\n\nRESULTS\nActivation was identified in the auditory cortex of the 28 subjects in response to monaural and binaural acoustic stimulation, which was shown in the transverse temporal gyrus (Heschl gyrus), the thalamus and both.Of the 21 patients with SNHL, contralateral dominance was shown in six cases, ipsilateral dominance in five cases and bilateral equilibrium in 10 cases when one ear was exposed to the stimuli. Of the seven children with normal hearing, contralateral dominance was shown in three cases, ipsilateral dominance in two cases and bilateral equilibrium in two cases.No significant difference of the activation intensity in auditory cortex was shown between children with SNHL and normal hearing (P > 0.05). Good hearing recovery was obtained in the 21 patients after CI. No significant difference in the level of hearing and speech rehabilitation was shown between children with LVAS and with normal inner ear structure.Listening behavior response threshold was 55 dBHL in the case with cochlear nerve hypoplasia 10 months after CI.\n\n\nCONCLUSIONS\nfMRI would be a feasible means of evaluating the function of the auditory cortex, which can be used for assessing the function of the entire auditory system prior to CI combined with ABR and imaging.","cites":"0","conferencePercentile":"53.84615385"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"75ef4159e36a005267827c31dfa896339de23c16","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2014","title":"[The spiral ganglion degeneration and the expression of EFR3A in the cochlea of the deaf mice induced by co-administration of kanamycin and furosemide].","authors":"Chen Nie, Mingliang Xiang, Chenling Shen, Haixia Hu, Bin Ye, Hao Wu","author_ids":"8005975, 6222541, 4480434, 7150540, 7579043, 1739602","abstract":"OBJECTIVE\nTo investigate the spiral ganglion degeneration and the expression of EFR3A in the cochlea of the deaf mice induced by co-administration of kanamycin and furosemide.\n\n\nMETHODS\nEight weeks old C57BL/6J mice were administered with a single dose of kanamycin followed by furosemide, then fluorescent immunohistochemistry staining and transmission electron microscopy were applied to observe the SGNs' degeneration process and extent characteristics at 1, 5, 15, 30 and 60 days following treatment. We detected the expression of EFR3A during the degeneration of SGNs via fluorescent immunohistochemistry and western blotting.\n\n\nRESULTS\nCo-administration of kanamycin and furosemide quickly induced cochlear hair cell death in mice, and then caused progressive degeneration of SGNs. Our results showed that the abnormal morphology of SGNs occurredat day 5 following administration, and the number of SGNs began to decrease at day 15. Compared to the control group, it was found the remarkable increase of the EFR3A protein at the fifth day after co-administration, then decreased to the nearly normal at 15 days following treatment, and no further significant changes thereafter.\n\n\nCONCLUSION\nThe changes of the EFR3A protein expression in the spiral ganglion of the cochlea in mice are coincidence with the time of the SGNs degeneration to happen, which imply that EFR3A may play an important role in the occurrence of the SGNs' degeneration in the cochlea in mice following hair cells loss.","cites":"0","conferencePercentile":"53.84615385"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"feea0da1d3d26f5de456d983fec40603745e0953","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2010","title":"[Test-retest reliability of Mandarin monosyllable lists: a multi-center study in Chinese dialectal regions].","authors":"Fei Ji, Xin Xi, Dong-yi Han, Shao-lian Lin, Sheng-nan Ye, You-hui Lin, Yong Cui, Si-min Huang, Wu-lan Zhao, Yan-lai Yang, Yong-hua Wang, Zheng Jiang, Yan-yi Li, Geng Chen, Xiu-li Liu, Yue-Hua Sun, Lu-Yang Wang, Yong-Mao Cao, Jun Li, Wei Chang, Yun Li, Yan Ren, Hao Wu","author_ids":"2966968, 3150190, 3498968, 4454421, 8187640, 4704030, 4382073, 2078434, 6889988, 3800238, 7707488, 2787736, 2635796, 5670805, 8016088, 2971442, 7137679, 6866039, 8722256, 4377819, 1724845, 1685029, 1739602","abstract":"OBJECTIVE\nTo develop 22 Chinese Mandarin monosyllable lists with good psychometrical equivalence. This study was to evaluate the test-retest reliability of these lists when it was used in speech recognition test in normal hearing dialectal speakers.\n\n\nMETHODS\nSeven cities including Dalian, Shanghai, Hangzhou, Wuhan, Guangzhou, Fuzhou and Xiamen were selected as testing centers which contain 6 typical Chinese dialectal regions including north of China, East of China, north of Fujian, south of Fujian, Guangdong and mid-south of China. At each center, 22 local normal hearing people were selected to join this study. Every participant was tested by each recognition test of all 22 lists twice in two sessions and same test order respectively. The second run of testing was carried out within 10 days-1 month since first run of testing.\n\n\nRESULTS\nThere was a significant correlations between scores obtained at the two sessions (r = 0.682, P < 0.01). Paired student-t test had shown that a gross score of all dialectal participants was significantly higher than that of initial test to retest (P < 0.01). The mean increment of score was (2.7 +/- 10.1)%. A significant difference of test-retest score in 7 sites was 19.8% and it was equal to 5 test items. A one way ANOVA analysis had indicated that there were statistically significant difference between the score improvement of 7 test sites (P < 0.01). Another analysis had shown that there was no significant correlation between test-retest score improvement and intra-session intervals (P = 0.947).\n\n\nCONCLUSIONS\nMandarin monosyllabic recognition test seems to be more stable, and the present study has indicated a systematic differences in Chinese Mandarin monosyllable recognition scores between test and retest. Monosyllable recognition test is not susceptible to memory effect. Pearson's correction analysis is not suitable to evaluation for test-retest reliability.","cites":"0","conferencePercentile":"45.83333333"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"6911ad14efabe3fdf371dda38ec89d001a773a5b","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2016","title":"[The sex difference of speech evoked auditory brainstem responses in children and young adults].","authors":"J F Liu, X Fu, D Wang, X T Li, N Y Wang","author_ids":"8190303, 7780900, 1715538, 7824408, 5001607","abstract":"OBJECTIVE\nThe aim of this study was to compare the sex difference of the speech-ABR in young adults and school age children.\n\n\nMETHODS\nSpeech-ABR of eighty normal hearing subjects including twenty four school-age children(12 girls and boys, age from 6 to 12 years old) and fifty six young adults(male 29, female 27, age from 20 to 34 years old) were recorded. The speech syllable /da/ as stimulus sound was transmitted to right ear by insert earphones in speech-ABR test.\n\n\nRESULTS\n① Females had a shorter latency than males in transient response (waves V, A and O) and sustained response (waves D, E and F) of speech-ABR (P<0.05, respectively). The amplitudes of transient response (waves V and A) and sustained response (waves D, E and F) in females were also significantly larger than those in males (P<0.05, respectively), except for amplitude of peak O (P>0.05). The V/A slope in females was significantly steeper than that in males[(-0.43±0.13)vs(-0.25±0.08), P<0.01]. ②The amplitude and latency of speech-ABR in transient response (waves V, A and O) and sustained response (waves D, E and F) were not significantly different between boys and girls. Only the V/A slope in girls was significantly steeper than that in boys [(-0.46±0.12)vs(-0.35±0.15), P<0.05]. ③The latency of speech-ABR was significantly prolonged in young men when compared with boys in both transient response (waves V, A and O) (P<0.05, respectively) and sustained response (waves D and F, P<0.05, respectively), except for wave E (P>0.05). The amplitude of speech-ABR showed a statistically significant decrease (P<0.05, respectively) only in wave A, D and F. Contrarily, the decrease in response amplitudes of waves V, E and O were not statistically significant (P>0.05, respectively). The V/A slope was steeper in boys than in young men, which was statistically significant (P<0.05). ④ In girls and young women, peak latency and magnitude of speech-ABR showed similar characteristics. No significant differences were found in either transient response or sustained response. The V/A slope between girls and young women was similar without significant difference (P>0.05).\n\n\nCONCLUSIONS\nThe female adults have shorter wave latency and larger amplitude of speech-ABR than males, which suggests that females have better speech encoding in brainstem. There are few differences between female and girls in wave latency and amplitude. The speech encoding in brainstem in young men tends to become worse than in boys. It implies that the increase of androgen might weaken the ability of the speech encoding in brainstem.","cites":"0","conferencePercentile":"53.84615385"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"e971dababd736648890adc199f41b60e3b3c29d6","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2007","title":"[Ultrastructural changes of olfactory epithelium of the patients with olfactory disorder caused by common cold].","authors":"Gang Liu, Hai Zhang","author_ids":"1697913, 1703065","abstract":"OBJECTIVE\nThe study focus on the olfactory changes post upper respiratory infection, through observation of nasal mucosa and it's ultrastructural changes.\n\n\nMETHODS\nOlfactory test was performed by odor threshold and identification test (T&T olfactometry). The specimens of olfactory epithelium (OE) were obtained from 10 patients with anosmia or olfactory disorder post upper respiratory infection. All specimens were obtained under endoscope. Transmission electron microscope (TEM) was used to observe the ultrastructural changes of each group.\n\n\nRESULTS\nUnder the TEM, the surface ultrastructure of the OE from patients showed following abnormal changes: (1) Normal epithelium structural characteristics maintained but clearance between cells appeared wider. (2) Olfactory vesicles reduced obviously, even if the olfactory vesicles existed, the olfactory cilia showed reduction. Some olfactory vesicles still existed, but the number of olfactory cilia reduced. Some olfactory vesicles changed their shape due to vacuolization. (3) Surface microvillus of the supporting cells disappeared. (4) The nuclei of supporting cell changed the shape or karyopyknosis, olfactory dendrites were shorter and wider than normal, and organelles reduced.\n\n\nCONCLUSIONS\nThere is close relationship between ultrastructural changes and olfactory disorders post upper respiratory infection. Reduced olfactory vesicles, cilia and disappeared microvillus of the supporting cells are the main reasons for the patient's olfactory disorder.","cites":"0","conferencePercentile":"53.33333333"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"872c4b608eba8f542ff71357e2d2330ae64c4f8e","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2014","title":"[Olfactory function in patients with mild cognitive impairment].","authors":"Wei Hang, Gang Liu, Tong Han, Yuying Zhou, Jinling Zhang, Qiang Zhang","author_ids":"8411450, 1697913, 2697104, 7743624, 8215235, 1689161","abstract":"OBJECTIVE\nTo analyze the correlation between olfactory bulb (OB) volume, depth of olfactory sulcus (OS) and olfactory function in patients with mild cognitive impairment (MCI).\n\n\nMETHODS\nFifty patients with MCI were compared with fifty controls in terms of olfactory function T&T testing, OB volume and depth of OS assessed with magnetic resonance imaging (MRI). SPSS 13.0 software was used to analyze the data.\n\n\nRESULTS\nT&T olfactory testing revealed that MCI patients had higher scores than controls (t = 3.142, P < 0.05). Both men and women with MCI were affected by the same extent of olfactory loss(t = 0.973, P > 0.05). Both men and women as controls were affected by the same extent of olfactory loss (t = 1.092, P > 0.05).OB volume of left side in MCI patients was (36.35 ± 4.09) mm(3), right side was (36.57 ± 4.13) mm(3), average OB volume was (36.47 ± 4.12) mm3; OB volume of left side in controls was (46.65 ± 6.23) mm(3), right side was (46.83 ± 6.27) mm(3), average OB volume was (46.71 ± 6.25)mm(3); OB volumes were lower in MCI patients as compared with controls (t value was 3.113, 3.145 and 3.132, all P < 0.01).OS depth study revealed no statistical different between MCI patients and controls (t value was 0.876,0.952 and 0.904, all P > 0.05). Olfactory discriminate threshold was negatively correlated with OB volume in MCI patients and controls (r value was -0.643, -0.541, both P < 0.05); was no correlated with depth of OS (r value was -0.167 and -0.183, both P > 0.05). Olfactory discriminate threshold was negatively correlated with cognitive impairment degree in MCI patients (r value was -0.427, -0.418 and -0.399, all P < 0.05), average OB volume was positively correlated with cognitive impairment degree in MCI patients (r value was 0.364, 0.383 and 0.379, all P < 0.05).\n\n\nCONCLUSIONS\nThe OB volumes are lower in MCI patients as compared with controls, the depth of OS show no significant changes in MCI patients. The OB volume is correlated with olfactory function, the depth of OS is not correlated with olfactory function. Cognitive impairment degree in MCI patients is accordance with olfactory function lower degree. The olfactory loss may be a earlier period and objective diagnosis indicator for MCI patients.","cites":"0","conferencePercentile":"53.84615385"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"92e639432b2b640a51f2fdb5f37a84365bfa5677","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2015","title":"[Development of early auditory and speech perception skills within one year after cochlear implantion in prelingual deaf children].","authors":"Ying Fu, Yuan Chen, Xin Xi, Mengdi Hong, Aiting Chen, Qian Wang, Lena Wong","author_ids":"2318631, 7137017, 3150190, 1830899, 3096898, 1729612, 5127370","abstract":"OBJECTIVE\nTo investigate the development of early auditory capability and speech perception in the prelingual deaf children after cochlear implantation, and to study the feasibility of currently available Chinese assessment instruments for the evaluation of early auditory skill and speech perception in hearing-impaired children.\n\n\nMETHODS\nA total of 83 children with severe-to-profound prelingual hearing impairment participated in this study. Participants were divided into four groups according to the age for surgery: A (1-2 years), B (2-3 years), C (3-4 years) and D (4-5 years). The auditory skill and speech perception ability of CI children were evaluated by trained audiologists using the infant-toddler/meaningful auditory integration scale (IT-MAIS/MAIS) questionnaire, the Mandarin Early Speech Perception (MESP) test and the Mandarin Pediatric Speech Intelligibility (MPSI) test. The questionnaires were used in face to face interviews with the parents or guardians. Each child was assessed before the operation and 3 months, 6 months, 12 months after switch-on.\n\n\nRESULTS\nAfter cochlear implantation, early postoperative auditory development and speech perception gradually improved. All MAIS/IT-MAIS scores showed a similar increasing trend with the rehabilitation duration (F=5.743, P=0.007). Preoperative and post operative MAIS/IT-MAIS scores of children in age group C (3-4 years) was higher than that of other groups. Children who had longer hearing aid experience before operation demonstrated higher MAIS/IT-MAIS scores than those with little or no hearing aid experience (F=4.947, P=0.000). The MESP test showed that, children were not able to perceive speech as well as detecting speech signals. However as the duration of CI use increased, speech perception ability also improved substantially. However, only about 40% of the subjects could be evaluated using the most difficult subtest on the MPSI in quiet at 12 months after switch-on. As MCR decreased, the proportion of children who could be tested using the MPSI reduced.\n\n\nCONCLUSIONS\nWithin one year after CI, children develop early auditory and speech perception capabilities with time. Chinese versions of the IT-MAIS/MAIS, MESP and MPSI are useful instruments to document early auditory and speech perception skills in children after CI implantation.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"1a027b027513795ceac8c0fc0e07b4df41c9fa80","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2013","title":"[Olfactory function in patients with idiopathic rapid eye movement sleep behavior disorder].","authors":"Jin-ling Zhang, Gang Liu, Wei Hang, Xiang-li Yang, Ji-xiang Liu","author_ids":"8214799, 1697913, 8411450, 8314871, 8190017","abstract":"OBJECTIVE\nTo analyze the correlation between olfactory bulb (OB) volume with depth of olfactory sulcus (OS) and olfactory function in patients with idiopathic rapid eye movement sleep behavior disorder (iRBD).\n\n\nMETHODS\nFifty patients with iRBD and fifty controls were assessed with polysomnography (PSG). The results of olfactory function T & T testing, OB volume and depth of OS assessed with magnetic resonance imaging (MRI) were compared. SPSS 11.0 software was used to analyze the data.\n\n\nRESULTS\nT & T olfactory testing revealed that iRBD patients had higher scores (3.1 ± 0.5) than those in controls (0.6 ± 0.1), and the difference was significant (t = 7.913, P < 0.05). Both men and women with iRBD were affected by the same extent of olfactory loss (t = 1.015, P > 0.05). OB volume of left side in iRBD patients was (33.75 ± 4.11) mm(3), right side was (34.57 ± 4.21) mm(3), average OB volume was (33.94 ± 4.15) mm(3); OB volume of left side in controls was (51.68 ± 7.71) mm(3), right side was (52.31 ± 7.77) mm(3), average OB volume was (51.94 ± 7.74) mm(3); OB volume were lower in iRBD patients as compared to controls (t value were 9.013, 8.889 and 8.923, all P < 0.01). OS depth study revealed no statistical difference between iRBD patients and controls (t value were 0.923, 0.897 and 0.904, all P > 0.05). Olfactory discriminate threshold was negatively correlated with OB volume in iRBD patients (r = -0.61, P < 0.05), but no correlated with depth of OS (r = -0.24, P > 0.05).\n\n\nCONCLUSIONS\nThe OB volume was lower in iRBD patients as compared to controls. The depth of OS showed no significant changes in iRBD patients. The OB volume was correlated with olfactory function, while the depth of OS was no correlated with olfactory function.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"08b9f7665557f84664d1fa58e122a80cbef57d9e","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2007","title":"[Audiological and vestibular evaluation of new coagulation factor C homology mutation carriers in a Chinese family].","authors":"Qing Sun, Su-jiang Xie, Lei Feng, Yu-feng Wang, Jian Xu, Chun-yan Qiu, Ai-ting Chen, Fei Ji, Dong-yang Kang, Xin Zhang, Xin Liu, Pu Dai, Hui-jun Yuan, Dong-yi Han","author_ids":"4673638, 8483495, 1724552, 1701288, 1766389, 7245344, 7785641, 2966968, 8118650, 2542917, 1749705, 6878050, 6172779, 3498968","abstract":"OBJECTIVE\nTo analyze the clinical features of audiological and vestibular function in a Chinese family with late onset autosomal dominant nonsyndromic sensorineural hearing loss.\n\n\nMETHODS\nComprehensive audiological and vestibular evaluation including pure tone audiometry, auditory brainstem response (ABR), electrocochleogram (EcochG), oculomotor testing, caloric tests, rotational testing, computerized dynamic posturography and vestibular evoked myogenic potentials (VEMP) were conducted to identify the hearing and vestibular impairment.\n\n\nRESULTS\nAll affected family members shared sensorineural hearing loss with full penetrance starting between the second and fifth decade of life as a high frequency loss which progresses to a severe to profound loss at the sixth to seventh decade. The extensive vestibular evaluation indicated that all affected members performed normally in computerized dynamic posturography and caloric testing. Impairment of the saccular otolith in all of six affected members was suggested by results of the VEMP test. The velocity step test generated abnormal time constants and sinusoidal oscillation test generated abnormal gains and phase in affected members indicated that horizontal canal vestibular hyporeflexia in history. All affected subjects examined in this family showed completely normal ocular motor responses in oculomotor testing, including smooth pursuit, optokinetic nystagmus, gaze and saccade.\n\n\nCONCLUSIONS\nThe predominant feature of the Chinese DFNA9 family was that all the affected subjects harboring COCH mutation in the vWFA2 domain didn't suffer the vestibular symptoms during their life time and comprehensive vestibular assessment revealed only subtle vestibular hypofunction in affected members of this family. There is a genotype-phenotype correlation in DFNA9.","cites":"0","conferencePercentile":"53.33333333"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"5a44e3f5edb5076b5301a904dcce2f3e691dbce4","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2015","title":"[Olfactory bulb volume and depth of olfactory sulcus in olfactory dysfunction patients after upper respiratory tract infection].","authors":"Wei Hang, Gang Liu, Tong Han, Jinling Zhang, Qiang Zhang","author_ids":"8411450, 1697913, 2697104, 8215235, 1689161","abstract":"OBJECTIVE\nTo analyze the correlation between olfactory bulb (OB) volume, depth of olfactory sulcus (OS) and olfactory function in patients with olfactory dysfunction after upper respiratory tract infection.\n\n\nMETHODS\nOne hundred patients with olfactory dysfunction after upper respiratory tract infection (patient group) were compared with one hundred normal controls in terms of olfactory function T&T testing, OB volume and depth of OS assessed with magnetic resonance imaging (MRI). T&T testing and MRI were performed again after a year in patient group and the results were compared. SPSS 13.0 software was used to analyze the data.\n\n\nRESULTS\nT&T olfactory testing revealed that the patient group had higher scores than controls (t = 4.014, P < 0.05). Both men and women in patient group were affected by the same extent of olfactory loss (t value was 0.892, P > 0.05). Both men and women in control group were affected by the same extent of olfactory loss (t value was 1.011, P > 0.05). OB volume of left side in patient group was (38.14 ± 4.31) mm³, right side was (38.72 ± 4.22) mm³, average OB volume was (38.47 ± 4.27) mm³; OB volume of left side in controls was (51.65 ± 6.30) mm³, right side was (51.98 ± 6.34) mm³, average OB volume was (51.81 ± 6.32) mm³; OB volume was lower in patient group as compared with controls (t value were 4.233, 4.267 and 4.249, all P < 0.01). OS depth study revealed no statistical difference between patient group and control group (t value were 0.901, 0.948 and 0.927, all P > 0.05). Olfactory discriminate threshold was negatively correlated with OB volume in patient group and control group (r value were -0.598, -0.512, both P < 0.05) Olfactory discriminate threshold was not correlated with the depth of OS (r value were -0.152, -0.174, both P > 0.05). Olfactory discriminate threshold and OB volume were not correlated with the persistent time of the dysosmia in patient group (r value were -0.121, 0.139, both P > 0.05). Among 100 olfactory dysfunction patients after upper respiratory tract infection, when followed-up, 24 showed increased in OB volume and olfactory function after a year, but no statistical difference was found with the first time (t value were 0.894, 0.914, 0.942 and 0.931, all P > 0.05). The other 76 patients showed no significant changes of OB volume and olfactory function.\n\n\nCONCLUSIONS\nThe OB volume was lower in patient group as compared with normal controls, the depth of OS showed no significant changes in patient group. The OB volume was correlated with olfactory function, the depth of OS was not correlated with olfactory function; Olfactory function had not correlated with the persistent time of the dysosmia in patient group.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"889868b3d6188e8c9b4c29299b8bc4431389ce22","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2015","title":"[Effect of cochlear implantation on bilateral perceived tinnitus of postlingually deafened patients].","authors":"Qian Wang, Limei Yu, Chao Zhang, Li Sun, Qingshan Jiao, Jianan Li, Shiming Yang","author_ids":"1729612, 6355905, 3671118, 6631274, 4026054, 6220762, 4919344","abstract":"OBJECTIVE\nThe aim of the study was to evaluate the effects of cochlear implantation on bilateral perceived tinnitus of postlingually deafened patients.\n\n\nMETHOD\nTotal of 32 postlingually deafened cochlear implant recipients (13 males, 19 females; 31 unilateral,1 bilateral cochlear implantation) with bilateral tinnitus were assessed by Tinnitus Handicap Inventory (THI) before and after implantation. Furthermore, characteristics information of tinnitus were recorded to analyze the variety of tinnitus. Intensity of tinnitus in ispilateral and contralateral ears was investigated when cochlear implant was switched on and off. Statistical analysis was performed by SPSS 18.0.\n\n\nRESULTS\nTwenty-two patients (71.0%) got a decreased THI score of more than 20 points after the operation. The average THI score of pre-operation was 56.4±18.1, and post-operation score was 24.7±22.7. A paired-samples t test analysis showed a significant difference of the THI total scores (t=8.037, P<0.05). Tinnitus in the ipsilateral ear improved in 81.9% (27/33) patients and 18.2% (6/33) unchanged. Tinnitus in the contralateral ear improved in 71.0% (22/31) patients, 16.1% (5/31) unchanged and 12.9% (4/31) worsen. Tinnitus of ipsilateral ears improved or abolished in 97.0% (32/33) patients, while 83.9% (26/31) of contralateral ear got reduction or absence of loudness when cochlear implant was switched on.\n\n\nCONCLUSIONS\nAs an electrical stimulation treatment method, cochlear implant has the inhibitory effect on tinnitus. However, cases of tinnitus aggravation were found, further data is still necessary before considering CI as a treatment of tinnitus.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"a6fe3b4ab329fe112a9670f9285d522d4ca13a9a","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2007","title":"[Protection from noise-induced hearing loss by a nitric oxide synthase inhibitor and neurotrophin 3 in the guinea pig cochlea].","authors":"Ming-fang Diao, Wen-yuan Gao, Jian-jun Sun, Ya Liu, Dong-lan Chen, Wei Jiang, Jing Zhao, Xi Chen","author_ids":"6456732, 8361108, 8456473, 2932390, 5079375, 4344679, 5349795, 1714741","abstract":"OBJECTIVE\nTo observe the protective effect of nitric oxide synthase inhibitor-N(G)-nitro-L-arginine methyl ester (L-NAME) with or without neurotrophin 3 (NT3) on hearing in acoustic trauma.\n\n\nMETHODS\nEighty pigmented male guinea pigs were randomly divided into two groups: sham-exposed group (n=20) and noise-exposed group. The latter was divided into three subgroups: saline group (n=20), L-NAME group (n=20) and L-NAME + NT3 group (n=20). Two days consecutively and 30 min before noise exposure (4 kHz octave band noise at 115 dB SPL for 5 h), subjects in L-NAME and L-NAME + NT3 groups received an intraperitoneal injection of 10 mg/kg; animals in saline group received the same dosage of physiological saline at the same time. Four days before noise exposure, NT3 in artificial perilymph was delivered to the right scala tympani via a mini-osmotic pump in noise + L-NAME + NT3 group. Auditory brainstem responses (ABR) were measured before and 10 days following noise exposure. The cochlear tissue was assayed for nitric oxide (NO) level 3 days after noise exposure. Protection was assessed physiologically by the change in ABR threshold shift, and histologically by outer hair cell (OHC) survival.\n\n\nRESULTS\nThe hearing thresholds and the number of OHC were relatively stable in sham-exposed group. The obvious threshold shift and OHC loss were observed in the noise-exposed groups. The hearing thresholds, NO level of cochlear tissue and OHC loss in the noise + saline group were significantly higher than those in the noise + L-NAME group (P < 0.01) and noise + L-NAME + NT3 group (P < 0.01). NT3 provided an additive functional (P < 0.01), but not morphological protection with L-NAME (P = 0.095).\n\n\nCONCLUSION\nCompared to L-NAME alone, a combination of L-NAME and NT-3 can provide an additional protection against acoustic trauma in the guinea pig cochlear.","cites":"0","conferencePercentile":"53.33333333"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"d9e4eaa2503256e79c7bb5165975c6a5db4db1d6","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2009","title":"[Analysis of directional preponderance of caloric test in evaluation of vestibular dynamic compensation].","authors":"Peng Lin, Hong Dong, Tai-sheng Chen, Liang Li, Hong-hua Lu, Wei Song, Yuan-xu Ma, Na Wang, Shi-ping Sun","author_ids":"7137079, 7503791, 7934282, 8682839, 7183069, 1696380, 7777351, 1806730, 7393436","abstract":"OBJECTIVE\nTo analyze the value of directional preponderance (DP) in vestibular dynamic compensation evaluation.\n\n\nMETHODS\nOne hundred fifty-five patients with sudden deafness accompanied vertigo were asked to accept routine vestibular tests including the spontaneous nystagmus (SN) and caloric test with video-nystagmography. DP, SN and unilateral weakness (UW) were selected as the observation parameters. Then the correlation analysis between DP, SN, UW and course of disease were investigated respectively. The change characteristic of the three parameters was also analyzed in the course of vestibular compensation.\n\n\nRESULTS\nOf the 155 patients, there were negative correlations between SN, DP and course of disease (r(s) = -0.386, r(s) = -0.424, P < 0.05), positive correlation between SN and DP (r(s) = 0.543, P < 0.05), but no correlation between UW and course of disease (r(s) = 0.004, P > 0.05), and also positive correlation (r(s) = 0.274, P < 0.05) between DP and UW. According to three parameters were positive or negative, three main groups (DP+UW+SN+, DP+UW+SN- and DP-UW+SN-) in DP, UW, SN. The course of disease in three main groups was positively skewed distribution. Median was 6 days, 10 days and 20 days respectively. Through Kruskal-Wallis Test, chi(2) = 24.63, P < 0.05, there was statistical significance among the above three main groups.\n\n\nCONCLUSIONS\nDP keeps on changing in the acute stage, static and dynamic compensation stage of peripheral vestibular disease. This indicates that DP can be considered as an objective evaluation index of vestibular dynamic compensation and as a guidance of the vestibular rehabilitation evaluation.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"6414c179d94b7ee6a56bc00c0e30f86216dbd59a","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2015","title":"[A correlation study on olfactory bulb volumes with ages and olfactory function in healthy adults].","authors":"Wei Hang, Gang Liu, Tong Han, Jinling Zhang, Qiang Zhang","author_ids":"8411450, 1697913, 2697104, 8215235, 1689161","abstract":"OBJECTIVE\nTo analyze the correlation between olfactory bulb (OB) volumes and ages, as well as OB volumes and olfactory function in healthy adults.\n\n\nMETHODS\nOne hundred healthy subjects, without any diseases which might cause smell dysfunction were selected to participate in this study. The ages of the subjects ranged from 20 to 70, with the mean age of 42.6 ± 4.8. These subjects were scaned for olfactory function by T&T testing, OB volumes assessed with Magnetic resonance imaging (MRI). The correlation between OB volumes and ages as well as OB volumes and olfactory function in healthy adults was analyzed. SPSS 13.0 software was used to analyze the data.\n\n\nRESULTS\nThe left and right OB volumes of men were (84.65 ± 7.11) mm(3) and (87.79 ± 7.57) mm(3), average OB volume was (86.14 ± 7.37) mm(3). The left and right OB volumes of women were (69.58 ± 4.72) mm(3) and (71.43 ± 5.29) mm(3), average OB volume was (70.22 ± 5.02) mm(3). OB volume study revealed no statistical difference between the left and right OB volumes of men (t = 1.024, P > 0.05). OB volume study revealed no statistical difference between the left and right OB volumes of women (t = 0.987, P > 0.05). OB volumes were lower in women as compared with men (t value were 3.742, 3.869 and 3.814, all P < 0.01). OB volumes were negatively correlated with ages in the subjects (r value were -0.588, -0.523, both P < 0.01). Olfactory discriminate threshold was negatively correlated with OB volumes in the subjects (r value were -0.624, -0.587, both P < 0.01).\n\n\nCONCLUSIONS\nThis study revealed no statistical difference between the left and right OB volumes in healthy adults. OB volumes were lower in women as compared with men. As age went up, OB volume would become smaller. As olfactory function went down, OB volume would become smaller. OB volumes were expected to be a gauge of olfactory function.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"07728a61a861b17de89775d27c47e43531fc127a","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2012","title":"[Evaluation of rhythmic and timbral perception by normal-hearing and postlingually deafened adult cochlear implant users].","authors":"Shuo Wang, Rui-juan Dong, Jing Li, Yun Zhou, Bei-er Qi, Xue-qing Chen, Bo Liu","author_ids":"5994097, 8054643, 1742253, 1733083, 7516156, 2409440, 1724237","abstract":"OBJECTIVE\nTo assess the rhythmic and timbral perception ability in musical activities for postlingually deafened adult cochlear implant users.\n\n\nMETHODS\nTwelve normal-hearing and 12 adult cochlear implant users were recruited in this study. Rhythm discrimination, instrument identification, and instrument number detection measurements in Musical Sounds in Cochlear Implants (MuSIC) test battery were used to assess the rhythmic and timbral perception ability for both normal-hearing and cochlear implant users.\n\n\nRESULTS\nCochlear implant subjects achieved 84.4% correct in rhythm discrimination test on average, which was not significantly different from the performance of normal-hearing subjects (85.1%) (t = 0.116, P > 0.05). The average score of instrument identification and instrument number detection test for cochlear implant subjects were 72.3% and 39.2%, respectively. The performance of cochlear implant subjects in both of two tests were significantly poorer than those of normal-hearing subjects with 88.3% and 73.5% correct, respectively (t = 2.498 and 4.673, P < 0.05).\n\n\nCONCLUSION\nPostlingually deafened cochlear implant subjects, on average, performed significantly poorer in timbral perception tasks relative to normal hearing subjects, while close to the ability of normal hearing subjects in rhythmic perception.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"7c3250b3e37a4e7d4ad630fd945e3fd8e0b99625","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2013","title":"[Influence of the quantified surface electromyography of sternocleidomastoid on cervical vestibular evoked myogenic potential].","authors":"Bo-chen Wang, Yong Liang, Xiao-long Liu, Jing Zhao, You-li Liu, Yan-fei Li, Wei Zhang, Qi Li","author_ids":"7425793, 1921801, 8016803, 5349795, 7895159, 7770793, 2916637, 1682467","abstract":"OBJECTIVE\nThis study investigated the correlations between electromyography (EMG) of sternocleidomastoid (SCM) and cervical vestibular evoked myogenic potentials (cVEMP), and intended to quantify the influence of EMG of SCM on cVEMP by recording the EMG of SCM and cVEMP in different head positions.\n\n\nMETHODS\nThirty healthy subjects (60 ears), without the history of ear illnesses, were enrolled in this study. In addition, the recruited subjects also showed favorable differentiation of cVEMP waves induced by Blackman pip cVEMP, and EMG were recorded in different head positions(with sagittal at 90°, 60°,45° and 30°angle), as well as to analyze and quantify the influence of EMG on cVEMP.\n\n\nRESULTS\nIn the case of the different EMG levels: P1 latency, (12.50 ± 2.39)ms; N1 latency, (19.79 ± 3.16)ms, and the latencies shown no statistical difference (P > 0.05). The amplitude was affected by EMG level, there was significant difference between the amplitudes(F = 55.47, P < 0.01). The different head positions on subjects their EMG level or area of EMG effects were statistically significant (P < 0.01). The study found a linear dependence of the amplitude from the EMG levels(r(2) = 0.591, Adjusted-r(2) = 9.590).\n\n\nCONCLUSIONS\nThe cVEMP amplitude increases as a function of EMG target level, and the latency remains constant. The quantized data will increase the amplitude in clinical diagnosis application of sensitivity, and it will improve the diagnosis of the vestibular system diseases and some related diseases.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"560e7a1c3293daafbd2779d6a17e857ccb6e40e6","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2012","title":"[Study on the concordance of objective multi-parameters analysis and perceptual evaluation].","authors":"Ping Yu, Gang Wang, Gui-juan Zhang, Ai-rong Tang, Rong-guang Wang","author_ids":"1803943, 4148672, 8274396, 4749239, 5636259","abstract":"OBJECTIVE\nThrough exploring the concordance of objective multi-parameters analysis and perceptual evaluation, to establish an objective multi-parameters evaluation protocol of voice disorder and to make the evaluation of voice objectification and quantification.\n\n\nMETHODS\nVoice samples from 271 patients (124 female and 147 male)with dysphonia and 69 control subjects with normal voice (37 female and 32 male)were recorded and assessed by a jury composed of 5 experts in phoniatrics from different hospitals. The jury was instructed to classify voice samples according to the G (grade) component of the GRBAS scale on a visual analogue scale secondarily transformed in a 4-point scale ranging from 0 for normal to 3 for severe dysphonia. The voice samples were unified sentences and ordered randomly 3 times, the mean of 3 evaluation scores were the final results. The objective parameters, including fundamental frequency (F0), jitter, shimmer, fundamental frequency standard deviation (F0SD), normalized noise energy (NNE), harmonic-to-noise ratio (HNR) and maximal phonatory time (MPT), were measured on a 2-second sustained vowel/a/including its initial segment, using the software Dr. Speech for Windows. The data were analyzed using SPSS11.0.\n\n\nRESULTS\nAll objective parameters except for F0 had high correlation with G and the variance tendency of these parameters values was coherent with the extent of voice disorder. And there were statistical differences between adjacent voice disorder groups. Male and female objective multi-parameters protocols were established respectively consisting of jitter, shimmer, F0SD, NNE, HNR and MPT using discriminant analysis (P < 0.05). The concordance between perceptual evaluation and objective multi-parameters evaluation was 81.6% in male and 83.2% in female. The concordance of evaluation of normal voice and severe voice disorder groups were better than that of mild and moderate voice disorder groups. All mis-grading voices were judged in the adjacent voice group.\n\n\nCONCLUSIONS\nThe objective parameters of voice are able to reflect the characteristic of its perceptual evaluation and the concordance between perceptual evaluation and objective multi-parameters evaluation is good. The objective multi-parameters evaluation protocol we established could provide an objective and quantitative evaluation method for voice disorders.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"d01a47ad7e2649455a23a8d79dc4d89db131cd98","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2011","title":"[Study on the stability of perceptual evaluation of voice quality].","authors":"Gang Wang, Ping Yu, Wen Xu, Wu Wen, Chun-sheng Wei, Dong-yan Huang, Li-zhen Hou","author_ids":"4148672, 1803943, 3925920, 7738430, 7152946, 8312466, 8526165","abstract":"OBJECTIVE\nTo explore the factors that influence the stability of evaluation results judged by a jury through a standard research on perceptual evaluation measurements of voice quality.\n\n\nMETHODS\nVoice samples from 300 patients with dysphonia and 100 control subjects with normal voice were recorded and assessed by a jury composed of 6 experienced listeners from different hospitals. The voice samples were discourse voices and ordered randomly 3 times, and the mean of 3 evaluations using visual analogue scale were the final results. The jury was instructed to classify voice samples according to the G (grade), R (rough) and B (breathy) components of the GRBAS scale on a 4-point scale ranging from 0 for normal to 3 for severe dysphonia. Κ value was used to analyze the concordance of evaluation results and regression analysis was used to research the effects of the extent of voice disorder to the stability of perceptual evaluation.\n\n\nRESULTS\nThe discordance of evaluation existed both between the jury and in listeners themselves. The concordance of listeners themselves of each evaluation parameter was not bad, good, or even very good, and the concordance of evaluation of G was the best (κ value: 0.46 - 0.85), then R (κ value: 0.41 - 0.84) and B (κ value: 0.41 - 0.81). The concordance between the jury was worse than that in themselves. And except a listener whose concordance of evaluation was under the requirement, the concordance of evaluation of G was the best (κ value: 0.43 - 0.96), then R (κ value: 0.33 - 0.78) and B (κ value: 0.002 - 0.45). The stability of evaluation of normal voice and severe voice disorder was better than mild and moderate voice disorder.\n\n\nCONCLUSIONS\nThe discordance between the jury was the main factor that influence the stability of perceptual evaluation. The evaluation parameters and extent of voice disorder will influence the stability of perceptual evaluation of the jury.","cites":"0","conferencePercentile":"55"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"e0b23ea3f69f75cbdd904bc6c680818d54610159","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2015","title":"[The longitude study on the mental development of congenital hearing-impaired infants and toddlers].","authors":"Ying Yang, Liyan Wang, Xibin Sun, Yongming Wang, Yongqing Bao, Shenglin Xu, Haiying Lin, Lei Song, Di Zhong, Jian Wang, Kuibao Zhang, Yang Liu, Yuanyuan Zhang","author_ids":"1699160, 2419677, 8283466, 8703982, 5621415, 8182233, 8422633, 1733388, 5395877, 1743989, 4141459, 3136333, 4357244","abstract":"OBJECTIVE\nTo explore the effect of chronological age and acoustic device in cognitive development of congenital hearing-impaired infants and toddlers, and analyze the correlation of abilities in cognitive development with other factors.\n\n\nMETHODS\nDepending on chronological age (1 year old group and 2 years old group) and acoustic device (hearing aids and cochlear implantation), locomotor, personal-social, hearing and speech, hand and eye co-ordination, performance tests in Griffith Cognitive Development Scale were used to assess the cognitive development of 80 hearing-impaired infants and toddlers aged 0-2 years, including before intervention (0 month), after intervention (6, 12 months). Datas were analyzed by Repeated Measurements and Pearson Correlation Test.\n\n\nRESULTS\nDuring 1 year hearing intervention and rehabilitation, hearing and speech, performance and cognitive were extremely significant difference for each phase of early intervention (P < 0.01), the development of locomotor, personal-social, hand and eye co-ordination were no significant difference (P > 0.05). Personal-Social in 1 year old group with hearing impairment was much higher than 2 years old group P < 0.05). Hearing and speech in cochlear implanted group with hearing loss was much higher than hearing aids group. Cognitive development was positive correlation with various region development P < 0.01), and was negatively correlated with chronological age (P > 0.05).\n\n\nCONCLUSIONS\nCognitive development is proportional to recovery time. The chronological age of early intervention obviously affect deaf children's cognitive development. The ability of hearing and speech in cochlear implanted children is superior to children with hearing aids in severe and profound hearing impaired children.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"9120b4a5ff4c2ed17a3948a3ab55326194b90ec2","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2009","title":"[Tone-pip auditory brainstem response and auditory steady-state response of infants with normal hearing.].","authors":"Qian Lin, Xing-Qi Li, Li-Li Xiang, Ying-Hui Li, Hui Li, Wen-Ying Nie, Yi-Sheng Qi, Yi Wang","author_ids":"7358759, 7824529, 7738040, 8646221, 1750828, 8599640, 6422187, 1737720","abstract":"OBJECTIVE\nTo estimate tone-pip auditory brainstem response (tone-pip ABR) and auditory steady-state response (ASSR) thresholds to follow the development of hearing in four groups of normal babies through the first 6 month of life and to make a comparison between the tone-pip ABR and ASSR for 0.25 - 8 kHz frequency range at different groups.\n\n\nMETHODS\nThe tone-pip ABR and ASSR were recorded in four groups of normal hearing infants (160 ears) at the age of 2 - 4 day, 6 weeks, 3-month and 6-month. Tone-pip ABR and ASSR thresholds were established in 0.25, 0.5, 1, 2, 4 and 8 kHz stimuli.\n\n\nRESULTS\nFor click ABR, the wave latency of I, III, V and inter-wave latency of I-III, III-V and I-V decreased as the age increase. The developmental changes were obvious in wave I and III before 6 weeks and 3 months respectively. Tone-pip ABR had the similar waveform as the click ABR. With the frequency increasing, their waveforms and wave latencies of I, III and V were getting better and shorter respectively. There was significant difference between the thresholds of tone-pip ABR and ASSR (all P < 0.05). The tone-pip ABR thresholds were significantly lower than those of ASSR from 0.5 to 8 kHz. Both ASSR and tone-pip ABR had similar audiograms for different age of infants with normal hearing.\n\n\nCONCLUSIONS\nThe longitudinal findings presented in this study suggest that with the maturational development, the wave latency of I, III, V and inter-wave latency of I-III, III-V and I-V of tone-pip ABR decrease as the age increase, while the hearing sensitivity have no changes. Both tone-pip ABR and ASSR have stable frequency specificity. Compared to the ASSR, tone-pip ABR have lower response threshold and maybe nearer to the hearing level of the infant.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"15f20b804792ae9617133b88b0e64589585f4c31","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2007","title":"[Observation of neural electrophysiology and morphology in traumatic optic neuropathy in cat model].","authors":"Yan Jiang, Na Li, Nian-kai Zhang, Pin Dong, Lian-xin Liu","author_ids":"4338747, 1748656, 4276080, 7982007, 7954421","abstract":"OBJECTIVE\nTo establish the animal model of traumatic optic neuropathy similar to clinical feature by injuring the optic nerve of the pipeline through the ethmoid and sphenoid sinus. The electrophysiology and morphology were observed.\n\n\nMETHODS\nThe optic nerve in 2 cats was anatomically observed. Thirty healthy adult cats were divided into 1 h, 1 d, 3 d, 1 w, 2 w, 4 w injury groups. The right eye was selected as the experiment eye, and the left as the control. The optic canals were damaged by the injury instrument. The changes of optic nerve were observed using light and electron microscope. The pattern reversal visual evoked potential (PR-VEP) was used to determine the succeed model and pupil was monitored. PR-VEP and neural tissue morphology were examined at intervals of 1 h, 1 d, 3 d, 1 w, 2 w, 4 w after trauma.\n\n\nRESULTS\nEight cats had Marcus-Gunn's pupil, and 22 cats did not have after injury. Neural tissue was physaliphorous degeneration in light microscope. The neural fibers swelled gradually and fibers physaliphorous degeneration in the first day after damage. At the seventh day, the bubble enlarged to be a big flat. After two weeks, the big flat bubble came out to be a bigger bubble. Under the electronic microscope, axons were physaliphorous degeneration, crack emerged between axon membrane and myelin sheath and myelin sheath were loose in the first day. At the third day, axon swelled, physaliphorous degeneration rose and myelin sheath were loose obviously. At the seventh day, axon and myelin sheath appeared loop in half cycle and bubble-like broke up. A lot of pieces came out and axon became physaliphorous and uniform. Microtubule and microfilament disappeared. After two weeks, myelin sheath became onion-like. On fourth week, myelin sheaths enlarged and squeezed to center. Axoplasm disappeared and neural tissues collapsed.\n\n\nCONCLUSIONS\nThis animal model was similar to clinical optic nerve decompression through ethmoid and sphenoid sinus. The change of PR-VEP and neuromorphology were distinct before and after trauma. The pathological changes of optic nerve catching vibrated injury are mainly degeneration, so earlier decompression of optic nerve may improve the visual function.","cites":"0","conferencePercentile":"53.33333333"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"b2b6cd4bfa05e34664832b0125bdbf15c0ef1ff1","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2012","title":"[Functional analysis of the vertical semicircular canal using vertical plane swing test and study of its normal values].","authors":"Xin Peng, Qing Sun, Na Li, Li-jun Yang, Jing Dai, Xi-zheng Shan","author_ids":"8249542, 4673638, 1748656, 3514147, 7698478, 6002368","abstract":"OBJECTIVE\nThe purpose of this study was to set up a method to analyze the vertical semicircular canal function and study the normal values of the vertical semicircular canal function using the vertical plane swing test.\n\n\nMETHODS\nA prospective analysis of 100 normal persons (aged from 18 to 59 years), who were treated by using the vertical plane swing test with the newly developed automatic vestibular function diagnosis and therapy system (SRM-IV). These persons were rotated 180° at a sinusoidal speed (acceleration 45°/s, maximum speed 90°/s) in the vertical semicircular canal plane. Using a PC, evoked vertical nystagmus was analyzed in order to evaluate the excitability of vertical semicircular canals, including the number and the duration of nystagmus, the slow phase velocity and other parameters. Meanwhile, the all persons were divided into two groups, order and younger than 45 years respectively. In the test procedure, with the two pairs of the right anterior vertical semicircular canal and left posterior vertical semicircular canal (RALP) as well as the left anterior vertical semicircular canal and the rear right vertical semicircular canals (LARP), the average slow phase velocity of the vertical nystagmus and the canal paresis (CP) of the two pairs of vertical semicircular canals were calculated using PC and SPSS13.0 software for statistical analysis.\n\n\nRESULTS\nThere was no significant difference between the two groups (P > 0.05). The general CP of RALP was 10.2% ± 7.1%, and LARP was 10.4% ± 6.2%. The normal CP range of the vertical semicircular canal in the health group was identified (idea: ≤ 20%; normal high: 20% - 25%).\n\n\nCONCLUSION\nThe 180° vertical plane sinusoidal swing method is effective in functional analysis of the vertical semicircular canal, it is expected to be reliably used in clinical treatment.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","id":"8dcd8d7574e0c929ecd8e5768cf360acf358bf03","venue_1":"Zhonghua er bi yan hou tou jing wai ke za zhi = Chinese journal of otorhinolaryngology head and neck surgery","year":"2015","title":"[Olfactory function in patients with idiopathic Parkinson's disease].","authors":"Wei Hang, Gang Liu, Tong Han, Peilan Zhang, Jinling Zhang","author_ids":"8411450, 1697913, 2697104, 7914174, 8215235","abstract":"OBJECTIVE\nTo analyze the correlation between olfactory bulb (OB) volume with depth of olfactory sulcus (OS) and olfactory function in patients with idiopathic Parkinson's disease (IPD).\n\n\nMETHODS\nOne hundred patients with IPD between January 2011 to December 2013 in Tianjin Huanhu Hospotal were compared with one hundred controls in terms of olfactory function T&T testing, OB volume and depth of OS assessed with Magnetic resonance imaging (MRI). One hundred IPD patients were investigated and estimated H-Y degrees, UPDRS, MMSE, MoCA. SPSS 13.0 software was used to analyze the data.\n\n\nRESULTS\nT&T olfactory testing revealed that IPD patients (3.0 ± 0.3) had higher scores than controls (1.3 ± 0.2, t = 2.537, P < 0.01). Both men and women with IPD were affected by the same extent of olfactory loss (t = 0.893, P > 0.05). Both men and women as controls were affected by the same extent of olfactory loss(t = 1.184, P > 0.05). OB volume of left side in IPD patients was (34.25 ± 5.14) mm(3), right side was (35.79 ± 5.28)mm(3), average OB volume was (35.28 ± 5.21) mm(3); OB volume of left side in controls was (47.38 ± 6.47) mm(3), right side was (47.75 ± 6.51) mm(3), average OB volume was (47.53 ± 6.49) mm(3); OB volume were lower in IPD patients as compared to controls (t value were 2.876, 2.747, 2.798, all P < 0.01). OS depth study revealed no statistical difference between IPD patients and controls (t value were 0.914, 0.987, 0.951, all P > 0.05). Olfactory discriminate threshold was negatively correlated with average OB volume in IPD patients and controls (r value were -0.537,-0.526, both P < 0.05); was no correlated with average depth of OS (r value were -0.142, -0.157, both P > 0.05). There was relation between the average OB volume and UPDRS III, UPDRS, the degree of H-Y in IPD patients (r value were 0.312, -0.419, -0.358, all P < 0.05). However the average OB volume was not related to the course of disease (r = -0.089, P > 0.05).\n\n\nCONCLUSIONS\nThe OB volume is lower in IPD patients as compared to controls, the depth of OS have no significant changes in IPD patients; The OB volume is correlated with olfactory function, the depth of OS is not correlated with olfactory function; Olfactory function lower degree is accordance with serious degree in IPD patients, is not accordance with the course of disease.","cites":"18","conferencePercentile":"100"}]}