{"Zhonghua_yi_xue_yi_chuan_xue_za":[{"venue":"Zhonghua yi xue yi chuan xue za zhi = Zhonghua yixue yichuanxue zazhi = Chinese journal of medical genetics","id":"d1bf3eb6930c1aebea50d1e20f0d29095b176cb1","venue_1":"Zhonghua yi xue yi chuan xue za zhi = Zhonghua yixue yichuanxue zazhi = Chinese journal of medical genetics","year":"2016","title":"[Progress in epigenetic research on Alzheimer disease].","authors":"Nannan Yang, Yang Wei, Qian Xu, Beisha Tang","author_ids":"2062325, 4261301, 3218981, 7138053","abstract":"Alzheimer's disease (AD) is the most common neurodegenerative disorder, which features mainly with memory impairment as the initial symptom of progressive loss of cognitive function. Its main pathological changes include senile plaques and neurofibrillary tangles. The pathogenesis of AD is still unclear, though it may be connected with aging, genetic factors and environmental factors. Among these, aging and environmental factors can be modified by epigenetics. In this paper, advances in the study of epigenetic mechanisms related to the pathogenesis of AD are reviewed.","cites":"0","conferencePercentile":"75"},{"venue":"Zhonghua yi xue yi chuan xue za zhi = Zhonghua yixue yichuanxue zazhi = Chinese journal of medical genetics","id":"e4e22136f9cba7cedd2a755742161d3b53d497f3","venue_1":"Zhonghua yi xue yi chuan xue za zhi = Zhonghua yixue yichuanxue zazhi = Chinese journal of medical genetics","year":"2007","title":"[The study of the correlation between the clinical phenotype of spinal muscular atrophy and SMN2 gene copy number].","authors":"Li-ping Lu, Hong-wei Ma, Jun Jiang, Tao Wang, Bin Hu","author_ids":"8450099, 7186555, 8571266, 1685072, 1702845","abstract":"OBJECTIVE\nTo detect the correlation between the clinical phenotype of spinal muscular atrophy (SMA) and survival motor neuron gene (SMN2) copy number.\n\n\nMETHODS\nThe SMN2 gene copy numbers of 57 different types of SMA were detected by real-time fluorescence quantitative PCR method with TaqMan technique.\n\n\nRESULTS\nAverage SMN2 copy number was 1.017 +/- 0.090, 2.019+/- 0.080, 3.104+/- 0.170 in predicting one, two, three copy numbers, respectively, and CV was 8.9%, 3.9%, 5.4%, respectively. Average SMN2 copy number was 1.926+/- 0.460, 2.508+/- 0.460, 2.876+/- 0.270, in type I, II and III SMA, respectively. The SMN2 gene copy number in type II and III SMA were higher than that of type I SMA (P < 0.01). The SMN2 gene copy number in type III SMA was higher than that of type II SMA (P < 0.01). 85.72% of type I SMA patients usually had 2 SMN2 copies; 40% and 60% of type II SMA patients had 2 and 3 SMN2 copies, respectively; 82% of type III SMA patients had 3 SMN2 copies.\n\n\nCONCLUSION\nThere is significant correlation between the change of SMA clinical phenotype and SMN2 cope number. The distributions of the SMN2 gene copy number are various in different types of SMA patients. All types of SMA patients have at least one copy SMN2. The SMN2 gene copy numbers in type II, III SMA are higher than that of type I. All of these findings suggest that the severity of SMA patients depend on the change of the SMN2 copy numbers.","cites":"1","conferencePercentile":"100"},{"venue":"Zhonghua yi xue yi chuan xue za zhi = Zhonghua yixue yichuanxue zazhi = Chinese journal of medical genetics","id":"80fa7976a2d20caa5d7a2641c554eb10d928c093","venue_1":"Zhonghua yi xue yi chuan xue za zhi = Zhonghua yixue yichuanxue zazhi = Chinese journal of medical genetics","year":"2015","title":"[Difference in brain surface area between first-episode familial and sporadic schizophrenia and its association with COMT gene polymorphisms].","authors":"Yinfei Li, Wei Deng, Qiang Wang, Mingli Li, Na Li, Wei Lei, Zhe Li, Xiaohong Ma, Xiehe Liu, Tao Li","author_ids":"3330510, 1726776, 1715161, 2700479, 1748656, 2515581, 1794367, 2780835, 8016828, 1726351","abstract":"OBJECTIVE\nTo assess the association of impairment of surface area of first-episode schizophrenia(SZ) with polymorphisms of COMT gene, and the difference in the impaired patterns between familial patients with schizophrenia(FPS) and sporadic patients with schizophrenia(SPS).\n\n\nMETHODS\nNinety-eight patients with first-episode SZ(FPS=40, SPS=58) and 78 healthy controls were recruited. COMT gene was genotyped by polymerase chain reaction-restriction fragment length polymorphism (PCR-RFLP) method. Participants were scanned for 3.0T magnetic resonance images. Freesurfer software was used to analyze the difference in brain surface area between SZ and controls, its association with COMT genotypes, and the difference between SPS, FPS and control groups. Multiple tests were corrected using a Monte Carlo simulation at P<0.05.\n\n\nRESULTS\nCompared with controls, SZ showed decreased surface area in right occipital cortex and left prefrontal cortex. No association was found between COMT polymorphisms and whole brain area difference. Among the three subgroups, SPS showed smaller left prefrontal area compared with both FPS and control groups. Patients with SPS also showed significant area reduction in right occipital lobe compared with controls.\n\n\nCONCLUSION\nSurface area impairment can be found in those with first-episode SZ, but without association with COMT gene polymorphisms. The SPS have more severe area impairment than FPS, indicating that SPS and FPS may be attributed to different etiological mechanisms.","cites":"1","conferencePercentile":"100"},{"venue":"Zhonghua yi xue yi chuan xue za zhi = Zhonghua yixue yichuanxue zazhi = Chinese journal of medical genetics","id":"c347fb65b891b8c1cf6a2cf534acbd92f057e2af","venue_1":"Zhonghua yi xue yi chuan xue za zhi = Zhonghua yixue yichuanxue zazhi = Chinese journal of medical genetics","year":"2012","title":"[Genome-wide association study with memory measures as a quantitative trait locus for schizophrenia].","authors":"Bo Xiang, Jun-yao Wu, Xiao-hong Ma, Ying-cheng Wang, Wei Deng, Zhuang-fei Chen, Ming-li Li, Qiang Wang, Zong-ling He, Li-jun Jiang, Tao Li","author_ids":"5227082, 7162121, 7832416, 7708774, 1726776, 8157907, 8393216, 1715161, 7686736, 7921432, 1726351","abstract":"OBJECTIVE\nTo assess the association between gene polymorphisms and memory function through a genome-wide association study (GWAS) of schizophrenia and control group. Memory cognition was used as a quantitative trait (QT).\n\n\nMETHODS\nNinty-eight subjects with chronic schizophrenia and 60 matched controls were genotyped with HumanHap660 Bead Array. The results were correlated with quantitative traits including memory and memory delay.\n\n\nRESULTS\nFive candidate genes, including RASGRF2 (rs401758, P = 8.03×10(-5)), PLCG2 (rs7185362, P= 4.54×10(-5)), LMO1 (rs484161, P=9.80×10(-7), CSMD1 (rs2469383, P= 2.77×10(-6)) and PRKG1 (rs7898516, P=6.94×10(-5)) were associated with memory cognition deficits.\n\n\nCONCLUSION\nUsing memory cognition as a quantitative trait, this Genome- wide association study has identified 5 susceptibility loci. With their association with nervous system development, neuronal growth, axon guidance and plasticity, brain development, above loci may play a role in the development of memory dysfunction in schizophrenia.","cites":"1","conferencePercentile":"100"},{"venue":"Zhonghua yi xue yi chuan xue za zhi = Zhonghua yixue yichuanxue zazhi = Chinese journal of medical genetics","id":"f8bdc3794e430e8a2bdc912a4fb9c5bc74bd18ef","venue_1":"Zhonghua yi xue yi chuan xue za zhi = Zhonghua yixue yichuanxue zazhi = Chinese journal of medical genetics","year":"2009","title":"[Brain structure abnormality as genetic endophenotype of schizophrenia].","authors":"Chao-hua Huang, Wei Deng, Zhuang-fei Chen, Ming-li Li, Su Lu, Li-jun Jiang, Li-qian Cui, Qiang Wang, Xiao-hong Ma, Xie-he Liu, Qi-yong Gong, Tao Li","author_ids":"7900637, 1726776, 8157907, 8393216, 8090680, 7921432, 7385875, 1715161, 7832416, 8016675, 8599262, 1726351","abstract":"OBJECTIVE\nTo explore the role of genetic factors in the brain structural variation by using magnetic resonance imaging scan in schizophrenic patients and their unaffected siblings, and to provide experimental evidence for identifying endophenotype of schizophrenia.\n\n\nMETHODS\nThe optimized voxel-based morphometry (OVBM) was used to process the brain magnetic resonance images in 15 first episode drug-naive schizophrenic patients, 19 unaffected siblings of the patients and 38 normal control subjects. The data were analyzed by using general linear model.\n\n\nRESULTS\nCompared to the normal control subjects, significant decreases of gray matter was observed in first episode drug-naive schizophrenia in bilateral temporal lobe, bilateral occipital lobe, left insula, left frontal lobe superior frontal gyrus and right lentiform nucleus medial globus pallidus. Significant increases of gray matter in bilateral parietal lobe, bilateral limbic lobe cingulate gyrus in patients group while compared to controls were also found. In unaffected siblings, significant decreases of gray matter was observed in the right temporal lobe, bilateral occipital lobe, left insula, and left frontal lobe precentral gyrus, and significant increases of gray matter were found in left parietal lobe and bilateral cerebellum posterior lobe. Increased gray matter in left parietal lobe precuneus was found in first episode drug-naive schizophrenia when compared with their unaffected siblings.\n\n\nCONCLUSION\nThere were similar brain structure abnormalities between the first episode drug-naive schizophrenia and their unaffected siblings. Genetic factor may play important role in brain structural abnormality in schizophrenia, which suggested that the brain structural change might be a genetic endophenotype of schizophrenia.","cites":"0","conferencePercentile":"66.66666667"},{"venue":"Zhonghua yi xue yi chuan xue za zhi = Zhonghua yixue yichuanxue zazhi = Chinese journal of medical genetics","id":"08db3339c23cca701dcb95002ff3d623601c3753","venue_1":"Zhonghua yi xue yi chuan xue za zhi = Zhonghua yixue yichuanxue zazhi = Chinese journal of medical genetics","year":"2009","title":"[A twin study on intelligence and processing speed heritability of children and adolescent].","authors":"Xiao-wei Zhang, Yi Huang, Yun Xiang, Xin Gao, Ming-jing Situ, Hui Fang, Yi Zhang, Yi-xiao Fu, Lu Jia, Hua-qing Meng, Xiao-hong Ma, Ying-cheng Wang, Xie-he Liu, Tao Li","author_ids":"8444116, 5224616, 3349565, 2160489, 5744419, 2662691, 3251861, 7727015, 3587285, 7626388, 7832416, 7708774, 8016675, 1726351","abstract":"OBJECTIVE\nTo explore the effects of the genetic and environmental factors on intelligence of children and adolescent from the Southwest China Prospective Twin Registry (SCPT).\n\n\nMETHODS\nThe intelligence was investigated by using the Wechsler Intelligence Scale for Children (C-WISC) in 333 twin pairs aged 6-16 years. The effects of genetic and environmental factors on IQ were analyzed by using structural equation modeling (SEM) and correlation analysis method. The effects in different sex and age groups in this population were also investigated.\n\n\nRESULTS\nGenetic influence accounted for 0.43 of total IQ variance and 0.37 of verbal IQ in 6-16 years old children and adolescent, but there was no significant genetic effect on performance IQ. The heritability of children aged 10-16 years was higher than that of those aged 6-10 years (total IQ: 0.82 vs 0.00, verbal IQ: 0.80 vs 0.00, performance IQ:0.51 vs 0.00). In males the heritability of verbal IQ (0.47) was higher than that in females (0.05). The shared environmental influences accounted fo r the majority of variance of performance IQ in both males and females.\n\n\nCONCLUSION\nThere is moderate heritability on the total IQ and verbal IQ, while shared environmental factors played important roles on the variance of performance IQ. The heritability of IQ, verbal IQ and performance IQ are higher in older children and adolescent than that in younger children.","cites":"0","conferencePercentile":"66.66666667"},{"venue":"Zhonghua yi xue yi chuan xue za zhi = Zhonghua yixue yichuanxue zazhi = Chinese journal of medical genetics","id":"4e71f9f0b1d55c5646951f6464c07aa6d07b711b","venue_1":"Zhonghua yi xue yi chuan xue za zhi = Zhonghua yixue yichuanxue zazhi = Chinese journal of medical genetics","year":"2014","title":"[Advance in studies on dopamine system related genetic polymorphisms associated with nicotine dependence].","authors":"Chao Wang, Wei Qian, Minming Zhang","author_ids":"6250419, 8673260, 3148674","abstract":"Nicotine is the main component for smoking addiction. It is widely believed that nicotine dependence is heritable. Many studies are committed to study the effects of specific gene polymorphisms connect with nicotine dependence. Release of dopamine has been considered the most important channel for nicotine dependence. This paper provides a review for recent advance in studies on dopamine system related genetic polymorphisms associated with nicotine dependence.","cites":"0","conferencePercentile":"100"}]}