{"Zhongguo_Zhong_yao_za_zhi__Zhon":[{"venue":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","id":"2a18744d05a14d7a6eaa201d76c52c0ce7422742","venue_1":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","year":"2013","title":"[Species study on Chinese medicine leech and discussion on its resource sustainable utilization].","authors":"Wei Zhang, Rui-Xian Zhang, Jian Li, Fei Liang, Zhong-Zhi Qian","author_ids":"8660382, 4321672, 1701502, 3312344, 4008441","abstract":"Through systemically sorting and studying literature of Chinese medicine, this article pointed out that leech used by the traditional Chinese medicine in ancient time has the features of small, living in water, able to suck blood of animal and people. The species of leeches having these features were Hirudo nipponia Whitman, H. pulchra Song, Poecilobdella nanjingensis sp. Nov. , P. manillensis (Lesson) and P. hubeiensis Yang, which were not fully coincidence with the species recorded in Chinese Pharmacopeia of 2010 edition. We suggests that species of leech in Chinese Pharmacopeia be revised: H. nipponica Whitman should be kept, P. manillensis (Lesson) should be added in, Whitmania pigra Whitman and W. acranulata Whitma should be temporarily reserved, and H. pulchra Song, P. nanjingensis sp. Nov. , and P. hubeiensis Yang should be considered.","cites":"0","conferencePercentile":"33.33333333"},{"venue":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","id":"5bddca1c06c09d76f98de0c7ff076253713d3568","venue_1":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","year":"2010","title":"[Effect of oxysophoridine on electric activities and its power spectrum of reticular formation in rats].","authors":"Jianqiang Yu, Yuxiang Li, Chengjun Zhao, Xin Gong, Jianping Liu, Feng Wang, Yuanxu Jiang","author_ids":"7177392, 2400208, 8132155, 8122059, 2227138, 1745827, 6686640","abstract":"OBJECTIVE\nTo observe the effect of oxysophoridine (OSR) on the EEG and its power spectrum of reticulum formation in mesencephalon of anaesthetized rat.\n\n\nMETHOD\nUtilizing the technique of brain stereotactic apparatus, electrodes were implanted into reticulum formation of mesencephalon. Monopolar lead and computerized FFT technique were employed to record and analyse the index of EEG, power spectrum and frequency distribution in order to study the effect of oxysophoridine on the bioelectricity change of mesencephalon reticulum formation in rats.\n\n\nRESULT\nAfter administrating(icy) with oxysophoridine at the dose of 2.5,5, 10 mg/rat, the EEG of mesencephalon reticulum formation mainly characterized with low amplitude and slow waves accompanied by spindle-formed sleeping waves with a significant decrease of total power of EEG (P < 0.05) while the ratio of theta, alpha waves increased in total frequency of rats (P < 0.05).\n\n\nCONCLUSION\nOxysophoridine possesses central inhibitory effects and its inhibitory mechanism may associate with the reduction of bioelectricity in mesencephalon reticulum formation. Mesencephalon reticulum formation may serve as one part of the structure serving as the circuit conducting the central inhibitory effect of oxysophoridine. [Key words] oxysophoridine; reticulum formation; electroencephalogram (EEG) ; rats","cites":"0","conferencePercentile":"50"},{"venue":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","id":"6f034f5cc2dbc12f867a473496854fdb71cb9917","venue_1":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","year":"2010","title":"[Effect of ginsenoside Rg1 on expressions of phosphory protein tau and N-methyl-D-aspartate receptor subunits NR1 and NR2B in rat brain slice model of Alzheimer's disease].","authors":"Xi Li, Ying Liu, Xin Zhang, Haifeng Yuan, Qiankun Quan","author_ids":"1742869, 1718041, 2552714, 2062297, 4307830","abstract":"OBJECTIVE\nTo investigate the effect of ginsenoside Rg1 on the expressions of phosphory protein Tau (P-Tau), N-methyl-D-aspartate receptor subunit 1 (NR1) and N-methyl-D-aspartate receptor subunit 2B(NR2B) in rat brain slice model of Alzheimer's disease.\n\n\nMETHOD\nBrains of 5-week-old Wistar rats were cut into slices which were 400 microm thick. These brain slices were randomly divided into normal control group, untreated group, low-dose ginsenoside Rg1 group, medium-dose ginsenoside Rg1 group and high-dose ginsenoside Rg1 group, with 10 slices in each group. All brain slices were cultured with artificial cerebrospinal fluid (ACSF) that was aerated via polyethylene tubing attached to a source of 95% O2, 5% CO2 at (32.0 +/- 0.5) degrees C. And brain slices in the ginsenoside R1 groups were administrated with the ginsenoside Rg1 (60, 120 and 240 micromol x L(-1) respectively) in ACSF for 2 h firstly. Then okadaic acid (OA) was administrated into ACSF of untreated group and ginsenoside Rg1 groups separately for 3 h to induce Tau phosphorylation to prepare AD models. The concentration of OA in each group was 1 micromol x L(-1). And there was no any intervention for the brain slices in the normal control group. The expressions of P-Tau, NR1 and NR2B in brain slices in each group were determined by immunohistochemical method, and the results were analyzed by image acquisition and analysis system.\n\n\nRESULT\nCompared with the normal control group, the expression of P-Tau was significantly increased (P < 0.05 or P < 0.01) and the expressions of NR1 and NR2B were decreased (P < 0.01) in untreated group. Compared with the untreated group, the expression of P-Tau was significantly decreased (P < 0.01 or P < 0.05) and the expressions of NR1 and NR2B were increased (P < 0.01 or P < 0.05) in ginsenoside Rg1 groups, especially in high-dose ginsenoside Rg1 group.\n\n\nCONCLUSION\nGinsenoside Rg1 can play the role of anti-dementia by inhibiting the expression of P-Tau so as to slow the formation of neurofibrillary tangles and increasing the expression of NR1 and NR2B so as to improve learning and memory abilities in rat brain slice model of Alzheimer's disease.","cites":"3","conferencePercentile":"100"},{"venue":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","id":"a23346af173130c532caf7329532d256ec11233e","venue_1":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","year":"2013","title":"[Effects of Shenwu capsule on learning-memory ability and cholinergic function of brain in AD-like rat model induced by chronic infusion of sodium azide by minipump].","authors":"Lan Zhang, Ru-Yi Zhang, Ya-Li Li, Li Zhang, Cui-Fei Ye, Lin Li","author_ids":"4514211, 4829654, 8646133, 1712838, 4574761, 1686030","abstract":"Because of the proposed importance of mitochondrial cytochrome C oxidase (COX) decrease in Alzheimer's disease (AD) , the protective effect of Shenwu capsule on mitochondrial deficiency model rats and its pharmacological mechanism were investigated in present study. Rats were administered with azide at 1 mg . kg-1 . h-1 subcutaneously via an Alzet minipump for 30 days. Tweny-four hours after the operation, the rats were administered intragastrically by Shenwu capsule with the dose of 0. 45, 0. 9 and 1. 8 g . kg-1 . d-1 for one month. Then learning-memory ability was determined by the watermaze test and passive avoidance tests. The activity of choline-acetyl-transfertase(ChAT) and acetylcholinesterase (AChE) in hippocampus and cortex of rats were measured by radiochemical method and hydroxylamine colorimetry separately. M-cholinergic receptor binding ability (M-binding) was assayed by radio binding. Chronic infusion of sodium azide via minipump induced learning-memory deficiency of rats. Both ChAT activity and M-binding decreased in hippocampus and cortex of model rats, however, the activity of AChE increased in hippocampus and was not affected at the cortex. As the result, the cholinergic function of the brain decreased in model rats. Shenwu capsule significantly improved learning and memory ability and the mechanism may be related with the improved cholinergic function in model brain: ChAT activity and M-binding significantly increased in Shenwu treated groups compared with model group; and the increased activity of AChE in hippocampus returned to normal. Mitochondria, especially mitochondrial cytochrome C oxidase, may play the key role in the early event of AD. Chronic, partial in vivo inhibition of mitochondrial cytochrome C oxidase in rats provides a suitable model mimicking several aspects of AD. Shenwu capsule indicate effectiveness in AD-like mitochondrial deficiency model rats, so it would be applied in the treatment of AD.","cites":"0","conferencePercentile":"33.33333333"},{"venue":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","id":"d097fa647c9de25e245bfe4c1d84c1473687a8ca","venue_1":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","year":"2014","title":"[Effect of synchronous perfusion of NaN3 in changes in content of cholinergic neurotransmitter in medial prefrontal cortex and hippocampal extra-cellular fluid].","authors":"Mei-Yu Zhang, Dan-Dan Sun, Yang Liu, Yue Cui, Xiao-Liang Zhao, Ying Zhang, Zhi-Guo Wang, Dan-Qiao Wang","author_ids":"3036555, 7679401, 1750084, 3173721, 8343479, 1752812, 2223433, 7496210","abstract":"OBJECTIVE\nTo observe the effect of synchronous perfusion of specific respiratory chain complex IV inhibitor sodium azide (NaN3) in brain on rat ventromedial prefrontal cortex (mPFC) and acetylcholine (ACh) and choline (Ch) contents in hippocampal extra-cellular fluid, and establish the AD rat model induced by mitochondrial acute injury.\n\n\nMETHOD\nThe synchronous dual-probe dual-channel brain microdialysis sampling technology was applied to synchronously perfuse modified Ringer's solution containing NaN3 (50 micro mol L-1) and neostigmine (2 micro mol L-1) into mPFC and hippocampus of conscious, freely moving normal rats, and continuously collect dialysates from different encephalic areas. Dynamic contents of ACh and Ch were determined by high performance liquid chromatography-post-column immobilized enzyme reactor-electrochemical process.\n\n\nRESULT\nACh and Ch contents in mPFC extracellular fluid of normal rats were higher than that in hippocampus. During the process of perfusion, NaN3 could significantly reduce ACh in mPFC/hippocampal extra-cellular fluid, but remarkably increase Ch, and constantly inhibit the recovery of ACh and Ch contents in mPFC/hippocampus.\n\n\nCONCLUSION\nThe synchronous perfusion of NaN3in rat mPFC and hippocampus can injure functions of the cholinergic nerve projection area, and cause the acute AD model with ACh and Ch metabolic disorders. This model can be used in pathogenetic and pharmacological studies.","cites":"0","conferencePercentile":"42.85714286"},{"venue":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","id":"a5821f31af6c16f15a652232f23aab9a186f7057","venue_1":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","year":"2013","title":"[Effects of icariin on beta-amyloid and neurotrophic factors in brain of mitochondrial deficiency model rats].","authors":"Ru-Yi Zhang, Li Zhang, Hou-Xi Ai, Lan Zhang, Lin Li","author_ids":"4829654, 1712838, 4379679, 4514211, 1686030","abstract":"The purpose of the present study was to investigate the effects of icariin (ICA) on the content of beta-amyloid (Abeta) and the expression of neurotrophic factors in the brain of mitochondrial deficiency model rats. SD rats were infused subcutaneously with sodium azide, which is an inhibitor of mitochondrial respiratory chain complex IV, via a minipump (0. 5 mg . kg-1 h-1) for 28 days to establish the mitochondrial deficiency animal model. The activity of mitochondrial respiratory chain complex IV (i. e. cytochrome C oxidase, COX) in hippocampus was measured by biochemical methods. ELISA method was used to detect the content of Abeta in the brain. The expression of neurotrophic factors was detected by Western blot and immunohistochemistry methods. Image analysis was performed by Image-pro software. The results showed that chronic infusion of sodium azide by minipump induced a significant decrease in the activity of mitochondrial cytochrome C oxidase, an obvious increase in the content of Abeta, and a marked decline in the expression of nerve growth factor (NGF), brain-derived neurotrophic factor (BDNF) and its receptor TrkB in the brain of rats. Intragastrical administration of ICA (12 or 36 mg . kg-l) significantly ameliorated all these abnormalities in the model rats. In conclusion, ICA can increase mitochondrial activity, inhibit Abeta production, and enhance the expression of neurotrophic factors in the brain of model rats induced by sodium azide. The results suggested that ICA may have beneficial prospect for the treatment of Alzheimer's disease.","cites":"1","conferencePercentile":"72.22222222"},{"venue":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","id":"c683f06d68b5da43caa6982cfac8936e9a8eb5d8","venue_1":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","year":"2009","title":"[Progress in research of processing of fructus Evodiae-Rhizoma Coptidis and research thoughts and methods of its processing mechanism].","authors":"Xiaobin Jia, Jun Jiang, Bin Chen, Yan Chen, Kun Hao, Baochang Cai, Hao Wu, Guangming Yang","author_ids":"5300317, 4733562, 3671409, 1700696, 2852495, 8411976, 1739602, 8250730","abstract":"This article ascended the history and successive changes of the processing research of Fructus Evodiae-Rhizoma Coptidis, and its application in classic prescription; made a summary on the research of the processing technology and substances of Fructus Evodiae-Rhizoma Coptidis; discussed the progress in the research of processing of Fructus Evodiae-Rhizoma Coptidis; expounded the overview on mechanism research of the processing of Fructus Evodiae-Rhizoma Coptidis, and proposed new thoughts and methods for the processing of Fructus Evodiae-Rhizoma Coptidis.","cites":"0","conferencePercentile":"50"},{"venue":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","id":"c6c9fce66dacc5bae4d7271892bb539879d29114","venue_1":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","year":"2013","title":"[Advance in studies on effect of paeoniflorin on nervous system].","authors":"Zeng-Yao Hu, Lan Xu, Rong Yan, Yan Huang, Gang Liu, Wen-Xia Zhou, Yong-Xiang Zhang","author_ids":"6761708, 2439531, 1767526, 1752621, 1697913, 7670382, 3246644","abstract":"Paeoniflorin (PF) is the chief active component of paeonia, with diverse pharmacological actions and wide application. Recently, the effect of PF on nervous system has attracted increasingly more attention. According to current study findings, PF can ameliorate the decline of memory and learning capacities in many dementia model animals, and have effect in protecting the cerebral ischemia injury, treating Parkinson's disease, reliving pain and improving neural synapse plasticity. Thought its mechanism has not been clarified, current findings show that adenosine A1 receptor plays an important role, while M cholinergic receptor, opiate receptor, calcium ion channel and NF-KB may also play a part in paeoniflorin's effect on nervous system.","cites":"4","conferencePercentile":"100"},{"venue":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","id":"68b7eee5b06ba71dad60877b0fc3ff53f6345ac9","venue_1":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","year":"2013","title":"[Analgesic effect of sinomenine on SSNI model rats and monoamine neurotransmitters in striatal extracellular fluid].","authors":"Mei-Yu Zhang, Peng Li, Dan-Qiao Wang, Xiao-Hong Niu, Ye Wang, Zhi-Guo Wang, Ying Zhang, Shi Xu, Xiao-Jun Xu","author_ids":"3036555, 1722268, 7496210, 8486263, 1681196, 2223433, 1752812, 4026517, 7925898","abstract":"OBJECTIVE\nTo observe the analgesic effect of sinomenine on the neuropathic pain rat model induced by SSNI, and discuss its impact on monoamine neurotransmitters in striatal extracellular fluid.\n\n\nMETHOD\nMale SD rats were randomly divided into the sham operation group, the SSNI model group, the gabapentin group (100 mg x kg(-1)), the sinomenine high dose group (40 mg x kg(-1)) and the sinomenine low dose group (20 mg x kg(-1)). Mechanical hyperalgesia and cold pain sensitivity were evaluated by Von Frey hairs and cold spray. Striatum was sampled by microdialysis. High performance liquid chromatography-electrochemical detector (HPLC-ECD) were used to detect the content of such neurotransmitters as monoamine neurotransmitters noradrenaline (NE), dopamine (DA), 5-hydroxy tryptamine (5-HT) and their metabolites dihydroxyphenylacetic phenylacetic acid (DOPAC) and 5-hydroxyindoleacetic acid (5-HIAA).\n\n\nRESULT\nSSNI model rats showed significant improvement in mechanical withdrawal threshold and cold pain sensitivity, significant decrease in intracerebral NE and notable increase in DA, 5-HT and their metabolites. Compared with the model group, the sinomenine high dose group showed significant increase in mechanical withdrawal threshold at 60, 90, 180 and 240 min after abdominal administration (P < 0.01), significant decrease in cold pain sensitivity score during 30-240 min (P < 0.05). Sinomenine can significantly up-regulated NE content in striatal extracellular fluid during 45-135 min (P < 0.05), remarkably reduce DA content and DOPAC at 45, 75 and 135 min (P < 0.05), 5-HT content during 45-135 min, DOPAC during 75-165 min (P < 0.05), and 5-HIAA during 45-135 min (P < 0.05).\n\n\nCONCLUSION\nSinomenine has the intervention effect on neuropathic pain in SSNI model rats. Its mechanism may be related to disorder of monoamine neurotransmitters in striatal extracellular fluid.","cites":"0","conferencePercentile":"33.33333333"},{"venue":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","id":"f6c8d77a5f46ca4f7ad998a1295deb25acac167f","venue_1":"Zhongguo Zhong yao za zhi = Zhongguo zhongyao zazhi = China journal of Chinese materia medica","year":"2009","title":"[Effect of total flavonoids of jiawei wuzi yanzong prescription on VGCCs induced by amyloid-beta25-35 peptide in CA1 pyramidal neurons of rat hippocampal slice].","authors":"Li Li, Haoran Cai, Lin Li, Xuemei Wang","author_ids":"1682059, 7697739, 1686030, 8416570","abstract":"OBJECTIVE\nTo explore the effect of the total flavonoids of Jiawei Wuzi Yanzong prescription on the Voltage-gated calcium channel of the CA1 pyramidal cell of rat hippocampus.\n\n\nMETHOD\nThe inward calcium current was recorded by the whole-cell patch clamp and the amplitude of it was thought to observe the effect of Abeta25-35 and the total flavonoids. The hippocampus of rat was separated and cut into slices. Active pyramidal cells of slices were chosen for the whole-cell patch clamp recording. After exposure to Abeta25-35, voltage steps (500 ms) were used to depolarize stepwise in a range from 50 to +50 mV (increment: 5 mV). An inward Ca2+ current which was suggested to be survey was evoked. Application of the total flavonoids was to be observed if it had effect on this voltage-depended inward current.\n\n\nRESULT\nAbeta25-35 could enhance the calcium current to induce intracellular calcium overload. The amplitude of the control group was--(157.1 +/- 19.9) pA, but after application of Abeta25-35 the current enhanced to--(323.2 +/- 23.4) pA. When the total flavonoids at concentration of 125, 250, 500 g x L(-1) were added, the current declined to--(257.9 +/- 31.6), - (196.4 +/- 29.8) and--(169.3 +/- 34.0) pA, respectively.\n\n\nCONCLUSION\nAbeta-induced intracellular calcium overload may be one of neurotoxic of beta-amyloid peptide. The total flavonoids of Jiawei Wuzi Yanzong prescription can suppress inward calcium current to protect neurons.","cites":"0","conferencePercentile":"50"}]}