{"Zhong_yao_cai__Zhongyaocai__Jou":[{"venue":"Zhong yao cai = Zhongyaocai = Journal of Chinese medicinal materials","id":"a0c5870dfdcf6165ecc63d64d9c78a96d3f89888","venue_1":"Zhong yao cai = Zhongyaocai = Journal of Chinese medicinal materials","year":"2006","title":"[The effect of ligustrazine on cells proliferation in cortex and striatum after focal cerebral ischemia in adult rats].","authors":"Fen Qiu, Yong Liu, Peng-Bo Zhang, Ying-Fang Tian, Jian-Jun Zhao, Qian-Yan Kang, Cun-Fang Qi, Xin-Lin Chen","author_ids":"3826433, 7135550, 7914287, 5011580, 7817837, 8038312, 8629297, 4263642","abstract":"OBJECTIVE\nTo explore the effect of Ligustrazine on cells proliferation in cortex and striatum after focal cerebral ischemia in adult rats.\n\n\nMETHODS\nFocal cerebral ischemia was induced by left middle cerebral artery occlusion (MCAO) with suture method. Two hours later, injection of Ligustrazine (80 mg/kg, 1 time/d) was performed peritoneally. Four hours after the ischemia, 5-bromodeoxyuridine (BrdU) (50 mg/kg, 1 time/d) was injected peritoneally. At 7d, 14d and 21d after ischemia, BrdU-Labeled cells in the cortex and striatum were observed by immunohistochemical staining.\n\n\nRESULTS\nIn ischemia model group, at 7 day, BrdU-labeled cells were observed in the ipsilateral cortex and striatum. With the prolongation of ischemia, the number of BrdU-labeled cells increased, reached the peak at 21d. In Ligustrazine group, BrdU-labeded cells were observed with an intense distribution in ischemic penumbra of the cortex and striatum. With the prolongation of ischemia, the number of BrdU-labeled cells increased significantly at 14d, and reached the peak at 21d. The numbers of BrdU-labeled cells at 7d, 14d and 21d were more than those in ischemia model group respectively.\n\n\nCONCLUSION\nLigustrazine increase the proliferated cells in the cortex and striatum after focal cerebral ischemia in adult rats. The results suggest that it may be useful for promoting self-repair after ischemia.","cites":"2","conferencePercentile":"100"},{"venue":"Zhong yao cai = Zhongyaocai = Journal of Chinese medicinal materials","id":"09474e6d7dce57a1f8c56a7bd45331c8cbf1eb14","venue_1":"Zhong yao cai = Zhongyaocai = Journal of Chinese medicinal materials","year":"2009","title":"Breviscapine improves functions of spatial learning and memory of focal cerebral ischemia rats.","authors":"Jian-Xin Liu, Yong Liu, Xin-Lin Chen, Jian-Jun Zhao, Tu-Sheng Song, Yi-Hua Qian","author_ids":"3987243, 7135550, 4263642, 7817837, 7354348, 6099132","abstract":"OBJECTIVE\nTo investigate the effects of breviscapine on the functions of spatial learning and memory of focal cerebral ischemia rats.\n\n\nMETHODS\nRots withl the left middle cerebral artery occluded were made by an intraluminal filament. Then breviscapine (20 mg/kg,40 mg/kg) in experimental group and 10% glucose in control group were administered intraperitoneally once a day for 2 weeks, and the Morris water maze tasks were carried out for 5 days.\n\n\nRESULTS\nCompared with sham-operation group,the animals of ischemia-control group exhibited seriously impaired spatial learning and memory in both place navigation test and spatial probe test. In the place navigation test, the mean value of escape latency in breviscapine group was significantly shorter than that in ischemia control group (P < 0.01 for lower-dose and P < 0.05 for higher-dose breviscapine group, respectively). In the spatial probe test,compared with sham-operation (P < 0.01) and breviscapine group (P < 0.01), the rats of ischemia-control group spent more time in the no-former platform quadrant, and showed reduced frequency of crossing former platform site significantly. The numbers of neurons with Nissl staining and choline acetyltransferase (ChAT) immunopositive neurons in ipssilateral cortex in the breviscapine group were significantly more than those in the ischemia-control group (P < 0.01). In hippocampus, the numbers of neurons with Nissl staining and ChAT immunopositive neurons in the stratum pyramidale of CA area were similar among the groups.\n\n\nCONCLUSION\nThese results indicate that breviscapine can improve the functions of spatial learning and memory of focal cerebral ischemia rats and the protection against the loss of ChAT immunopositive neuron in new cortex may be involved in its mechanisms.","cites":"1","conferencePercentile":"100"}]}