{"Zhonghua_yan_ke_za_zhi_Chinese_":[{"venue":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","id":"b53a5200b0d38e18e2a73b52d150c96efe06bc31","venue_1":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","year":"2006","title":"[Guidance of regenerative axons in optic nerve regeneration in Bcl-2 overexpressing mice].","authors":"Liu Yang, Dong-feng Chen","author_ids":"1745614, 7167444","abstract":"OBJECTIVE\nTo determine whether optic nerve can regenerate after optic nerve crush and weather the regenerating axon reaches the target in the brain in Bcl-2 overexpressing mice.\n\n\nMETHODS\nLeft eye optic nerve crush was performed in wild-type (C57Bl/6J) and Bcl-2 transgenic mouse pups at 3 days after birth (P3), followed immediately by the opposite eyeball enucleated. Mouse pups were killed at 4 days post-surgery. Optic nerve regeneration was assessed at the sections of optic nerve and the brain. An anterograde tracer, cholera toxin B subunit conjugated with fluorescein (CTB-F), was applied intraocularly, immediately after optic nerve crush to label retinal ganglion cell axons. Immunofluorescence staining with anti-GAP-43 was carried out to reveal regenerating axons in optic nerve sections.\n\n\nRESULTS\nIn wild-type mice, severed optic nerves failed to regenerate. In contrast, in all of the Bcl-2 transgenic mice examined, optic nerves regenerated robustly over long distances, but the regenerating fibers were found to deviate from the optic pathway and grew into the forebrain to form aberrant projection.\n\n\nCONCLUSION\nWhen the opposite eyeball is removed in P3 Bcl-2 overexpressing mice with optic nerve was crushed in one side, the guidance from the normal optic pathway is lost, the optic nerve could regenerate and reach the brain, but the regenerating axons could not reach both side of target in the midbrain, they grow into aberrant place of forebrain.","cites":"0","conferencePercentile":"54.16666667"},{"venue":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","id":"ebac6604d12701aa95b408b13939fd75728892d7","venue_1":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","year":"2012","title":"[The research advances of intrinsically photosensitive retinal ganglion cells].","authors":"Rui-lin Zhu, Liu Yang","author_ids":"7590003, 1745614","abstract":"Intrinsically photosensitive retinal ganglion cells (ipRGC) are photosensitive cell besides rods and cones. These cells are crucial for circadian photoentrainment and pupillary light reflex. Some chronobiologists and ophthalmologists have focused on these ipRGC in recent years. However, little research has been done by Chinese scientists. Here we review the recent advances about biological features, physical functions and clinical applications of ipRGC.","cites":"0","conferencePercentile":"41.66666667"},{"venue":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","id":"a13795dac7c901626e927b95cc00f211110c4488","venue_1":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","year":"2005","title":"[Optic nerve regeneration in Bcl-2 overexpressing mice].","authors":"Liu Yang, Kin-sang Cho","author_ids":"1745614, 7405507","abstract":"OBJECTIVE\nTo determine whether overexpression of Bcl-2 is sufficient to support optic nerve regeneration in mouse in the early neonatal stage, when the brain environment remains permissive for axonal growth, and whether regenerating axons follow the guidance cues to reach the appropriate targets in the brain.\n\n\nMETHODS\nOptic nerve crush was performed in wild-type (C57BL/6J) and Bcl-2 transgenic mouse pups at 3 days after birth (P3). To assess optic nerve regeneration, mouse pups were allowed to survive for 1-4 days post-surgery. An anterograde tracer-cholera toxin B subunit (CTB) and anti-GAP-43 immunofluorescence were applied to reveal regenerating axons.\n\n\nRESULTS\nIn wild-type mice, severed optic nerves failed to regenerate, and most severed axons retracted within 24 hour post-surgery. In contrast, in all of the Bcl-2 transgenic mice examined, optic nerves regenerated robustly over long distances and reached their brain targets in 4 days after optic nerve crush. However, the majority of regenerating axons, appearing to follow the existing optic tract and visual pathways, entered the visual targets that were ipsilateral to the nerve injury. Much less number of regenerating axons innervated their contralateral visual targets.\n\n\nCONCLUSION\nOverexpression of Bcl-2 is sufficient to support the intrinsic growth mechanisms of retinal ganglion cell axons and enables robust optic nerve regeneration over long distances in vivo if the injury is incurred at 3 days after birth. However, the regenerating axons appear to follow the existing CNS pathways and innervate uninjured brain areas.","cites":"0","conferencePercentile":"33.33333333"},{"venue":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","id":"1f19714bb3883d54a60fb360e5282113612bffdf","venue_1":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","year":"2008","title":"[Observation on morphology and function of macular in pathologic myopia].","authors":"Ying Tu, Wen-Bin Wei, Dan Zhou, Dong-Sheng Wang, Yan Liu, Ming Zhao","author_ids":"3158962, 7736751, 1751069, 7496791, 1681842, 1736537","abstract":"OBJECTIVE\nTo observe the morphology and function of the macular in pathologic myopia by the combination of the fundus examination, optic coherence tomography and multifocal electroretinogram (mERG). To analyze the relationships among macular function, ocular axis length, refraction and corrected visual acuity.\n\n\nMETHODS\nCase series including 36 eyes of 31 consecutive pathologic myopia cases, which were chosen from Tongren Eye Center from February to April 2006 and divided into two groups according to ocular axis length:group A, composed of 12 eyes from 10 cases (axis length > or = 30.00 mm) and group B, composed of 24 eyes from 21 cases (<30.00 mm). Manifest refraction, A and B scan, fundus examination, OCT scan for the macular area, the measurement of the thickness of the retinal neuroepithelial layer and mERG were carried out for each eyes. The results were further analyzed by comparing the ocular axis length, diopter of myopia, corrected visual acuity, results of the OCT study and mERG. Relationships among the macular function, ocular axis length, refraction and corrected visual acuity were also analyzed.\n\n\nRESULTS\nThe mean ocular axis length, diopter of myopia, corrected visual acuity of group A were (31.77 +/- 1.27) mm, (-22.92 +/- 7.10) D and (0.31 +/- 0.25), respectively. The mean ocular axis length, diopter of myopia, corrected visual acuity of group B were (28.64 +/- 1.17) mm, (-14.03 +/- 5.37) D, (0.55 +/- 0.35 ), respectively. Statistically significant difference was shown between these two groups (t = -2.28, P<0.05). The thickness of neural retina of area 1 to 5 in group A was smaller than that of group B, and significant differences exists between these two groups (P = 0.016, 0.032, 0.048, 0.009, 0.002). There were statistical differences in amplitude densities of P1 waves in central macular, super-temporal quadrants, super-nasal quadrants and infer-nasal quadrants between these two groups (t = 3.63, 2.71, 2.21, 2.32, 2.64, P<0.05). Amplitude densities of P1 waves showed negative correlation to ocular axis length (r = - 0.498, P<0.01) and positive correlation to corrected visual acuity (r = 0.468, P<0.01). Ocular axis length showed positive correlation to diopter of myopia (r = 0.800, P<0.01) and negative correlation to corrected visual acuity (r = -0.605, P<0.01). Diopter of myopia was negatively correlated to corrected visual acuity (r = -0.616, P< 0.01).\n\n\nCONCLUSIONS\nVisual function loss in pathologic myopia is correlated with the increase of diopter of myopia, decrease of corrected visual acuity, increased macular disease and decreased macular function and extensive elongation of ocular axis in pathologic myopia. A combination of fundus examination, OCT scan and mERG may contribute to the earlier detection and monitoring of progression of the macular abnormality.","cites":"0","conferencePercentile":"55.55555556"},{"venue":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","id":"6e47c6c6c801ad103e61c6f0e7f902a8ab1b31ff","venue_1":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","year":"2005","title":"[Studies on vision mediated behavioral changes of rat with photic injury].","authors":"Xue-min Li, Xiao-yong Chen, Li Shen, Chun Zhang, De-bo You, Xue Chen, Hai-yan Yu, Wei Wang","author_ids":"7824355, 8082670, 1712125, 7923471, 5070222, 1822388, 2840513, 2593479","abstract":"OBJECTIVE\nTo evaluate the relationship of visual function and photoreceptor cell loss, and to establish a visual function assessment system based on the observation of optokinetic behavior in rat with photic injury.\n\n\nMETHODS\nSD rats were exposed to (950 +/- 50) lux green light for 3 hours, 12 hours and 24 hours respectively after 24-hour dark adaptation. Then 24-hour dark recovery was followed by 48-hour observation before the eyes were enucleated. Frozen sections were obtained. Slides were stained by HE and rhodopsin immunofluorescent stainings. Vision mediated disturbance of consciousness and pre-pulse response were used to assess the visual function. Optokinetic behavior test was conducted 2 days before and after photic injury. Average velocity of motion were analyzed.\n\n\nRESULTS\nVision mediated disturbance of consciousness response are gradually weakened; while pre-pulse response is reinforced as the photic injury time increases. The relationship of optokinetic behavior and rat visual function is statistically significant. Optokinetic behavior test shows the average velocity of motion gradually decreases as the injury is aggravated.\n\n\nCONCLUSIONS\nLonger light exposure time leads to increased photoreceptor injury, which in turn, causes decrease of visual function in SD rat. Optokinetic behavior test, represented by average velocity of motion, is correlated with rat visual function. Thus, optokinetic behavior test can be used to assess the visual function of SD rat quantitatively.","cites":"0","conferencePercentile":"33.33333333"},{"venue":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","id":"0b0fb37c452cab5aa70a5b9cc7c0edddee81c502","venue_1":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","year":"2012","title":"[Functional magnetic resonance imaging in glaucoma].","authors":"Zhi-qi Chen, Jing Gao, Hong Zhang","author_ids":"8157532, 1698083, 1734058","abstract":"Neurological damage in glaucoma does not only limit to the eye, but also affects the central nervous system of the visual pathway. Functional magnetic resonance imaging provides a non-invasive method that can help to assess anatomical and functional changes of the central nervous system. This technology has been used in the investigations of nerve fiber damage, metabolic changes in visual cortex, and dysfunction of the visual system in glaucoma. Functional magnetic resonance imaging is introduced, and the progress in its application and prospect in glaucoma diagnosis were summarized in this paper.","cites":"0","conferencePercentile":"41.66666667"},{"venue":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","id":"54e163e4b0bc7110bfb06fc0554a82fc56e1dcce","venue_1":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","year":"2015","title":"[Contributions of human rods and cones pathway to different components of oscillatory potentials in time and frequency domain].","authors":"Jiaman Dai, Shiying Li, Zhengqin Yin, Gang Wang, Xiaohong Meng","author_ids":"7698361, 2805782, 3743332, 4148672, 8399217","abstract":"OBJECTIVE\nTo investigate the contributions of human rods and cones pathway to different components of oscillatory potentials (OP) in time and frequency domain.\n\n\nMETHODS\nCase-control study. Twenty subjects were divided into two groups, normal groups (NG) and cones pathway abnormal groups (CAG). All eyes were investigated by dark-adapted (DA) and light-adapted (LA) 3.0 ERG recommended by ISCEV. Data were output into the computer and processed and analyzed by the software Matlab7.0. First, to extract the OP by filter, then to get the frequency-amplitude relationship by FFT, after that the relationship was fitted by equations and lastly we statistic and analyze the parameters gotten from the equations.\n\n\nRESULTS\nCompared with normal group [(48.63 ± 4.29), (158.00 ± 32.75), (69.27 ± 30.31), (38.5 ± 15.28) µV], the amplitudes of the first two components of dark-adapted OP in the CAG [(4.12 ± 3.20), (71.25 ± 25.43), (48.96 ± 20.05), (36.84 ± 14.26) µV] were significant decreased (t = 16.68, 5.77, P < 0.01). Frequency domain of LA and DA OP in the two groups was comprised with two components (harmonic and subharmonic). Compared with normal group, harmonic components of CAG were dramatic decreased (t = 2.72, P < 0.05; Z = -2.24, P < 0.05). The value of subharmonic component in CAG was lowest in DA OP compared with NG (t = 4.20, P < 0.005).\n\n\nCONCLUSIONS\nCones and rods pathway all contributed to the DA and LA OP Cones pathway mainly contributes to the earlier and faster components of OP while the rods pathway to the later and slower components.","cites":"0","conferencePercentile":"45"},{"venue":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","id":"b1847800d4dec0f3295207780472e42e8248317a","venue_1":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","year":"2014","title":"[Morphological changes of corneal subbasal nerve plexus in patients with ocular blunt trauma by in vivo confocal microscope].","authors":"Bin Zheng, Yanfeng Bi, Yan Chen, Lijun Shen","author_ids":"1717159, 5412793, 7377817, 3344139","abstract":"OBJECTIVE\nTo evaluate morphological changes of corneal subbasal nerve plexus in patients with ocular blunt trauma using in vivo confocal microscope.\n\n\nMETHODS\nA prospective study. Twenty-three consecutive zone 2 or zone 3 monocular contusion outpatients from the same ophthalmologist in the Affiliated Eye Hospital of Wenzhou Medical College were included in this study from December 2009 to December 2010. The 23 injured eyes divided into trauma group, and the contralateral 23 normal eyes were divided into control group. In vivo confocal microscope (IVCM) was performed in both groups at the first week after injury, and in trauma group at the first and the third month after injury. The main parameters for analyzing were corneal subbasal nerve plexus density, nerve trunks, nerve branching, total nerve number, and nerve tortuosity. Data were analyzed using a paired t-test and Wilcoxon signed-rank test to compare the difference of parameters between the control group and each time point of trauma group. A repeated measures analysis of variance (ANOVA) was used to analyze data on the three time points in the trauma group.\n\n\nRESULTS\nAll parameters of trauma group were changed significantly over time (F values: 16.272, 24.138, 63.393, 68.122, 91.463, all P values < 0.01) . Corneal subbasal nerve plexus density, nerve trunks, nerve branching, total nerve number were significantly decreased at the first week [(624.0 ± 109.9) µm/frame, 1.66 line/frame, 6.70 line/frame, 8.45 line/frame)] compared with control group [(1677.9 ± 87.1) µm/frame, 4.80 line/frame, 8.98 line/frame, 13.80 line/frame) (t = 8.998, 9.301, 9.119, 12.969; all P < 0.01)], and showed a continued downward trend with time. However, nerve trunk showed no significant changes at the first week (1.66 line/frame) and the first month (2.31 line/frame) (t = -1.518; P = 0.143). Nerve tortuosity was significantly increased at the first week (1.66) compared with control group (1.00) (t = -6.879; P < 0.01) , and then kept increasing gradually. At the first month after injury, the nerve tortuosity (3.20) was more obvious than the first week (P < 0.01) , and nerve regeneration could be observed. At the third month, the values of each parameters were gradually approaching levels of control group. Nerve trunks (4.00 line/frame), nerve branching (8.69 line/frame), total nerve number (13.26 line/frame) and nerve tortuosity (1.00) of trauma group showed no significant difference compared with control group (t = 3.117, 1.703, 3.325, -1.837; P = 0.079,0.792,0.392,0.392) , but nerve density [(1064.3 ± 93.3)µm/frame] was still less than control group (t = 5.736; P < 0.01). Injury of different zone showed no significant influence on all the parameters in trauma group (F values:0.119,0.032,0.296,0.053,0.143;P values: 0.733,0.859,0.592,0.821,0.709).\n\n\nCONCLUSIONS\nIVCM can clearly display the histological features of corneal subbasal nerve plexus in patients with ocular blunt trauma. Corneal subbasal nerve plexus were morphologically abnormal within 3 months after injury, and gradually underwent from atrophy to regeneration over time.","cites":"0","conferencePercentile":"55.55555556"},{"venue":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","id":"d418f3a06e1e62ed8bf24fdfbddd22d821134a8f","venue_1":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","year":"2003","title":"[The neuroprotective effect of erigeron breviscapus (vant) hand-mazz on retinal ganglion cells after optic nerve crush injury].","authors":"Bing Jiang, You-qin Jiang","author_ids":"3350151, 5694857","abstract":"OBJECTIVE\nTo investigate whether a Chinese herbal medicine, erigeron breviscapus (vant) hand-mazz (EBHM), can protect the retinal ganglion cells (RGC) damaged by calibrated optic nerve crush injury.\n\n\nMETHODS\nForty-two Sprague-Dawley rats were randomly divided into two groups. Calibrated optic nerve crush injury model was induced in the right eyes by a special designed optic nerve clip. The left eyes served as a control. All 42 rats were randomly divided into 2 groups. Group A consisted of the rats with calibrated optic nerve crush injury and group B consisted of rats with calibrated optic nerve crush injury treated with EBHM. In group B, EBHM solution was given once after the crush injury. According to the time interval between the optic nerve crush and the sacrifice, both groups A and B were further divided into three subgroups (day 4, day 14 and day 21). Therefore, there were 7 rats in each subgroup. Three days before sacrifice, 3% fast blue was injected into superior colliculi bilaterally. The eyes were enucleated after the rat was sacrificed, and flat mounts of the retina from both eyes were prepared on a slide and observed under a fluorescence microscope. Four photos with 400 x magnification were taken from each of the four quadrants of the retina 1 mm away from the optic disc. The labeled RGC were counted by a computerized image analyzer. The labeled RGC rate was used for statistical analysis (the labeled RGC rate = number of RGC in injured eye/control eye x 100%).\n\n\nRESULTS\nIn group A, the labeled RGC rate was (77.79 +/- 7.11)%, (63.76 +/- 3.79)% and (54.66 +/- 4.75)% on day 4, day 14 and day 21, respectively. In group B, the labeled RGC rate was (80.13 +/- 12.03)%, (78.17 +/- 9.19)% and (83.59 +/- 12.61)% on day 4, day 14 and day 21, respectively. In group B, which was treated with EBHM after injury, the labeled RGC rate was significantly higher than that of group A on day 14 and day 21.\n\n\nCONCLUSIONS\nIn the experimental optic nerve crush model in rats, EBHM therapy can increase the survival rate of the RGC and can rescue and/or restore the injured RGC.","cites":"0","conferencePercentile":"38.88888889"},{"venue":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","id":"23eccaa4514cde977ec048d3993a0ea514ea3c39","venue_1":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","year":"2006","title":"[Study of functional magnetic resonance imaging in strabismic and anisometropic amblyopic patients].","authors":"Hu Liu, Kan-xing Zhao, Min Chen, Tian-gang Zhou","author_ids":"8425033, 3682494, 1711628, 8305384","abstract":"OBJECTIVE\nTo elucidate the difference in the pathogenesis between strabismic amblyopia and anisometropic amblyopia.\n\n\nMETHODS\nUsing an EPI gradient echo sequence in 1.5 T MRI and visual electrophysiological system, the pattern visual evoked potentials and calcarine activation by monocular viewing of check-board pattern with reversal were examined in 18 strabismic amblyopes and 15 anisometropic amblyopes. The calcarine activation in terms of binocular voxels index and dependence on the spatial frequency of the stimuli were compared. The correlation between PVEP P(100) latency and activation intensity was also analyzed.\n\n\nRESULTS\nThe binocular voxels index was lower in the strabismic amblyope than that in the anisometropic amblyope. The calcarine activation from amblyopic eyes in strabismic amblyopes was more suppressed at higher spatial frequencies (1, 2 c/d); while that from amblyopic eyes in anisometropic amblyopes was more suppressed at all spatial frequencies (0.25, 0.5, 1 and 2 c/d). Inverse correlations existed between PVEP P(100) latency and activation intensity in two types amblyopia (P < 0.05).\n\n\nCONCLUSIONS\nThe binocular interaction is not equal in these two different types of amblyopia. Meanwhile, the amblyopia-related deficits in the low and high-spatial-frequency pathway of visual system are not similar between these two different types of amblyopia.","cites":"0","conferencePercentile":"54.16666667"},{"venue":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","id":"11d2d01926851218c22f951eae62a2dff265d1ba","venue_1":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","year":"2016","title":"[The clinical features and value of macular ganglion cell complex thickness patterns in patients with optic chiasma lesion].","authors":"Li Zhang, Chuan Sun, Xinquan Sun","author_ids":"1712838, 3921509, 8282899","abstract":"OBJECTIVE\nTo evaluate patterns of macular retinal ganglion cell complex thickness (mRGCCT) in patients with two types of neurologic lesions in optic chiasm region.\n\n\nMETHODS\nRetrospective case review study. Visual field test was conducted with automated perimetry (HAAG-STREIT OCTOPUS101 V6.07g Seven-in-One and 2010(HFA Ⅱ750-40220-5.1.1/5.1.1) Carl Zeiss Meditec), and visual field in the central 30 degree region was measured. Three types of thickness mapping including macular retinal thickness (MRT), macular ganglion cell complex thickness (mGCCT) and peripapillary retinal nerve fiber layer (pRNFL) were recorded with TOPCON 3D-OCT 2000 spectral domain OCT. The results of OCT were compared with visual field.\n\n\nRESULTS\nSixteen cases were included in this study, male 10 cases, female 6 cases. Age 5 to 77 years (average 48.2). Neurologic lesions including pituitary tumor (9 cases), craniopharyngioma (3 cases), optic canal dysplasia in optic chiasm region (1 case), meningioma (1 case), hemangioma (1 case) and aneurysm (1 case). 14 cases have chronic, progressive, long course of disease, OCT showed characteristic perpendicular bisector delimitation, bilateral nasal mGCCT atrophy and corresponding temporal hemianopsia. 2 cases (both were pituitary tumor ) have a chronic, short duration, accelerated attack, visual acuity and visual field rapidly declined, mGCCT is swelling or approach high limit of normal range. In pRNFL thickness map, atrophy of mRNFL in temporal peripapillary and nasal macular region could be observed.\n\n\nCONCLUSIONS\nChronic, progressive, long course of disease, combined with characteristic perpendicular bisector delimitation, bilateral nasal mGCCT atrophy and corresponding temporal hemianopsia is helpful to predict lesion of disease. mGCCT map is of equal importance with visual field test for diagnosis of lesion within optic chiasm. In cases with a chronic, short disease course, and accelerated attack, mGCCT could be swelling, but pRNFL could be thinner in temporal peripapillary and nasal macular region of single or both eyes, and visual field test is thus necessary in these cases.","cites":"0","conferencePercentile":"54.54545455"},{"venue":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","id":"5b9229bbe14e65a66dba345b15fc35d0ac0a9d92","venue_1":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","year":"2001","title":"[Evaluation of optic disc in open-angle glaucoma with hemifield defect by Heidelberg retinal tomography].","authors":"L Wu, S Kunimatsu, Y Suzuki","author_ids":"8531802, 4600686, 8545120","abstract":"OBJECTIVE\nTo investigate whether the glaucomatous optic disc change demonstrated by Heidelberg retinal tomography (HRT) is consistent to the distribution of the visual field defects and whether Heidelberg retinal tomography, (HRT) parameters in primary open angle glaucoma (POAG) and normal tension glaucoma (NTG) are different.\n\n\nMETHOD\nSixty-four eyes of 64 patients with open angle glaucoma (27 of POAG, 37 of NTG) and hemifield abnormality detected by Humphery Field Analyzer (HFA) were tested by HRT. The HRT parameters and the visual field results were divided into two parts (0 degree-180 degrees and 180 degrees-360 degrees) for the corresponding analysis.\n\n\nRESULTS\nComparing with the half disc corresponding to the intact hemifield, the half disc corresponding to the defective hemifield has significantly higher values of cup/disc area ratio and cup shape measure, but has significantly lower values of rim area, the thickness and cross-section area of the retinal nerve fiber layer. No significant differences were found between NTG and POAG eyes in the HRT parameters of the half disc corresponding to the defective hemifield.\n\n\nCONCLUSIONS\nThe optic disc changes detected by HRT are consistent to the distribution of the visual field defects, cup/disc area ratio, cup shape measure, rim area, mean thickness and cross-section area of the retinal nerve fiber layer, and they are the relatively sensitive parameters. That the HRT parameters of NTG and POAG are similar suggests they possibly have certain similar mechanisms in the development of glaucomatous neuropathy.","cites":"0","conferencePercentile":"50"},{"venue":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","id":"9634c4f70586b5bd7180d2f4ac570f239db862e5","venue_1":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","year":"2011","title":"[Macular retinal function detected by MP-1 microperimetry in normal subjects of middle and old age].","authors":"Jing Zhou, Wu Liu, Xiang Li, Qian Li, Jing Hao, Xin-Lei Wang","author_ids":"1711615, 8134085, 1737850, 7137586, 2583625, 8416294","abstract":"OBJECTIVE\nTo investigate the macular retinal sensitivity and fixation stability rates in normal subjects of middle and old age by using the MP-1 microperimetry.\n\n\nMETHODS\nThis was a normal value test which enrolled 60 healthy subjects aging from 41 to 70 years old. It detected the retinal function of the central 10 degrees of the macular by using the MP-1 microperimetry. Sixty subjects were divided into three groups according to their ages: group A from 41 to 50, group B from 51 to 60 and group C from 61 to 70. Rank and testing methods were used to compare the mean retinal sensitivity (MS) within the central 10 degrees of the macular among the three groups, and P < 0.017 was used for statistical significance. Rank and testing methods were used to compare MS of different locations in the macular fovea, and P < 0.025 was used for statistical significance. Correlation analysis was used to analyze the correlation between the age and retinal MS values.\n\n\nRESULTS\nThe retinal MS within the central 10 degrees of the macular in 60 eyes of the 60 subjects was (19.7833 ± 0.4906) dB, and were (19.5117 ± 1.1044), (19.8542 ± 0.4099) and (19.9183 ± 0.3895) dB at 5 degrees, 3 degrees and 1 degree from the center of the macular, respectively. The mean fixation stability rates within 2 degrees and 4 degrees were (88.4667 ± 9.9600)% and (97.2000 ± 3.9091)%, respectively. There was statistical significance between retinal MS at 5 degrees and at 3 degrees from the center of the macular (Z = -2.943, P < 0.025); there was also statistical significance between retinal MS at 3 degrees and at 1 degree from the center of the macular (Z = -2.367, P < 0.025).\n\n\nCONCLUSIONS\nMP-1 microperimetry examination could be used to evaluate the macular retinal function. There is no difference in the retinal MS within the central 10 degrees of the macular among the three groups of normal subjects of different ages. The retinal MS difference is statistically significant with different distances from the center of the macular; but there is no correlation between the age and the retinal sensitivities in normal subjects of middle and old age.","cites":"0","conferencePercentile":"44.44444444"},{"venue":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","id":"868bd9948b98a08cc4d3e200013c4cb8c237a29b","venue_1":"[Zhonghua yan ke za zhi] Chinese journal of ophthalmology","year":"2009","title":"[The influence of pressure on the cell survival and axonal growing in rat retinal ganglion cells in vitro].","authors":"Hong Zhang, Jie Zhong, Gui-gang Li, Jun Hu, Xiao-chun Mao","author_ids":"1734058, 6781043, 7229691, 1745787, 8191338","abstract":"OBJECTIVE\nTo evaluate the effect of pressures on the changes of purified cultivation of SD suckling rats' retinal ganglion cells (RGC) by a hyperbaric cell culture model and on the expression of neurofilament protein-H (NF-H) in vitro.\n\n\nMETHODS\nIt was a control experimental study. RGC were purified from twenty SD neonatal rats (postnatal 1 - 3 days) using Thy1.1 antibody and cultured under the pressures of 0, 20, 40, 60, and 80 mm Hg (1 mm Hg = 0.133 kPa) respectively. The growth and survival times of RGC were observed, the numbers of processes of RGC were counted, and the processes measured under the different pressures after 48 h under phase-contrast microscope. The expression of NF-H and its distribution in primary purified RGC was investigated by an immunohistochemical technique and by semi-quantitative statistics analysis using microscopic image-analysis technique. The data was analyzed with SPSS 13.0 software. Difference among groups with One-way ANOVA and ambi-groups with SNK (q test), statistical significance was confirmed as P < 0.05.\n\n\nRESULTS\nThe purification rate of RGC reached 96.24% after cultured for 12 hours. Compared with the control group, the growth and survival times of RGC were similar (P = 0.595, 0.147) under the pressure of 20 mm Hg cultured for 48 hours, the expression of NF-H in RGC was not different (P = 0.227); but the growth and survival times of RGC were significantly different (P = 0.001, 0.000, 0.000 and 0.000, 0.000, 0.000) under the pressures of 40, 60, and 80 mm Hg, respectively. The expression of NF-H in RGC were significantly (P = 0.000, 0.000, 0.000) reduced under the pressures of 40, 60, and 80 mm Hg for 48 hours respectively.\n\n\nCONCLUSIONS\nThe growth and survival times of cultured RGC in vitro are affected by the pressure > 40 mm Hg leading to a decreased expression of NF-H indicating a pressure caused mechanism of RGC damage in glaucoma. Down-regulation of NF-H may influence the process growth of RGC.","cites":"0","conferencePercentile":"50"}]}