{"Zhong_xi_yi_jie_he_xue_bao__Jou":[{"venue":"Zhong xi yi jie he xue bao = Journal of Chinese integrative medicine","id":"91fc94ec813c8a3e995a3e18b8eaf9519f6d435b","venue_1":"Zhong xi yi jie he xue bao = Journal of Chinese integrative medicine","year":"2008","title":"[An explanation on \"guiding principles of clinical research on mild cognitive impairment (protocol)\"].","authors":"Jin-Zhou Tian, Jing Shi, Xin-Qing Zhang, Qi Bi, Xin Ma, Zhi-Liang Wang, Xiao-Bin Li, Shu-Li Sheng, Lin Li, Zhen-Yun Wu, Li-Yan Fang, Xiao-Dong Zhao, Ying-Chun Miao, Peng-Wen Wang, Ying Ren, Jun-Xiang Yin, Yong-Yan Wang","author_ids":"8369498, 1808711, 8443991, 1728244, 7137114, 1786147, 4785117, 7976376, 1686030, 5309703, 5752964, 8343881, 8548377, 4025475, 7800422, 8307180, 7708417","abstract":"In order to provide the \"guiding principles of clinical research on mild cognitive impairment (MCI) (protocol)\" edited by Beijing United Study Group on MCI of the Capital Foundation of Medical Developments (CFMD) with evidence support, clinical criteria, subtypes, inclusion and exclusion of MCI, and use of rating scales were reviewed. The authors suggested that MCI clinical criteria and new diagnosis procedure from the MCI Working Group of the European Alzheimer's disease Consortium (EADC) may better reflect the heterogeneity of MCI syndrome. Diagnostic rating scales including Clinical Dementia Rating (CDR), Global Deterioration Scale (GDS), Alzheimer's Disease Assessment Scale-cognitive subscale (ADAS-cog) and Instrumental Activities of Daily Living (IADL) are very useful in definition of MCI but can not replace its clinical criteria. Absence of major repercussions on daily life in patients with MCI was emphasized, but the patients may have minimal impairment in complex IADL. According to their previous research, the authors concluded that highly recommendable neuropsychological scales with cut-off scores in the screening of MCI cases should include Mini-Mental State Examination (MMSE), logistic memory test such as Delayed Story Recall (DSR), executive function test such as Clock Draw Test (CDT), language test such as Verbal Category Fluency Test (VCFT), etc. And finally, the detection of biological and neuroimaging changes, including atrophy in hippocampus or medial temporal lobe in patients with MCI, was introduced.","cites":"0","conferencePercentile":"41.66666667"},{"venue":"Zhong xi yi jie he xue bao = Journal of Chinese integrative medicine","id":"5200ec37b4ee64718794238d61129e24ac914c39","venue_1":"Zhong xi yi jie he xue bao = Journal of Chinese integrative medicine","year":"2005","title":"[Effect of Niupo Zhibao Pellet on expression of neuronal nitric oxide synthase in brain of endotoxin-induced shock rats].","authors":"Jian-Hong Zhou, Dong-Feng Chen, Shao-Hui DU, Hui Li, Yi-We Li, Ru-Dong Deng, Sai-Xia Zhang","author_ids":"7934596, 7167424, 8023214, 1750828, 6796381, 7166661, 4448355","abstract":"OBJECTIVE\nTo investigate the effect of Niupo Zhibao Pellet (NPZBP) on the expression of neuronal nitric oxide synthase (nNOS) in the brain of endotoxin-induced shock rats.\n\n\nMETHODS\nSD rats were randomly divided into normal control group, endotoxin-induced shock model group and NPZBP-treated group. Lipopolysaccharide (LPS) (1.5 mg/kg i.v.) and tsD-galactosamine (D-GalN) (100 mg/kg i.p.) were administered to the rats in endotoxin-induced shock model group, as well as to the rats in NPZBP-treated group after seven-day treatment, to induce the shock. The expression of nNOS in the brain of the rats in each of the 3 groups was measured by immunohistochemical methods.\n\n\nRESULTS\nIn the 3 groups, nNOS immuno-positive cells distributed widely in layer II, III, IV of the cerebral cortex, the molecular layer of hippocampus, the polymorphic layer of the dentate gyrus, the reticular formation of brain stem, and the molecular, granular and Purkinje cell layer of the cerebellar cortex. The number of immuno-positive cells in the NPZBP-treated group was slightly higher than that of the normal control group, and significantly lower than that of the model group (P<0.05) in many regions of the brain, including cerebral cortex, hippocampus, brain stem and cerebellar cortex.\n\n\nCONCLUSION\nNPZBP can inhibit the over-expression of nNOS in wide area of the brain in endotoxin-induced shock rats.","cites":"0","conferencePercentile":"100"}]}