{"Zhongguo_gu_shang__China_journa":[{"venue":"Zhongguo gu shang = China journal of orthopaedics and traumatology","id":"427cc707e6832e0c763b4641d00701d6bb988a71","venue_1":"Zhongguo gu shang = China journal of orthopaedics and traumatology","year":"2010","title":"[Effects of small needle knife on the substance P in the dorsal root ganglion and spinal cord of rats].","authors":"Jin-Rong Wang, Yong-Zhi Wang, Fu-Hui Dong, Hong-Gang Zhong, De-Long Wang, Xuan Wang","author_ids":"2860341, 7708382, 7432469, 5183484, 7496123, 1747105","abstract":"OBJECTIVE\nTo study the mechanism of synthesis of substance P (SP) in the dorsal root ganglion (DRG) and the release of it in the dorsal horn of the spinal cord of rats after compression of skeletal muscle, and to observe the influence of small needle knife.\n\n\nMETHODS\nSustained pressure of 70 kPa was applied to rats, muscular tissues for 2 hours. The rats were divided into three groups: normal, control and experiment group respectively. In all rats except the six normal ones, the lower legs were compressed once one day. The left leg was considered as the control group, the right left was experiment group, which were divided into the 1st day, the 2nd day and the 3rd day within the two groups. Experiment group was treated with small needle knife after the muscular tissue was compressed. After completing the stimulation, the DRG related to the muscle and part of spinal cord were removed for the qualification of SP-like immunoreactivity using immunohistochemistry. The dark brown stains on the DRG and on the REXed laminae I and II in the dorsal horn of the spinal cord were counted by Image-Pro Plus software.\n\n\nRESULTS\nSP-like immunoreactivity in the side treated by the small needle knife was enhanced comparing with the counterpart in DRG in normal group (P < 0.01). The integrated optical density of SP like immunoreactivity of the DRG in the experiment group were significantly reduced compared with the control group (P < 0.05). However, the release of SP from spinal cord in experiment group was lower than that in the control group at the 1st day and the 3rd day (P < 0.01), with the opposite result of the 2nd day.\n\n\nCONCLUSION\nBased on the fact that SP is a nociceptive neurotransmitter, the present study suggests that tension relaxation by small needle knife reduces expression of SP in the DRG, and shows no effects on the release of SP from the spinal cord in short-term (3 days).","cites":"0","conferencePercentile":"62.5"},{"venue":"Zhongguo gu shang = China journal of orthopaedics and traumatology","id":"996847432354dcad1f248039bfc43d793c502a23","venue_1":"Zhongguo gu shang = China journal of orthopaedics and traumatology","year":"2009","title":"[Protective effect of glial cell line-derived neurotrophic factor infused into the tube setted into cavitas subarachnoidealis on spinal front corner motor neurons].","authors":"Shi-peng Pan, Qiang Liu, Dou Wu","author_ids":"8011568, 1728293, 7464020","abstract":"OBJECTIVE\nTo investigate the effect of exogenous glial cell line-derived neurotrophic factor (GDNF) infused into the cavitas subarachnoidealis on cornu anterius medullae spinalis motor neurons after sciatic nerve axotomy.\n\n\nMETHODS\nForty-eight healthy SD rats were divided into 2 groups randomly: GDNF group and NS group. The left sciatic nerve in rats were cut off. And then 0.9% saline (6 microl) and GDNF solution (6 microl) were injected into cavitas subarachnoidealis at L4-L6 in NS group and GDNF group,respectively. The rats were sacrificed on postoperative 1, 2, 4 and 8 weeks respectively. Their specimen of L4-L6 spinal cord were taken at different time and sectioned. The HE staining, Nissl staining and cholinesterase (ChE) staining in motor neurons were used for counting of motor neurons.\n\n\nRESULTS\nIn GDNF group the number of motor neurons in cornu anterius medullae spinalis and the ChE activity were higher than that of NS group.\n\n\nCONCLUSION\nThe exogenous GDNF infused into the cavitas subarachnoidealis are supposed to protect the degenerated spinal motor neuron from death after sciatic nerve injury.","cites":"0","conferencePercentile":"50"}]}