{"Zhonghua_jie_he_he_hu_xi_za_zhi":[{"venue":"Zhonghua jie he he hu xi za zhi = Zhonghua jiehe he huxi zazhi = Chinese journal of tuberculosis and respiratory diseases","id":"b70e718696ae5157f52debaa27d003c6f7687812","venue_1":"Zhonghua jie he he hu xi za zhi = Zhonghua jiehe he huxi zazhi = Chinese journal of tuberculosis and respiratory diseases","year":"2010","title":"[Effects of 5-HT2 agonist/antagonist on sleep apnea in Sprague-Dawley rats].","authors":"Yi-jue Zhong, Cheng Zhang, Guang-fa Wang","author_ids":"5635053, 3585347, 8349785","abstract":"OBJECTIVE\nTo evaluate the effects of 5-HT2 agonist/antagonist Ketanserin on sleep apnea in Sprague-Dawley (SD) rats.\n\n\nMETHODS\nTwenty adult male SD rats were operated for implantation of EEG and EMG electrodes and a microinjection probe was placed within the fourth ventricle. After recovery for a week, rats were monitored for sleep and respiration in three continuous days. There is no intervention on the first day. Before monitoring, 40 microl ACSF were microinjected into the IV ventricle of the rats on the second day. On the third day before monitoring, 40 microl DOI were microinjected into the IV ventricle of ten rats and 40 microl Ketanserin into another ten ones.\n\n\nRESULTS\nCompared with blank control and microinjection of ACSF, DOI significantly reduced the total apnea index (AI) from 18.3 (11.1, 20.3) times/h and 15.2 (11.4, 18.0) times/h to 10.8 (3.1, 14.1) times/h (P=0.005 and 0.005, respectively). Post sign apnea index (PSAI) during non-rapid eye movement (NREM) and rapid eye movement (REM) sleep as well as spontaneous apnea index (SPAI) during NREM sleep were all significantly decreased; (P<0.05, respectively); while it had no effect on SPAI during REM sleep (P>0.05). Neither sleep efficiency (the percent of total sleep time in total monitoring time) nor the time ratio of NREM sleep and REM sleep was significantly changed. In contrast to blank control and microinjection of ACSF, Ketanserin significantly reduced the total apnea index (AI) from 19.2 (13.7, 20.9) times/h and 19.0 (12.9, 21.6) times/h to 13.1 (9.5, 14.9) times/h (P=0.005 and 0.005, respectively). PSAI during NREM and REM sleep were significantly decreased (P<0.05, respectively). SPAI during NREM and REM sleep were changed without statistically significant (P>0.05, respectively). It also had no effects on sleep efficiency and the time ratio of NREM sleep and REM sleep.\n\n\nCONCLUSION\nBoth 5-HT2 agonist and antagonist decreased the sleep apnea index and had no effects on sleep structure. It shows that the role of 5-HT2 receptor in the respiratory regulation during sleep is complex. The mechanisms involved remain to be studied in future.","cites":"0","conferencePercentile":"100"},{"venue":"Zhonghua jie he he hu xi za zhi = Zhonghua jiehe he huxi zazhi = Chinese journal of tuberculosis and respiratory diseases","id":"db6b92cececa690f6a26cfcef5d5535e7413180f","venue_1":"Zhonghua jie he he hu xi za zhi = Zhonghua jiehe he huxi zazhi = Chinese journal of tuberculosis and respiratory diseases","year":"2015","title":"[Memory and executive dysfunction in patients with severe obstructive sleep apnea and hypopnea syndrome].","authors":"Yating Peng, Ruoyun Ouyang, Yuping Cao, Ping Chen, Yan Chen","author_ids":"7541914, 8059137, 4613878, 1711641, 1700696","abstract":"OBJECTIVE\nTo compare differences in the memory and executive functions between patients with obstructive sleep apnea and hypopnea syndrome (OSAHS) and healthy people.\n\n\nMETHODS\nIn this study, 50 male Chinese patients with OSAHS were consecutively recruited from the outpatient departments of the Second Xiangya Hospital and 26 healthy individuals were recruited from the physical examination center between October 2013 and March 2014. A full-night polysomnography and a comprehensive neuropsychological assessment were performed on all subjects. The disease severity was scored following the guideline recommended by the American Academy of Sleep Medicine(AASM). Statistical analyses were performed using SPSS 17.0 software for Windows.\n\n\nRESULTS\nCompared with the healthy group, OSAHS patients had lower scores on MoCA (28.0 ± 1.1 vs. 22.6 ± 3.0), picture memory (15.7 ± 1.6 vs.11.9 ± 2.7), visual reproduction (12.6 ± 1.2 vs. 9.0 ± 2.2), logical memory (13.7 ± 1.7 vs. 10.9 ± 1.9), digit span forward [8.0(7.8-8.0) vs. 7.0(6.0-8.0)], digit span backward [5(5-6) vs. 4(3-4)], higher continuous wrong numbers on Wisconsin Card Sorting Test (WCST) [7(6-9) vs. 12.4 ± 4.9], lower categories completed [5(4-6) vs. 3.5(2.0-4.3)], longer Stroop Interference time (18.2 ± 9.5 vs. 44.8 ± 13.5); lower correct rate on 2-back test [91.0 ± 2.6 vs. 79(75-81)], longer response time on 2-back test [645 ± 21 vs. 691(653-752)], all with significant differences (P<0.001). (2) In the OSAHS patients, with similar age and education background and BMI, there were positive correlations between scores on MoCA and SaO₂mean (r=0.283, P=0.054), scores on SCWT and Sat90 (r=0.277, P=0.059); but there were negative correlations between scores on MoCA and TSat90 (r=-0.353, P=0.015), visual reproduction (r=-0.308, P=0.035), logical memory (r=-0.306, P=0.036), digit span forward (r=-0.297, P=0.043), backward (r=-0.322, P=0.027) and Sat90.\n\n\nCONCLUSIONS\nThe present study demonstrated that male patients with severe OSAHS had widespread executive dysfunctions (shifting, inhibition, updating) and memory impairments. Nighttime hypoxia and sleep fragmentation were closely related to the cognitive impairments of OSAHS.","cites":"0","conferencePercentile":"75"},{"venue":"Zhonghua jie he he hu xi za zhi = Zhonghua jiehe he huxi zazhi = Chinese journal of tuberculosis and respiratory diseases","id":"4c90622003f8fc97cbc4ea4fca1c58c20204406d","venue_1":"Zhonghua jie he he hu xi za zhi = Zhonghua jiehe he huxi zazhi = Chinese journal of tuberculosis and respiratory diseases","year":"2015","title":"[A study of attention networks in patients with obstructive sleep apnea-hypopnea syndrome].","authors":"Ying Hu, Chong Pei, Feifei Liu, Li Shen, Panpan Hu, Kai Wang","author_ids":"5514915, 5697763, 2539123, 8716586, 8217026, 3751236","abstract":"OBJECTIVE\nTo explore the different aspects of attention function in patients with obstructive sleep apnea-hypopnea syndrome (OSAHS) and further to investigate the factors related to the impairments.\n\n\nMETHODS\nAfter one night polysomnography (PSG) monitoring, a total of 50 patients with OSAHS and 40 demographic-matched healthy controls received basic cognitive assessment with a neuropsychological battery and then performed the attention networks test (ANT) was performed.\n\n\nRESULTS\nCompared with healthy controls, patients with OSAHS performed significantly worse on cognitive tests and emotion evaluation including Montreal Cognitive Assessment (MoCA), stroop, verbal fluency, digital span, Hamilton anxiety scale (HAMA) and Beck depression inventory (BDI). With regard to ANT, significant group differences were found in executive control network [(138 ± 58) ms vs (104 ± 37) ms, P=0.003], but not in alertness [(33 ± 36) ms vs (33 ± 18)ms, P=0.975] or orientation [(48 ± 30)ms vs (51 ± 22) ms, P=0.674]. Correlation analysis indicated that the scores of the executive control network was positively correlated with the longest apnea time during the night (r=0.620, P=0.006), but was negatively correlated with the average oxygen saturation(r=-0.869, P=0.000) and the lowest oxygen saturation (r=-0.577, P=0.019).\n\n\nCONCLUSIONS\nPatients with OSAHS were associated with impaired attention function, especially in the executive control network efficiency. Chronic hypoxia and apnea during the sleep may be the key factors that could diminish their attention and executive function.","cites":"0","conferencePercentile":"75"}]}