{"Zhongguo_yao_li_xue_bao__Acta_p":[{"venue":"Zhongguo yao li xue bao = Acta pharmacologica Sinica","id":"1b0e4d7a0c9a5a0afe67c231c4349788f9fa8712","venue_1":"Zhongguo yao li xue bao = Acta pharmacologica Sinica","year":"1998","title":"Pinacidil suppression on 5-HT3 receptor-mediated contraction of guinea pig ileum in vitro.","authors":"Y M Yuan, D Y Xu, G Y Hu","author_ids":"1788936, 1714390, 3022803","abstract":"AIM\nTo study the effects of the K+ channel opener pinacidil on 5-HT3 receptor-mediated contractions of the isolated guinea pig ileum (GPI) longitudinal muscle-myenteric plexus strip preparations.\n\n\nMETHODS\nGPI contractions were recorded with a chart recorder through isometric transducers. The effect of pinacidil on binding properties of 5-HT3 receptors was assessed using [3H]GR65630 binding assay in membrane preparations of rat entorhinal cortex.\n\n\nRESULTS\n(1) A selective 5-HT3 receptor agonist 2-methyl-5-HT 0.1-300 mumol.L-1 and 5-HT 0.001-50 mumol.L-1 elicited GPI contractile responses in concentration-dependent manners, the EC50 values (and 95% confidence limits) for 2-methyl-5-HT and 5-HT were 10.0 (8.9-11.2) mumol.L-1 and 1.6 (1.3-1.9) mumol.L-1, respectively. Selective 5-HT3 receptor antagonist tropisetron 0.1 mumol.L-1 competitively inhibited the responses to 2-methyl-5-HT and 5-HT. (2) Pinacidil 0.5-5 mumol.L-1 inhibited 5-HT3 receptor-mediated contractions. (3) Pinacidil 1 mumol.L-1 enhanced the inhibitory effects of tropisetron 0.1 mumol.L-1 or another selective 5-HT3 receptor antagonist benesetron 1 mumol.L-1 on 5-HT-induced GPI contractile responses. (4) Pinacidil 1-5 mumol.L-1 did not affect GPI contractile responses evoked by a selective M-ACh receptor agonist carbachol 1 mumol.L-1. (5) Pinacidil 1-5 mumol.L-1 had no effect on binding properties of 5-HT3 receptors with selective 5-HT3 receptor radioligand [3H]GR65630 in the entorhinal cortex of rat brain.\n\n\nCONCLUSION\nThe inhibition by pinacidil of 5-HT3 receptor-mediated GPI contractile responses may be mediated through activation of ATP-sensitive K+ channels located in prejunctional myenteric neurons.","cites":"1","conferencePercentile":"57.69230769"},{"venue":"Zhongguo yao li xue bao = Acta pharmacologica Sinica","id":"59074292c9a8428d4bf3b470be21f7d7e4dc84bb","venue_1":"Zhongguo yao li xue bao = Acta pharmacologica Sinica","year":"1994","title":"[Facilitation of cholinergic transmission by huperzine A in toad paravertebral ganglia in vitro].","authors":"G B Zhang, M Y Wang, J Q Zheng, X C Tang","author_ids":"8273922, 7272049, 1737694, 6336475","abstract":"Using the intracellular recording techniques of toad paravertebral ganglia (PVG), the effects of cholinesterase inhibitor huperzine A (Hup-A), an alkaloid first isolated from Huperzia serrata (Thunb) Trev in China, on the synaptic transmission were studied. In 30 PVG cells tested, no remarkable changes in membrane potential and input resistance were observed during superfusion of Hup-A 0.3 or 1 mumol.L-1 for 15 min. The rate of orthodromic action potential evoked by preganglionic stimulation was increased by Hup-A 0.3 or 1 mumol.L-1 (n = 12, P < 0.05), and much faster, stronger, and longer in action at 50 or 100 mumol.L-1 (n = 11). The amplitude and duration of exogenous acetylcholine-, but not carbachol-, induced depolarization were increased (P < 0.05). It is concluded that Hup-A is a selective and potent cholinesterase inhibitor, by which action it facilitates the cholinergic transmission of PVG neurons.","cites":"1","conferencePercentile":"78.26086957"},{"venue":"Zhongguo yao li xue bao = Acta pharmacologica Sinica","id":"2b35da03301cda9c802e85ba40d54020d439583b","venue_1":"Zhongguo yao li xue bao = Acta pharmacologica Sinica","year":"1999","title":"Effect of tetrahydropalmatine analogs on Fos expression induced by formalin-pain.","authors":"J Y Hu, G Z Jin","author_ids":"5498214, 1750299","abstract":"AIM\nTo study the effect of tetrahydropalmatine (THP) analogs on Fos protein expression induced by formalin-pain and elucidate analgesic mechanism of THP analogs.\n\n\nMETHODS\nThe pain response to Sprague Dawley rats was induced with formalin injected s.c. into the plantar surface of the right hindpaw. Fos protein expression in brain and spinal cord was investigated with immunohistochemistry. The numbers of Fos-like immunoreactive (FLI) neurons were counted with Leica Q570 image analyzer.\n\n\nRESULTS\nIn the groups of THP analogs and D2 antagonist spiperone, FLI neurons induced by intraperitoneal (i.p.) injection of THP analogs and spiperone were mainly located in the striatum and accumbens nucleus, and a few FLI neurons were also in sensorimotor cortex. In the D1 antagonist, D1 agonist, D2 agonist, saline and vehicle groups, FLI neurons were seldom seen in the striatum and accumbens nucleus. Moreover, the Fos protein expression induced by l-THP and spiperone could be prevented by the pre-treatment of the D2 agonist quinpirole but not D1 agonist SKF38393. In the formalin-pain group, FLI neurons were mainly distributed in ascending pain afferent system (APAS) and descending pain modulation system (DPMS). Following i.p. THP analogs, however, the numbers of FLI neurons induced by formalin-pain in the APAS, such as dorsal horn (mainly laminae I, II, IV-VI) were markedly decreased, while the numbers of FLI neurons in the DPMS, such as periaqueductal gray (PAG) and reticular paragigantocellular lateral nucleus (RPLN) were significantly increased.\n\n\nCONCLUSION\nTHP analogs enhanced the activity of brainstem DPMS by the blockade of D2 receptors in the striatum and accumbens nucleus, and sequentially inhibited the inputs of peripheral pain afferent message in spinal cord level.","cites":"0","conferencePercentile":"27.17391304"},{"venue":"Zhongguo yao li xue bao = Acta pharmacologica Sinica","id":"e8cbd9186f11199c8e64f6c5f0f55e239109dcf7","venue_1":"Zhongguo yao li xue bao = Acta pharmacologica Sinica","year":"1997","title":"Physostigmine blocked nicotinic acetylcholine receptors in rat sympathetic ganglion neurons.","authors":"J Q Zheng, X P He, A Z Yang, C G Liu","author_ids":"1737694, 6999705, 4851197, 6349443","abstract":"AIM\nTo study the blocking mechanism of physostigmine (Phy) on nicotinic acetylcholine receptors (NAChR) in sympathetic neurons.\n\n\nMETHODS\nThe whole-cell patch-clamp technique was used to observe the effects of Phy on NAChR in the cultured sympathetic neurons from neonatal rat superior cervical ganglia (SCG).\n\n\nRESULTS\nPhy 5 -20 mumol.L-1 inhibited neuronal NAChR in a concentration-dependent manner and accelerated the desensitization of NAChR. Changing the membrane potential from -50 to -90 mV did not affect the blocking effect of Phy. Phy 200 mumol.L-1 did not induce any noticeable response in SCG neurons.\n\n\nCONCLUSION\nPhy blocked NAChR in the sympathetic ganglion neurons by interacting with the allosteric sites out of the binding sites and the open ionic channels of the receptors. Phy did not possess excitative effect on NAChR in SCG neurons.","cites":"0","conferencePercentile":"25"},{"venue":"Zhongguo yao li xue bao = Acta pharmacologica Sinica","id":"5867113454e1b8439735201919afe2f7c8ce2672","venue_1":"Zhongguo yao li xue bao = Acta pharmacologica Sinica","year":"1997","title":"Kinetic properties of nicotinic receptors in cultured rat sympathetic neurons from superior cervical ganglia.","authors":"J Q Zheng, X P He, A Z Yang, C G Liu","author_ids":"1737694, 6999705, 4851197, 6349443","abstract":"AIM\nTo analyze the kinetic properties of the effect of nicotine on nicotinic acetylcholine receptors (nAChR) in the cultured sympathetic neurons from neonatal rat superior cervical ganglia (SCG).\n\n\nMETHODS\nThe whole-cell recording method of patch-clamp technique was used to record the currents induced by different concentrations of nicotine. The concentration-response of nicotine was fitted with Clark equation.\n\n\nRESULTS\nHill coefficient (1.097) was determined by fitting the nicotine responses of neuronal nAChR with Clark equation. The theoretical values of nicotine effect, calculated with Clark equation with H = 1, were basically identical with the practically recorded currents.\n\n\nCONCLUSIONS\nInteraction of nicotine and nAChR in rat SCG fits a single binding site model.","cites":"0","conferencePercentile":"25"},{"venue":"Zhongguo yao li xue bao = Acta pharmacologica Sinica","id":"cb9e2034f573de75eb97b00ee024c013ba954352","venue_1":"Zhongguo yao li xue bao = Acta pharmacologica Sinica","year":"1999","title":"Supraspinal D2 receptor involved in antinociception induced by l-tetrahydropalmatine.","authors":"J Y Hu, G Z Jin","author_ids":"5498214, 1750299","abstract":"AIM\nTo study the role of dopamine (DA) receptors in l-tetrahydropalmatine (l-THP)-induced antinociception.\n\n\nMETHODS\nThe intraperitoneal (i.p.) and intrathecal (ith) injections were used to give the drugs. The tail-flick test was used to assess the nociceptive threshold of rats.\n\n\nRESULTS\nBy i.p. injection, l-THP (10, 20, 40 mg.kg-1) as well as D2 receptor antagonist spiperone (1, 2, 3 mg.kg-1) produced dose-dependent antinociceptive effects on the nociception of rats, while D2 receptor agonist quinpirole, D1 receptor agonist SKF38393, and D1 receptor antagonist Sch-23390 showed no antinociception. Moreover, l-THP- or spiperone-induced antinociception was markedly attenuated by quinpirole (2, 3 mg.kg-1) but not SKF38393 or naloxone. On the other hand, ith quinpirole (20, 30, 40 micrograms.kg-1) also induced a dose-dependent antinociception, while ith l-THP, spiperone, SKF38393, and Sch-23390 did not exhibit any antinociception. Furthermore, ith spiperone (20, 30, 40 micrograms.kg-1) but not Sch-23390 dose-dependently antagonised the antinociception induced by quinpirole. l-THP (ith, 100, 200, 300 micrograms.kg-1) also dramatically attenuated the quinpirole-induced antinociception with a dose-dependent relationship.\n\n\nCONCLUSION\nActivating the spinal D2 receptor or blocking the supraspinal D2 receptor produces antinociception. D1 receptor might be not directly involved in the antinociception. l-THP (as a D2 antagonist) as well as spiperone produces antinociception via blocking the supraspinal D2 receptor.","cites":"6","conferencePercentile":"95.65217391"}]}