{"Zhonghua_zheng_xing_wai_ke_za_z":[{"venue":"Zhonghua zheng xing wai ke za zhi = Zhonghua zhengxing waike zazhi = Chinese journal of plastic surgery","id":"9eae834ec8516eae04b16ce82913707390b42737","venue_1":"Zhonghua zheng xing wai ke za zhi = Zhonghua zhengxing waike zazhi = Chinese journal of plastic surgery","year":"2012","title":"[A new procedure to correct the crow's feet by covering the orbicularis oculi muscles with the superficial temporal fascia flap in rhytidectomy].","authors":"Li Yu, Zuo-Jun Zhao, Jia-Qi Wang","author_ids":"1720783, 8419886, 7898034","abstract":"OBJECTIVE\nTo explore an ideal procedure with more lasting aesthetic results by covering the orbicularis oculi muscles with the superficial temporal fascia flap in rhytidectomy, which can help to correct the crow's feet successfully.\n\n\nMETHODS\nDuring rhytidectomy, dissection was performed subcutaneously and also under pericranium and superficial temporal fascia at temporal area. Then the superficial temporal fascia flap was formed by cutting between pericranium and superficial temporal fascia. The fascia flap was reversed to cover the lateral orbicularis oculi muscle with fixation.\n\n\nRESULTS\nFrom May 2004 to May 2010, 18 cases were treated with a follow-up period of 6-12 months. The crow's feet was corrected better with long lasting results, compared with conventional rhytidectomy. No complication happened.\n\n\nCONCLUSIONS\nThe crow's feet can be corrected markedly with long lasting results by covering the orbicularis oculi muscles with the superficial temporal fascia flap in rhytidectomy.","cites":"0","conferencePercentile":"100"},{"venue":"Zhonghua zheng xing wai ke za zhi = Zhonghua zhengxing waike zazhi = Chinese journal of plastic surgery","id":"f471d912b57525e4099c52a0f16322f62d4c3db1","venue_1":"Zhonghua zheng xing wai ke za zhi = Zhonghua zhengxing waike zazhi = Chinese journal of plastic surgery","year":"2016","title":"[Anthropometric analysis of facial aging in 1200 Han adult people in Dalian].","authors":"Huizhong Guo, Gang Hu, Qianqian Xu, Hongzhi Qin, Fang Li, Le Kang, Hui Qu, Xiang Li, Wei Siming, Jinghen Gao","author_ids":"4176038, 4129071, 2282673, 5374438, 2720124, 8588094, 7220869, 1737850, 3791377, 6577369","abstract":"OBJECTIVE\nTo investigate the facial aging analysis of 1200 Han adult people in Dalian with iris diameter, so as to provide reference for facial rejuvenation in Han people.\n\n\nMETHODS\n1200 facial digital photographs from the second-generation ID card of China were stratified randomly selected as the research sample, excluding facial deformity, tattooing eyebrow, tattooing lid margin, ptosis, lip grain and eyebrow deformity cases, as well as the cases whose join point of upper eyelid and lower eyelid not exposed at the nasal side. These photos were divided into six cohorts: female aged 18, 38, and 68 years old; and male aged 18, 38, and 68 years old, with 200 cases in each cohort. The individual iris diameter was divided into 20 equal parts in each photograph, with each part marked one unit as individual iris diameter ruler. Ten values were made from a horizontal plane between the medial canthus to ten points at one face ( the line between two medial canthus is used as the horizontal line, circumocular and facial soft tissue were measured with individual iris diameter ruler on the photographs), then the results were analyzed with Adobe Photoshop software.\n\n\nRESULTS\nThere are statistically significant differences in eyebrow height (36.42 ± 4.22 unit in 18 years old male group, 40.22 ± 6.90 unit in 38 years old male group, 34.83 ± 9.39 unit in 68 years old male group; 37.59 ± 6.72 unit in 18 years old female group, 41.09 ± 5.15 unit in 38 years old female group, 36.84 ± 9.45 unit in 68 years old female group), palpebral fissure height, physiognomic external canthus height, palpebral fissure width, pupil height and other items (P < 0.05).\n\n\nCONCLUSIONS\n(1) The brow position rises to the peak level at middle age (38 years old group), then drops down gradually with aging. (2) The physiognomic external canthus moves towards the nasal side and caudal side with aging. (3) Eyeball moves towards caudal side with aging. (4) The soft tissue around bilateral angle of mouth, nasal tip and submaxilla moves towards caudal side with aging. (5) The measurement of individual iris diameter ruler can apply to analyze the aging changes of facial soft tissue, and is more suitable for the case when facial photographs are taken at different distances.","cites":"0","conferencePercentile":"100"},{"venue":"Zhonghua zheng xing wai ke za zhi = Zhonghua zhengxing waike zazhi = Chinese journal of plastic surgery","id":"9b961eb50cc8a7257a4e8b49e3b23fa82a0def5f","venue_1":"Zhonghua zheng xing wai ke za zhi = Zhonghua zhengxing waike zazhi = Chinese journal of plastic surgery","year":"2007","title":"[Cranial vault reconstruction of plagiocephaly].","authors":"Wei-min Shen, Gang Wang, Jie Cui, Jun-ping He, Jian-bing Chen","author_ids":"7962778, 4148672, 7617416, 8516488, 2063185","abstract":"OBJECTIVE\nTreatments of unilateral lambdoid synostosis and unilateral coronal synostosis.\n\n\nMETHODS\nApproach to coronal, double frontal flaps were rotated with orbit advancement and anteversion of the frontal to enlarge the volume of ante cranial fossa., and reconstruct the contour of orbit and the frontal. The gap was between the frontal and parietal to reconstruct the coronal suture after fixation and reconstruction of the frontal os. For post plagiocephaly, double rotated occipital flap and plum-plasty flap were performed to reconstruct the occiput. The gap between the parietal and occiput was to reconstruct the lambdoid suture.\n\n\nRESULTS\nEight cases have favourable prognosis with satisfactory contour.\n\n\nCONCLUSIONS\nIt is optimal to use frontal flap rotation, orbit advancement and frontal anteversion to correct the unilateral coronal synostosis. Bilateral rotated occipital-parietal crossing flap and plum-plasty were performed to reconstruct the occiput. Keeping the gap between the parietal and occiput for reconstruction of the lambdoid suture is suitable to infant.","cites":"0","conferencePercentile":"50"}]}