{"Zhonghua_yu_fang_yi_xue_za_zhi_":[{"venue":"Zhonghua yu fang yi xue za zhi [Chinese journal of preventive medicine]","id":"beaba6d8bb754bedb2c3fbc85f43c3835321d9e4","venue_1":"Zhonghua yu fang yi xue za zhi [Chinese journal of preventive medicine]","year":"2003","title":"[Brain-derived neurotrophic factor mRNA expressions in rat brain induced by short-term in vivo exposure to deltamethrin].","authors":"Su-qing Wang, Nian Shi, Li Zhou, You-tong Wu, Tao Li, Jie Dong, Liang Chen","author_ids":"7489488, 1914111, 4363590, 3915866, 1726351, 6106037, 8702312","abstract":"OBJECTIVE\nTo elucidate the mechanism of damage on central nervous system (CNS) caused by deltamethrin (DM).\n\n\nMETHODS\nThe mRNA and protein expressions of brain-derived neurotrophic factor (BDNF) in the cerebral cortex and hippocampus of the rats exposed to DM were measured by retro-transcription-polymerase chain reaction (RT-PCR), dot blot, flow cytometry analysis and immunohistochemistry.\n\n\nRESULTS\nAfter exposure to DM at high-dose (DM1, 25.0 mg x kg(-1) x d(-1), i.p.) once and low-dose (DM2, 12.5 mg x kg(-1) x d(-1), i.p.) for 5 days, the level of BDNF mRNA and protein expression in the cerebral cortex and hippocampus of the rats increased significantly. The levels of BDNF mRNA and protein expression in the cerebral cortex and hippocampus measured by of RT-PCR in the rats with DM1 and DM2 were higher than those in the controls by 48% and 56%, and 59% and 54%, respectively. And, those measured by dot blot in the rats with MD1 and MD2 were 186% and 161%, and 148% and 158% of those in the controls, respectively, basically similar to those measured by RT-PCR. Flow cytometric analysis showed that the levels of BDNF mRNA and protein expression in the cerebral cortex and hippocampus in the rats with DM1 and DM2 were higher than those in the controls by 53% and 89%, and 45% and 46%, respectively. Immunohistochemical analysis showed that protein expression in the cerebral cortex of the rats with DM1 and DM2 were 129% and 147% of those in the controls, same as the flow cytometric analysis, but those were significantly higher in the hippocampus mainly in the CA1 and DG areas of the rats with MD1 and the CA3 and DG areas of the rats with DM2.\n\n\nCONCLUSIONS\nDM could induce BDNF mRNA and protein expression in the cerebral cortex and hippocampus of the rats, which could play an important role in repairing of nerve damage.","cites":"0","conferencePercentile":"100"}]}