{"Zhongguo_dang_dai_er_ke_za_zhi_":[{"venue":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","id":"547d7d8246d4194e283d0f4c2dd14a85e21bf2f0","venue_1":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","year":"2012","title":"[Changes in expression levels of PV, GAD67 and KCC2 in the brain tissue of rats with schizophrenia induced by MK-801].","authors":"Yong Liu, Ya-Mei Tang, Xiang-Hui Zhang, Jing-Ping Zhao","author_ids":"7135550, 7868590, 8443473, 6920851","abstract":"OBJECTIVE\nTo study changes in the expression levels of parvalbumin (PV), glutamate decarboxylase 67 (GAD67) and K+-Cl- cotransporter 2 (KCC2) in the brain tissue of rats with schizophrenia (SZ) induced by dizocilpine (MK-801), and to investigate the mechanism involving gamma-aminobutyric acid (GABA) by which NMDA receptor blocker induces SZ in the perinatal period.\n\n\nMETHODS\nThirty-six neonatal male Sprague-Dawley rats were randomly assigned to two batches on postnatal day 6. Each batch was divided into normal control (treated by 0.9% normal saline), SZ-development model (treated by subcutaneous injection of 0.1 mg/kg MK-801 on postnatal days 7-10; bid), and SZ-chronic medication model groups (treated by intraperitoneal injection of 0.2 mg/kg MK-801 on postnatal days 47-60; qd). On postnatal day 63, the brain tissue of the first batch of rats was obtained and then fixed with paraform for histological sections; expression levels of PV and GAD67 in the medial prefrontal cortex (mPFC) and hippocampus CA1 were measured by immunohistochemistry. Simultaneously, the second batch of rats was sacrificed and the mPFC and hippocampus were obtained and homogenized; expression levels of KCC2 in the mPFC and hippocampus were measured by Western blot.\n\n\nRESULTS\nExpression levels of PV and GAD67 in the mPFC and hippocampus CA1 were significantly lower in the SZ-development and chronic medication model groups than in the normal control group (P<0.05). Expression levels of KCC2 in the mPFC and hippocampus were significantly lower in the SZ-development model group than in the SZ-chronic medication model and normal control groups (P<0.05).\n\n\nCONCLUSIONS\nThe expression changes of PV and GAD67 in SZ can be simulated using the SZ development model induced by MK-801, which might affect the development of the GABA system in the PFC and hippocampus by downregulating KCC2 expression.","cites":"0","conferencePercentile":"50"},{"venue":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","id":"b89a33c38f88712674e866b40ac4da95933d4d02","venue_1":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","year":"2010","title":"[A functional MRI study in ADHD children with impulsivity].","authors":"Fei Li, Bao-Juan Li, De-Wen Hu, Jun Liu, Zhong He, Shun-Ke Zhou","author_ids":"4641515, 1915628, 7352406, 1843598, 3759418, 7523081","abstract":"OBJECTIVE\nImpulsivity is one of the core symptoms of children with attention deficit hyperactivity disorder (ADHD). In order to understand the neuromechanism of the impulsive behaviors in ADHD children, this study investigated the specific functional areas of the brain by functional MRI.\n\n\nMETHODS\nThe subjects consisted of 10 ADHD children with impulsivity, 7 ADHD children without impulsivity and 9 normal children. A functional MRI examination was performed when the subjects were instructed to finish GO and STOP tasks with the GO-STOP impulsivity paradigm. The MRI data during the two tasks of GO and STOP were averaged and the corresponding activation regions between groups were compared.\n\n\nRESULTS\nThe data from the GO task revealed that the main activation regions of the normal children included frontal pole (superior frontal gyrus, middle frontal gyrus and medial frontal gyrus); the main activation regions of ADHD children without impulsivity were cerebellum (posterior lobe and anterior lobe bouton) and cingulated gyrus; those of ADHD children with impulsivity were medial globus pallidus and insula. The data from the STOP task showed that the main activation regions of normal children included superior frontal gyrus and middle frontal gyrus; those of ADHD children without impulsivity were middle frontal gyrus and cingulate gyrus; those of ADHD children with impulsivity were uncus and putamen. The activation regions of ADHD children with impulsivity were much fewer than the other two groups.\n\n\nCONCLUSIONS\nThe behavior of impulsivity-control involves a number of specific functional areas in the cerebral cortex. Compared with normal children, ADHD children without impulsivity have weaker brain function and brain activation, and ADHD children with impulsivity demonstrate much fewer brain activation regions, worse brain function and little awareness of the cerebral cortex.","cites":"1","conferencePercentile":"84.61538462"},{"venue":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","id":"ac70a476b108f399d2713df4f172d78db5671a3c","venue_1":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","year":"2009","title":"[Neurogenesis in the subventricular zone of neonatal rats after ischemic brain injury].","authors":"Jin-Qiao Sun, Bin Sha, Wen-Hao Zhou, Yi Yang","author_ids":"6588202, 6446555, 2117989, 1698559","abstract":"OBJECTIVE\nTo study the proliferation and differentiation of neural stem cells in the subventricular zone (SVZ) in neonatal rats after bilateral common arteries occlusion.\n\n\nMETHODS\nNinety-six 3-day-old Sparuge-Dawley rats were randomly divided into two groups: ischemia and control. Rats in the ischemia group were subjected to bilateral common arteries occlusion and the rats in the control group were sham-operated. All rats were administrated with 5-bromodeoxyuridine (BrdU) (50 mg/kg) via intraperitoneal injection. Rats were sacrificed and their brains were removed 1, 4, 7, 10, 14 and 35 days after ischemia. Using brain paraffin sections and immunofluorescence assays, the number of newborn cells in the SVZ was counted. Newborn neural stem cells and oligodendrocytes in the SVZ were observed, and then double marked with BrdU and nestin or osmium tetroxide (O4).\n\n\nRESULTS\nThe number of BrdU+ cells (neural stem cells) in the SVZ in the ischemia group was greater than in the control group 4, 7, 10 and 14 days after ischemia, and reached a peak at 4 days after ischemia (253.1+/- 49.3 vs 133.5+/- 17.7; P< 0.01). By 35 days after ischemia, the number of BrdU+/O4+ cells (oligodendrocytes) in the corpus callosum (56.0+/- 7.2 vs 17.0+/- 6.4; P< 0.01), the septal nuclei (45.0+/- 11.9 vs 20.5+/- 5.0; P< 0.01), the striatum (34.5+/- 4.2 vs 14.5+/- 5.8; P< 0.01) and the olfactory bulb (46.5+/- 6.6 vs 23.5+/- 8.4; P< 0.01) in the ischemia group increased significantly as compared to the control group (P< 0.01).\n\n\nCONCLUSIONS\nBrain ischemia can activate the proliferation of neural stem cells in the SVZ and promote neural stem cells differentiation into oligodendrocytes. The immature brain may have the capacity for self-repair after ischemic brain injury.","cites":"1","conferencePercentile":"83.33333333"},{"venue":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","id":"b6799629e44f290bdcf30d6565463dad4a9e90b4","venue_1":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","year":"2006","title":"[Role of caspase-1 and cytokines activated by caspase-1 in brain injury of the developing rats following recurrent seizures].","authors":"Ding-An Mao, Qun Yin, Li-Qun Liu, Tao Bo, Hai-Tao Bai, Jie Xiong","author_ids":"8701408, 7477412, 7954498, 7963333, 3730444, 1784158","abstract":"OBJECTIVE\nThe expressions of caspase-1 and cytokines activated by caspase-1 are associated with the pathophysiology of many diseases for its proinflammatory and proapototic peculiarity. However its relationship to brain injury of developing rats following recurrent seizures has not yet been identified. This study aimed to investigate the role of caspase-1 and cytokines activated by caspase-1 in brain injury of developing rats following recurrent seizures.\n\n\nMETHODS\nA total of 96 postnatal 20 day Sprague-Dawley rats were randomly assigned into Control and Seizure groups. Seizures were induced in the Seizure group by flurothyl inhalation daily for six days. Brain tissues were sampled at 6 hrs, and at 1, 3, and 7 days after last seizure. The expressions of caspase-1, interleukin (IL)-18 and IL-1beta mRNA in the cerebral cortex were detected by RT-PCR. The water content of the brain and the pathological changes of cortex nerve cells were observed. Brain injury was evaluated using a semiquantitative neuropathological scoring system.\n\n\nRESULTS\nThe levels of caspase-1 and IL-18 mRNA in the cerebral cortex of the Seizure group were obviously higher than those in the Control group at 6 hrs, and at 1, 3, and 7 days after seizure (P < 0.05 or P < 0.01). The expression of IL-1beta mRNA in the Seizure group exhibited a biphasic pattern: increased significantly at 6 hrs, and at 1 and 7 days post-seizure (P < 0.01), but was not significantly different from the Control group at 3 days post-seizure. Edema, degeneration and necrosis of nerve cells in cerebral cortex, accompanying by inflammatory cell infiltration and apoptosis of nerve cells, were observed under a light microscope in the Seizure group after recurrent seizures. The water content of the brain in the Seizure group increased significantly compared with that in the Control group at 6 hrs, and at 1 and 3 days after recurrent seizures (P < 0.01). The Seizure group had significantly higher neuropathological scores than the Control group at each time point (P < 0.01).\n\n\nCONCLUSIONS\nCaspase-1 and cytokines activated by caspase-1 play an important role in the developing brain injury after recurrent seizures.","cites":"0","conferencePercentile":"41.66666667"},{"venue":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","id":"ca56708ea390c67f87dcaa875cd80c3e9d8a4a4f","venue_1":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","year":"2008","title":"[Short-term effects of recurrent neonatal seizures on gamma-aminobutyric acid A receptor alpha1 and beta2 subunit expression in the rat brain].","authors":"Tao Bo, Tuan-Mei Wang, Xiao-Hua Zhu, Jian Li, Xing-Fang Li, Yong Chen, Ding-An Mao","author_ids":"7963333, 4613649, 3014065, 1701502, 7824591, 5511325, 8701408","abstract":"OBJECTIVE\nTo investigate the short-term effects of flurothyl-induced neonatal recurrent seizures on gamma-aminobutyric acid A receptor (GABAAR) alpha1 and beta2 subunit expression in the rat brain, and to study the relationship between the alterations of GABAAR subunits in the developing brain and seizure-induced brain injury.\n\n\nMETHODS\nSixty-four 7-day-old Sprague-Dawley rats were randomly divided into two groups: control and seizure. Seizures were induced by inhalant flurothyl daily for six consecutive days. The expression of GABAAR alpha1 and beta2 subunits protein in the cerebral cortex and the hippocampus were detected by Western blot and immunohistochemistry method 1 and 7 days after recurrent seizures.\n\n\nRESULTS\nCompared to the control, the accumulated optical density (AOD) of GABAAR alpha1 subunit immunoreactivity (IR) in the parietal cortex, the CA3-CA4 regions and the dentate gyrus in seizure rats increased significantly 1 day after recurrent seizures (P<0.05). The AOD of GABAAR alpha1 subunit IR in the parietal cortex, the CA1-CA4 regions and the dentate gyrus in seizure rats increased significantly 7 days after recurrent seizures compared with the control (P<0.05). The expression of GABAAR alpha1 subunit in the hippicampus and the cerebral cortex increased significantly in seizure rats compared with that in control rats 1 and 7 days after recurrent seizures. After 7 days of recurrent seizures, the AOD of GABAAR beta2 subunit IR in the CA1-CA2 regions increased significantly in the seizure group compared with that in the control group (P<0.05), but the AOD of GABAAR beta2 subunit IR in the thalamus decreased significantly in the seizure group compared with that in the control group (P<0.05). The expression of GABAAR beta2 subunit protein in the hippocampus increased significantly in the seizure group compared with that in the control group 7 days after recurrent seizures (P<0.05).\n\n\nCONCLUSIONS\nRecurrent neonatal seizures may result in the short-term alterations of GABAAR alpha1 and beta2 subunits expression in the cerebral cortex and the hippocampus in rats, suggesting the alterations of GABAAR subunit expression may be related to the developing brain injury following recurrent seizures.","cites":"0","conferencePercentile":"40.90909091"},{"venue":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","id":"afaab9ccfcc87b7691af71f5ee58e1c24c5e9150","venue_1":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","year":"2009","title":"[Neurobehavioral function of neonatal mice following excitotoxic brain damage].","authors":"Zhi-Ye Qi, Xiang-Ying He, Qi Li, Ya-Xiong Mo, Kun Liang","author_ids":"4252693, 3835005, 1682467, 7781246, 7272720","abstract":"OBJECTIVE\nTo assess the changes of neurobehavioral function in a neonatal mouse model of excitotoxic brain damage.\n\n\nMETHODS\nFifty-five 5-day-old ICR neonatal mice were randomly assigned to three groups: blank (no intravenous) control (n=20), saline control (n=20) and excitotoxic brain damage model (ibotenic acid treatment, n=15). Behavioral function was evaluated by the surface righting reflex test (postnatal days 6-10), the swimming test (postnatal days 8-12) and the Y-maze discrimination learning test (postnatal days 33-34).\n\n\nRESULTS\nRighting time in the surface righting reflex test in the ibotenic acid treatment group on postnatal days 6-10 was more prolonged than that in the two control groups (p<0.05). Swimming test scores in the ibotenic acid treatment group were significantly lower than those in the two control groups (p<0.05). In the Y-maze discrimination learning test, the mice from the ibotenic acid treatment group performed significantly worse than two control groups, presenting with increased learning times (19.79+/-2.42 vs 16.29+/-2.48 or 16.30+/-2.37; p<0.05) and achieving a lower correct percentage (86.7% vs 96.5% or 95.0%) (p<0.05).\n\n\nCONCLUSIONS\nThe developmental reflexes and learning and memory functions were impaired in neonatal mice following excitotoxic brain damage. Behavioral testing is useful in the evaluation of early developmental reflexes and long-term neurobehavioral outcome in neonatal mice with excitotoxic brain damage.","cites":"0","conferencePercentile":"38.88888889"},{"venue":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","id":"efaf0277e86dab83ff327a19b6f43ba73ef5b5e7","venue_1":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","year":"2006","title":"[Effect of hyperbaric oxygenation on neural stem cells and myelin in neonatal rats with hypoxic-ischemic brain damage].","authors":"Xiao-He Yu, Yu-Jia Yang, Xia Wang, Qin-Hong Wang, Min Xie, Bo-Xiang Qi, Chen-Tao Liu, Xiao-Li Wang, Yan-Jie Jia, Le Zhong","author_ids":"7932669, 8701869, 3517895, 7417590, 8703925, 5999500, 7531538, 1715651, 7415268, 7921126","abstract":"OBJECTIVE\nThis study investigated the effect of hyperbaric oxygenation (HBO) on neural stem cells (NSCs) and myelin in neonatal rats following hypoxic-ischemic brain damage (HIBD) and aimed to explore the possible mechanism of the protective effect of HBO on HIBD.\n\n\nMETHODS\nSeven-day-old Sprague-Dawley rat pups were randomly assigned into 4 groups: Normal control, HIBD, hyperbaric air (HBA), and HBO groups (n=30 each). The HIBD model was produced by permanent occlusion of the left common carotid artery and 2 hrs hypoxemia exposure (8% O2 at 37 degrees C). HBA and HBO treatment was administered (2 ATA, once daily for 7 days) in the HBA and HBO groups respectively 1 hr after HIBD. BrdU immunohistochemistry was used to detect the NSCs in the sub-ventricle zone (SVZ) of the lateral ventricle and the dentate gyrus (DG) of the hippocampus. The myelin damage was assessed by myelin basic protein (MBP) immunostaining.\n\n\nRESULTS\nThe BrdU-positive cells in the SVZ and the DG of the ischemic hemisphere in the HIBD group were dramatically decreased compared with those of the Normal control group at 3 weeks post-HIBD (P < 0.01). The HBO treatment resulted in an increase of BrdU-positive cells in the DG from 153.7 +/- 37.0 to 193.7 +/- 38.8 (P < 0.05). The nestin expression in the HIBD and HBA groups was reduced compared with that in the Normal control group. There was no difference in the nestin expression between the HBO and the Normal control groups. Hypoxia-ischemia (HI) led to marked myelin damage at 1 week post-HIBD. HBO or HBA treatment alleviated the damage.\n\n\nCONCLUSIONS\nThe HBO treatment can result in the proliferation of BrdU-positive cells and alleviate the myelin damage following HIBD in neonatal rats, thereby offering neuroprotectivity against HI insults.","cites":"5","conferencePercentile":"100"},{"venue":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","id":"144ece601a9736ebfee204558d931c58bdddf797","venue_1":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","year":"2010","title":"[Effects of neonatal recurrent seizures on glucocorticoid receptor expression in the rat brain].","authors":"Tuan-Mei Wang, Tao Bo, Man-Zhi Wang, Xiao-Hua Zhu, Jian Li, Xing-Fang Li, Ding-An Mao","author_ids":"4613649, 7963333, 7272132, 3014065, 1701502, 7824591, 8701408","abstract":"OBJECTIVE\nTo investigate the effets of flurothyl-induced neonatal recurrent seizures on glucocorticoid receptor (GR) expression in the rat brain.\n\n\nMETHODS\nForty-eight seven-day-old Sprague-Dawley rats were randomly divided into two groups: control and seizure. Seizures were induced by inhalant flurothyl daily for six consecutive days. Brains were sampled on postnatal days 13, 15 and 19. The expression of GR protein in the cerebral cortex was detected by Western blot and immunohistochemical method.\n\n\nRESULTS\nThe expression of GR in the cerebral cortical plasma protein was significantly lower in the seizure group than in the control group on postnatal day 15. The expression of GR protein in the cerebral cortical nuclear protein decreased significantly in the seizure group compared with that in the control group on postnatal days 15 and 19 (p<0.05). Compared to the control group, the accumulated optical density (AOD) of GR immunoreactivity (IR) decreased significantly in the parietal cortex on postnatal day 13 (p<0.05), the AOD of GR IR decreased significantly in the parietal cortex and the temporal cortex on postnatal day 15 (p<0.05), and the AOD of GR IR decreased significantly in the parietal cortex, temporal cortex and the frontal cortex in the seizure group on postnatal day 19 (p<0.05).\n\n\nCONCLUSIONS\nRecurrent seizures in neonatal rats result in abnormal GR expression in the cerebral cortex which might play an important role in short-term brain injury induced by early recurrent seizures.","cites":"0","conferencePercentile":"38.46153846"},{"venue":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","id":"aa2636f5181ecf3be8fc5ee2a2f0cb70b2447e05","venue_1":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","year":"2011","title":"[Progress in encephalopathy of prematurity].","authors":"Zhi-Heng Huang, Yi Sun, Chao Chen","author_ids":"7945875, 4399292, 2067320","abstract":"The preterm birth has been increasing for the last decade. With the development of neonatal intensive care techniques, the survival rate of preterm infants is increased markedly. However, the brain of preterm infants is so vulnerable to injury that preterm brain injury has become an enormous public health problem. Hypoxia-ischemia and infection/inflammation are two main perinatal risk factors causing premyelinating oligodendrocyte and cortical neuron injury. Encephalopathy of prematurity is characterized by diffuse white matter injury and neuronal/axonal disruption, leading to neurological disabilities such as cognitive impairment and cerebral palsy. The advancement in imaging techniques, especially magnetic resonance imaging, provides more information for preterm brain injury and brain development, which contributes to the diagnosis and follow-up of the preterm infants. This article reviews the progress in encephalopathy of prematurity in order to open a new window to prophylaxis and management of this disease.","cites":"0","conferencePercentile":"50"},{"venue":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","id":"21fcbe784a952f089dcd56d1f43bf513a14762a1","venue_1":"Zhongguo dang dai er ke za zhi = Chinese journal of contemporary pediatrics","year":"2011","title":"[Effects of low-dose chlorpyrifos exposure on dopaminergic neurons in the midbrain substantia nigra and neural behavioral development in neonatal rats].","authors":"Jie Zhang, Ling-Ling Zhao, Zhi-Ping Hu, Jun Zhou, Li Deng, Fen Gu, Hong-Mei Dai, Min Huang","author_ids":"8670363, 2646875, 7690349, 1728391, 8418094, 7247158, 7944665, 3587515","abstract":"OBJECTIVE\nTo explore the effects of low-dose chlorpyrifos (CPF) exposure on dopaminergic (DA) neurons in the midbrain substantia nigra and neural behavioral development in neonatal rats.\n\n\nMETHODS\nPostnatal 11 day old Sprague-Dawley rats were randomly assigned into CPF, menstruum dimethysulfoxide (DMSO) and normal saline (NS) groups. The rats in the CPF group were injected with low-dose CPF (5 mg/kg?d) on postnatal days 11-14. The two control groups were injected with DMSO or NS respectively. The rats were sacrificed on postnatal days 15, 20, 30, and 60. Body weight gain, outward appearance of brain tissue, the coefficient of brain and the water content of brain tissue were measured. Tyrosine hydroxylase (TH) expression in DA neurons in the midbrain substantial nigra was examined by immunohistochemical straining. Immune electron microscopy was used to examine the subcellular structure of DA neurons. Open field test, grip strength test, slope test and Morris water maze test were used to examine the neurobehavioral changes.\n\n\nRESULTS\nThe outward appearance of brain tissue was normal in the three groups. There were no significant differences in the absolute value of body weight gain, the coefficient of brain and the water content of brain tissue among the three groups. CPF exposure decreased the level of TH immunoreactivity (P<0.05) in the substantia nigra of CPF group since postnatal day 30 compared with the DMSO and NS groups. The subcellular structures of some DA neurons in the CPF group were impaired. Decreased motor activity and learning and memory impairments were observed in the CPF group compared with those in the DMSO and NS groups (P<0.05) since postnatal day 30.\n\n\nCONCLUSIONS\nCPF exposure during the neonatal period can cause long-term motor activity and learning and memory impairments in accompany with DA neurons damage in the midbrain substantia nigra.","cites":"0","conferencePercentile":"50"}]}