{"Zhonghua_lao_dong_wei_sheng_zhi":[{"venue":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","id":"9e1dee95a506771209bccbda685078f71f53792e","venue_1":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","year":"2006","title":"[Maximum acceptable weight of lift for manual lifting tasks].","authors":"Jing Chen, Lei Yang","author_ids":"3943100, 1704442","abstract":"OBJECTIVE\nTo explore the maximum acceptable weight of lift (MAWL) in different lifting conditions and the suitable lifting equation for the stipulation of occupational health standard of manual lifting tasks in China.\n\n\nMETHODS\nThe MAWL was investigated among the thirteen male and ten female students using psychophysical methodology and the recommended weight of limit (RWL) was compared.\n\n\nRESULTS\nThe MAWL of male and female subjects was decreased gradually with the increase of lifting height. Once the height of lifting was over shoulder, the MAWL was decreased dramatically. The RWL was greater than the MAWL at 25 cm horizontal distance in male subjects, but the RWL was smaller than the MAWL at the distance of 45 cm and 63 cm. The average MAWL of male subjects was 30.8% greater than that of female subjects. The MAWL was decreased gradually with increase of the horizontal distance at the same height of lifting. The result of the male subjects was consistent with that of the female subjects. For the asymmetric lifting tasks of the male subjects, the bigger the angle of rotation was, the less the MAWL became. The angle of rotation had negative correlation with the capability of lifting (r = -0.996 6, P < 0.01). When the subjects performed asymmetric lifting tasks, the RWL was smaller than the MAWL and the difference was significant.\n\n\nCONCLUSION\nThe revision is sufficient for the horizontal distance and asymmetric lifting in the NIOSH lifting equation, but it is not suitable for height, especially for the task of lifting over shoulder. The RWL for the task of lifting over shoulder should be lowered. The factor of gender should be taken into account in the lifting equation and the constant of gender S can be added. Then S = 1 for male while S = 0.692 for female.","cites":"5","conferencePercentile":"100"},{"venue":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","id":"d8004d0c07654a0480aa8ca7c063e85aba338313","venue_1":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","year":"2012","title":"[Effect of JNK signal transduction pathway in intense noise-induced apoptosis of vestibular hair cells in guinea pigs].","authors":"Ming Wei, Wei-tao Wang, Tao Zhang, Ling Tu, Ying-hong Liang, Jia Liu, Jun-hua Zhang, Yan-jie Gong","author_ids":"3424372, 7634841, 1743147, 8509381, 7668878, 7136836, 8215329, 7419895","abstract":"OBJECTIVE\nTo investigate the mechanism of intense noise-induced apoptosis of vestibular hair cells in guinea pigs and the effect of phosphorylated c-Jun N-terminal kinase (JNK) signal transduction pathway in intense noise-induced apoptosis of vestibular hair cells.\n\n\nMETHODS\nThirty-two guinea pigs were randomly and equally divided into 1, 5, and 15 d experimental groups and control group. The guinea pigs in the experimental groups were exposed to 4 kHz narrow-band noise at 120 dB SPL for 4 h and then subjected to measurement of auditory brainstem response at 1, 5, or 15 d after noise exposure. In each group, four guinea pigs were used to prepare paraffin sections of vestibular hair cells, and the rest for extraction of total protein from vestibular hair cells. The apoptosis of vestibular hair cells was detected by terminal deoxynucleotidyl transferase (TdT)-mediated d-UTP nick-end labeling (TUNEL). The expression levels of p-JNK and pc-Jun were measured by immunohistochemistry and Western blot.\n\n\nRESULTS\nTUNEL-positive cells were found in the vestibular hair cells in the experimental groups, most in the 1 d experimental group and least in the 15 d experimental group, but no positive cells were found in the control group. The immunohistochemical results showed that p-JNK and pc-Jun were detected in the cell nuclei in the experimental groups, but no p-JNK- and pc-Jun-positive cells were found in the control group. The Western blot showed that p-JNK and pc-Jun were increased and activated quickly at 1d after noise exposure, reached the peak levels at 5 d after noise exposure, and were then decreased gradually, but they were still at relatively high levels at 15 d after noise exposure.\n\n\nCONCLUSION\nIntense noise can cause injury to vestibular hair cells by inducing cell apoptosis, and p-JNK marks the activation of JNK signal transduction pathway, suggesting that JNK signal transduction pathway plays an important role in intense noise-induced apoptosis of vestibular hair cells in guinea pigs.","cites":"0","conferencePercentile":"57.14285714"},{"venue":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","id":"216e2fcf99e4ee231db6797a26485de7e65f734e","venue_1":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","year":"2015","title":"[Effects of methomyl on acetylcholinesterase in erythrocyte membrane and various brain areas].","authors":"Fei Zhao, Tao Li, Changchun Zhang, Yiping Xu, Hangong Xu, Nian Shi","author_ids":"2218321, 1726351, 2121446, 1757932, 6305670, 1914111","abstract":"OBJECTIVE\nTo study the toxicity of methomyl to acetylcholinesterase (AChE) in different regions.\n\n\nMETHODS\nThe optimal temperature and time for measurement of AChE activity were determined in vitro. The dose- and time-response relationships of methomyl with AChE activity in human erythrocyte membrane, rat erythrocyte membrane, cortical synapses, cerebellar synapses, hippocampal synapses, and striatal synapses were evaluated. The half maximal inhibitory concentration (IC50) and bimolecular rate constant (K) of methomyl for AChE activity in different regions were calculated, and the type of inhibition of AChE activity by methomyl was determined.\n\n\nRESULTS\nAChE achieved the maximum activity at 370 °C, and the optimal time to determine initial reaction velocity was 0-17 min. There were dose- and time-response relationships between methomyl and AChE activity in the erythrocyte membrane and various brain areas. The IC50 value of methomyl for AChE activity in human erythrocyte membrane was higher than that in rat erythrocyte membrane, while the Ki value of methomyl for AChE activity in rat erythrocyte membrane was higher than that in human erythrocyte membrane. Among synapses in various brain areas, the striatum had the highest IC50 value, followed by the cerebellum, cerebral cortex, and hippocampus, while the cerebral cortex had the highest Ki value, followed by the hippocampus, striatum, and cerebellum. Lineweaver-Burk diagram demonstrated that with increasing concentration of methomyl, the maximum reaction velocity (Vmax) of AChE decreased, and the Michaelis constant (Km) remained the same.\n\n\nCONCLUSION\nMethomyl is a reversible non-competitive inhibitor of AChE. AChE of rat erythrocyte membrane is more sensitive to methomyl than that of human erythrocyte membrane; the cerebral cortical synapses have the most sensitive AChE to methomyl among synapses in various brain areas.","cites":"0","conferencePercentile":"66.66666667"},{"venue":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","id":"05f21060322015644c01a9e7dfc36d22e3971781","venue_1":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","year":"2006","title":"[Evaluation of work load and related factors during asymmetric lifting with surface electromyography].","authors":"Jing Chen, Lei Yang","author_ids":"3943100, 1704442","abstract":"OBJECTIVE\nTo evaluate the work load and related factors for asymmetric lifting tasks using surface electromyography (EMG).\n\n\nMETHODS\nThirteen male volunteers lifted loads of 6 and 13 kg at two speeds, in varying angles of trunk rotation, from floor to knuckle height, performing 16 lifting tasks. During lifting, surface electromyography signals from the erector spinae, bilaterally at level of T10 and L3, was continually recorded. The work load and related factors for asymmetric lifting tasks were evaluated by comparing the average amplitude of EMG signals.\n\n\nRESULTS\nThe EMG average amplitude when lifting the load of 13 kg (43.30% MVE) was significantly greater than that when lifting the load of 6 kg (37.70% MVE) (P < 0.01). The EMG average amplitude when lifting at the higher speed (41.80% MVE) was significantly greater than that at the lower speed (39.19% MVE) (P < 0.05). The EMG average amplitude was increased with the increase of the trunk rotation angle without significant difference (P > 0.05). At T10, the EMG average amplitude was greater on the right side than that on the left side (50.31% MVE and 25.88% MVE respectively) while at L3, it was on the contrary (45.60% MVE on the left and 40.22% MVE on the right respectively) (P < 0.01). Multiple stepwise regression analysis showed that the load of lifting was the factor contributing most to the EMG average amplitude followed by the lifting speed.\n\n\nCONCLUSION\nThe risk factors related to work load for asymmetric lifting tasks are mainly the load and the speed of lifting. The EMG activity between the right and left side of erector spinae is different during such lifting.","cites":"0","conferencePercentile":"31.25"},{"venue":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","id":"c23d83f95e32b2a9431e61300e394a3abc7e5d95","venue_1":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","year":"2006","title":"[Mental workload for mental arithmetic on visual display terminal].","authors":"Xiao-Wu Peng, Qi-Cai He, Tao Ji, Zheng-Lun Wang, Lei Yang","author_ids":"5223233, 2941896, 8022744, 6836575, 1704442","abstract":"OBJECTIVE\nTo investigate the possibility of subjective rate, primary task evaluation and psychophysiology evaluation as methods for mental workload assessment of mental arithmetic on visual display terminal (VDT).\n\n\nMETHODS\nThe indexes including Cooper-Harper scale score, correct rate, speed in answering questions, heart rate variability, pupil size and blink rate were recorded during the performance of three different difficult tasks.\n\n\nRESULTS\nWith the variable number of formula increasing, the Cooper-Harper scale score increased, the right rate decreased, the speed decreased, pupil size increased, and blink rate significantly decreased. In comparison with rest, the value of TP, VLF, LF, LFnorm, LF/HF decreased remarkably in the mental arithmetic task, the value of HFnorm, HF/TP, rMSSD increased. However, the difference was not significant among three groups.\n\n\nCONCLUSION\nWith the variable number of formula increasing, the participant's mental workload increases. Every method of mental workload evaluation can assess the mental workload information for three tasks at various different levels in a way. Multi-indexes may be appropriate for mental load assessment.","cites":"1","conferencePercentile":"75"},{"venue":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","id":"b323dbd49bd1d20c9f02dadf555fe20b97381d85","venue_1":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","year":"2015","title":"[Effects of mecobalamin on Bax and Bcl-2 in neurons after peripheral nerve injury].","authors":"Dongqiang Wang, Pingping Zhang, Zhijun Li, Ying Liu","author_ids":"4100818, 7914162, 7719014, 1718041","abstract":"OBJECTIVE\nTo observe the effects of mecobalamin on the expression of apoptosis-related proteins, Bax and Bcl-2, in neurons after peripheral nerve injury, and to explore the role of neuron apoptosis in peripheral nerve regeneration after injury.\n\n\nMETHODS\nThirty healthy adult male wistar rats were randomly divided into sham-operation group, model group, and mecobalamin group, with 10 rats in each group. A rat model of left sciatic nerve semi-injury was established using forceps. Rats in the mecobalamin group were fed mecobalamin, while rats in the sham-operation group and model group were given the same dose of normal saline. The protein expression of Bax and Bcl-2 in neurons was measured at 14 days after operation. A semi-quantitative analysis of Bax and Bcl-2 proteins was performed by image analysis technology.\n\n\nRESULTS\nThe model group had significantly increased Bax protein expression and significantly reduced Bcl-2 protein expression in spinal cord anterior horn motor neurons and ganglion sensory neurons compared with the sham-operation group (P<0.05). Compared with the model group and sham-operation group, the mecobalamin group had significantly reduced Bax protein expression and significantly increased Bcl-2 protein expression in spinal cord anterior horn motor neurons and ganglion sensory neurons (P<0.05).\n\n\nCONCLUSION\nMecobalamin has anti-apoptotic effect, and it contributes to neurological function recovery possibly by inhibiting the death of injured neurons.","cites":"0","conferencePercentile":"66.66666667"},{"venue":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","id":"5b37c22f0daba23dac955796a626e077907c6660","venue_1":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","year":"2004","title":"[Estimation of intramuscular load of the upper limb in static postures and repetitive work by surface electromyography].","authors":"Jia-Shun Ding, Zheng-Lun Wang, Hai-Yang Zhang, Lei Yang","author_ids":"4894168, 6836575, 7214604, 1704442","abstract":"OBJECTIVE\nTo evaluate the intramuscular loads of the upper limb during static postures and repetitive work by surface electromyography.\n\n\nMETHODS\nTwenty-six male college student volunteers were recruited for the experiment. The surface electromyography (SEMG) singal were recorded from the brachioradialis, biceps brachii, deltoid and trapezius of right arm during static postures including forward elevating, abducting, extending and a repetitive performance at different height of the bench, and root mean square (RMS) values were educed from the singal.\n\n\nRESULTS\nThe SEMG amplitudes from forward elevating and abducting were in direct proportion to the angle of the elevating and abducting (r > 0.9, P < 0.01). The maximal voluntary electrical activation (MVE) of the deltoid were 6.4%, 10.1%, 12.6%, 16.2% and 20.8% while the arm elevated forward at an angle of 0 degrees , 45 degrees , 90 degrees , 135 degrees and 180 degrees respectively. The repetitive work showed that the height of the bench and the duration had more effects on deltoid and trapezius than the other muscles. The MVE% of the deltoid were 13.0%, 14.4% and 15.6% while the bench was 74, 79 and 84 cm in height respectively (P < 0.01).\n\n\nCONCLUSION\nSEMG which is suitable for determining and reflecting the muscle strain during static postures and repetitive work may be a reasonable indicator for the assessment of manual workload and the ergonomic design.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","id":"eab602c40b627370bb6e0283b40d2d329a68f1ff","venue_1":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","year":"2004","title":"[Analysis of surface electromyography on repetitive lifting task-induced fatigue of back muscles].","authors":"Jing Chen, Jia-Shun Ding, Zheng-Lun Wang, Lei Yang","author_ids":"3943100, 4894168, 6836575, 1704442","abstract":"OBJECTIVE\nUsing surface electromyography (SEMG) technique to evaluate repetitive lifting task-induced fatigue of back muscles.\n\n\nMETHODS\nThirteen volunteers lifted and lowered an 8 kg weight from floor to waist level for 100 times. Fatigue in the erector spinae muscles was quantified by comparing the frequency content of the EMG signal during static contractions performed before, and immediately after the 100 lifts.\n\n\nRESULTS\nEMG average amplitude rose gradually during 100 lifts, the difference was significant at T10 right (P < 0.05) and L3 left (P < 0.01), the difference was not significant at T10 left and L3 right (P > 0.05). The median frequency intercept at T10 right, T10 left, L3 right, L3 left erector spinae muscles decreased by 2.0% (P > 0.05) 10.9% and 29.9% (P < 0.05), 27.9% (P < 0.01), respectively. The mean power frequency intercept decreased by 9% at L3 left erector spinae muscle (P < 0.05), the decrease was not statistically significant at other sites (P > 0.05).\n\n\nCONCLUSION\nRepetitive lifting may induce measurable fatigue in the erector spinae muscles. Erector spinae muscle at L3 is more easily fatigued than at T10. Using the median frequency intercept to assess muscle fatigue is more sensitive than using mean power frequency intercept.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","id":"4732566a5ad664e135eea16ac7fba1459fe42b28","venue_1":"Zhonghua lao dong wei sheng zhi ye bing za zhi = Zhonghua laodong weisheng zhiyebing zazhi = Chinese journal of industrial hygiene and occupational diseases","year":"2011","title":"[The effects of caspase-3 siRNA on the neurobehavior of mice exposed to aluminum].","authors":"Na Li, Xiao-yan Wang, Chun-chang Liu, Qin-li Zhang, Qiao Niu","author_ids":"1748656, 8416980, 6286755, 8326739, 3774175","abstract":"OBJECTIVE\nTo investigate the effects of caspase-3 siRNA on the neurobehavior of mice exposed to aluminum.\n\n\nMETHODS\nMale KunMing mice (3 months old) were randomly divided into 4 groups by weight:blank control group (4 microl normal saline), Al group (4 microl 0.5% AlCl3), Al plus empty vector group(3 microl 0.5% AlCl3 plus control siRNA expression vector)and Al plus RNAi group (3 microl 0.5% AlCl3 plus targeted siRNA expression vector). All groups were treated by lateral cerebral ventricle micro-injection for 5 days. The neurobehavior was tested by the Morris water maze test, Open-field and Step-down tests for all treated mice. Pathological changes in hippocampus was observed by electron microscopy, the caspase-3 gene expression levels were detected using RT-PCR.\n\n\nRESULTS\nThe results of Step-down test indicated that as compared with control group, the latent time [LT, (44.67 +/- 10.60) s] in A1 group decreased significantly, the error number (3.63 +/- 0.52) in Al group increased significantly and the LT [(68.00 +/- 14.70) s] in Al plus empty vector group decreased significantly (P<0.05). the LT [(239.50 +/- 19.36) s] in Al plus RNAi group increased significantly and the error number in Al plus RNAi group decreased significantly, as compared with Al group (P<0.05). The results of Morris water maze test showed that as compared with control group, the LT in Al group increased significantly, and residence time in the former platform quadrant decreased significantly and the LT in Al plus empty vector group increased significantly (P<0.05). The LT in Al plus RNAi group was significantly longer than that in Al group (P<0.05). The results of open-field test demonstrated that as compared with control group, the time in the central grid in Al group and Al plus empty vector group increased significantly, the rearing number and the modification number in Al group and Al plus empty vector group decreased significantly (P< 0.05). As compared with Al group, the time in the central grid in Al plus RNAi group decreased, the inter-cell number, the rearing number and the modification number increased significantly (P<0.05). The results of electron microscopic examination exhibited that a slight change of hippocampal cells appeared in control group, the obvious pathological changes of hippocampal cells appeared in Al group and Al plus empty vector group, but the pathological changes of hippocampal cells in Al plus RNAi group significantly reduced as compared with Al group. The results of thionin staining indicated that the layers of neural cells of hippocampal CA3 were more clear and there was not obvious denatured injury of neural cells of hippocampal CA3 in control group. The number and Nissl body color of neural cells of hippocampal CA3 in Al group and Al plus empty vector group decreased significantly. After RNA interference, the number and Nissl body color of neural cells of hippocampal CA3 increased obviously. The expression levels of caspase-3 gene in Al group and Al plus empty vector group were 2.24 +/- 0.57 and 2.28 +/- 0.33, respectively, which were significantly higher than that (1.00 +/- 0.00) in control group (P<0.05). The expression level of caspase-3 gene in Al plus RNAi group was 0.44 +/- 0.08, which was significantly lower than those in Al group and control group (P<0.05).\n\n\nCONCLUSION\nAluminum can decrease the learning and memorizing ability, and inhibited the activity or exploration function of mice. It is suggested that Caspase-3 siRNA may reduce the neurotoxicity induced by aluminum to a certain extent.","cites":"1","conferencePercentile":"100"}]}