{"Zhonghua_shao_shang_za_zhi__Zho":[{"venue":"Zhonghua shao shang za zhi = Zhonghua shaoshang zazhi = Chinese journal of burns","id":"42d77cf5c64475d592ef08b612f7e8ad0dbb819d","venue_1":"Zhonghua shao shang za zhi = Zhonghua shaoshang zazhi = Chinese journal of burns","year":"2011","title":"[Correlation analysis between the expression of aquaporin 4 and magnetic resonance imaging of brain tissue in severely scalded rabbit with brain edema during early stage].","authors":"Yan-wei Zhang, Hai-tao Li, Jun Hu, Yun Lin, Jing-ming Hou, Wen-jing Wu","author_ids":"3857097, 7178851, 1745787, 3811347, 7287415, 2417209","abstract":"OBJECTIVE\nTo observe expression pattern of aquaporin 4 (AQP4) in brain tissue of severely scalded rabbit during early stage of brain edema and its relationship with signal changes in magnetic resonance imaging (MRI), and to explore the feature of water transmembrane transportation in brain edema at early stage after severe scald.\n\n\nMETHODS\nThirty-five healthy New Zealand white rabbits were divided into control group (C, n = 5) and scald group (S, n = 30) according to the random number table. Rabbits in S group were inflicted with 50% TBSA full-thickness scald with brain edema (confirmed by histopathologic examination). At post scald hour (PSH) 1, 2, 3, 4, 5, and 6, signal change in cerebral MRI, as well as dynamic change in apparent diffusion coefficient (ADC) were examined in rabbits of S group. Specimens were harvested from frontal cortex, parietal cortex, temporal lobe cortex, basal ganglia, and cerebellum in rabbits of S group for determination of protein and gene expressions of AQP4 with immunohistochemical method and RT-PCR. Above-mentioned indexes were also determined in C group. Data were processed with one-way analysis of variance and linear correlation analysis (between protein expression of AQP4 and ADC value).\n\n\nRESULTS\nThere was no significant change in image signal of MRI at each time point in S group as compared with that in C group, including T1WI, T2WI, and DWI. Compared with those in C group, ADC in S group at PSH 4, 5, and 6 were significantly decreased (with F values from 0.492 to 2.271, P values all below 0.05). The expression of AQP4 protein in each part of brain tissue in S group was obviously increased at PSH 2, 3, 4, 5, and 6 as compared with those in C group (from 0.164 ± 0.022 to 0.247 ± 0.018), and it peaked at PSH 3 or 4 (from 0.237 ± 0.042 to 0.306 ± 0.026), with F values from 2.420 to 11.439, P values all below 0.05. The expressions of AQP4 protein were similar in brain tissue of all regions, and they were negatively correlated with corresponding ADC values (with r values from -0.489 to -0.337, P < 0.05 or P < 0.01). Compared with that in C group, the expression of AQP4 mRNA in each part of brain tissue in S group was obviously increased at each time point, and it reached the peak at PSH 2 (with F values from 39.992 to 238.584, P values all below 0.05). The expressions of AQP4 mRNA were similar in all brain tissue regions.\n\n\nCONCLUSIONS\nBrain edema within 6 hours after severe scald was mainly characterized by cytotoxicity, in which AQP4 may play an important role. ADC value may have important reference value for non-invasive and convenient assessment of development of brain edema.","cites":"0","conferencePercentile":"100"}]}