{"Zhonghua_er_ke_za_zhi__Chinese_":[{"venue":"Zhonghua er ke za zhi = Chinese journal of pediatrics","id":"e860d6ab96fd4a4aaf31f810103650d542391081","venue_1":"Zhonghua er ke za zhi = Chinese journal of pediatrics","year":"2004","title":"[Protective effects of fructose-1,6-diphosphate on brain damage caused by febrile seizures in rats].","authors":"Jian-ping Zhou, Fan Wang, Rui-lin Li, Bao-li Yuan, Jing Li, Er-di Xu","author_ids":"8655110, 6701355, 8139910, 4362084, 1742253, 6120004","abstract":"OBJECTIVE\nFebrile seizure (FS) is a pediatric emergency. The reiterative attacks of FS may result in brain damage to various extents. Fructose-1,6-diphosphate, serving as a cellular energy substance, has been applied to clinical practice for many years and has shown its importance in adjuvant treatment of diseases with myocardial damage. This study aimed to explore the potentiality of protecting rats' brain damage caused by febrile seizure with fructose-1,6-diphosphate (FDP).\n\n\nMETHODS\nThirty 21-day-old male Sprague-Dawley (SD) rats were randomly divided into febrile seizure group (FS), sodium chloride solution (NS) control group and FDP intervention group (FD). Febrile seizure was induced by hyperthermal bath at 45 degrees C in the present study. No intervention treatment was given to rats in FS group before febrile seizure. Thirty minutes before febrile seizures, rats in FD group were given peritoneal injection of FDP at a dose of 25 mg per 100 g of body weight, whereas the same volume of 0.9% sodium chloride solution was injected into peritoneum of rats in NS group. Manifestations of seizure and differences in seizure latency, duration of seizure and seizure severity were observed in all the 3 groups. Samples of rat brain were prepared for electron microscopy in order to understand the characteristics of the ultrastructural changes in mitochondria, interspace of neuronal synapses and neurons of hippocampal region CA(1).\n\n\nRESULTS\nData collected from this study indicated that peritoneal injection of FDP at 25 mg per 100 grams of body weight 30 minutes before febrile seizures could result in improvement of the clinical manifestation of the rats caused by febrile seizures. Specifically speaking, the seizure latency was prolonged, the duration of seizures was shortened and severity of seizure was reduced. Analysis of variance and q-test on the data collected from the 3 groups revealed that there were significant differences between FD group and the other two groups (P < 0.05), yet no significant difference was found between FS group and NS group (P > 0.05). Electron microscopic observations on brain specimens revealed that FDP could relieve mitochondrial degeneration and edema. FDP could also reduce neuronal degeneration and necrosis in hippocampal region CA(1) (the percentages of neuronal degeneration and necrosis in the 3 groups were respectively 13% for FD group, 28% for FS group and 30% for NS group). There was a significant difference between FD group and the other two groups (P < 0.05), FDP treatment could prevent interspace of neuronal synapses from enlarging (the mean interspace was 6.47 +/- 0.37 micro m for FD group, 7.60 +/- 0.36 micro m for FS group and 7.53 +/- 0.40 micro m for NS group. The difference between FD group and the other two groups was significant (P < 0.01).\n\n\nCONCLUSION\nFDP could lead to prolonged seizure latency, shorter duration of seizures and mitigation of seizures severity. FDP could also reduce neuronal degeneration and necrosis and prevent the interspace of neuronal synapses from enlarging in hippocampal region CA(1). The present study suggests that FDP can protect brain of rat from damages caused by febrile seizures.","cites":"0","conferencePercentile":"44.44444444"},{"venue":"Zhonghua er ke za zhi = Chinese journal of pediatrics","id":"193128063ac8da097ab29820c0a52eb515f9ca34","venue_1":"Zhonghua er ke za zhi = Chinese journal of pediatrics","year":"2013","title":"[Relationship between tic symptom severity and amplitude of low frequency fluctuation of resting-state functional magnetic resonance imaging of Tourette syndrome].","authors":"Yong-hua Cui, Yi Zheng, Zhen Jin, Yong He, Xu Chen, Li-ping Yu","author_ids":"7332509, 1789089, 6253281, 1752156, 1734498, 5586222","abstract":"OBJECTIVE\nTo examine the relationship between tic symptom severity and amplitude of low frequency fluctuation (ALFF) brain functioning of the first-episode Tourette syndrome through resting-state functional magnetic resonance imaging (fMRI).\n\n\nMETHOD\nSixteen subjects were all recruited from the outpatient department of pediatrics, Beijing Anding Hospital, Capital Medical University and were all first-episode Tourette syndrome patients [male: 13, female: 3; age: 6-16 years; mean age: (11.00 ± 2.92) years]; mean education time: (5.06 ± 2.86) years; course: 14-104 months; mean (48.44 ± 25.00) months; scores of YGTSS at baseline: tic severity score: 37.88 ± 5.39; global damage score: 25.63 ± 12.63. All the subjects experienced resting-state fMRI scans and ALFF were calculated in three frequency ranges: 0.01-0.1 Hz, 0.01-0.027 Hz and 0.027-0.073 Hz. First-episode Tourette syndrome patients and 16 gender, age, and education-matched normal controls experienced resting-state fMRI scans. Correlation analysis was performed in between the amplitude of low frequency fluctuation (ALFF) and the severity of tic symptom. P < 0.05 and k value ≥ 10 were considered to be of significance.\n\n\nRESULT\nIn tic symptom patients, tic severity (total tic scores of YGTSS) was positively correlated with the ALFF values in the orbital part of left superior frontal gyrus (0.01-0.1 Hz:r = 0.83,0.027-0.073 Hz:r = 0.91, P < 0.05, respectively), right middle frontal gyrus (0.01-0.027 Hz:r = 0.85,0.027-0.073 Hz:r = 0.57, P < 0.05, respectively ) and orbital part of left middle frontal gyrus (0.01-0.027 Hz:r = 0.64, P < 0.05). Tic severity was negatively correlated with the ALFF values in the right calcarine fissure and surrounding cortex (0.01-0.1 Hz:r = -0.65,0.01-0.027 Hz:r = -0.69, P < 0.05, respectively ) and the left calcarine fissure and surrounding cortex (0.027-0.073 Hz:r = -0.81, P < 0.05).\n\n\nCONCLUSION\nTic symptom severity of the first-episode Tourette syndrome is associated with abnormal brain activity patterns of specific brain areas.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er ke za zhi = Chinese journal of pediatrics","id":"c336366c471596f41ac7aecdf560e0bc09e618e3","venue_1":"Zhonghua er ke za zhi = Chinese journal of pediatrics","year":"2004","title":"[Effects of febrile seizures on motor, behavior, spatial learning and memory in rats].","authors":"Jian-ping Zhou, Fan Wang, Rui-lin Li, Bao-li Yuan, Ya-le Guo","author_ids":"8655110, 6701355, 8139910, 4362084, 6879252","abstract":"OBJECTIVE\nFebrile seizure is a very common emergency in children. Although researchers home and abroad constantly pay close attention to studies on brain damage and lesion possibly caused by febrile seizure, studies of effects on motor, behavior, spatial learning and memory are relatively seldom. In our study, Sprague-Dawley rats were utilized for the purpose of the exploration of effects of febrile seizures on their motor, behavior, spatial learning and memory.\n\n\nMETHODS\nSixty 21-day-old male Sprague-Dawley rats, weighing (50 +/- 5) g were divided randomly and equally into febrile seizure group (FS), febrile control group (FG) and normal control group (NG). Febrile seizure animal model was induced by hyperthermal bath with 45 degrees C water. Febrile seizure was induced twice a day, thus ten times within five days in FS group. Rats of FG group were immersed in the same hyperthermal water for 2 minutes. Nothing special was performed on NG group. The abilities of motor and behavior of every rat in these 3 groups were tested in inclined plane test (IPT), overhanging test (OHT) and open field test (OFT) to show their varieties. Furthermore, Morris water maze was applied to evaluate the effects by febrile seizure on spatial learning and memory in rats during the place navigation test and spatial probe test.\n\n\nRESULTS\nIn the present experiments, febrile seizures were altogether induced 192 times with the mean latency being (4.25 +/- 0.98) minutes and the mean duration being (1.06 +/- 0.59) minutes. The experiments confirmed that multiple febrile seizures could lead to decreases of abilities in all tests in which analysis of variance indicated that there were significant differences between febrile seizure group and the other two (P < 0.01). In inclined plane test, the turning ability of the rats was weakened. The mean turning time was (9.1 +/- 2.6) seconds for FS, (5.3 +/- 2.1) seconds for FG and (5.3 +/- 2.0) seconds for NG. In overhanging test, the overhanging time was shortened: (33.4 +/- 18.1) seconds for FS, (50.1 +/- 20.3) seconds for FG and (59.0 +/- 20.7) seconds for NG. In the open field test, the rats became less active with the scores (5.1 +/- 2.0) for FS, (10.4 +/- 3.0) for FG and (13.2 +/- 2.3) for NG. Meanwhile, the authors discovered the decreases of the abilities of spatial learning and memory in rats caused by febrile seizures many times. In the place navigation test, the mean escape latency for the rats' looking for hidden platform was prolonged; the efficiency of their search strategy decreased; the swimming time the animals spent in platform region decreased [(44.02 +/- 5.25) seconds for FS, (51.75 +/- 5.28) seconds for FG and (57.07 +/- 5.36) seconds for NG; analysis of variance, P < 0.01.]; the number of times they crossed the platform area decreased [(6.07 +/- 1.77) times for FS, (9.25 +/- 2.07) times for FG and (11.34 +/- 2.37) times for NG; analysis of variance, P < 0.01]; the percentage of their swimming time fell (36.68% for FS, 43.13% for FG and 47.56% for NG).\n\n\nCONCLUSION\nThe experiments confirmed that multiple febrile seizures could result in damage and lesion of motor, behavior, spatial learning and memory in rats.","cites":"0","conferencePercentile":"44.44444444"},{"venue":"Zhonghua er ke za zhi = Chinese journal of pediatrics","id":"b500f0ebf3f01ac61fd88ccce619db3a59011285","venue_1":"Zhonghua er ke za zhi = Chinese journal of pediatrics","year":"2014","title":"[Study on concordance of ictal and interictal epileptiform activity in patients with tuberous sclerosis complex].","authors":"Zhixian Yang, Qinghui Guo, Jiaxin Zhuang, Xiaoyan Liu, Hui Xiong, Ye Wu, Shuang Wang, Xingzhi Chang, Yuehua Zhang, Xinhua Bao, Yuwu Jiang, Jiong Qin","author_ids":"8387153, 7736776, 5805646, 1799750, 1707713, 7860959, 6002294, 8205097, 7550658, 8538080, 7911884, 4237204","abstract":"OBJECTIVE\nTo analyze the relationship between the ictal onset zone and dominant interictal epileptiform foci in tuberous sclerosis complex (TSC) patients.\n\n\nMETHOD\nClinical data of 20 patients with TSC which had epileptic seizures during Video-EEG monitoring was assessed. Consistency and dominance of focal interictal epileptiform activity and the ictal onset zone were identified. Concordance between interictal and ictal findings was analyzed.\n\n\nRESULT\nOf the 20 patients, 7 were female, and 13 were male. The age of epilepsy onset was from 15 d to 6 years. The Video-EEG monitoring age was from 6 months to 11 years. Family history was found in three cases. Abnormality in neuroimaging existed in 17 of 18 patients who were examined. Interictal EEG showed hypsarrhythmia in 3 patients, multifocal epileptiform activity with a dominant focus in 12 patients, both focal and generalized discharges in 2 patients, and only focal discharges in 3 patients. The seizures types during EEG monitoring included epileptic spasms, partial seizure, atypical absence, and generalized or focal myoclonic seizure. The most common seizure type was partial seizure and then epileptic spasms. EEG in 4 patients with epileptic spasms showed ictal generalized discharges and interictal hypsarrhythmia or generalized discharges. Clinical manifestation of epileptic spasms was asymmetric in 3 patients. Lateralization and location of interictal and ictal discharges were consistent in 2 of the 3 patients, while only lateralization consistency in 1 of the 3 patients. Partial seizures as the only seizure type were monitored in 13 patients. Of the 13 patients, lateralization and location of interictal and ictal discharges were inconsistent in 2 patients (15%), consistent in 8 patients (62%), lateralization or location consistent in 2 patients (15%). One case could not be analyzed because of uncertainty of lateralization and location of seizure onset.\n\n\nCONCLUSION\nIn the majority of patients with TSC, multifocal interictal epileptiform activity is present, in which a most dominance of focal epileptiform activity could be found. For some epileptic seizures or the majority of partial seizures, the ictal onset zone is concordant with the dominance of focal interictal epileptiform foci. The concordance might have positioning reference significance for preoperative evaluation of epilepsy surgery.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er ke za zhi = Chinese journal of pediatrics","id":"12747df4992b87242c4a355d049e8314f46a5ed0","venue_1":"Zhonghua er ke za zhi = Chinese journal of pediatrics","year":"2004","title":"[Clinical analysis of 91 cases with articulation error].","authors":"Xing-ming Jin, Jing Zhao, Yi-wen Zhang, Hong Wu","author_ids":"5834164, 5349795, 3407162, 5814513","abstract":"OBJECTIVE\nTo study classification of the articulation errors, find the related factors which affect the therapy effect, and compare the therapy effect in the different patterns of the phonemic errors and build up a clinical model of the speech therapy on the basis of more than 4 years speech therapy in the clinic.\n\n\nMETHOD\nAfter excluding the organic articulation disorders, 91 cases of consonant phonemic errors were classified into different patterns according to the phonemic placement errors. The 91 cases were divided into two groups as effective one and ineffective one depending on whether the symptoms disappeared or not after the speech therapy. Ten factors including sex, age, oral-motor function problem, developmental delay, history of language development delay, history of middle ear affection, lingua frenata, mental retardation, the therapy frequency and times, were analyzed. The statistics software SPSS (SPSS Inc, 1997) was applied to show the factors related to the therapy effect by logistic multiple stepwise regression analysis. The therapy effect was compared between the single pattern (phonemic error < 2 groups) and multiple pattern (phonemic errors > or = 2 groups).\n\n\nRESULTS\nThe 91 cases with consonant phonemic errors were classified into four groups. The multiple pattern of the articulation errors was the most common (37 cases, 41%) among the 4 groups, followed by velar errors (33 cases, 36%). The third one was the apico-dental errors (12 cases, 13%) and the last one was the linguo-alveolar errors (8 cases, 9%). Only one case had labiodental error (/f/). The logistic multiple stepwise regression analysis showed that the history of the positive developmental delay, language delay and the frequency of the speech therapy were related to the therapy effect. The effective rate of the speech therapy in the single pattern of the phonemic error was as high as 87% while the one in the multiple pattern group was only 2.7%. The difference was significant (P < 0.000 1) when the therapy effect in these two groups was compared. The clinical model of the speech therapy included speech assessment, designing of the goal, choice of the target sound, sound production and oral-motor functional training.\n\n\nCONCLUSION\nThe consonant phonemic errors in the clinic represent four groups. The developmental delay, the language delay and frequency of the speech therapy influence the therapy effect. The frequency of the speech therapy should be increased every week, for example not less two times a week. The therapy effect of the single pattern of the phonemic errors is much better than that of the multiple pattern. The primary model of the speech therapy has been built in the clinics.","cites":"0","conferencePercentile":"44.44444444"},{"venue":"Zhonghua er ke za zhi = Chinese journal of pediatrics","id":"d428c094377fc7c58ace4a06ff49b9aff4e23a71","venue_1":"Zhonghua er ke za zhi = Chinese journal of pediatrics","year":"2014","title":"[Exploring the clinical significance of continuously measuring apparent diffusion coefficient values in the preterm infants with punctate white matter damage by applying diffusion weighted imaging].","authors":"Xin Tong, Xindong Xue, Jianhua Fu","author_ids":"1743927, 7988762, 8505809","abstract":"OBJECTIVE\nTo observe the dynamic changes of MRI in the preterm infants with punctate white matter damage (PWMD), and to explore the clinical significance of apparent diffusion coefficient (ADC) values by continuously measuring the lesions and surrounding region by applying diffusion weighted imaging (DWI).\n\n\nMETHOD\nMRI, using conventional and diffusion weighted imaging, was performed in 151 preterm infants within 7 days after birth between October 2010 to June 2011 in NICU. Twenty-four preterm infants with PWMD and 24 controls were obtained according to their MRI results. The control group infants were those with normal MRI results and at the same gestational age as those with PWMDs. The ADC value was measured for the lesions and their surrounding regions, and for the same sites of the controls. All the PWMD were followed up for 2-5 weeks, and apparent diffusion coefficients were measured at the same regions. The variation of magnetic resonance imaging was observed and the apparent diffusion coefficients were compared.\n\n\nRESULT\nThe first MRI scanning: in the 24 cases with PWMD, high signals on DWI were seen in all patients (100%), increased signal intensity on T1-weighted images were seen in 19 (79.2%) patients, increased signal intensity on T1-weighted images and decreased signal intensity on T2-weighted images were seen in 4 (16.6%) patients. The second MRI scanning: in the 24 cases with PWMD, The high signal on DWI vanished in all patients (100%), the increased signal intensity on T1-weighted images vanished in 9 (39.1%) patients, the increased signal intensity on T1-weighted images did not vanish but was smaller than before in 14 (60.9%) patients. The measurement of ADC values: the mean ADC value of the lesions in the group of PWMD was (942 ± 170)×10(-3)mm(2)/s, significantly lower than the area surrounding (1 554 ± 116)×10(-3)mm(2)/s and the same area of the control group (1 524 ± 116)×10(-3)mm(2)/s ( P < 0.05). The second MRI scanning: the mean ADC of the lesions in the PWMD group was up to (1 468 ± 195)×10(-3)mm(2)/s, which is significantly higher than before, but still lower than the areas surrounding the lesion (1 586 ± 97)×10(-3)mm(2)/s (P < 0.05).\n\n\nCONCLUSION\nContinuous measurement of ADC values in the lesions and surrounding areas is important to describe the micro-change of PWMD.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er ke za zhi = Chinese journal of pediatrics","id":"8be00ee9482a57377ef7cb5cf642425774e32c52","venue_1":"Zhonghua er ke za zhi = Chinese journal of pediatrics","year":"2011","title":"[Electroclinical features of myoclonic-atonic epilepsy].","authors":"Jie Deng, Yue-hua Zhang, Xiao-yan Liu, Zhi-xian Yang, Hui Xiong, Shuang Wang, Xin-hua Bao, Yu-wu Jiang, Jiong Qin, Qing Lin, Xi-ru Wu","author_ids":"5880060, 7550351, 1799750, 5806234, 1707713, 6002294, 8538098, 7912304, 4237204, 7358626, 7916631","abstract":"OBJECTIVE\nTo summarize the electroclinical characteristics of myoclonic atonic epilepsy (MAE) in children.\n\n\nMETHOD\nThe clinical data, video electroencephalogram (EEG) and simultaneous electromyography (EMG) of MAE patients were analyzed. The treatment and its effects were followed up.\n\n\nRESULT\nIn 47 MAE patients, 25 had a history of febrile seizures (FS), 20 had a family history of FS or epilepsy. All patients had a normal development before the illness. The age of afebrile seizure onset was between 1.4 years to 5.8 years. The first seizure was generalized tonic-clonic seizure (GTCS) in 41 patients (87.2%). All patients had multiple seizure types, including 47 GTCS (97.9%), 34 myoclonic atonic seizures (72.3%), 47 myoclonic seizures (100%), 32 atonic seizures (68.1%), 36 atypical absences (76.6%) and 3 tonic seizures (6.4%). EEG backgrounds were slow or parietal θ rhythm, interictal EEG showed 1-4 Hz (predominant 2-3 Hz) generalized spike and wave or poly spike and wave discharges in all cases. Seizures were controlled by antiepileptic drugs (AEDs) in 41 patients (87.2%). Valproate was used in 37. Lamotrigine was used in 26. Mild mental retardation was observed in 10 children after the onset of the illness.\n\n\nCONCLUSION\nThe clinical features of MAE included the following: the development was normal before the onset of the illness; the onset of seizure type was often GTCS. All patients had multiple generalized seizure types. Myoclonic atonic seizure was its characteristic seizure type. EEG showed generalized discharges. Early diagnosis and rational choice of AEDs are important for getting a better prognosis.","cites":"2","conferencePercentile":"100"},{"venue":"Zhonghua er ke za zhi = Chinese journal of pediatrics","id":"4f6c5dbaf4d3b12919057b03daba48fb818dcf57","venue_1":"Zhonghua er ke za zhi = Chinese journal of pediatrics","year":"2008","title":"[Clinical and electrophysiologic studies on epileptic negative myoclonus in atypical benign partial epilepsy of childhood].","authors":"Zhi-xian Yang, Xiao-yan Liu, Jiong Qin, Yue-hua Zhang, Xin-hua Bao, Xing-zhi Chang, Ye Wu, Hui Xiong","author_ids":"5806234, 1799750, 4237204, 7550351, 8538098, 6626015, 7860959, 1707713","abstract":"OBJECTIVE\nTo investigate the clinical, neurophysiologic characteristics and therapeutic considerations of epileptic negative myoclonus (ENM) in atypical benign partial epilepsy of childhood (ABPE).\n\n\nMETHODS\nVideo-EEG monitoring with outstretched arm tests were carried out in 17 patients, and 9 of them were examined with simultaneous electromyography (EMG). The ENM manifestations, electrophysiologic features and responses to antiepileptic drugs (AED) were analyzed.\n\n\nRESULTS\nSeventeen patients were diagnosed as having benign childhood epilepsy with centrotemporal spikes (BECT) during the early course of the disease and were treated with AED. During the course of the disease, hand trembling, objects dropping, head nodding and instability during standing might be clues for ENM occurrence. ENM had been confirmed in our patients by outstretched arm tests during video-EEG recording. The ictal EEG showed that high-amplitude spikes followed by a slow wave over the contralateral motor areas. This was further confirmed by time-locked silent EMG in 9 patients. During ENM occurrence or recurrence, the habitual seizures and interictal discharges were exaggerated. Atypical absence seizures also occurred in 6 patients. The alteration of therapeutic options of AED relating to ENM appearance in some patients included the add-on therapy with carbamazepine (CBZ), oxcarbazepine, phenobarbital, or withdrawal of valproate (VPA). ENM was controlled in most cases by using VPA, clonazepam (CZP) and corticosteroid with different combination.\n\n\nCONCLUSION\nENM could occur during the course of ABPE. Outstretching arm tests during video-EEG monitoring in combination with EMG was essential to confirm ENM. The ENM occurrence was always associated with the frequency increasing of habitual seizures and the aggravation of interictal discharges. Some AED such as CBZ might induce ENM. VPA, benzodiazepines and corticosteroid with different combination were relatively effective in treatment of ENM.","cites":"0","conferencePercentile":"37.5"},{"venue":"Zhonghua er ke za zhi = Chinese journal of pediatrics","id":"e25f2db444208a02d5a286927e71a31abff3ed99","venue_1":"Zhonghua er ke za zhi = Chinese journal of pediatrics","year":"2004","title":"[Time-course of mu-calpain activation, c-Fos, c-Jun, HSP70 and HSP27 expression in hypoxic-ischemic neonatal rat brain].","authors":"Ke-wen Jiang, Cui-wei Yang, Quan-xiang Shui, Zhe-zhi Xia, Ying Zhang","author_ids":"3659611, 8100189, 7852918, 7653471, 1752812","abstract":"OBJECTIVE\nThe cascade of physiological events underlying hypoxic-ischemic brain damage (HIBD) remains to be fully established. The perinatal brain shows both an increased tolerance to hypoxic-ischemic (HI) injury and a faster and more complete recovery than the adult. It is, therefore, important to understand the sequence of events following hypoxia and ischemia in young animals. The present study aimed to clarify the time-course of the activation of the mu-calpain, and the expression of c-Fos, c-Jun, HSP70 and HSP27 proteins following severe HI (2 h hypoxia) and their relationship with each other.\n\n\nMETHODS\nA modified newborn rat model of HIBD that included a combination of hypoxia and ischemia as described by Rice was used. Forty-two postnatal 7-day-old Sprague-Dawley rats were randomly divided into seven groups (6 rats in each): 6 time-window groups and a normal control group. Samples were collected at 0, 1, 2, 4, 12 and 24 h after HI insults. The protein concentration was determined using a modified Bradford assay. mu-calpain activation, c-Fos, c-Jun, HSP70 and HSP27 expressions were observed respectively by Western blot from cortical and hippocampal samples.\n\n\nRESULTS\nThe cleavage of cytosolic mu-calpain was observed from both cortical and hippocampal samples in neonatal rats after HI. The ratio 76:80 of mu-calpain was increased significantly post-HI and reached a maximum at 24 h in cortex and at 12 h in hippocampus after HI. The expressions of c-Fos and c-Jun from both cortical and hippocampal samples in neonatal rats were up-regulated and peaked at 2 or 4 h after HI, demonstrating significant differences at 1, 2, 4, and 12 h compared with that observed in the control (P < 0.05). When compared with that observed in cortex, the nuclear c-Fos expression from hippocampal samples was highly elevated at 2, 4 and 12 h but significantly decreased at 24 h after HI (P < 0.05), while the nuclear c-Jun expression from hippocampal samples was highly elevated at 0 and 1 h but significantly decreased at 4 and 24 h after HI (P < 0.05). Similarly, the expressions of HSP70 and HSP27 from both cortical and hippocampal samples were up-regulated and reached a maximum at 12 or 24 h after HI, demonstrating significant differences at 12 or 24 h both in cortex and hippocampus for HSP70, and at 24 h in cerebral cortex as well as at 12 and 24 h in hippocampus for HSP27 compared with the control (P < 0.05). Furthermore, in comparison with that observed in cortex, the HSP70 expression from hippocampal samples was highly elevated at 1 h, but significantly decreased at 4, 12 and 24 h after HI (P < 0.05), while the HSP27 expression was permanently elevated in hippocampus after HI.\n\n\nCONCLUSION\nThe neuronal injury induced by HI insults appears to involve many ongoing and simultaneous mechanisms. HI activates the calpains immediately, which may contribute to neuron apoptosis, and induces a significant brain neuroprotection, since there is an increased HSP70 expression and a relatively late remarkable HSP27 expression in hypoxic-ischemic neonatal rat brain. Nuclear c-Fos and c-Jun may participate in the pathogenesis of HIBD.","cites":"2","conferencePercentile":"100"},{"venue":"Zhonghua er ke za zhi = Chinese journal of pediatrics","id":"59b1777220e2bd9bebe5deda898c645b813b7f9d","venue_1":"Zhonghua er ke za zhi = Chinese journal of pediatrics","year":"2014","title":"[Retrospective mixed-longitudinal study on the growth trajectory of height among children and adolescents].","authors":"Xinnan Zong, Hui Li, Yaqin Zhang, Hui Zhang","author_ids":"6302829, 1750828, 7550615, 3438656","abstract":"OBJECTIVE\nLongitudinal studies in height for school-age children and adolescents mainly focused on the velocity, spurt and peak of growth, and currently no changing growth trajectory or channel around the baseline were reported except the shift of percentiles among infants. This study aimed to analyze general characteristic of the growth trajectory of height among children and adolescents so as to provide scientific evidence for early detecting height deviation and evaluating treatment interventions for pediatric clinical and health care professionals.\n\n\nMETHOD\nHeight measurement data of 4 632 school-aged children and adolescents were retrospectively collected from two middle schools in urban Beijing between 2006 and 2012, with physical examination records varying from 1 to 8 times. Corresponding Z-score curve of the first height data of each study subject was defined as the baseline growth trajectory. Interval censored data were determined by calculating and comparing the amount of up or down floating deviation of those follow-up measurements around the baseline trajectory at different time points, and the LIFEREG procedure was used to fit parametric regression model. Defined 0.67 s as isometric growth channel, proportions of follow-up measurements along the baseline or off-baseline channel were calculated at different baseline Z-score interval channel.\n\n\nRESULT\nTotally 3 308 subjects with height examination records of 3 times or more were included in this study. Interval censored data of height abide by the exponential distribution based on parametric regression model. The exponential distribution model with two covariates of sex and baseline Z-score interval channel showed that sex was not statistically significant (P = 0.186 6). After removing factor of sex, the model only with baseline Z-score channel displayed that those Z-score channels over +2.00 s (P = 0.946 7) and -2.00-1.34 s (P = 0.091 1) were not statistically significant with the control of the channel below -2.00 s. Refined exponential distribution model (P < 0.000 1) was constructed after the Z-score channel reduced to six consecutive isometric growth channels. There were district differences in height deviations around the baseline trajectory in different baseline Z-score interval channels, floating downward in upper channel and floating upward in lower channel. Overall, the range of deviation of 4.06 cm was observed around the baseline trajectory in 90% of individuals (from P5 to P95), with the floating down 2.60 cm and the floating up 1.46 cm. The proportions of the individuals growing along the original channel were 43.8%-47.4% in the upper Z interval (0-2.00 s) and 33.0%-37.9% in the lower Z interval (-2.00-0 s); the proportions not shifting ± 1 channel were 94.0%-94.8% in the upper part and 79.1%-91.0% in the lower part.\n\n\nCONCLUSION\nThis study obtained general characteristics of growth trajectory of height among children and adolescents: the deflection range of shifting up and down is about 4 cm around the baseline trajectory for 90% individuals, with the downward float 2.00-3.00 cm and the upward 1.00-2.00 cm; and 30%-50% individuals go along the baseline channel and 80%-90% individuals do not exceed ± 1 channels.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er ke za zhi = Chinese journal of pediatrics","id":"9b54b7a6facea8106019f813603d91b88bfde1ac","venue_1":"Zhonghua er ke za zhi = Chinese journal of pediatrics","year":"2007","title":"[Clinical characteristics and treatment of Rasmussen syndrome in 16 children].","authors":"Yue-hua Zhang, Li-hua Pu, Xiao-yan Liu, Hui Xiong, Yun-lin Li, Xing-zhou Liu, Guo-ming Luan, Jiong Qin, Xi-ru Wu","author_ids":"7550351, 8479054, 1799750, 1707713, 3293759, 7025215, 4839846, 4237204, 7916631","abstract":"OBJECTIVE\nRasmussen syndrome (RS) is a chronic inflammatory disease of unknown origin, usually affecting one brain hemisphere. The present study aimed to analyze the electroclinical characteristics and treatment of RS.\n\n\nMETHODS\nThe medical records of 16 children with RS were retrospectively reviewed.\n\n\nRESULTS\nOf the 16 children, 8 were males and 8 were females. The age of onset was from 1 year and 11 months to 11 years and 6 months. The first symptom was seizure in all patients. The main seizure type was partial motor seizures. In all the patients, seizures gradually became frequent and in the form of epilepsia partialis continua (EPC). Thirteen cases developed hemiparesis. Fixed hemiparesis occurred from 2 months to 3 years after the onset of seizures. The cognitive deterioration was present in 14. The EEG background activity was abnormal in all the cases, asymmetric slow wave disturbances were bilateral but with unilateral predominance in 11, unilateral delta or theta wave in 8. The presence of interictal epileptiform discharges were found in all cases, unilateral in 11 and bilateral in 5. Seizures were recorded in all patients, no electroclinical correlation was found in 5. Serial magnetic resonance imaging (MRI) showed progressive unihemispheric or focal cortical atrophy in all cases. Six cases transiently showed focal cortical swelling or T2/FLAIR hyperintense signal on early scans. Antiepileptic drugs were not effective in any of the patients. Three of 10 patients receiving immunoglobulin, and 4 of 8 receiving corticosteroids, had some reduction of seizure frequency for a short period. Six patients accepted functional hemispherectomy, in 4 of them seizure no longer occurred and cognitive function was improved. The results of multiple subpial transection in 2 cases and focal resection in one patient were disappointing.\n\n\nCONCLUSION\nThe clinical features of RS were refractory partial epilepsy, progressive hemiplegia and cognitive deterioration. The EEG background was asymmetric with slow wave activity, interictal epileptiform discharges were unilateral or bilateral, no electroclinical correlation occurred. Serial MRI showed progressive unihemispheric focal cortical atrophy. Antiepileptic drugs were not effective for RS. In some patients, immunoglobulin or corticosteroids could reduce seizure frequency in the short term. Functional hemispherectomy could lead to seizure control and prevent further development of neurological impairment and cognitive deterioration.","cites":"0","conferencePercentile":"50"}]}