{"Zhongguo_yi_xue_ke_xue_yuan_xue":[{"venue":"Zhongguo yi xue ke xue yuan xue bao. Acta Academiae Medicinae Sinicae","id":"3b0bdcd590406455cad228375ec6b3f45642d594","venue_1":"Zhongguo yi xue ke xue yuan xue bao. Acta Academiae Medicinae Sinicae","year":"2005","title":"[Advances in the studies on the molecular and genetic aspects of epilepsy].","authors":"Xu Wang, Tao Wang, Ming-xiong Yuan, Mu-gen Liu, Qing Wang","author_ids":"1712593, 1685072, 3557737, 6499702, 7135234","abstract":"Epilepsy is one of the most common and debilitating neurological diseases that affects more than 40 million people worldwide. Genetic factors contribute to the pathogenesis of epilepsy. Molecular genetic studies have identified 15 disease-causing genes for epilepsy. The majority of the genes encode ion channels, including voltage-gated potassium channels KCNQ2 and KCNQ3, sodium channels SCN1A, SCN2A, and SCN1B, chloride channels CLCN2, and ligand-gated ion channels CHRNA4, CHRNB2, GABRG2, and GABRA1. Interestingly, non-ion channel genes have also been identified as epilepsy genes, and these genes include G-protein-coupled receptor MASS1/VLGR1, GM3 synthase, and proteins with unknown functions such as LGI1, NHLRC1, and EFHC1. These studies make genetic testing possible in some patients, and further characterization of the identified epilepsy genes may lead to the development of new drugs and new treatments for patients with epilepsy.","cites":"0","conferencePercentile":"50"},{"venue":"Zhongguo yi xue ke xue yuan xue bao. Acta Academiae Medicinae Sinicae","id":"e628deadc92d5e0afaed7c3020826589ba4c5815","venue_1":"Zhongguo yi xue ke xue yuan xue bao. Acta Academiae Medicinae Sinicae","year":"2000","title":"[Areas of brain involved in immunoregulation].","authors":"Y Gao, Y Huang, J Lin, D Wang, R Lin","author_ids":"2224931, 1735506, 1862974, 1715538, 4556031","abstract":"OBJECTIVE\nTo study the location of brain areas involved in immunoregulation.\n\n\nMETHODS\nImmunohistochemistry and immunofluorescence were used to detect the different distribution of cytokines immunopositive cells in the brain of rats immunized via both intraperitoneal and subcutaneous injections.\n\n\nRESULTS\nThe cytokines immunopositive cells were distributed in the supraoptic (SO) and paraventricular (PV) nuclei of the hypothalamus, the anterior hypothalamic (AH) nucleus, arcuate and median eminence, the lateral hypothalamic nucleus (LH) and the amygdaloid nuclear complex while only the appearance of the cytokines immunopositive cells in LH and amygdaloid nuclear complex in hypothalamus was related with immunization status of the animals. Double-labelling results showed that the cytokines immunopositive cells were neurons.\n\n\nCONCLUSIONS\nWe have observed that neurons of the LH and amygdaloid nuclear complex in hypothalamus as a main source of the neuroimmunoregulation played a key role in neuroimmunoregulation and they participated in the neuroimmunoregulation at an early stage of the immune response.","cites":"0","conferencePercentile":"60"}]}