{"Zhonghua_nei_ke_za_zhi.csv":[{"venue":"Zhonghua nei ke za zhi","id":"a0f6796e780b560717398b6ce91ea8a6c474eb26","venue_1":"Zhonghua nei ke za zhi","year":"2010","title":"[Multi-modality magnetic resonance imaging features of cognitive function in mild cognitive impairment].","authors":"Hua-li Wang, Hui-shu Yuan, Lydia Min-ying Su, Yue Zhu, Jing Liao, Mei-yan Zhang, Tao Li, Xin Yu","author_ids":"3022953, 7740668, 2902014, 6525366, 7306194, 2866845, 1726351, 4092561","abstract":"OBJECTIVE\nTo investigate the association of multi-modality neuroimaging features and cognitive function in mild cognitive impairment (MCI) and Alzheimer's disease (AD).\n\n\nMETHODS\nNine individuals with amnestic MCI (aMCI), fifteen patients with mild probable AD, and eleven age-controlled cognitively normal controls (NC) were recruited. All participants were administered with mini-mental status examination (MMSE) and Cognitive assessment screening instrument (CASI) to assess general cognitive function. Optimized voxel-based morphometry (VBM) was used for the analysis with 3-D high resolution anatomical images. Values of fractional anisotropy (FA) and mean apparent diffusivity coefficient (ADC) were measured from different brain regions on diffusion-tensor images (DTI). The relationship between structural atrophy and DTI-based measurements in the selected brain regions was examined.\n\n\nRESULTS\nThe scores of MMSE and CASI were correlated with the volumetric changes in such areas as temporal, frontal and parietal lobes, and cingulate gyrus and hippocampal gyrus (P<0.001). The scores of MMSE and CASI were positively correlated with FA values, and negatively with ADC values in the white-matter-affected regions including temporal, frontal, parietal lobes, cingulate gyrus, and parahippocampal gyrus (P<0.05).\n\n\nCONCLUSIONS\nCognitive decline was associated with atrophy and white matter microstructural alterations in temporal, frontal, parietal lobes, cingulate gyrus, and parahippocampal gyrus in MCI and AD. Multi-modality imaging technique may be important in elucidating the brain mechanism of cognitive impairment.","cites":"0","conferencePercentile":"62.5"},{"venue":"Zhonghua nei ke za zhi","id":"095b8c7d189c45c95a4779bc2fd35b7c3801a022","venue_1":"Zhonghua nei ke za zhi","year":"2008","title":"[The role of norepinephrine in down-regulation of visceral sensitivity in rats deprived of rapid eye movement sleep].","authors":"Tong Ling, Ke Zuo, Ying Yang, Xiao-jun Yang, Wei Qian, Xiao-hua Hou","author_ids":"2189021, 4863751, 1699160, 8314104, 1955203, 8588676","abstract":"OBJECTIVE\nTo investigate the role of norepinephrine in the down-regulated visceral sensitivity of rats deprived of rapid eye movement (REM) sleep.\n\n\nMETHODS\nTwenty-four male Sprague-Dawley rats were randomly divided into 3 groups: cage-yoked rats as control (YC), rats with REM sleep deprivation (SD) and rats with yohimbine administered intraperitoneally after REM sleep deprivation (YSD). Flower pot technique was employed to make sleep deprivation model. YSD group was given yohimbine intraperitoneally at the 48th hour after REM sleep deprivation. After both SD and YSD groups had completed these processes, rats of all the three groups were given colorectal distension (CRD) and electromyogram (EMG) was recorded at the same time. The number of discharges of EMG and the threshold of pain perception of the rats were observed to evaluate the visceral sensitivity. The thalamus, rectum and distal colon were taken after CRD; MAO-mRNA and TH-mRNA in three tissues were detected with RT-PCR.\n\n\nRESULTS\nOn 48th hour, the number of discharges of EMG in 10 seconds responding to CRD in group SD was significantly less than that in group YC and the threshold of pain perception in group SD was higher than that in group YC (P < 0.05). The number of discharge of EMG in group YSD was significantly more than that in group SD (P < 0.05). The expression of MAO-mRNA in group SD was lower than that in group YC (P < 0.05) and the expression of TH-mRNA in group SD was higher than that in group YC (P < 0.05).\n\n\nCONCLUSIONS\nThe visceral sensitivity in rats is down-regulated by REM sleep deprivation, which can increase synthesis of norepinephrine. Norepinephrine can modulate visceral sensitivity.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua nei ke za zhi","id":"78b085c29379b3804b8d627fa40e137634b06507","venue_1":"Zhonghua nei ke za zhi","year":"2012","title":"[The reliability and validity of Chinese version of AD8].","authors":"Tao Li, Hua-li Wang, Yuan-han Yang, James E Galvin, John C Morris, Xin Yu","author_ids":"1726351, 3022953, 7608139, 6668004, 1801769, 4092561","abstract":"OBJECTIVE\nTo examine the validity and reliability of the application of Chinese version of AD8 among patients with Alzheimer's disease (AD), and to explore the discriminative properties of AD8 including score boundaries, sensitivity and specificity in differentiating AD and normal controls.\n\n\nMETHODS\nA total of 240 subjects were recruited, including 75 cognitively intact subjects as normal control and 165 patients with AD. Normal control and patients with AD were assessed with Clinical Dementia Rating (CDR), Mini-Mental State Examination (MMSE), and Clock Drawing Test (CDT). All informed normal controls and informants of patients with AD were asked about Chinese version of AD8, among which, 158 informants of patients with AD received AD8 examination again.\n\n\nRESULTS\n(1) The Cronbach alpha for Chinese version of AD8 was 0.78. The intraclass correlation coefficient (ICC) of retest reliability was 0.96 (P < 0.01). (2) The correlation coefficients between each item of AD8 ranged from 0.36 to 0.69 (P < 0.01). Chinese version of AD8 total scores were strongly positively correlated with CDR global score (r = 0.82, P < 0.01), and CDR-SB(r = 0.80, P < 0.01), and negatively correlated with the total score of MMSE (r = -0.75, P < 0.01) and CDT (r = -0.53, P < 0.01). (3) For discrimination between normal controls and patients with AD, the AUC was 0.93. Using a cutoff of 2 or greater on Chinese version of AD8 to discriminate dementia, the sensitivity was 93.9%, and specificity was 76.0%.\n\n\nCONCLUSION\nChinese version of AD8 is a brief and sensitive screening measure with good validity and reliability.","cites":"0","conferencePercentile":"66.66666667"}]}