{"Zhong_nan_da_xue_xue_bao._Yi_xu":[{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"b7ee56ba2aa5698c4fafe5390b9e1ac7264bda9c","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2010","title":"[Anatomic characteristics and clinic significance of the medial calcaneal nerve].","authors":"Juyu Tang, Kanghua Li, Jiawu Ren, Jun Liu, Yangbo Liu, Lin Luo","author_ids":"8053158, 8497904, 5925517, 1843598, 5253222, 1786055","abstract":"OBJECTIVE\nTo provide anatomic evidence for choosing medial calcaneal nerve(MCN ) as recipient cutaneous nerve to rebuild heel sensation.\n\n\nMETHODS\nWe chose 20 adult cadavers' lower limbs, dissected the MCNs, observed their original sites, shapes, courses and distribution, and measured the perpendicular distance from original sites of MCNs from tibial nerve, original sites of their branches to the tip of medial malleolus, and the external diameters of their main trunks and branches.\n\n\nRESULTS\nThe frequency of the MCN was 95% in this array. All the MCNs arose from the tibial nerve at 3.3 cm up the horizontal plane of the tip of medial malleolus. They sent out anterior branches and posterior branches from 0.3 cm below the horizontal plane of the tip of medial malleolus on average. The anterior branch dominated the cutaneous sensation of the anterior part of the medial calcaneal and heel weight loading field, while the posterior branch dominated the sensation of the posterior and median part. The shape of MCNs, main trunks, anterior branches and posterior branches was like circular cylinder. At the origination, the external diameter of the MCN, the anterior branch and the posterior branch was 1.58, 1.13 and 0.90 mm on average, respectively.\n\n\nCONCLUSION\nThe anatomical position of MCN is relatively constant, and its external diameter is suitable. The initiation is not close to the heel weight loading area. Its anatomic characteristics meet the requirements of sensation recovery of the heel, especially the heel weight loading field.","cites":"0","conferencePercentile":"34.375"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"08d576ca34b2e83e0dcb31213de7f274f4cb7521","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2013","title":"[Survival of calbindin, calretinin and parvalbumin positive neurons in mouse hippocampal CA area at chronic stage of pilocarpine-induced epilepsy].","authors":"Jianxin Liu, Yong Liu, Fengru Tang","author_ids":"2161137, 7135550, 4364993","abstract":"OBJECTIVE\nTo analyze the survival and the changes of proportions of Calbindin, Calretinin and Parvalbumin positive neurons in mouse hippocampal CA area at chronic stage of Pilocarpine-induced epilepsy.\n\n\nMETHODS\nCalbindin, Calretinin and Parvalbumin immunofluoresence staining were done 2 months after Pilocarpine-induced epilepsy in mice or saline injection.\n\n\nRESULTS\nTwo months after Pilocarine-induced epilepsy, the number of Calbindin, Calretinin and Parvalbumin positive neurons in the CA area decreased significantly compared with the control (P<0.01), especially the Calbindin positive neurons had a great drop and Pavalbumin positive neurons had a least drop. At the chronic stage of epilepsy, the proportion of Calbindin, Calretinin and Parvalbumin positive neurons in the CA area was changed. The content of Pavalbumin positive neurons increased whereas the content of Calbindin positive neurons decreased significantly compared with the control (P<0.01).\n\n\nCONCLUSION\nThe changes of proportions of Calbindin, Calretinin and Parvalbumin positive neurons in the CA area of mouse hippocampus may be a factor in the ongoing epileptic activity at chronic stage of Pilocarpine-induced epilepsy.","cites":"0","conferencePercentile":"50"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"23152ffff09d8dea2942a6452779e7cdac9a5925","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2014","title":"[Effect of pre-amputation pain block on the spinal and anterior cingulated cortex NMDA receptor activation in amputated rats].","authors":"Qi Li, Yangyang Lian, Hong Xiao, Aimin Feng, Hui Liu","author_ids":"1682467, 8599380, 6446401, 5505997, 1749569","abstract":"OBJECTIVE\nTo investigate the effect of pre-amputation pain block on the N-methyl-D-aspartate receptor activation in the central nervous system of amputated rats, and the association between pre-amputation pain block and chronic amputation-related pain.\n\n\nMETHODS\nThirty-six adult male SD rats were randomly assigned to an NA group (n=12), a PA group (n=12) and a PAB group (n=12). Group NA was intraplantarly injected saline l00 μL while group PA and group PAB were intraplantarly injected complete Freund adjuvant (CFA) 100 μL. The sciatic nerve of group NA and group PA were freed from surrounding tissue, and that of group PAB was blocked by bupivacaine under pentobarbital sodium anesthesia 5 days after the injection. Thermal withdrawal latency (TWL) was measured before and after the injection. All rats were amputated at the scheduled survival time. The expression of N-methyl-D-aspartate receptor (NR2B) was measured by immunohistochemistry in L4-6 of the spinal cord and the anterior cingulated cortex 7 days after the amputation procedure.\n\n\nRESULTS\nThe TWL after intraplantar administration of CFA in group PA and group PAB decreased significantly compared with the baseline value (P<0.05), while the saline treated control group remained unchanged. Besides the basic value, the TWL of group PA was shorter than that of group NA at the above-mentioned time-points (P<0.05). Compared with the basic value and group NA, the TWL of group PAB after the block increased significantly (P<0.05). Compared with group NA and group PAB, group PA had a remarkably high expression of NR2B (P<0.05), while there was no difference between group PA and group PAB.\n\n\nCONCLUSION\nPre-amputation pain may activate N-methyl-D-aspartate receptor of the central nervous system, which may lead acute postoperative pain to chronic pain. It is necessary to treat pre-amputation pain.","cites":"0","conferencePercentile":"55"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"eb7f01e766f2458034273827deb372cc45948ad4","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2006","title":"[Functional magnetic resonance image study on the brain areas involved in reading Chinese, English, and Nepali in Nepalese].","authors":"Jun Mu, Peng Xie, Ze-song Yang, Fa-jin Lu, Yong Li, Tian-you Luo","author_ids":"1685459, 3332678, 8387290, 5482062, 1689181, 8576965","abstract":"OBJECTIVE\nTo explore the different brain areas activated by Chinese, English, and Nepali word tasks in Nepalese by using the functional magnetic resonance image (fMRI).\n\n\nMETHODS\nTo determine the neuroanatomic functional brain areas responsible for Chinese, English and Nepali reading as well as sentence-formation, blood oxygenation level dependent (BOLD) block design by fMRI was performed in 6 healthy Nepalese volunteers.\n\n\nRESULTS\nDuring Chinese reading, the activated areas included bilateral motor area, subfrontal gyri, superior temporal gyri, and superior parietal lobule; during English reading, the activated areas were left motor area, left subfrontal gyrus, left supra temporal gyrus, left insula and bilateral cerebellum; and the Nepali task demonstrated the activation of left anterior central gyrus, superior frontal gyrus, superior temporal gyrus. Aside from the bilateral occipital lobes, both English and Nepali activated areas were the left cerebral hemisphere dominant.\n\n\nCONCLUSION\nThe more familiar with the language, the fewer areas are activated. Superior temporal gyrus might be involved in sentence-formation.","cites":"0","conferencePercentile":"50"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"da7bf768207d414508ab14e50bf32b22d3f35c93","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2008","title":"[Internalization of beta amyloid protein in primary cultured cortical neurons in mouse].","authors":"Yi-hua Qian, Li-li Shi, Jie Yang, Xiao-dan Hu, Hua Han, Yong Liu","author_ids":"6099132, 8119489, 1690374, 3887713, 1724667, 7135550","abstract":"OBJECTIVE\nTo observe the internalization of beta-amyloid protein (Abeta) in primary cultured neurons and effect of astrocyte on it.\n\n\nMETHODS\nThe purified cortical neurons of mouse were cultured for 14 d, and were divided into a control group and an Abeta group. Each group was further divided into 3 subgroups. The neurons and 3 different concentration fluorescein or Abeta1-42-fluo were co-incubated for 24 h. The internalization of Abeta and the location of Abeta in subcellular structure were examined by the laser scanning confocal microscope combined with the image analysis method directly or after immunofluorescence staining. Neurons and astrocytes were co-cultured for 14 d. The cultured neurons and astrocytes were divided into a control group and a Abeta group. The cultures were treated with 200 nmol/L fluorescein or 200 nmol/L Abeta1-42-fluo for 24 h respectively. The effect of astrocyte on the internalization was analyzed by the above method.\n\n\nRESULTS\nThere were no fluorescent granules within neurons in every fluorescein group. The purified cortical neurons could internalize 100 nmol/L, or 200 nmol/L Abeta1-42-fluo in 24 h. The fluorescent granules of Abeta1-42 distributed within perikaryon and processes. The internalization was related to the concentration of Abeta. The part of Abeta was located in the lysosome of neurons indicated by immunofluorescence staining. Compared with the purified neurons, the neurons co-cultured with the astrocytes internalized Abeta increased in the internalization of Abeta. There was significant difference between the purified neurons and the co-cultured neurons with astrocytes (P<0.05).\n\n\nCONCLUSION\nNeurons could internalize the proper concentration of Abeta. Astrocyte might facilitate the internalization of Abeta in neurons.","cites":"0","conferencePercentile":"31.57894737"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"67a6180541ac028899580b4710af3da3e6160050","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2011","title":"Neuron activation, degeneration and death in the  hippocampus of mice after pilocarpine induced  status epilepticus.","authors":"Jianxin Liu, Fengru Tang, Yong Liu","author_ids":"2161137, 4364993, 7135550","abstract":"OBJECTIVE\nTo examine the occurrence of neuron activation, neurodegeneraion and cell death, and the correlation among them in the hippocampus after status epilepticus.\n\n\nMETHODS\nCFV, Fluoro Jade B and c-Fos staining were done at multiple time points after pilocarpine induced status epilepticus.\n\n\nRESULTS\nIn the stratum granulosum of dentate gyrus, c-Fos positive neurons increased significantly at 1 h, 2 h and 1 d after status epilepticus (P<0.01 or 0.05). However, almost no Fluoro Jade B staining cell was found in the stratum granulosum in the experiment and control groups, and no obvious difference was shown on the numbers of CFV staining cells in this area among all groups. In the hilus of dentate gyrus of different groups, there were no c-Fos positive neurons in all groups. In the hilus, the number of Fluoro Jade B staining cells significantly increased at 2 h and 1 d after the status epilepticus (P<0.01), and the number of CFV staining neurons dramatically decreased 1 d after the status epilepticus (P<0.01) compared with the control. In the stratum pyramidale of CA1, the numbers of c-Fos positive neurons at 30 mim, 1 h, 2 h and 1 d, and Fluoro Jade B staining cells at 2 h and 1 d after the status epilepticus significantly increased(P<0.01 or 0.05), while no obvious difference in the number of CFV staining cells in the stratum pyramidale of CA1 among different groups was shown.\n\n\nCONCLUSION\nThere is no direct correlation among cell activation, neuron degeneration and cell death in the hippocampus of mice after pilocarpine induced status epilepticus.","cites":"1","conferencePercentile":"72.22222222"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"0c47f134d188c971c7482352b513df528f5ff4e7","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2008","title":"[Functional MRI study on thalamus activation induced by electrical stimulation of different intensities].","authors":"Yuan Wang, Ming Zhang, Hai Liu, Shi-zheng Zhang, Bo-lang Yu","author_ids":"1724874, 3032572, 1691690, 2076341, 4092798","abstract":"OBJECTIVE\nTo detect the activation pattern of the thalamus in human by the functional magnetic resonance imaging (fMRI) with the electrical stimulation of different intensities, and to explore the mechanism of this area in pain modulation.\n\n\nMETHODS\nTen healthy right-handed volunteers were given different electrical stimulations of 1-, 2-, and 3- times pain threshold respectively. The whole-brain was scanned simultaneously by GE 1.5T magnetic resonance imaging system. The data were postprocessed by analysis of functional neuroimages (AFNI) to establish the regional activity maps of the thalamus.\n\n\nRESULTS\nPatterns of functional activity showed a positive linear relationship between the activation signals and stimulation intensity in bilateral thalamus, whereas the BOLD signal of bilateral medial thalamus demonstrated that the curve was similar to the exponential function. Meanwhile, the activation in the contralateral lateral thalamus (cThl), but not the contralateral medial thalamus (cThm), was prominent compared with the corresponding ipsilateral subregions, and only the lateral thalamus displayed a contralateral biased representation while the medial thalamus lacked this property.\n\n\nCONCLUSION\nThalamus is one of the vital components in the pain modulation network, which can present spatial segregation activations with unique characteristics of stimulation intensity-response in each subregion. All the results are helpful to understand the crucial role of thalamus in processing the pain information.","cites":"0","conferencePercentile":"31.57894737"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"d39c562e8c1d8b9825160517fe20bd0817ded8ff","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2011","title":"Concentration change of DA, DOPAC, Glu and GABA in brain tissues in schizophrenia developmental model rats induced by MK-801.","authors":"Yong Liu, Yamei Tang, Weidan Pu, Xianghui Zhang, Jingping Zhao","author_ids":"7135550, 6164880, 3515998, 6807288, 6920851","abstract":"OBJECTIVE\nTo explore the related neurobiochemical mechanism by comparing the concentration change of dopamine (DA), dihydroxy-phenyl acetic acid (DOPAC), glutamate (Glu), and γ-aminobutyric acid (GABA) in the brain tissues in schizophrenia (SZ) developmental model rats and chronic medication model rats.\n\n\nMETHODS\nA total of 60 neonatal male Spragur-Dawley (SD) rats were randomly assigned to 3 groups at the postnatal day 6: an SZ developmental rat model group (subcutaneous injection with MK-801 at the postnatal day 7-10, 0.1 mg/kg, Bid), a chronic medication model group (intraperitoneal injection at the postnatal day 47-60, 0.2 mg/kg,Qd), and a normal control group (injection with 0.9% normal saline during the corresponding periods). DA, DOPAC, Glu, and GABA of the tissue homogenate from the medial prefrontal cortex (mPFC) and hippocampus were examined with Coularray electrochemic detection by high performance liquid chromatogram technique. The utilization rate of DA and Glu was calculated.\n\n\nRESULTS\nCompared with the normal control group, the concentration of DA and DOPAC in the mPFC and the hippocampus in the SZ developmental model group significantly decreased (P<0.05), and the GABA concentration and Glu utilization rate in the mPFC also decreased (P<0.05). Compared with the chronic medication model group, the DA concentration of the mPFC in the SZ developmental group decreased (P<0.05), and the DOPAC concentration and the utility rate of DA in the hippocampus also decreased (P<0.01, P<0.05, respectively).\n\n\nCONCLUSION\nThe activities of DA, Glu and GABA system decrease in the mPFC and the DA system function reduces in the hippocampus of SZ developmental rats.","cites":"1","conferencePercentile":"72.22222222"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"b195b52253c0801a2fc87bbcbcf99b7f39cbedb7","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2010","title":"5-HT modulation of pain in SI and SII revealed by fMRI.","authors":"Weiwei Wang, Ming Zhang, Yuan Wang, Chenwang Jin, Bin Yan, Shaohui Ma","author_ids":"2492328, 3032572, 1724874, 6460649, 7702780, 4251942","abstract":"OBJECTIVE\nTo observe the different cerebral activations between pre-administration and post-administration of tryptophan-depleted amino acid mixture (TRP-)/balanced amino acid mixture (BAL) in healthy volunteers through functional magnetic resonance imaging (fMRI) when they received electrical stimulation at the same time. Furthermore, the effects of 5-hydroxytryptamine (5-HT) were explored in pain modulation network.\n\n\nMETHODS\nTwo-phase crossover design was adopted. Six right-handed healthy volunteers participated in the experiment. TRP- and BAL were administered to each participant according to the Young's method. Volunteers were scanned under fMRI with or without administration of TRP- or BAL when receiving electrical stimulation simultaneously. Analysis of functional neuroimages (AFNI) software was used to show the different activations in the human brain between pre- and post-administration of TRP-/BAL. Then all the results were analyzed by SPSS 14.0.\n\n\nRESULTS\n(1) Bilateral primary somatosensory cortex (SI) and secondary somatosensory cortex (SII) were activated during pre-administration and post-administration of TRP-, but the activated volumes of bilateral SI and SII during post-administration of TRP- were found significantly larger than that during pre-administration of TRP (P<0.05). (2) All the activated regions showed no difference between pre- and post-administration of BAL. (3) There were significant differences of pain threshold between pre- and post-administration of TRP- (P<0.01), which meant that pain threshold reduced remarkably after TRP- administration, while it showed no difference between pre- and post-administration of BAL (P>0.05).\n\n\nCONCLUSION\n5-HT plays an important role in pain modulation in the central nervous system, TRP- causes acute tryptophan depletion (ATD) through reducing the level of 5-HT in the human brain, which can induce the decrease of volunteers' pain threshold. The activated volumes of bilateral SI and SII display significant difference between pre- and post-administration of TRP-, suggesting these brain areas may not only involve in the 5-HT related activities but in pain modulation network as well.","cites":"0","conferencePercentile":"34.375"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"3f5e78b6b81e34c6496b46d803ae393ebd6bcd99","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2010","title":"[Effect of tanshinone IIA on the change of calcium current induced by beta-amyloid protein 25-35 in neurons of nucleus basalis of Meynert].","authors":"Shujuan Zhu, Yihua Qian, Lili Shi, Weina Yang, Xinzheng Feng, Cuiqin Li, Yong Liu","author_ids":"6839752, 6099132, 8119580, 4665034, 7285492, 6696836, 7135550","abstract":"OBJECTIVE\nTo explore the effect of tanshinone IIA (TanIIA) on calcium current induced by beta-amyloid protein 25-35 (Abeta25-35) in neurons of nucleus basalis of Meynert (nbM).\n\n\nMETHODS\nCell acute dissociated technique and the whole-cell recording model of patch-clamp technique of single-cell were used. The voltage-dependent calcium current in neurons of nbM was recorded in SD rats first. Then the effect of TanIIA on the voltage-dependent calcium current in the neurons was assayed. The change of calcium current induced by Abeta25-35 as well as the effect of TanIIA on the change of calcium current induced by Abeta25-35 in neurons of nbM were analyzed.\n\n\nRESULTS\nExtracellular fluid containing different concentrations of TanIIA was irrigated, respectively. The peak current did not change obviously. There was no difference in current density between the TanIIA group and the control group at 0 mV (P>0.05). Extracellular fluid containing 200 nmol/L Abeta25-35 was irrigated after the normal calcium current recorded under whole patch clamp, and the peak current changed obviously. There was distinct difference in the current density between the Abeta group and the control group at 0 mV (P<0.05). Extracellular fluid containing Abeta25-35 and different concentrations of TanIIA were irrigated after the normal calcium current was recorded under whole patch clamp, respectively, and the peak current did not change. There was no difference in current density between the TanIIA +Abeta group and the control group at 0 mV (P>0.05).\n\n\nCONCLUSION\nIn vitro, TanIIA could inhibit the calcium current amplification induced by Abeta25-35 in neurons of nbM. TanIIA may protect neurons against the toxicity of Abeta and decrease the inward flow of Ca(2+).","cites":"1","conferencePercentile":"75"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"59d6529bc7143f23dd219af55b5e6163628efb16","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2013","title":"[Pattern visual evoked potentials in normal-vision eyes of post-therapy amblyopia].","authors":"Manyi Xiao, Xin Wei, Yunping Li, Wei Xiong, Shuxian Xu","author_ids":"6934344, 1859365, 7770606, 6737623, 5920350","abstract":"OBJECTIVE\nTo evaluate the clinical significance of pattern visual evoked potential (P-VEP) parameters on amblyopic patients with normal-vision after pleoptic therapy.\n\n\nMETHODS\nWe investigated 60 amblyopic children (8-12 years old) who gained normal-vision after pleoptic therapy. These patients were assigned to a unilateral amblyopia group (40 patients) and a bilateral amblyopia group (20 patients). Another 20 healthy children served as a control group. All patients underwent a full initial ophthalmologic and orthoptic evaluation. P-VEP test was performed in all. Amplitude and latencies were analyzed and compared among groups. The latencies of P100 waves in the amblyopic eyes were used to generate a multiple linear regression formula from sex, first treatment age, baseline visual acuity, and cycloplegic refraction.\n\n\nRESULTS\nThere was no significant difference in the mean levels of best-corrected visual acuity among groups (P>0.05). A significant prolongation of the latency and a decrease of amplitude of P100 waves were observed in the unilateral amblyopia group and the bilateral amblyopia group compared with the healthy control group (P<0.05). Amplitude and latencies of the fellow eyes in the unilateral amblyopia group were abnormal compared with the healthy control group (P<0.05). Multiple linear regression analysis revealed that the latencies of P100 waves were significantly correlated with the first treatment age, baseline visual acuity, and cycloplegic refraction (R(2)= 0.52, P<0.05).\n\n\nCONCLUSION\nDeficits exist in the fellow eyes and in normal-vision eyes after pleoptic therapy. The delayed P100 latency is affected by the first treatment age, baseline visual acuity, and cycloplegic refraction. Traditional amblyopic therapy may be not enough for vision function recovery.","cites":"0","conferencePercentile":"50"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"7511f1523fbffe4d38c58483c6176a6aa5e796aa","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2008","title":"[Neurons in the corpus callosum of rats: expression of Cav2.2 and their connection].","authors":"Jian-shui Zhang, Yong Liu, Jie-hua Xu, Peng-bo Yang, Xin-li Xiao, Xin-lin Chen, Yu-mei Tian, Jun-feng Zhang","author_ids":"8214488, 7135550, 7169458, 8020422, 7211067, 4263642, 8193366, 8214252","abstract":"OBJECTIVE\nTo prove the existence neurons in the rat corpus callosum, the potential function of these neurons and their connection.\n\n\nMETHODS\nImmunohistochemistry was used performed to examine the expressions of NeuN, a mature neuron marker,and N-type voltage-dependent valcium channel alpha1-subunit (Cav2.2)in the section of the rat corpus callosum. Horseradish peroxidase (HRP) normal sodium solution (30%), the retrograde tracer,was injected under the frontal forceps of corpus callousm and HRP absorbed by the process of neurons in the brain slices was stained with tetramethyl benzidine.\n\n\nRESULTS\nThere were some NeuN positive cells in the rat corpus callosum and Cav2.2 was detected in some of these NeuN positive cells.Neurons with positive HRP were found in the rat corpus callosum and some of these neurons connected to the cortex or corpus striatum.\n\n\nCONCLUSION\nThere are a few neurons in the corpus callosum of adult rats and some of them express Cav2.2. Neurons in the corpus callosum have connections with the brain cortex or corpora striatum.","cites":"0","conferencePercentile":"31.57894737"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"fa9ae33a63203afe0c9cfb90385ec692b99c67eb","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2009","title":"[Behavioral change and cell proliferation in the subventricular zone in adult rats after intracerebral hemorrhage].","authors":"Jianjun Sun, Yong Liu, Pengbo Zhang, Xinlin Chen, Zhenyu Guo, Jianshui Zhang, Pengbo Yang","author_ids":"8456597, 7135550, 7913936, 4263642, 1850900, 6444140, 5328054","abstract":"OBJECTIVE\nTo investigate the relationship between behavioral changes and cell proliferation in subventricular zone (SVZ) after intracerebral hemorrhage (ICH) in adult rats.\n\n\nMETHODS\nForty male Sprague-Dawley rats were randomly assigned into a behavioral test group (n = 19) and a bromodeoxyuridine (Brdu) immunohistochemical staining group (n = 21). ICH was induced by stereotactial injection of collagenase type VII into straitum. Proliferating cells were labeled by injection intrapenitoneally of bromodeoxyuridine in a pulse protocal. Rats were killed on day 2, 7, 14, and 28 after the ICH. Behavioral test and bromodeoxyuridine immunohistochemical staining were performed.Behavioral change was tested by forelimb placing test, Berderson's grade and corner turn test in rats. Cell counting of bromodeoxyuridine immunoreactive cells in SVZ was performed.\n\n\nRESULTS\nThere were marked neurological deficits by day 2 after the ICH, with progressive recovery of function over 4 weeks. A significant increase in the number of bromodeoxyuridine immunoreactive cells in the ipsilateral and cortralateral SVZ was observed from 2 to 14 days with a peak at day 7 after the ICH compared with the sham group.The bromodeoxyuridine immunoreactive cells decreased to control level 28 days after the ICH.\n\n\nCONCLUSION\nProliferation of cells in SVZ corresponds well with behavioral recovery after the ICH, which indicates SVZ cells may be involved in the repairing process after the ICH.","cites":"0","conferencePercentile":"33.33333333"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"a60d56dc6746cdab7353f095fb6c63ebe1bbc9b6","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2012","title":"[Effect of Shuganjieyu capsules on neuronal apoptosis in hippocampal CA3 area and the expression of caspase-3 in the brain of rat depression model].","authors":"Jinhua Fu, Yong Liu, Qingyong Wang, Jingping Zhao","author_ids":"6501637, 7135550, 7417368, 6920851","abstract":"OBJECTIVE\nTo evaluate the effect of \"Shuganjieyu\" (SGJY) capsules on neuronal apoptosis in hippocampal CA3 area and the expression of caspase-3 in the brain of rat depression model, and to investigate its pharmacological mechanisms in depression treatment.\n\n\nMETHODS\nAdult male SD rats were randomly divided into 4 groups: a control, a model, a SGJY and a fluoxetine group. The rat depression model was established under chronic unpredictable mild stress (CUMS) and separate feeding. The behaviors were measured by open-field test, sucrose consumption and forced swimming test. We observed the neuronal morphology structure and neuronal apoptosis in the hippocampal CA3 area. We detected the rat caspase-3 expression level of medial prefrontal cortex ( mPFC) and hippocampal CA3 area by Western blot.\n\n\nRESULTS\nAfter 21-day stress, compared with the model group, spontaneous activity and sucrose consumption and preference percentage of the rats in the SGJY group significantly increased, while the immobility time in forced swimming test, the number of apoptotic cells and the protein levels of caspase-3 significantly reduced (P<0.01 or 0.05). There was no significant difference between the SGJY group and the fluoxetine group (P>0.05).\n\n\nCONCLUSION\nSGJY capsules can reduce the depression symptoms of CUMS and help to increase hippocampal neuron generation, survival and neogenesis, reduce the protein levels of caspase-3, and reverse neurocyte apoptosis in the rat depression model with the same efficacy as fluoxetine.","cites":"1","conferencePercentile":"92.85714286"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"6cfb272ba4ab606852dcc998622d8a60d60fb3a5","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2016","title":"[Progress in study on endocannabinoids and cannabinoid receptors in the treatment for neuropathic pain].","authors":"Peng Liu, Wei Zhang, Shaobo Zhang, Yibao Zhang, Jing Wang","author_ids":"1712572, 2983809, 2361114, 6066029, 1697912","abstract":"Endocannabinoids and cannabinoid receptors are expressed in various central pain modulation regions. They maintain in dynamic changes in the expression level and distribution under different pathological and physiological conditions. These changes possess advantage as well as disadvantage. Exogenous administration of endocannabinoids exerts analgesic effect in different pain models, which is mainly mediated by the cannabinoid CB1 and CB2 receptors. Inhibition of enzymes for degrading endocannabinoids in different pain models also shows analgesic effect due to the increased local levels of endocannabinoids.","cites":"0","conferencePercentile":"58.33333333"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"3f25ff17e54517e158f6fd2879dc69b03d2fb8bb","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2011","title":"[Role of LRRN3 in the cerebellum postnatal development in rats].","authors":"Jing Yang, Fang Li, Li Qiu, Xuegang Luo, He Huang","author_ids":"1796912, 2720124, 7653291, 8104436, 7192502","abstract":"OBJECTIVE\nTo explore the effect and possible mechanism of LRRN3 in the cerebellum postnatal development in rats.\n\n\nMETHODS\nNew born rats were randomly divided into an experimental group and a control group, and each group included 3 sub-groups of different time points. Behavioral experiment, hematoxylin-eosin (HE) staining and immunohistochemistry were used to evaluate the effects of anti-LRRN3 injection on the cerebellum development in new born rats.\n\n\nRESULTS\nCompared with the control, the balance ability in the experiment group was weak, and there was significant difference in the static balance between the 2 groups (P<0.05). HE staining showed that molecular layer (ML) grew thicker from the 7th day to the 21st day after birth,and the structure changed dynamically. Vesicular glutamate transporter 1(VGluT1) expression was positive in the cerebellum of all groups, and the positive ML grew thicker from the 7th day to the 21st day after birth. Compared with the control, there was no obvious difference between the 2 groups on the 7th day after birth (P<0.05), while on the 14th day and the 21st day, there was significant difference (P<0.01).\n\n\nCONCLUSION\nLRRN3 plays an important role in cerebellum postnatal development. Anti-LRRN3 antibody injection may down-regulate the expression of VGluT1, reduce the synapse formation in the molecular layer,decrease the thickness of ML and inhibit the growth of cerebellum cortex and the functional neural circuit formation.","cites":"0","conferencePercentile":"30.55555556"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"3930df3d5299d1bbb045691e742d63c2a5ebca58","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2011","title":"[Correlation among coping style, social support, and negative emotion in infertile women].","authors":"Hui Li, Chunli Yan, Shujuan Zhu, Li Cheng, Guoping He, Jun Lei","author_ids":"1750828, 7589881, 7472071, 8267119, 1796975, 8154954","abstract":"OBJECTIVE\nTo explore the correlation among coping style, social support, and negative emotion in Chinese infertile women.\n\n\nMETHODS\nA total of 211 infertile women was enrolled for this study. Participants completed questionnaires including Social Support Rating Scale (SSRS), Simplified Coping Style Questionnaire (SCSQ), Selfrating Anxiety Scale (SAS), and Self-rating Depression Scale (SDS).\n\n\nRESULTS\nThe mean scores of the 2 dimensions of SCSQ for the infertile women were 20.18±5.43 (positive coping) and 10.19±3.83 (negative coping), respectively. The total mean score of SSRS was 38.95±6.87, and the mean score of 3 dimensions of SSRS were 22.63±4.15 (subjective support), 8.97±2.73 (objective support), and 7.35±1.87 (extent of using the support), respectively. The mean scores of SAS and SDS were 43.44±10.45 and 50.06±10.59, respectively. SAS scores were negatively correlated to the scores of positive coping, subjective support, objective support and extent of using the support (P<0.01) while positively correlated to the scores of negative coping (P<0.01). SDS score were negatively correlated to the scores of positive coping, subjective support, objective support, and extent of using the support (P<0.01). SEM analysis showed that positive coping had direct and positive effect on social support (β=0.49, P<0.01) while direct and negative effect on negative emotions (anxiety and depression, β=-0.27, P<0.01). Negative coping had direct and negative effect on social support (β=-0.21, P<0.01) while direct and positive effect on negative emotions (β=0.21, P<0.01). Positive coping and negative coping also had indirect effects on negative emotions through the pathway of social support, which had direct and negative effect on negative emotions (β=-0.21, P<0.01).\n\n\nCONCLUSION\nCoping styles have direct and indirect effects on negative emotions for the infertile women. As a mediator, social support regulates the relationship between coping styles and negative emotions. Using positive coping more frequently while using negative coping less frequently can alleviate the negative emotions of the infertile women through improving social support levels directly or indirectly.","cites":"0","conferencePercentile":"30.55555556"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"bd0021d6468620fc41557614843047d52fae23b3","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2008","title":"[Features of functional MRI in children with oppositional defiant disorder].","authors":"Jun Liu, Yan Zhu, Yu-Zhi Wu","author_ids":"1843598, 1740068, 5452311","abstract":"OBJECTIVE\nTo determine the characteristics of functional magnetic resonance imaging in brain of children with oppositional defiant disorder (ODD)when performing an impulsive task and to explore the brain structure of impulsivity.\n\n\nMETHODS\nTen ODD children and 10 age and sex-matched control children were recruited. The stimulus task with GOSTOP impulsivity paradigm software was used as the mode of stimulus-rest-stimulus. The data of 2 groups were normalized, merged, and averaged, and then the activation regions were compared by SPM software.\n\n\nRESULTS\nMore scattered cortex and subcortex regions were activated in the ODD group than in the control group during the performance of an impulsive task. The activated cortex in the control group focused on the frontal pole (including inferior frontal gyrus, middle frontal gyrus and orbital-frontal gyrus) and temporal pole (including inferior temporal gyrus and middle temporal gyrus).\n\n\nCONCLUSION\nFrontal pole may be an important region related to multiplicity impulsivity, and shows hypofunction in ODD children.","cites":"2","conferencePercentile":"97.36842105"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"3b16bc78350103250af449647660accda5a99342","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2014","title":"[Pharmacological characteristics of glycine receptors in rat hippocampal pyramidal cells].","authors":"Kai Meng, Wen Xie, Li Zhang","author_ids":"1993889, 5754653, 1712838","abstract":"OBJECTIVE\nTo investigate function of glycine receptors (GlyRs) at the hippocampal CA1 pyramidal cells and to characterize the pharmacological properties of these receptors at early postnatal stage.\n\n\nMETHODS\nWe used whole cell patch clamp recording to study the current response in the acutely prepared hippocampal slices from postnatal day 11-13 rats induced by glycine applied in the artificial cerebrospinal fluid.\n\n\nRESULTS\nApplication of glycine to the pyramidal cells elicited strychnine sensitive chloride currents. EC50 for GlyRs respond to glycine was 123. 23 μmol/L and Hill coefficient was 1.24. Picrotoxin could partly blocked the currents.\n\n\nCONCLUSION\nStrychnine sensitive glycine receptors are functionally expressed in CA1 pyramidal neurons in rat hippocampal CA1 area at early postnatal stage, and some of GlyRs are αβ heteromeric receptors.","cites":"0","conferencePercentile":"55"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"c7634ab349ba0a8f701dbfee9c3e7a16682162c9","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2011","title":"[MRI for brain structure and function in patients  with first-episode panic disorder].","authors":"Yan Zhang, Lian Duan, Mei Liao, Fan Yang, Jun Liu, Baoci Shan, Lingjiang Li","author_ids":"3397744, 1740786, 5609974, 1752128, 1843598, 7705157, 7137967","abstract":"OBJECTIVE\nTo determine the brain function and structure in patinets with first-episode panic disorder (PD).\n\n\nMETHODS\nAll subjects (24 PD patients and 24 healthy subjects) received MRI scan and emotional counting Stroop task during the functional magnetic resonance imaging. Blood oxygenation level dependent functional magnetic resonance imaging and voxel-based morphometric technology were used to detect the gray matter volume.\n\n\nRESULTS\nCompared with the healthy controls, left thalamus, left medial frontal gyrus, left anterior cingulate gyrus, left inferior frontal gyrus, left insula (panic-related words vs. neutral words) lacked activation in PD patients, but the over-activation were found in right brain stem, right occipital lobe/lingual gyrus in PD patients. Compared with the healthy controls, the gray matter volume in the PD patients significantly decreased in the left superior temporal gyrus, right medial frontal gyrus, left medial occipital gyrus, dorsomedial nucleus of left thalamus and right anterior cingulate gyrus. There was no significantly increased gray matter volume in any brain area in PD patients.\n\n\nCONCLUSION\nPD patients have selective attentional bias in processing threatening information due to the depression and weakening of the frontal cingulated gyrus.","cites":"1","conferencePercentile":"72.22222222"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"cc41b6ac12e43d3c25cc440efbc9ea377e39f749","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2016","title":"[Hypoxic condition promotes olfactory mucosa mesenchymal stem cells to differentiate into neurons and  underlying mechanisms].","authors":"Yi Zhuo, Ting Yuan, Da Duan, Lei Wang, Lite Ge, Pei Wu, Hao Wang, Ming Lu","author_ids":"7790595, 1750306, 7208352, 1743559, 6229890, 2139443, 1728073, 4898850","abstract":"OBJECTIVE\nTo explore whether hypoxic condition could promote the olfactory mucosa mesenchymal stem cells (OM-MSCs) to differentiate into neurons with the olfactory ensheathing cells (OECs) supernatant and the potential mechanisms.  Methods: The OM-MSCs and OECs were isolated and cultured, and they were identified by flow cytometry and immunofluorescence. The OM-MSCs were divided into three groups: a 3%O2+ HIF-1α inhibitors (lificiguat: YC-1) + OECs supernatant group (Group A) , a 3%O2 + OECs supernatant group (Group B) and a 21%O2 + OECs supernatant group (Control group). The neurons, which were differentiated from OM-MSCs, were assessed by immunofluorescence test. The mRNA and protein expression of hypoxia-inducible factor-1α (HIF-1α), βIII-tubulin and glial fibrillary acidic portein (GFAP) were detected by quantitative polymerase chain reaction (Q-PCR) and Western blot. The potassium channels were analyzed by patch clamp.  Results: The neurons differentiated from OM-MSCs expressed the most amount of βIII-tubulin, and the result of Q-PCR showed that HIF-1α expression in the Group B was significantly higher than that in the other groups (all P<0.05). Western blot result showed that the βIII-tubulin protein expression was significantly higher and GFAP protein expression was obviously decreased in the Group B (both P<0.05). The patch clamp test confirmed that the potassium channels in the neurons were activated.  Conclusion: Hypoxic condition can significantly increase the neuronal differentiation of OM-MSCs by the OECs supernatant and decrease the production of neuroglia cells, which is associated with the activation of HIF-1 signal pathway.","cites":"0","conferencePercentile":"58.33333333"},{"venue":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","id":"30a81f6a8448f1abc23e36740beaa3d9b14a9434","venue_1":"Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences","year":"2011","title":"[Functional magnetic resonance imaging of brain of college students with internet addiction].","authors":"Wanping DU, Jun Liu, Xunping Gao, Lingjiang Li, Weihui Li, Xin Li, Yan Zhang, Shunke Zhou","author_ids":"7808422, 1843598, 5193648, 7137967, 7878373, 3376221, 3397744, 7523294","abstract":"OBJECTIVE\nTo explore the functional locations of brain regions related to internet addiction (IA)with task-functional magnetic resonance imaging (fMRI).\n\n\nMETHODS\nNineteen college students who had internet game addition and 19 controls accepted the stimuli of videos via computer. The 3.0 Tesla MRI was used to record the Results of echo plannar imaging. The block design method was used. Intragroup and intergroup analysis Results in the 2 groups were obtained. The differences between the 2 groups were analyzed.\n\n\nRESULTS\nThe internet game videos markedly activated the brain regions of the college students who had or had no internet game addiction. Compared with the control group, the IA group showed increased activation in the right superior parietal lobule, right insular lobe, right precuneus, right cingulated gyrus, and right superior temporal gyrus.\n\n\nCONCLUSION\nInternet game tasks can activate the vision, space, attention and execution center which are composed of temporal occipital gyrus and frontal parietal gyrus. Abnormal brain function and lateral activation of the right brain may exist in IA.","cites":"2","conferencePercentile":"88.88888889"}]}