{"Zhongguo_xiu_fu_chong_jian_wai_":[{"venue":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","id":"9e441f4c9139e40765cdd29b59d0713d78f28525","venue_1":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","year":"2009","title":"[Effect of Neuritin protein on axonal regeneration after acute spinal cord injury in rats].","authors":"Shaosong Xi, Weigang Liu, Hong Zhang, Rui Gao, Jin Huang","author_ids":"6276586, 3185572, 1734058, 2484526, 3579556","abstract":"OBJECTIVE\nTo investigate the effects of Neuritin on the regeneration of the neural axons after acute spinal cord injury (SCI) in rats.\n\n\nMETHODS\nThe model of acute SCI at T10 was established in 54 adult healthy Wistar rats (half males and half females) weighing 250-300 g by using the improved Allen's weight-drop method. The rats were randomly divided into 3 groups. 100 microL (6 microg) Neuritin and His protein was injected into group A (n = 24) and group B (n = 24), respectively, through subarachnoid catheter. Six rats from each group were killed 3, 7, 14, and 28 days after injury to receive Basso, Beattie and Bresnahan (BBB) locomotor rating scaling, HE staining observation, and immunohistochemistry staining observation for neurofilament 200 (NF-200) and growth associated protein 43 (GAP-43). Group C (n = 6) served as sham-operated group receiving laminectomy without spinal injury and with an empty catheter in the subarachnoid space and received the above observations 7 days after injury.\n\n\nRESULTS\nBBB scale: after operation, the scale of groups A and B was increased over time; group A was significantly higher than group B from 14 days (P < 0.05); group C was higher than groups A and B at different time points after operation (P < 0.05). HE staining: in group C, the injured spinal tissue was normal after operation; from 7 days after operation, group A presented deeper-stained nissl body, less physaliferous cells, and more nerve synapses when compared with group B. NF-200 and GAP-43 immunohistochemistry observation: in group C, there was just little positive expression; while in groups A and B, positive expression of NF-200 and GAP-43 was evident in the spinal cord from 7 days after operation. Mean density integral absorbency (IA) value of NF-200 and GAP-43: group A was higher than group B at each time point (P < 0.05) and group C was lower than groups A and B at each time point (P < 0.05).\n\n\nCONCLUSION\nLocal application of exogenous Neuritin can promote the axonal regeneration after acute SCI in rats and the recovery of the locomotion function of hind-limbs in rats.","cites":"1","conferencePercentile":"85"},{"venue":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","id":"f459e6a75515c1abcd7327e4b9e7b9fe8dee1e77","venue_1":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","year":"2008","title":"[Spinal pathologic changes and axonal regeneration after brachial plexus root anastomosis in rats].","authors":"Zhaopeng Xuan, Xiaojie Zhang, Laijin Lu, Zhigang Liu","author_ids":"3549704, 8444016, 8449724, 1796724","abstract":"OBJECTIVE\nTo evaluate the feasibility of direct anastomosis in the rat model of the brachial plexus extravertebral foramen nerve root division of C5-7. Methods Forty-eight SD rats (male or female) aging 4-6 months and weighing 250-300 g were selected to make the model of extravertebral foramen nerve root division of C5-7. The left C5-7 nerve roots, as the experimental sides, were separated to the brachial plexus nerve trunk and the transected roots were sutured to the proximal stump immediately after cutting off the brachial plexus extravertebral foramen nerve root division. The right C5-7 nerve roots, as the control sides, received no operation. The general condition of rats after operation was observed. The gross observation, the histological observation and BDA nerve tracing technology were adopted to observe the wet weight of musculus biceps brachii, the cross section of biceps brachii and the spinal cord and distal nerve trunk at 3 weeks, 3 months and 6 months after operation. Results All rats survived well after operation. Claudication and unfold claw reflex were observed in the experimental sides, and the unfold claw reflex disappeared 3 months later. Comparatively, the control sides were normal. Nerve adhesion aggravated gradually and the neural stems were shriveled within 6 months after operation in the experimental sides. Comparatively, the control sides were normal. The wet weight of biceps brachii in the experimental sides and the control sides at 3 weeks, 3 months and 6 months after operation was (0.28 +/- 0.12), (1.37 +/- 0.33), (0.58 +/- 0.10), (1.36 +/- 0.35), (1.39 +/- 0.31), (1.37 +/- 0.38) g, respectively, indicating significant differences between two sides at 3 weeks and 3 months (P < 0.05), but no significant difference at 6 months (P > 0.05). The modified Marsland and the LFB staining of spinal cord and superior trunk of brachial plexus showed that the number of neurons, cell nuclear and Nissl body decreased and cell bodies changed from swelling to shrinkage, dyeing nerve fibers increased, neural axone was thin and myelin sheath was slightly stained at each time point in experimental side. The number of motor neurons in cornu anterius medullae spinalis in the experimental side was 84.5% +/- 3.2%, 74.4% +/- 4.5%, 73.7% +/- 3.8% of that in the control side at each time point, respectively. HE staining of biceps brachii detected that the muscle denaturation was very serious at 3 months after operation and then recovered. Neural tracing used BDA showed that the closer to the proximal of nerve trunk, the more obviously stained it was of myelin sheath and the more massive of axon at 6 months after operation. And there was almost no myelin and axon stained in musculocutaneous nerve.\n\n\nCONCLUSION\nIn the rat model of brachial plexus extravertebral foramen nerve root division, the motoneuron in cornu anterius medullae spinalis necrosis rate reaches 20%-30%, and most of the residual neurons are pathologic. The regenerated fibers manifest as insufficient dynamic power and incomplete development, making no sense for the recovery of end organ function. Therefore, the exact mechanism of the recovery of biceps brachial muscle demands further study.","cites":"0","conferencePercentile":"50"},{"venue":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","id":"68f0113e123b8d26966daeb608054b29310c77d9","venue_1":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","year":"2007","title":"[Experimental study on brachial plexus injury induced by radiation in rats].","authors":"Zhigang Liu, Zulin Sun, Zhaopeng Xuan","author_ids":"1796724, 5488556, 3549704","abstract":"OBJECTIVE\nTo explore the changes of morphology and ventricornual motor neurons in SD rats' ventral horn of spinal cord after radiated as the therapy protocol for breast cancer, to discover the rule of radiation-induced injury of brachial plexus, and also if there exits the reversible conversion in neurons.\n\n\nMETHODS\nTwenty SD rats were selected. The left side of the rats was used as the radiation side, and the right side as the control side. The RIBPI animal models were established by divided-dose of radiation. Using 2 Gy/time and 5 times/week, a total administered dose reached 30 Gy after 3 weeks. The behaviour of the rats was observed after radiation. At 3, 5, 7 and 9 weeks after the last radiation (n = 4), the wet weights of biceps brachii muscle, upper-limb circumference and compound action potential were examined; the pathological changes of biceps brachii muscle, the morphological changes, counts of the motor neurons in ventral horn and axons of bilateral spinal cord were observed by HE staining, argentums staining and toluidine blue staining.\n\n\nRESULTS\nThe rats showed lameness and a \"claw hand\" 3 weeks after radiation. Compared with control side, the wet weights of biceps brachii muscle and upper-limb circumference were significantly reduced, meanwhile, the compound action potential significantly decreased, and its latent period was also significantly prolonged 3, 5, 7 and 9 weeks (P < 0.05). The histological observation: Musculocutaneous nerve showed decreased medullated fibers, heterogeneous ditribution and decreased density, thin myelin sheath, damaged nerve structure and collagen hyperplasia; biceps brachii muscle showed degeneration, fiber breakage and inflammatory cell infiltration; The account of motor neurons in ventral horn was significantly decreased in the radiation side with time extending, the sign of cell death, such as, the neurons crimple, and karyolysis were observed (P < 0.05).\n\n\nCONCLUSION\nLarge dose of X-ray can induced brachial plexus injury, and the lameness, a \"claw hand\", biceps brachii muscle atrophy and the compound action potential abnormality. The account of motor neurons in ventral horn was significantly decreased. The motor neurons showed oxonal degeneration and myelinec degeration.","cites":"0","conferencePercentile":"50"},{"venue":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","id":"02deddff41a18fb613ac0e6e58b1f02fe7290802","venue_1":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","year":"2012","title":"[Biomechanical analysis of bilateral facet joint stabilization for posterior cervical spine reconstruction with bio-derived tendon in goats].","authors":"Beiyu Wang, Hao Liu, Weiguang Hou, Huiqi Xie, Yueming Song, Ying Hong, Rui Shi, Litai Ma","author_ids":"3610572, 4087368, 2366828, 8303983, 6227734, 6787264, 8697593, 3749075","abstract":"OBJECTIVE\nThere is few report on dynamic stabilization for posterior cervical reconstruction. To investigate the biomechanical properties of a novel cervical spine posterior fixation using the bio-derived freeze-dried tendon in posterior cervical spine reconstruction.\n\n\nMETHODS\nThe palmaris longus flexor tendon and metacarpal extensor tendon were collected from the death donors' stump to prepare bio-derived tendon. Twenty fresh cervical vertebrae (C1-7) were harvested from goats and were randomly divided into 4 groups (n = 5): intact group (group A); injury control group (group B); screw-rods fixation group, fixed with screw-rods on C3, 4 (group C); tendon reconstruction group, cross-fixed with bio-derived freeze-dried tendon on C3, 4 bilatera facet joints (group D). The range of motion (ROM) values in flexion, extension, lateral bending, and axial rotation were measured.\n\n\nRESULTS\nIn flexion, the ROM values of group C were significantly lower than those of the other 3 groups (P < 0.05), and the ROM values of group B were significantly higher than those of groups A and D (P < 0.05). In extension, lateral bending, and axial rotation, the ROM values of group C were significantly lower than those of groups A, B, and D (P < 0.05), and no significant difference was found within the other 3 groups (P > 0.05).\n\n\nCONCLUSION\nThe novel cervical spine posterior fixation using the bio-derived frozen-dried tendon can provide enough stability in flexion motion, but it can not limit the lateral bending and axial rotation motion, which can provide dynamic stabilization in animal model.","cites":"0","conferencePercentile":"56.25"},{"venue":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","id":"9d726a91b11ff557c303abca97fa0197146da5b1","venue_1":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","year":"2012","title":"[Clinical significance of thoracic pedicle classification by inner cortical width of pedicles on CT images in posterior vertebral column resection for treatment of rigid and severe spinal deformities].","authors":"Ying Zhang, Jingming Xie, Yingsong Wang, Ni Bi, Zhi Zhao, Tao Li","author_ids":"1752812, 2990111, 7709281, 5240198, 3049130, 1726351","abstract":"OBJECTIVE\nTo investigate the clinical significances of the thoracic pedicle classification determined by inner cortical width of pedicle in posterior vertebral column resection (PVCR) with free hand technique for the treatment of rigid and severe spinal deformities.\n\n\nMETHODS\nBetween October 2004 and July 2010, 56 patients with rigid and severe spinal deformities underwent PVCR. A total of 1098 screws were inserted into thoracic pedicles at T(2-12). The inner cortical width of the thoracic pedicle was measured and divided into 4 groups: group 1 (0-1.0 mm), group 2 (1.1-2.0 mm), group 3 (2.1-3.0 mm), and group 4 (> 3.1 mm). The success rate of screw-insertion into the thoracic pedicles was analyzed statistically. A new 3 groups was divided according to the statistical results and the success rate of screw-insertion into the thoracic pedicles was analyzed statistically again. And statistical analysis was performed between different types of thoracic pedicles classification for pedicle morphological method by Lenke.\n\n\nRESULTS\nThere were significant differences in the success rate of screw-insertion between the other groups (P < 0.008) except between group 3 and group 4 (chi2 = 2.540, P = 0.111). The success rates of screw-insertion were 35.05% in group 1, 65.34% in group 2, and 88.32% in group 3, showing significant differences among 3 groups (P < 0.017). According to Lenke classification, the success rates of screw-insertion were 82.31% in type A, 83.40% in type B, 80.00% in type C, and 30.28% in type D, showing no significant differences (P > 0.008) among types A, B, and C except between type D and other 3 types (P < 0.008). In the present study, regarding the distribution of different types of thoracic pedicles, types I, II a, and II b thoracic pedicles accounted for 17.67%, 16.03%, and 66.30% of the total thoracic pedicles, respectively. The type I, II a, and II b thoracic pedicles at the concave side accounted for 24.59%, 21.13%, and 54.28%, and at the convex side accounted for 10.75%, 10.93%, and 78.32%, respectively.\n\n\nCONCLUSION\nA quantification classification standard of thoracic pedicles is presented according to the inner cortical width of the pedicle on CT imaging: type I thoracic pedicle, an absent channel with an inner cortical width of 0-1.0 mm; type II thoracic pedicle, a channel, including type IIa thoracic pedicle with an inner cortical width of 1.1-2.0 mm, and type IIb thoracic pedicle with an inner cortical width more than 2.1 mm. The thoracic pedicle classification method has high prediction accuracy of screw-insertion when PVCR is performed.","cites":"0","conferencePercentile":"56.25"},{"venue":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","id":"bc0b54403f494611c9d32e1f6869f4fb268199ae","venue_1":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","year":"2013","title":"[Finite element study on anterior transpedicular screw-artificial vertebral body fixation in lower cervical spine].","authors":"Weidong Wu, Peidong Sun, Xiong Liu, Chun Chen, Changfu Wu, Jun Ouyang","author_ids":"7970246, 5258773, 3892581, 5371645, 7513637, 7368314","abstract":"OBJECTIVE\nTo compare the biomechanical properties of the anterior transpedicular screw-artificial vertebral body (AVB) and conventional anterior screw plate system (AP) in lower cervical spine by finite element study.\n\n\nMETHODS\nCT images (C1-T1) were obtained from a 38-year-old female volunteer. The models of intact C(3-7) (intact group), AP fixation (AP group), and AVB fixation (AVB group) were established and analyzed by Mimics 14.0, Geomagic Studio 2013, and ANSYS 14.0 softwares. The axial force of 74 N and moment couple of 1 N x m were loaded on the upper surface and upper facet joint surfaces of C3. Under conditions of flexion, extension, lateral bending, and rotation, the Von Mises stress distribution regularity and maximum equivalent stree of AP and AVB groups were recorded, and the range of motion (ROM) was also analyzed of 3 groups.\n\n\nRESULTS\nThe intact model of lower cervical spine (C(3-7)) was established, consisting of 286,382 elements and 414,522 nodes, and it was successfully validated with the previously reported cadaveric experimental data of Panjabi and Kallemeyn. The stress concentrated on the connection between plate and screw in AP group, while it distributed evenly in AVB group. Between AP and AVB groups, there was significant difference in maximum equivalent stress values under conditions of 74 N axial force, flexion, extension, and rotation. AVB group had smaller ROM of fixed segments and larger ROM of adjacent segments than AP group. Compared with intact group, whole ROM of the lower cervical spine decreased about 3 degrees, but ROM of C(3,4) and C(6,7) segments increased nearly 5 degrees in both AP and AVB groups.\n\n\nCONCLUSION\nAs a new reconstruction method of lower cervical spine, AVB fixation provides better stability and lower risk of failure than AP fixation.","cites":"0","conferencePercentile":"75"},{"venue":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","id":"e366fe45724b4b163f3672e49edd9daed3d57e45","venue_1":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","year":"2010","title":"[Biomechanical study on effect of polymethylmethacrylate augmentation on cervical stability after anterior cervical interbody fusion].","authors":"Chun Chen, Weidong Zhao, Peidong Sun, Changfu Wu, Dongbin Qu, Jun Ouyang","author_ids":"5371645, 1738626, 5258773, 7513637, 7421930, 7368314","abstract":"OBJECTIVE\nTo evaluate the effect of polymethylmethacrylate (PMMA) augmentation on cervical stability after anterior cervical interbody fusion (ACIF) before and after fatigue.\n\n\nMETHODS\nTwelve porcine cervical spines (C3-7) were subjected to testing angular displacement parameters, including the range of motion (ROM), neutral zone (NZ), and elastic zone (EZ), in nondestructive flexion and extension, right/left lateral bending, and left/right rotation on Motion Analysis motion capture system and MTS-858 servo-hydraulic testing machine. Intact cervical spines served as control group (group A); one-level discectomy and fusion was performed with anterior plate fixation based on group A as group B; flexion and extension, left/right lateral bending (5 000 cycles) fatigue testing based on group B as group C; the augmentation screw channel was used based on group C as group D; and flexion and extension, left/right lateral bending fatigue testing were performed based on group D as group E.\n\n\nRESULTS\nThe ROM, NZ, and EZ in group A were significantly different from those in other groups (P < 0.05) at flexion/extension, left/right bending, and left/right rotation. The ROM, NZ, and EZ in group B were significantly smaller than those in group C (P < 0.05) in flexion/extension, left/right bending, and left/right rotation, but there was no significant difference when compared with group D (P > 0.05). The ROM and NZ in flexion/extension and the EZ in flexion in group B were significant smaller than those in group E (P < 0.05), but there was no significant difference in the other indexes (P > 0.05). The ROM, NZ, and EZ in group C in flexion and extension, left/right lateral bending, and left/right rotation were significantly higher than those in groups D and E (P < 0.05). The ROM and NZ in flexion and extension and left/right lateral bending, and the ROM in left/right rotation, and the EZ in flexion and extension, right bending, and left/right rotation in group D were significantly smaller than those in group E (P < 0.05), but there was no significant difference in the other indexes (P > 0.05).\n\n\nCONCLUSION\nPMMA augmentation can significantly increase the instant cervical stability and provide a biomechanics basis in cervical anterior plate fixation.","cites":"0","conferencePercentile":"50"},{"venue":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","id":"f8e775da5b0df48181ba188d37c35e95e9db49b3","venue_1":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","year":"2013","title":"[Effect of chondroitinase ABC on axonal myelination and glial scar after spinal cord injury in rats].","authors":"Tao Zhang, Yixin Shen, Leilei Lu, Zhihai Fan, Weiwei Huo","author_ids":"1743147, 8034895, 5175102, 7763613, 2002383","abstract":"OBJECTIVE\nTo investigate the effects of chondroitinase ABC (ChABC) on axonal myelination and glial scar after spinal cord injury (SCI) in rats.\n\n\nMETHODS\nSeventy-two adult male Sprague Dawley rats were randomly assigned into ChABC treatment group (group A), saline treatment group (group B), and sham operation group (group C), 24 rats in each group. In groups and B, the SCI model was established with modified Allen's method and then the rats of groups A and B were administrated by subarachnoid injection of 6 microL ChABC (1 U/mL) and saline respectively at 1 hour after injury and every day for 1 week; the rats of group C served as control, which canal was opened without damage to spinal cord. At 1, 7, 14, and 28 days after operation, the locomotor functions were evaluated according to the Basso-Beattie-Bresnahan (BBB) score scale; and the spinal cord samples were harvested for HE staining, Nissl staining, and immunohistochemistry analysis to detect the change of myelin basic protein (MBP), growth associated protein 43 (GAP-43), and glial fibrillary acidic protein (GFAP) of the injured spinal cord.\n\n\nRESULTS\nAt different time points, the BBB score of group C was significantly higher than those of groups A and B (P < 0.05), and the BBB score of group was significantly better than that of group B at 14 and 28 days after operation (P < 0.05). HE staining and Nissl staining showed that the morphous and the neuron number of the remainant injured spinal cord in group A were better than those in group B. The integral absorbance (IA) values of MBP and GAP-43 and the positive area of GFAP after SCI in groups A and B were significantly higher than those in group C at different time points (P < 0.05), and the IA values of MBP and GAP-43 were significantly higher in group A than those in group B at 7, 14, and 28 days after operation (P < 0.05), but the positive area of GFAP was significantly smaller in group A than that in group B (P < 0.05).\n\n\nCONCLUSION\nThe ChABC can effectively improve the microenvironment of the injured spinal cord of rats, enhance the expressions of MBP and GAP-43, and inhibit the expression of GFAP, which promotes the axonal regeneration and myelination, attenuate glial scar formation, and promote the recovery of nerve function.","cites":"0","conferencePercentile":"75"},{"venue":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","id":"0561dc8a7ddcde3d7a4c30fa8411b6c98de88ea6","venue_1":"Zhongguo xiu fu chong jian wai ke za zhi = Zhongguo xiufu chongjian waike zazhi = Chinese journal of reparative and reconstructive surgery","year":"1999","title":"[Observation on the degeneration and regeneration of the Meissner's corpuscles in the monkey's denervated fingers following sensory nerve implantation under electron microscope].","authors":"X Y Li, S Z Chen, Y J Li","author_ids":"2617520, 7159643, 1877386","abstract":"OBJECTIVE\nTo observe the degeneration and regeneration of the Meissner's corpuscles after implanted sensory nerve into the denervated monkey's fingers under electron microscope.\n\n\nMETHODS\nThe two finger nerves of the monkey's fingers were denervated. Afterwards, one finger nerve was cut off, and the other was reimplanted into the denervated finger. After 1, 3, 5, 8 and 12 months, the finger skin was cut off and observed under electron microscope.\n\n\nRESULTS\nThe degenerative changes of nerve ending in Meissner's corpuscles were observed after 1 month of denervation, and the basic structure of the corpuscles had no obvious changes. After 3 months, the axons of corpuscles were disappeared, and the volume of corpuscles was shrunk. The basic structure of nerves was disappeared, and the lemmocyte and neurolemma plate were changed after 5 months. The collagen fibrils in the corpuscles were gradually increased in 8 months, the endoneurial structure and interneurial matrix were completely disappeared and replaced by collagen fibrils in 12 months. After 3 months of nerve implantation, unmyelinated nerve fibers were appeared and grew into the corpuscles. A part of corpuscles innervated in 5 months. Most of corpuscles innervated and myelinated nerve fibers were observed in 8 months. And in 12 months, corpuscles innervated to normal level.\n\n\nCONCLUSION\nThe implantative sensory nerve by means of reinnervating the original corpuscles and regenerating new corpuscles could innervate the degenerative Meissner's corpuscles.","cites":"0","conferencePercentile":"50"}]}