{"Zhongguo_ying_yong_sheng_li_xue":[{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"9d3df8bda470c3d51f85cbbd33c160ba36808d48","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2013","title":"[The effect of niflumic acid on gamma aminobutyric acid activated current in DRG neurons].","authors":"Li Li, Jing Li, Ke-Tao Ma, Hong-Ju Cheng, Lei Zhao, Yang Wang, Jun-Qiang Si","author_ids":"1738073, 1742253, 8503053, 1798886, 1716145, 1803489, 5201800","abstract":"OBJECTIVE\nTo explore the modulatory effect of niflumic acid (NFA) on gamma aminobutyric acid (GABA)-activated currents of dorsal root ganglion (DRG) neurons in rat.\n\n\nMETHODS\nThe whole-cell patch-clamp technique was used to record the NFA- and GABA-activated currents in neurons freshly dissociated from rat DRG neurons.\n\n\nRESULTS\nApplication of NFA(0.1 - 100 micromol/L) could induce concentration-dependent outward currents in some cells (21/48,43.75%), and GABA (0.1 - 100 micromol/L) could induce concentration-dependent inward currents in some cells(150/159,94.32%). NFA-(100 micromol/L) and GABA-(100 micromol/L) activated currents were (0.27 +/- 0.06) nA (n = 12) and (1.29 +/- 0.72) nA (n = 53) respectively. However, pre-application of NFA (0.1 - 100 micromol/L) could inhibit the GABA-activated inward current which was identified to be GABAA receptor-mediated current. The inhibitory effects of NFA were concentration-dependent. NFA could not alter the EC50 (about 30 micromol/L) and inverse potential (about -10 mV) of GABA-activated current (P > 0.05).\n\n\nCONCLUSION\nPre-application of NFA exerts a more strong inhibitory effect on the peak value of GABA-activated current.","cites":"0","conferencePercentile":"42.85714286"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"4d7547719030ecaee7438da69660038d35b52f95","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2013","title":"[Study on fatigue of pilots during simulated flight training based on electroencephalogram].","authors":"Jia-Li Zhang, Jing Li, Guo Meng, Ming-Gao Li","author_ids":"8215380, 1742253, 3236713, 3679346","abstract":"OBJECTIVE\nTo study EEG during simulated flight training, then to explore the situational character of mental fatigue of the pilots.\n\n\nMETHODS\nFifty male pilots were randomly choice to be recorded their EEG including rest,flight and recovery phase. Then the band waves of EEG were analysed among the three phase.\n\n\nRESULTS\n(1) During flight, the amplitude of alpha, beta, SMR, theta, gamma waves tended to increase. These changes seemed obviously in SMR, theta waves. (2) After flight, all the amplitude of the waves declined except for beta wave of the right lobe,and most of them were still higher than those before flight (P < 0.05); (3) The right brain showed a higher cerebration than the left, especially in theta wave.\n\n\nCONCLUSION\nMental fatigue is started during the flight training, and the right lobe has a severe mental fatigue than the left. After flight, mental fatigue showed a slow recovery.","cites":"0","conferencePercentile":"42.85714286"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"4894f4cd01ef8106cf93737acf1ad4e57a66584c","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2011","title":"[Changes of GABA-activated currents in isolated dorsal root ganglion neurons in rats with neuropathic pain].","authors":"He Zhu, Ke-tao Ma, Li Li, Zhong-shuang Zhang, Jing Li, Jun-qiang Si","author_ids":"3243775, 8503071, 1738073, 7969984, 1742253, 8603662","abstract":"OBJECTIVE\nTo investigate the changes of GABA-activated currents in isolated dorsal root ganglion neurons in rats with neuropathic pain.\n\n\nMETHODS\nThe neuropathic pain model was established by chronic constriction injury (CCI) 7 days before electrophysiological-recording. The rat DRG neurons were enzymatically dissociated. Whole-cell patch clamp technique was used to record GABA-activated currents. The changes of currents of injured side and opposite side were expected to compare with control group.\n\n\nRESULTS\n(1) The currents of injured side of CCI group were notablely decreased compared with control group (GABA concentration, 0.1-1000 micromol/L). (2) By the contrast, opposite side currents of CCI group increased significantly compared with those in injured side and control group (GABA concentration, 0.01-1000 micromol/L).\n\n\nCONCLUSION\nThe data indicates that the chronic constriction injury change both the function of GABAA receptors of injury side and opposite side. The decrease of pre-synaptic inhibition of GABA may be the possible reason of neuropathic pain.","cites":"0","conferencePercentile":"41.17647059"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"ab5127cb734ceea141ccb97ae26ed39827b121ad","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2001","title":"[Effects of intermittent hypoxia on long-term potentiation in hippocampal dentate gyrus of rat].","authors":"X R Wang, Q Ma, A S Ding, B X Zeng, F Z Wang","author_ids":"8415722, 1750998, 3577678, 4129999, 1745827","abstract":"AIM\nTo investigate the effects of intermittent hypoxia on the hippocampal synaptic plasticity in rat.\n\n\nMETHODS\nThe evoked potentials were recorded extracellularly, then the LTP were induced by tetanic stimulation in rat hippocampal dentate gyrus.\n\n\nRESULTS\nCompared with control group, the amplitude of LTP was significantly reduced in hippocampus of rat treated with intermittent hypoxia.\n\n\nCONCLUSIONS\nThe present results suggest that the hippocampal synaptic plasticity could be decreased by the treated of intermittent hypoxia.","cites":"2","conferencePercentile":"100"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"8265fa6953c424e8bff618be1e6a1a9a7a53df24","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2012","title":"[Brain-derived neurotrophic factor prevents against amyloid beta protein-induced impairment of hippocampal in vivo long-term potentiation in rats].","authors":"Qing-Shan Li, Wei Yang, Yan-Fang Pan, Jie Min, Zhe Zhang, Hui-Zhong Gao, Jin-Shun Qi","author_ids":"8194533, 1742383, 5918003, 4539112, 2091513, 3536266, 6399086","abstract":"OBJECTIVE\nTo explore the effects of brain-derived neurotrophic factor (BDNF) pretreatment on beta amyloid protein (Abeta) induced impairment of in vivo hippocampal long-term potentiation (LTP) in the CA1 region of rats.\n\n\nMETHODS\nThirty-six adult male SD rats were randomly divided into six groups (n = 6): control, Abeta25-35, BDNF, (0.02 microg, 0.1 microg, 0.5 microg) BDNF + Abeta25-35. A self-made hippocampal local drug delivery catheter and a parallel bound stimulating/recording electrode were used to deliver drugs/stimulation and record field excitatory post-synaptic potentials (fEPSPs) in the hippocampal CA1 region of rats. High-frequency stimulation (HFS) was used to induce in vivo LTP.\n\n\nRESULTS\n(1) Abeta25-35 (2 nmol) injection into CA1 region of rats did not affect the baseline fEPSPs, but inhibited the HFS-induced LTP significantly (P < 0.01). (2) Hippocampal CA1 injection of BDNF (0.1 microg) alone did not affect the baseline fEPSPs and HFS-induced LTP. (3) Compared with Abeta25-35 alone group, the averaged amplitude of LTP in BDNF (0.1 microg and 0.5 microg) plus Abeta25-35 groups significantly increased at 0 min, 30 min, and 60 min after HFS (P < 0.01), indicating that pretreatment with BDNF effectively protected against the Abeta,25-35 induced depression of LTP in a dose-dependent manner.\n\n\nCONCLUSION\nIntrahippocampal injection of BDNF can protect against the Abeta25-35-induced LTP impairment, suggesting that the up-regulation of BDNF in the brain could maintain the normal hippocampal synaptic plasticity and may contribute to the improvement of learning and memory in Alzheimer's (AD) disease patients.","cites":"1","conferencePercentile":"86.66666667"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"67a3d3b0fdf1dec7ad0946aae0df0e7f1d6912e2","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2003","title":"[Effects of CNTF on the nuclear translocation of PKC following NMDA administration in primary hippocampal neurons].","authors":"Fang Liu, Jin Yan, Zong-lai Jiang, Xue-qi Wang, Xuan Bao, Chang-lin Lu","author_ids":"4496957, 1764614, 6789584, 8417369, 2418751, 7434172","abstract":"AIM\nTo investigate the effect of ciliary neurotrophic factor (CNTF) on the nuclear translocation of protein kinase C (PKC) following NMDA administration in the primary cultured hippocampal neurons.\n\n\nMETHODS\n(1) PKCGAMMA or PKCepsilon- immunocytochemistry staining method was used after treating neurons with NMDA or CNTF. (2) The gray of the nucleus of the PKC-positive neurons were measured under the image pattern analysis system.\n\n\nRESULTS\n(1) After NMDA administration of different concentration and time, Nucleus appear PKCgamma and PKCepsilon activities, especially the 100 micromol/L NMDA 30 min group. (2) The gray of nucleus in CNTF + 500 micromol/L NMDA group is similar to control group.\n\n\nCONCLUSION\nNMDA can induce nuclear translocation of PKC in the primary cultured hippocampal neurons, and CNTF can inhibit the translocation. It suggests that the inhibition of PKC translocation induced by NMDA is one of the important reasons for the neuro-protective effects of CNTF.","cites":"0","conferencePercentile":"44.44444444"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"bf4e0b476cbc5ea6eb2ed8edbbdf8c315e8297e0","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2002","title":"[Research of regulation on calcium-activated potassium channel in hypothalamic neurons by nitric oxide].","authors":"Shuai Wang, Zhen-Gang Wang, Xu-Dong Zhang, Fei Zou","author_ids":"3804894, 4608989, 2704424, 2384975","abstract":"AIM\nTo study the effects of nitric oxide on calcium-activated potassium channels (KCa) in hypothalamus neurons.\n\n\nMETHODS\nThe data was recorded by adopting cell-attached or inside-out configuration of patch-clamp technique.\n\n\nRESULTS\nNitric oxide was found to increase the open probability of the channels directly or through increasing cGMP, which resulted from both the prolongation of open period and increase of open frequency.\n\n\nCONCLUSION\nNitric oxide could regulate calcium-activated potassium channels in hypothalamic neurons through alternative pathways.","cites":"0","conferencePercentile":"44.44444444"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"b8558ceaf962720b868ea8c3dc82857808bf3202","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2005","title":"[Protecting effect of human-derived neurotrophin-6 on retrogradely degenerated motoneurons of facial nucleus of rats].","authors":"Cheng-Wu Zhang, Zi-Cheng Li, Li Li, Yu Zheng","author_ids":"7923787, 2002854, 1748024, 1713117","abstract":"AIM\nThe protecting effect of human-derived neurotrophin-6 (NT-6) on injured neurons was investigated to test the neurobiological characteristics of human-derived NT-6.\n\n\nMETHODS\nAdult SD rats were used and divided into two groups, normal control group and experiment group. The right facial nerve of the experimental rats was sectioned. The experimental animals were subdivided into three groups, blank control group, NT-6 group and saline control group. The rats were raised for two weeks. Brain stem of the rats was removed and transversely sliced. Nissle stain and ChAT immunohistochemical stain of the slices were carried out to observe the role of NT-6 in protecting facial motoneurons.\n\n\nRESULTS\nThe number of the ChAT positive neurons and the intensity of Nissle stain in the facial nucleus of NT-6 group were significantly augmented compared with that of the blank and saline control groups.\n\n\nCONCLUSION\nThe human-derived NT-6 could partially protect the facial motoneurons from retrograde degeneration induced by their axon damage.","cites":"0","conferencePercentile":"47.05882353"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"7e88738cb3e281e8c6d3da612e1c60fb456dfde6","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2003","title":"[Effects of lidocaine and thiopental on the neuronal injury in rat hippocampus slice cultures].","authors":"Hong Cao, Jun Li, Jun Wang, Shi-Ming Duan, Yin-Ming Zeng","author_ids":"1686517, 3306969, 1791794, 4990433, 6921605","abstract":"AIM\nTo observe the effects of lidocaine and thiopental on the neuronal injury induced by the experimental ischemia in hippocampus slice cultures obtained from postnatal 22 days SD rats.\n\n\nMETHODS\nModel of the experimental ischemia was produced by hypoxia and glucose deprivation. Propidium iodide (PI) assay was used to observe the neuronal injury in CA1 and dentate gyrus (DG).\n\n\nRESULTS\nAfter experimental ischemia, the peak of PI index was appeared in CA1 and DG on the first day (P < 0.01), PI index in DG was less than in CA1 (P < 0.01). PI indices were still higher during seven days after the experimental ischemia than before the experimental ischemia (P < 0.01). 10 nmol/L and 100 nmol/L concentration of lidocaine could significantly decrease PI indices in CA1 and DG (P < 0.01). 250 nmol/L and 600 nmol/L concentration of thiopental also decreased the PI indices in CA1 and DG (P < 0.01). The neuronal injury peaks were postponed to the third day after the experimental ischemia by lidocaine and thiopental.\n\n\nCONCLUSION\nIt suggested that lidocaine and thiopental could decrease the neuronal injury in CA1 and DG induced by the experimental ischemia, and postpone the neuronal injury peaks to the third day after the experimental ischemia.","cites":"0","conferencePercentile":"44.44444444"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"4563c421d39c32dbe5a84b2a29ded0d739a390dd","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2011","title":"[The progressive effects of chronic intermittent hypoxia on cognitive function and the cholinergic neuron in rats].","authors":"Yan Chen, Chun-Ling Zhao, Chun-Lai Zhang, Qian Xu","author_ids":"1868151, 8132088, 7924037, 3218981","abstract":"OBJECTIVE\nTo investigate the relation between the progressive effects of chronic intermittent hypoxia (CIH) on cognitive function and the change of cholinergic neuron.\n\n\nMETHODS\nForty adult male Sprague-Dawley rats were randomly averagely divided into four groups: control group, CIH 1 week group, CIH 3 week group and CIH 5 week group. The cognitive function was assessed by the Morris Water Maze. The necrosis neurons in prefrontal cortex and hippocampus were observed and counted. The cholin acetyltransferase (ChAT) immunostained cells in prefrontal cortex and hippocampus were identified and quantitated.\n\n\nRESULTS\nThe spatial learning and memory impairments progressed from 1 to 5 5 weeks in rats. Compared with the control group, the cognitive impairments in CIH5w group were significant (P < 0.05). The degeneration or necrosis neurons in prefrontal cortex and hippocampus were significantly increased in CIH rats, and worsen gradually along with the hypoxia. The ChAT immunostained cells in prefrontal cortex and hippocampus were gradually reduced. The ChAT immunostained cells of prefrontal cortex and hippocampus in CIH3w group and CIH5w group were less than that in control group (P < 0.05).\n\n\nCONCLUSION\nChronic intermittent hypoxia induced slowly progressive spatial learning and memory impairments in rats, which maybe associated with the damage of neurons and the reduction of ChAT in prefrontal cortex and hippocampus.","cites":"0","conferencePercentile":"41.17647059"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"4ff364403744e7c3a5bf48fcff4968e5d10ad528","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2007","title":"[The relationship between the effects of curcumin on cerebral ischemia/reperfusion injury and immediately genic expressions of fos, Jun and NF-kappaB in hippocampal CA1 area and its significance in gerbils].","authors":"Hong Cao, Jun Li, Guang-ming Li, Yao-qi Wang, Yin-ming Zeng","author_ids":"1686517, 3306969, 7230108, 7709762, 8507265","abstract":"AIM\nTo explore the relationship between the effects of curcumin on cerebral ischemic/reperfusion injury and immediately genic expressions of Fos, Jun and NF-kappaB in hippocampal CA1 area.\n\n\nMETHODS\nGerbils were randomly divided into sham group (SH), ischemia/reperfusion group (I/R), curcumin group (CU) and solvent control group (SC). Forebrain ischemia was induced by occlusion of bilateral common carotid arteries. Observations were carried out in each group 15 min, 1 h, 2 h, 6 h, 1 d, 3 d, 5 d and 7 d after ischemia: open field test was used to examine the behavioral change, the apoptosis neurons in hippocampal CA1 region was counted, the expression of Fos, Jun and NF-kappaB in hippocampal CA1 was detected by SABC immunocytochemical technique.\n\n\nRESULTS\nThe behavioral mark and the number of apoptosis neurons in hippocampal (CA1 region was much less in CU group than in I/R group (P < 0.01) The expression of Fos was more and the expression of Jun and NF-kappaB was less in CA1 area in CU group than in I/R group (P < 0.01).\n\n\nCONCLUSION\nCurcumin can significantly protect neurons against cerebral ischemia, increasing the expression Fos and decreasing the expression of Jun and NF-kappaB may be the protective mechanisms.","cites":"0","conferencePercentile":"36.53846154"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"07dd369d23d8f67bdfb1805b848017412d2f5468","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2007","title":"[Changes of glycine uptake of synaptosomes of rat spinal cord in 0.7 MPa (7ATA) air pressure].","authors":"Gang Bi, Jian Zhang, Tao Yang, Jing-Chang Liu","author_ids":"7153400, 1686770, 1720792, 5895492","abstract":"AIM\nTo study changes of function of transmitter glycine in nitrogen narcosis.\n\n\nMETHODS\nSynaptosomes of rat spinal cord were prepared. Glycine uptake of synaptosomes of rat spinal cord in 0.7 MPa (7ATA) hyperbaric air pressure was observed by the methods of isotope.\n\n\nRESULTS\nGlycine uptake slowed down and took a longer period of time to reach saturation in 0.7 MPa (7ATA). The maximum glycine uptake was lessened. Vm was diminished, but Km was increased. Vm rose in 0.7 MPa (7ATA) when corticosterone was added.\n\n\nCONCLUSION\nWhen nitrogen narcosis arose in 0.7 MPa (7ATA), the function of transporters of glycine re-uptake was reduced, the affinity of glycine for transporters subsided. Corticosterone was conductive to the recovery of the function of glycine transporters of high affinity.","cites":"0","conferencePercentile":"36.53846154"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"0549aae43a5945e6ea8c7e2ed06724f30b37bba5","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2012","title":"[Effects of taurine on the ultrastructure and P2X7 receptor expression in brain following traumatic brain injury in rats].","authors":"Xin-Juan Li, Shuang Li, Xin-Qiang Li, Lin-Yu Wei, Dong-Liang Li","author_ids":"7824147, 1700248, 4154510, 4460549, 7379606","abstract":"OBJECTIVE\nTo explore the effects of taurine on the ultrastructure and P2X7 receptor protein expression in brain following traumatic brain injury (TBI) in rats.\n\n\nMETHODS\nForty male SD rats, were divided randomly into four groups that were sham-operated group, TBI group, TBI plus low-dose taurine group and TBI plus high-dose taurine group. The TBI model was established by Marmarou's method, the expression of P2X7 receptor protein in parietal cortex and hippocampus was detected by the immunohistochemical method, the ultrastructure of parietal cortex were observed by transmission electron microscope.\n\n\nRESULTS\nCompared with sham-operated group, the positive expression cells of P2X7 receptor protein in parietal cortex and hippocampus of TBI group were significantly increased (P < 0.01). Compared with TBI group, the positive expression cells of P2X7 receptor protein in parietal cortex and hippocampus of TBI plus low-dose taurine group and TBI plus high-dose taurine group were significantly decreased (P <0.01 or P <0.05). Compared with TBI plus low-dose taurine group, the positive expression cells of P2X7 receptor protein in parietal cortex and hippocampus of TBI plus high-dose taurine group were significantly decreased (P < 0.05 or P < 0.01). The pathological damage of parietal cortex in the TBI plus high-dose taurine group was obviously lightened.\n\n\nCONCLUSION\nTaurine exerts the neuroprotective effect on TBI in rats, the protective mechanism might be associated with down-regulating the expression of P2X7 receptor protein in parietal cortex and hippocampus.","cites":"0","conferencePercentile":"40"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"5ea32c569918109d3baf1325aa3c9837efb35684","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2015","title":"[Effects of polydatin on learning and memory and Cdk5 kinase activity in the hippocampus of rats with chronic alcoholism].","authors":"Xin-juan Li, Yan Zhang, Chun-yang Xu, Shuang Li, Ai-lin Du, Li-bin Zhang, Rui-ling Zhang","author_ids":"7824619, 8700541, 7520992, 1700248, 3933982, 7559972, 4804703","abstract":"OBJECTIVE\nTo observe the effects of polydatin on learning and memory and cyclin-dependent kinase 5 (Cdk5) kinase activity in the hippocampus of rats with chronic alcoholism.\n\n\nMETHODS\nForty rats were randomly divided into 4 groups: control group, chronic alcoholism group, low and high polydatin group. The rat chronic alcoholism model was established by ethanol 3.0 g/(kg · d) (intragastric administration). The abstinence scoring was used to evaluate the rats withdrawal symptoms; cognitive function was measured by Morris water maze experiment; Cdk5 protein expression in the hippocampus was detected by immunofluorescence; Cdk5 kinase activity in the hippocampus was detected by liquid scintillation counting method.\n\n\nRESULTS\nThe abstinence score, escape latency, Cdk5 kinase activity in chronic alcoholism group rats were significantly higher than those of control group (P < 0.05). The abstinence score, escape latency in high polydatin group rats were significantly lower than those of chronic alcoholism group (P < 0.05); Cdk5 kinase activity in high and low polydatin group rats was significantly lower than that of chronic alcoholism group( P < 0.05); immunofluorescence showed that the Cdk5 positive cells of chronic alcoholism group were significantly increased compared with control group (P < 0.05), and the Cdk5 positive cells of polydatin groups were significantly decreased compared with chronic alcoholism group ( P < 0.05).\n\n\nCONCLUSION\nPolydatin-reduced the chronic alcoholism damage may interrelate with regulation of Cdk5 kinase activity.","cites":"0","conferencePercentile":"54.54545455"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"82f0c2144da65e294b24ff01dfafea74e4f70657","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2008","title":"[The change of potassium current of neural stem cells cultured in vitro from newborn rat hippocampus].","authors":"Ying Xing, Zi-Juan Zhang, Ying Jing, Xue-Fei Han, Yan Xu, Wen-Hai Yan","author_ids":"2866794, 7969970, 2337030, 8479972, 4841658, 8194785","abstract":"AIM\nTo observe the change of potassium current on cultured neurons differentiated from hippocampus neural stem cells of the newborn rat.\n\n\nMETHODS\nNeural stem cells from newborn rat hippocampus were cultured in vitro and passaged continuously. Differentiation of the cell was induced by serum and removing mitogens. After differentiation cells were plated on plastic dishes and cultured for 1 d, 7 d, 14 d and 21 d. Whole-cell voltage patch clamp recording was used respectively to detect voltage-dependent K+ current.\n\n\nRESULTS\nAfter 1 d culture, no current was detected, and on the 7th d, 14th d, 21st d after differentiation, the amplitude of K+ currents was (18.077 +/- 2.789)pA/pF, (13.099 +/- 2.742)pA/pF, (34.045 +/- 8.067)pA/pF at +50 mV. The recorded K+ current included two components that could be blocked by TEA and 4-AP separately, assumed the slowly inactivating delayed rectifier K+ current (IK) and the fast inactivating transient outward K+ current (IA).\n\n\nCONCLUSION\nThe function of potassium channels on the hippocampus neural stem cells of the newborn rat approaches mature gradually when the time of differentiation becomes longer in vitro.","cites":"0","conferencePercentile":"45.45454545"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"05a30c1f9921a21e0eac6e2198ecdb22592fc071","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2016","title":"[The expression of Calbindin and Parvalbumin in auditory pathway of kit gene mutated C57BL/6J mouse].","authors":"Feng Zhang, Li Shen, Guo-qing Liang, Xia Sun","author_ids":"2985219, 1712125, 4433479, 8283496","abstract":"OBJECTIVE\nTo observe the expressions of Calbindin(CB) and Parvalbumin (PV), the two calcium-binding protein, in auditory pathway in mice of wild type C57BL/6J and kit⁺/kitW⁻ ²Bao, a kit gene mutant.\n\n\nMETHODS\nSix mutated kit gene kit⁺/kitW⁻ ²Bao mice and 6 wild type C57BL/6J (B6) mice were anaesthetized i. p. with chloral hydrate. After the mice were fixed by heart perfusion, the brains were removed and coronal sections were cut with a freezing microtome.\n\n\nRESULTS\nWe found that wild type mice had significant expressions of PV on ventral cochlear nucleus, anterior part (AVCN), ventral cochlear nucleus, posterior part (PVCN), inferior colliculus (IC) and auditory cortex (AC). CB was expressed in wild type mice on PVCN and nucleus of the trapezoid body (Tz). The mutant of kit gene induced the less expression of PV on PVCN, IC and AC (P < 0.01), but increased the expression of Tz (P < 0.01). CB could not be observed on PVCN in mutant mice, and the expression of AC was increased( P < 0.01).\n\n\nCONCLUSION\nCB and PV has differential expression level in auditory pathway. Since mutated kit gene can affect expression of PV on PVCN, IC, Tz and AC, as well as CB on PVCN and AC, it suggests that the mutation of kit gene can affect the advanced function of central nervous system in auditory pathway.","cites":"0","conferencePercentile":"60"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"b8b1e68644050e46e84ed534d8c26a753fa76dcb","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2008","title":"[Role of extracellular-signal regulated kinase cascade on cerebral ischemia and ischemic preconditioning in hippocampal neuron in gerbils].","authors":"Jun Li, Hong Cao, Qing-Quan Lian, Yao-Qi Wang, Yin-Ming Zeng, Shang-Long Yao, Bang-Xiong Zeng","author_ids":"3306969, 1686517, 6621541, 3923014, 6921605, 4306568, 8221817","abstract":"AIM\nTo investigate the role of extracellular-signal regulated kinase (ERK) cascade on cerebral ischemia and ischemic preconditioning in hippocampal neuron.\n\n\nMETHODS\nMale gerbils were randomly divided into sham group (SH), ischemia/reperfusion group (I/ R), ischemia preconditioning group (IP), specific antagonist of ERK-PD98059 (PD), solvent control groups (VE group), PD98059 combined with IP group (PIP). Forebrain ischemia was induced by occlusion of bilateral common carotid arteries and confirmed by isoelectricity of EEG. Observations were carried out in each group 15 min, 2 h, 4 h, 6 h, 1 d, 3 d, 5 d and 7 d after ischemia. Open field test was used to examine the spontaneous motor activity, the survival and apoptotic neurons, Fos and NF-kappaB masculine neurons in hippocampal CA1 region were counted, the expression of HSP70 in hippocampal CA1 region and p-ERK in hippocampal CA3/DG regions were detected by SABC immunocytochemical technique.\n\n\nRESULTS\nThe spontaneous motor activity, the number of apoptotic neurons and NF-kappaB masculine neurons at 1 d, 3 d, 5 d, 7 d in CA1 region were much less in IP group than in I/R group (P < 0.01). The number of Fos masculine neurons at 15 min, 2 h, 4 h, 6 h, 1 d in CA1 region were significant more in IP group than in I/R group (P < 0.01). The expressions of p-ERK and HSP70 were significantly higher in IP group than in I/R group. The number of Fos masculine neurons at each point were more and apoptotic neurons at 1 d, 3 d were less in PD group than in I/R group. Results of observation in PIP group were within IP group and I/R group.\n\n\nCONCLUSION\nActivation of ERK in CA3/DG regions were related to ischemic tolerance. Induction of the expression of Fos and HSP70, decreasing of the product of NF-kB which might be one of the molecule mechanisms playing an important role in neural protection of ischemic preconditioning.","cites":"0","conferencePercentile":"45.45454545"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"a5a4c49f3d073e424f334f3fc915909d77f63250","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2013","title":"[Effect of M8046 on expression of COX-2/PGE2 in spinal cord and DRG in rats with neuropathic pain].","authors":"Guo-Kun Ou, Rui-Xian Wang, Jia-Jia Li, Hong Cao, Qing-Quan Lian, Jun Li","author_ids":"6890099, 3864331, 8548855, 1686517, 6621541, 3306969","abstract":"OBJECTIVE\nTo investigate the effects of glucocorticoid receptor antagonist-M8046 on the behavior and the cyclooxygenase-2/prostaglandin E2( COX-2/PGE2) expression in spinal cord dorsal horn and dorsal root ganglia (DRG) in chronic constrictive injury (CCI) rats.\n\n\nMETHODS\nOne hundred and forty-four male SD rats were randomly divided into 4 groups, 36 rats in each group: Sham operation group (Sham), chronic constrictive group (CCI), M8046 treated group (M8046) and solvent controlled group (Sc). M8046 3 mg/(kg x d) intraperitoneal injection was given after operation in group M8046. Paw thennal withdrawal (PTWL) and paw mechanical withdrawal threshold (PMWT) of rats were measured on 2 pre-operative and 1, 3, 7, 10, 14 post-operative days. The spinal cord and L15 DRG of the operated side was removed at 3, 7, 14 days after surgery. The change of COX-2 and PGE2 expression was determined by immunohistochemical staining and ELISA separately.\n\n\nRESULTS\nPTWL and PMWT in CCI group were significantly lower than those in Sham group on every post-operative day (P < 0.05). PTWL and PMWT in M8046 group were significantly higher than those in CCI group on 7, 10, 14 post-operative day (P < 0.05). In spinal dorsal horn, the level of COX-2 and PGE2 expression in CCI group was significantly higher than that in Sham group (P < 0.05). M8046 could significantly attenuate the activation of COX-2 and PGE2 induced by CCI (P < 0.05). The expression of COX-2 and PGE2 in DRG was similar to that in spinal dorsal horn.\n\n\nCONCLUSION\nThe effects of M8046 ameliorate the CCI-induced neuropathic pain may be related to attenuate the expression of COX-2 and PGE2 in spinal cord and DRG.","cites":"1","conferencePercentile":"89.28571429"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"40c909dd9bcb539b7a5ba2bacde7fb5ac72375a9","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2014","title":"[Effect of dopamine receptor agonist apomorphine on scopolamine induced memory deficits in mice].","authors":"Hui-Di Yang, Zheng Yang, Tao-Di Liu","author_ids":"3887288, 1785641, 6036445","abstract":"OBJECTIVE\nTo research the mechanism of dopamine (DA) controlled memory in mice.\n\n\nMETHODS\nMice received i.p. injection of scopolamine (0.3 mg/kg, SCOP 0.3, and 3.0mg/kg, SCOP 3.0, respectively, n = 10) and saline (NS, n = 10) for 60 days in experiment 1. Memory of mice was detected by dark avoidance behavior in the 53\" d and the 60\"' d. Animals were sacrificed after the memory test; brain tissues were processed for Fos-ir and TH-ir by immunohistochemistry. Mice were divided into four groups according results of expri-ment 1, they received i.p. injection of apomorphine (0.1 mg/kg, APO 0.1, 0.5 mg/kg, APO 0.5, and 2.0 mg/kg, APO2.0 respectively, n = 10).\n\n\nRESULTS\nMemory was inhibited in mice injected scopolamine 3.0 mg/kg. Latency was significantly less than in NS group, only 1/ 4 that of NS group (P > 0.05). The number of mistake of SCOP 3.0 group increased about four times than that of NS group (P > 0.05). But there was no difference of latency and number of mistake between SCOP 0.3 and NS group in expriment 1. Scopolamine-induced memory deficit was associated with decreased cellular activation, indicated by Fos immunoreactive (ir) staining, in NAcc CA1 and CA3 (P < 0.05), and also associated with decreases in the number of cells labeled for tyrosine hydroxylase (TH-ir), the rate limiting enzyme for dopamine conversion (P < 0.01) and the number of cells co-labeled for TH-ir/Fos-ir (P <0.01) in the ventral tegmental area(VTA), apomorphine lessened scopolamine-induced memory deficit in experiment 2. The number of cells co-labeled for TH-ir/Fos-ir (P <, 0.05) was increased in VTA after apomorphine treatment.\n\n\nCONCLUSION\nApomorphine lessened scopolamine-induced memory deficit in mice by increasing DA activities in VTA.","cites":"0","conferencePercentile":"50"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"863d237dbfb5da2dc5861044989469e87c49db12","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2015","title":"Effects of curcumin on sodium currents of dorsal root ganglion neurons in type 2 diabetic neuropathic pain rats.","authors":"Bo Meng, Lu-lu Shen, Xiao-ting Shi, Yong-sheng Gong, Xiao-fang Fan, Jun Li, Hong Cao","author_ids":"7407726, 8674404, 8183068, 7420038, 8010010, 3306969, 1686517","abstract":"Along with the development of economy and society, type 2 diabetic mellitus (T2DM) has become one of the most common diseases at the global level. As one of the complications of T2DM, diabetic neuropathic pain (DNP) stubbornly and chronically affects the health and life of human beings. In the pain field, dorsal root ganglion (DRG) is generally considered as the first stage of the sensory pathway where the hyperexcitability of injured neurons is associated with different kinds of peripheral neuropathic pains. The abnormal electrophysiology is mainly due to the changed properties of voltage-gated sodium channels (VGSCs) and the increased sodium currents (I(Na)). Curcumin is an active ingredient extracted from turmeric and has been demonstrated to ameliorate T2DM and its various complications including DNP effectively. The present study demonstrates that the I(Na) of small-sized DRG neurons are significantly increased with the abnormal electrophysiological characteristics of VGSCs in type 2 diabetic neuropathic pain rats. And these abnormalities can be ameliorated efficaciously by a period of treatment with curcumin.","cites":"0","conferencePercentile":"54.54545455"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"c3b748942ee6f1f6804b8f0a22ac520e7b584bac","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2008","title":"[Detection of the thresholds of auditory brain-stem response in CBA, BALB/c, C57BL, KunMing mice and guinea pigs].","authors":"Li Yu, Hao Tang","author_ids":"1720783, 7799108","abstract":"AIM\nTo compare the thresholds of auditory brain-stem response (ABR) and frequency characteristics in five normal rodent species: CBA, BABL/c, C57BL, KunMing mice and guinea pigs.\n\n\nMETHODS\nAuditory brain-stem responses in four species of mice and guinea pigs were investigated with IHS-SmartEP 3.91 system. The thresholds and characteristics of ABR in each frequency were measured by the stimulated sound of tone-pip. Acoustic frequency-threshold curves in these five rodent species were made. The optimal response frequencies were assessed.\n\n\nRESULTS\nThe thresholds of guinea pigs were the lowest in five rodent species, and KunMing mice, CBA mice, BALB/c mice, C57BL mice in turn. All the thresholds of ABR in these experimental animals were the lowest in 10 kHz. The thresholds became increasing in higher frequency (> 10 kHz), and in lower frequency (< 10 kHz). This was a common characteristic in frequency threshold curves of ABR in these five rodent species.\n\n\nCONCLUSION\nThe hearing of guinea pigs was the best in these five rodent species. The hearing of KunMing mice was sharper than those of the other mice. Stimuli of 10 kHz was the optimal frequency in these live rodent species, and the optimal frequency range was from 8 kHz to 24 kHz.","cites":"0","conferencePercentile":"45.45454545"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"d1c01b4c22ed14b87a7d6ef318fdef16b7a89929","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2001","title":"[Effect of microsectioning medulla, pH and temperature on rhythmical respiratory discharge activity of medulla-spinal preparation isolated from newborn rat].","authors":"D H Hu, Z H Wu, Y Gao","author_ids":"1811433, 7806528, 2224931","abstract":"AIM AND METHODS\nThe brain stem and the spinal cord were isolated from 0-4-day-old rats, placed in a bath and perfused with artificial cerebrospinal fluid (aCSF) in vitro. Spontaneous rhythmic neural activity could be recorded from phrenic (C4v, C5v) and hypoglossal nerves (XII). By microsection of medulla of medulla-spinal preparation, rhythmical respiratory discharge activity (RRDA) of C4v, C5v and XII were observed.\n\n\nRESULTS\nMedulla-spinal preparation survival about six to eight hours when preparation was perfused continuously with aCSF. RRDA of C4v or C5v and XII was synchronous and continued about four to six hours. RRDA of C4v or C5v and XII could not be perturbed until a level of 500 microm rostral to obex was reached when cutting brain stem coronally in a rostral-to-caudal direction, and until a horizontal plane at middle level was reached when cutting brain stem dorsal-ventrally from dorsal surface of the stem. RRDA of XII also could not be perturbed until a level just caudal to the caudalis root of the XII (50 micro m caudal to the obex) when cutting brain stem caudal-rostrally. Frequency of respiration gradually decreased and amplitude of RRDA gradully enhanced when pH of fluid perfused from 7.45 up to 7.85, and RRDA enhanced when from 7.35 down to 6.85 and ceased when 4.5 RRDA enhanced when temperature of fluid perfused from 27 degrees C up to 37 degrees C, and decreased when from 38 degrees C up to 41 degrees C and when from 27 degrees C down to 23 degrees C, and ceased when 42 degrees C or 22 degrees C.\n\n\nCONCLUSION\nA respiratory rhythm generating site is located in mNRF, there are neurons those are susceptible to change of pH and temperature in mNRF.","cites":"0","conferencePercentile":"50"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"10622640df0f05e4c9095c425aa68b94cfc4fbcf","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2007","title":"[Neural stem cells transplantation improved learning and memory abilities in Alzheimer's disease rat].","authors":"Chun Yang, Qian Zhang, Shu-chun Wang, Peng Qiao, Zhao Zhang","author_ids":"4588259, 1737486, 2936612, 7271853, 7969104","abstract":"AIM\nTo investigate whether transplantation of neural stem cells can ameliorate learning and memory abilities in Alzheimer's disease (AD) rats.\n\n\nMETHODS\nNeural stem cells were isolated from dentate gyrus of hippocampus of newborn rats. After labeled with Hoechst33258, neural stem cells were grafted into the hippocampus of AD rats. 2 or 4 weeks post transplantation, the rats underwent behavioral testing using Y-maze trial. Fluorescence observation and immunohistochemistry were used after the rats were sacrificed.\n\n\nRESULTS\nNeural stem cells grafted into hippocampus of AD rats could not only survive well, but also possessed the capacity of continuous proliferation and migrate along the hippocampus.\n\n\nCONCLUSION\nNeural stem cells grafted into hippocampus of AD rats can not only survive well, possess the capacity of continuous proliferation, but also ameliorate memory defects in Alzheimer's disease rats.","cites":"1","conferencePercentile":"82.69230769"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"93849106bf0390087303851a1e0ba607e413cb61","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2016","title":"[The application of in vivo multi-channel recording methods in the studies of the affective pain in rats].","authors":"Zhen-hua Li, Yang Yang, Miao-miao Hou, Yuan Wang, Xia Qin, Che Zhang, Yu Zhang","author_ids":"7718743, 3432893, 8744225, 1724874, 7710460, 2888773, 1727577","abstract":"OBJECTIVE\nTo record the electrical activities of Antirior cingulate cortex (ACC) neurons by in vivo multi-channel recording methods using the model of complete freund's adjuvant (CFA) induced conditioned place avoidance (C-CPA), which has been set up in our previous studies.\n\n\nMETHODS\nThe electrode was self-made and the CPA responses were recorded by in vivo multi-channel recording method.\n\n\nRESULTS\n(1) The electrical activities of ACC neurons could be successfully recorded by the self-made electrode. (2) Before or after the injection of CFA, rats were respectively conditioned to the different place. The firing rates of ACC neurons in the CFA-paired place vs that in the non-CFA-paired place was (0.853 ± 1.377) imp/s vs (0.221 ± 0.971) imp/s (P < 0.05, n = 26). (3) The CPA responses in the CFA-paired place vs that in the non-CFA-paired place were (303.55 ± 61.77)s vs (140.32 ± 33.52)s(P < 0.05, n = 6).\n\n\nCONCLUSION\nThe firing rates of rACC (rostral Anterior Cingulate Cortex) neurons were involved in the occurrence of the affective pain.","cites":"0","conferencePercentile":"60"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"8a0004b8191849db98bc66707f22d0a2bb1e10eb","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2013","title":"[Expression of choline acetyltransferase in the rat barrel cortex by electrical stimulation].","authors":"Hong-Kun Fan, Chun Yang, Yan-Yan Zhang, Xiao-Ping Le, Chun-Guang Zheng, Li Shi, Qian Zhang","author_ids":"5513732, 4588259, 8700562, 4256149, 3566936, 8119432, 1737486","abstract":"OBJECTIVE\nTo observe a turning performance in the rats excited by using a proper electrical stimuli of the barrel cortex region (BC), and the expression of choline acetyltransferase (ChAT) in the BC regions after electoral stimulation.\n\n\nMETHODS\nSD rats were divided into three groups. The stimulation electrodes were surgically implanted into the bilateral BC regions in the control group and the experimental group rats. The experiment group post surgery for seven days was given the electrical impulses via connection with the electrodes for three times each day through consecutive three days. Three groups of the rats were killed and the brains were quickly removed for frozen sections and then performed with conventional HE and immunohistochemistry staining. And protein samples were prepared from brain and the hippocampus tissues of the three groups to detect the level of the ChAT protein by Western blot.\n\n\nRESULTS\nThe experimental rats turn left or right when continuously stimulation in the bilateral BC regions with electric pulse. HE staining showed no significant damage around electrodes in the cerebral cortex. Compared with the control and blank groups, the ChAT positive rate in the brain section in the experimental rats was significantly high by immunohistochemistry assay; the level of the ChAT protein in the rats given the electrical stimulation increased.\n\n\nCONCLUSION\nTurnings performance of the rat could be initiated hy electrical stimuli in the BC region. Expression of ChAT is significantly higher in the BC regions of rat under electrical stimulation, suggesting that acetylcholine might be associated with signal transmission between senses and movement behavior in the nervous central system.","cites":"0","conferencePercentile":"42.85714286"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"5f62b0cc6ee862696d3f9a4c78e7b08c168eb49d","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2001","title":"[The types of respiratory neurons in nucleus paragigantocellularis lateralis in rats and their responses to some medicines].","authors":"L H Li, Y Zheng, M L Xu","author_ids":"1870704, 1713117, 4669392","abstract":"AIM AND METHODS\nIn 36 anesthetized spontaneously breathing Sprague-Dawley rats, the types of respiratory neurons and the state of neurotransmitters and receptors in nucleus paragigantocellularis lateralis (PGCL) were studied with extracellular recording technique and multibarrel microelectrode techniques.\n\n\nRESULTS\nAt the caudal part of the PGCL(cPGCL) in 14 rats, a total of 39 respiratory neurons (RNs) were recorded including 24 inspiratory, 12 expiratory and 3 phase-spanning neurons. At the cPGCL in another 22 rats, we discovered that out of 14 RNs tested, 12 were excited by iontophoretic application of sodium glutamate (L-GLu), and all the 22 RNs tested were inhibited by gamma-aminobutyric acid (GABA). DL-2-amino-5-phosphonovaleric acid (AP5), an antagonist of N-methyl-D-aspartate (NMDA) receptor, and bicuculline (BIC), an antagonist of GABA(A) receptor, both showed three kinds of effects on the RNs discharge: excitatory, inhibitory and no-effect. AP5 could block partially the excitatory effect of L-GLu on a large part of RNs tested (6/9). BIC blocked, partially or completely, the inhibitory effect of GABA also on a large part of the RNs tested (9/11).\n\n\nCONCLUSION\nIt is implied that PGCL is one of the important neural substrates responsible for the regulation of respiration. There might exist endogenous glutamate and GABA acting as neurotransmitters in the cPGCL area and excitatory amino acids (including NMDA and non- NMDA) and GABA(A)-receptors on cPGCL neurons. These neurotransmitters and receptors may mediate the regulatory action of cPGCL on respiration.","cites":"0","conferencePercentile":"50"},{"venue":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","id":"799413266f35aaf715104ff5b24f3b6db3e1a5bf","venue_1":"Zhongguo ying yong sheng li xue za zhi = Zhongguo yingyong shenglixue zazhi = Chinese journal of applied physiology","year":"2008","title":"[Comparisons of several methods used to isolate outer hair cells and morphological observations in cochlea].","authors":"Yuan Tian, Li Yu","author_ids":"1696287, 1720783","abstract":"AIM\nThe comparison of several methods which were used to isolate cochlear outer hair cells and the observations of morphology were researched.\n\n\nMETHODS\nThree different separating methods of outer hair cells in cochlea were adopted; the morphology of outer hair cells in cochlea and the morphology of cochlear stretched preparation in Silver Nitrate staining were also investigated.\n\n\nRESULTS\nSingle alive OHC in cochlea was disassociated by all methods, with microscope and cochlear stretched preparation's staining. We could also observe appearances and distributions of OHC in cochlea.\n\n\nCONCLUSION\nIt is successful to isolate single alive cochlear OHC, and it will be very important to investigate deeply normal physiological functions and changes of functions and morphology in some pathologic status in cochlear OHCs.","cites":"0","conferencePercentile":"45.45454545"}]}