{"Zhongguo_zhen_jiu__Chinese_acup":[{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"b668285b0dd62d6ef60e90d46058039fbb13e994","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2015","title":"[Effects of acupuncture at left and right Hegu (LI 4) for cerebral function laterality].","authors":"Linying Wang, Chunsheng Xu, Yifang Zhu, Chuanfu Li, Jun Yang","author_ids":"7974512, 7521257, 5206803, 7430981, 1750537","abstract":"OBJECTIVE\nTo explore the cerebral function laterality of acupuncture at left and right Hegu (LI 4) by using functional magnetic resonance imaging (fMRI) and provide objective evidences for side selection of Hegu (LI 4) in the clinical application.\n\n\nMETHODS\nEighty healthy volunteers were randomly divided into a left-acupoint group and a right-acupoint group, and they were treated with acupuncture at left Hegu (LI 4) and right Hegu (LI 4) respectively. After the arrival of qi, the task-state fMRI data in both groups was collected, and analysis of functional neuroimages (AFNI) software was used to perform intra-group and between-group comparisons. After acupuncture, acupuncture feelings were recorded and MGH acupuncture sensation scale (MASS) was recorded.\n\n\nRESULTS\nThe difference of MASS between the two groups was not significant (P>0. 05). The result of left-acupoint group showed an increased signal on right cerebral hemisphere, while the right-acupoint group showed extensive signal changes in both cerebral hemispheres. The analysis between left-acupoint group and retroflex right-acupoint group showed differences in brain areas.\n\n\nCONCLUSIONS\nThe central effect of acupuncture at left and right Hegu (LI 4) is dissymmetry, indicating right hemisphere laterality. The right lobus insularis and cingulate gyrus may be the key regions in the acupuncture at Hegu (LI 4).","cites":"1","conferencePercentile":"98.88888889"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"34d1709cc25ef5914f396db4e567c6e479f4fcde","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2015","title":"[The theorotical basis for chronic fatigue syndrome from bladder meridian of foot-taiyang].","authors":"Fei Yao, Yi Zhao, Shichao Jiang, Min Fang","author_ids":"2093967, 1778267, 3586625, 8145657","abstract":"The bladder meridian of foot-taiyang is considered as key of six meridians and the yang of the yang, which is the pivot of transportation for qi and blood in the meridians and zang-fu. The running route and treatment characteristic of bladder meridian is closely related with chronic fatigue syndrome (CFS). The bladder meridian belongs to brain and connects with governor vessel, which has a close relationship with zang-fu function, quality of sleep and fatigue. Besides, the running route of bladder meridian is highly consistent with the surface projections of important anatomical structures such as muscle, nerve and sympathetic trunk, etc. Therefore, regulating the meridian-qi of bladder meridian can harmonize five-zang and calm the mind, but also effectively relieve physical and mental fatigue in CFS.","cites":"0","conferencePercentile":"48.88888889"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"c5d033d55b21e2cfa94b0f3a0598ba784304b96c","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2006","title":"[Effect of acupuncture at Sanyinjiao (SP 6) on glucose metabolism in the patient of dysmenorrhea].","authors":"Ping Gong, Ming-min Zhang, Qi Wang, Zhi-jian Wu, Xiao-tao Huang, Wei Wang, Guang-ying Huang","author_ids":"7817682, 5488139, 4849112, 1741020, 2896804, 2428792, 8252761","abstract":"OBJECTIVE\nTo investigate the central modulating mechanism of acupuncture at Sanyinjiao (SP 6) in treatment of primary dysmenorrhea.\n\n\nMETHODS\n18F-FDG positron emission tomograph imaging of whole brain was performed in six patients with primary dysmenorrhea during two stimulation: pseudo acupuncture and real acupuncture at Sanyinjiao (SP 6). The areas of cerebral glycometabolism change were obtained by using statistical parametric mapping (SPM). Meanwhile the pain intensity before and after pseudo-acupuncture and real acupuncture was assessed with 0-10 numerical pain intensity scale.\n\n\nRESULTS\nNo differences in the values of pain before and after pseudo-acupuncture (P > 0.05). The value of pain after acupuncture was significantly lower than that before acupuncture (P < 0.01). Most of the activated brain areas were shared with the areas activated by pain as described in the literature. The brain areas of increasing glycometabolism were ipsilateral lentiformn nucleus (globus pallidus, putamen), cerebellum and insula, bilateral thalamus, ipsilateral paracentral lobule, bilateral amygdala, contralateral midbrain, bilateral second somatosensory cortex, ipsilateral hippocampus and anterior cingulate, contralateral mammillary body. The brain areas of decreasing glycometabolism were limited in small cerebral cortex.\n\n\nCONCLUSION\nAcupuncture at Sanyinjiao (SP 6) can relieve significantly the pain of the patient. Primary dysmenorrhea is cured mainly by activating the area involved in pain. It is indicated that acupuncture can relieve pain and balancing the pain-related central networks. Also neuroendocrine may play a role in the therapy.","cites":"0","conferencePercentile":"32.14285714"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"79d0075f7cd9dfbcca666751b6cb967fe5657f34","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2012","title":"[Mild cognitive impairment disease treated with electroacupuncture: a multi-center randomized controlled trial].","authors":"Ling Zhao, Fu-Wen Zhang, Hong Zhang, Yu Zhao, Bo Zhou, Wei-Yin Chen, Man-Jia Zhu","author_ids":"1742329, 7855797, 1734058, 1729901, 3738572, 2002818, 8185031","abstract":"OBJECTIVE\nTo verify the clinical efficacy on mild cognitive impairment (MCI) treated with electroacupuncture (EA) intervention based on the principle as \"promoting the circulation of the Governor Vessel and regulating the marrow\" and plan to provide the A-grade evidence of the evidence-based medicine for the clinical treatment of this disease with acupuncture and moxibustion.\n\n\nMETHODS\nThe multi-center randomized controlled trial (RCT) was adopted. One hundred and ninety-two cases of MCI were randomized into an EA group and a nimodipine group, 96 cases in each one. In the EA group, EA was applied to Shenting (GV 24), Baihui (GV 20), Sishen cong (EX-HN 1) and Fengchi (GB 20), once every other day. In the nimodipine group, Nimodipine was pre scribed for oral administration. Four weeks constituted one course, the treatment of 8 weeks was required. The minimum mental state examination (MMSE) and the graphic recognition test (GRT) were applied before and in the 1st and 2nd session of treatment separately. The follow-up visit of MMSE scale was provided in the 1st, 3rd and 6th months after treatment separately.\n\n\nRESULTS\nThe total effective rate was 50.0% (47/94) in the EA group, which was superior to 34.4% (32/93) in the nimodipine group (P < 0.05). At the end of the 1st session treatment, the differences in MMSE total score and the cognitive, memory and speech dimensional scores were not significant statistically between two groups (all P > 0.05). At the end of the 2nd session treatment, the MMSE total score and the cognitive, memory, visual-space skill dimensional scores were improved in comparison before treatment (all P < 0.05). The results in the EA group were superior to those in the nimodipine group (all P < 0.05). But the difference in the speech dimensional score was not significant statistically between the two groups (P > 0.05). In the EA group, the GRT score was improved significantly after 2 sessions of treatment as compared with that before treatment (P < 0.01) and was superior to that in the nimodipine group (P < 0.05). In the 1st, 3rd and 6th month after treatment, the MMSE scale total scores were different significantly in statistics between the two groups (all P < 0.01). The long-term efficacy in the EA group was superior to that in the nimodipine group.\n\n\nCONCLUSION\nBoth of the EA therapy based on the principle as \"promoting the circulation of the Governor Vessel and regulating the marrow\" and the nimodipine program improve significantly the cognitive function of MCI patients. Compared with the nimodipine program, the EA therapy improves the comprehensive cognitive and the short-term memory abilities much more significantly and is especially advantageous at improving cognitive, memory and visual-space skill dimensions for MCI patients. In the half a year follow-up visit after the end of treatment, the long-term efficacy of EA is better than that of Nimodipine.","cites":"0","conferencePercentile":"41.66666667"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"418ba3897ee6e51e19873f9a465c013fa09d83d3","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2015","title":"[Effects of electroacupuncture on resting-state encephalic functional connectivity network in patients with PTSD].","authors":"Chengqiang Zheng, Lingxiao Tan, Tianxiu Zhou, Hong Zhang","author_ids":"4387614, 6210107, 6734796, 1734058","abstract":"OBJECTIVE\nTo explore the central regulatory mechanism of electroacupuncture (EA) on patients with post-traumatic stress disorder (PTSD).\n\n\nMETHODS\nFourteen patients of PTSD were selected as study objects and treated with \"regulating mind and restoring consciousness\" acupuncture method, in which Baihui (GV 20) and Shenting (GV 24) were used as main acupoints and Sishencong (EX-HN 1) and Fengchi (GB 20) were used as supporting acupoints for acupuncture. After the arrival of qi, Han's acupoint nerve stimulator was connected for 30 min per treatment, three times a week for consecutive 12 weeks. Before treatment and 12 weeks into treatment, the clinician administered PTSD scale (CAPS), self-rating anxiety scale (SAS) and self-rating depression scale (SDS) were evaluated; a Siemens 3.0 T magnetic resonance imaging system was used to perform resting-state scan, and bilateral hippocampus were taken as region of interested to perform encephalic function connectivity analysis.\n\n\nRESULTS\nAfter the treatment, the scores of CAPS, SAS and SDS were all reduced compared with those before treatment (all P<0.05) ; function connectivity was enhanced in bilateral hippocampus, right posterior central gyrus and left superior parietal lobule (2.3<Z<4.0, P<0.05), but the connectivity in left parahippocampal gyrus and right amygdaloid nucleus was suppressed.\n\n\nCONCLUSION\nElectroacupuncture has certain improving effects on PTSD symptoms, which is likely to be related with enhancing the connectivity between parietal lobe and hippocampus, suppressing the connectivity between hippocampus and parahippocampal gyrus, amygdaloid, leading to an indirect influence on limbic system.","cites":"0","conferencePercentile":"48.88888889"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"ef1f7fbb593c4b57878232f208fb217479c37af7","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2016","title":"[Acupuncture for aphasia: a retrospective analysis of clinical literature].","authors":"Jie Tan, Hong Zhang, Guodong Han, Kun Ai, Shifeng Deng","author_ids":"5212511, 1734058, 8632666, 1943682, 3919418","abstract":"With the Meta-analysis method, the clinical efficacy of acupuncture and other regular methods for aphasia was evaluated, and the acupoints selection for aphasia was explored. The acupuncture literature of clinical randomized control trials for aphasia published in CNKI, WANFANG, VIP and CBM database was searched; the statistical analysis of clinical efficacy of acupuncture and other regular methods for aphasia was performed by using software Revman 5. 2 provided by Cochrane library. A file of Microsoft Excel was established to perform the analysis of acupoints selection based on frequency analysis method, so as to summarize the characteristics and rules. Totally 385 articles were searched, and 37 articles those met the inclusive criteria was included, involving 1,260 patients in the acupuncture group and 1 238 patients in the control group. The Meta-analysis results showed OR = 3.82, 95% Cl [3.01, 4.85]; rhombus was located on the right side and the funnel plot was nearly symmetry, indicating the treatment effect of the acupuncture group for aphasia was superior to the control group (Z = 11.04, P < 0.000 01). The frequency-analysis results showed that the frequency of acupoints from top to bottom was Lian-quan (CV 23), Tongli (HT 5), Yamen (GV 15), Jinjin (EX-HN 12), Yuye (EX-HN 13), Baihui (GV 20), Yuyan II, Yuyan I and Yuyan III. The frequency of meridians from top to bottom was the governor vessel, extra channels, conception vessel, heart meridian and large intestine meridian. It is concluded that the clinical efficacy of acupuncture combined with speech rehabilitation training and medication treatment for aphasia is superior to that of speech rehabilitation training and medication treatment alone. The clinical treatment for aphasia focuses on its local effect; the main acupoints are in the head and face, and the meridians are governor vessel, extra channels and conception vessel.","cites":"0","conferencePercentile":"53.125"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"57fc3890224b843d1ca5a019c01d55c777e427c8","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2016","title":"[Impacts of numerology on acupuncture].","authors":"Min Chen, Changqiu Wu, Xueyi Wu","author_ids":"1711628, 5396937, 6287166","abstract":"Numerology has a long history in China and has the profound impacts on every academic field in TCM, with acupuncture involved. In this paper, the impacts on acupuncture were discussed in different aspects such as the numbers of meridians, the length of meridian, the time taboo of acupuncture, acupuncture manipulation and time acupuncture. It was found that numerology had laid the critical impact on acupuncture and had the profound imprint nowadays. It is of great significance to study the numerology theory in its impacts on acupuncture, in the exploration on the theories behind acupuncture as well as the comprehensive understanding of acupuncture.","cites":"0","conferencePercentile":"53.125"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"39a7918a439a90ac9720dfa3c6cacb328ce14740","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2011","title":"[Pattern of acupoint selection based on complex network analysis technique].","authors":"Yuan-Yuan Wang, Feng Lin, Zhong-Li Jiang","author_ids":"4450147, 3673120, 8324473","abstract":"To analyze the global structural models of point prescription in acupuncture therapy, and to provide new insights for acupoint selection based on syndrome differentiation. Taking prescriptions in the commonly used textbooks as the resources, a directed network of point prescription according to syndrome differentiation was constructed. The network was visualized with Pajek 1.25, the linkage distributions of points and symptoms were analyzed with Matlab 7.0. The result showed that there existed 1 635 combinations between 233 syndromes and 232 acupoints. The linkages of symptoms and selection of acupoints confirmed to the feature of random distribution with 5 points for each symptom in average. And the linkages obeyed a power-law distribution, which indicates that most symptoms can be treated by selecting a few points. Thus, it was concluded that complexity can be found in the global structural of relation between syndrome differentiation and acupoint selection. The selection of acupoints for every symptom and the matching of symptoms for every acupoint had different distribution patterns. The former obeyed a random pattern while the latter had a scale-free property. The complex network analysis is promised to be an available tool for researches on acupuncture prescriptions.","cites":"3","conferencePercentile":"100"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"1ad122e5761fbcfa7ddcec6d068b2c0f72c2bf4c","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2011","title":"[Perspectives of network thinking and network analysis applied on meridians and collaterals researches].","authors":"Feng Lin, Yuan-Yuan Wang, Zhong-Li Jiang","author_ids":"3673120, 4450147, 8324473","abstract":"The retrospective method of literatures was adopted and the epistemology of network thinking was integrated with the methodology of network analytic techniques so that the researches of meridian and collateral could be conducted in the new view of complex networks. The results indicate that meridian and collateral could be regarded as the complex networks composed of acupoints and meridians. The thinking and the methods of network analysis are ongoing to be applied to the paradigm of the analysis on meridian and collateral and it is expected that the paradigm could generate profound impacts on understanding the substance of meridian and collateral as well as on guiding clinical practice.","cites":"0","conferencePercentile":"30.64516129"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"77bbaa098ac4c6c68254da2497c9342eb69ec078","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2016","title":"[Meaning of exegetics research on acupoint name].","authors":"Min Chen","author_ids":"1711628","abstract":"Acupoint name has rich TCM meaning and cultural connotation and its nomenclature originates from ancient Chinese. In order to clearly explore the significance of acupoint name, the exegetics is used in this study. It is found that the study on acupoint name contributed to determining the controversial acupoint locations and revealing the cultural connotation and the basic TCM theory behind the acupoint. Additionally, it helps us to understand the effect mechanisms of acupoints [Tianshu (ST 25) is either for constipation or diarrhea as an example], dig the clinical effects of acupoints, discover and rectify the mistakes in nomenclatures such as pronunciation and glyph. All of these study results benefit the accurate and comprehensive recognition on the acupoints.","cites":"0","conferencePercentile":"53.125"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"1ceaa8653c77c7794d3982085f4aa92e7cbbe90c","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2014","title":"[Developmental status and prospect of musical electroacupuncture].","authors":"Fan Wang, Chun-Lan Xu, Gui-Rong Dong, Hong-Sheng Dong","author_ids":"6701355, 7521241, 8212263, 7503734","abstract":"Through searching domestic and foreign medical journals in CNKI, Wanfang database, VIP database and Pubmed database from January of 2003 to November of 2013, 39 articles regarding musical electroacupuncture (MEA) were analyzed. The result showed that MEA was clinically used to treat neurological and psychotic disorders; because it was combined with musical therapy and overcame the acupuncture tolerability, and MEA was superior to traditional electroacupuncture. However, problems such as low research efficiency and the mechanism of MEA superiority and the musical specificity not being revealed by research design still exist. In future, large-sample multi-center RCT researches should be performed to clarify MEA clinical efficacy. With modern science and technology and optimized study design, guided by five-element theory of TCM, researches on different musical elements and characteristics of musical pulse current as well as MEA's correlation with meridians and organs should be studied, so as to make a further exploration on MEA mechanisms and broaden the range of its clinical application.","cites":"0","conferencePercentile":"46.77419355"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"78a0b0a904651d6e67c1b3949b11920e83276fe6","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2009","title":"[Study of the relationship between the acupoints of Zhongzhu (TE 3), Yanglingquan (GB 34) and their corresponding cortical areas with the functional MRI].","authors":"Li-Fang Tian, Cheng Zhou, Min Chen, Ming-Zhu Zou, Zheng-Han Yang","author_ids":"8444391, 4618228, 1711628, 8238180, 6046783","abstract":"OBJECTIVE\nUsing the functional magnetic resonance imaging (fMRI) to observe the distributed characteristic of excited cerebral cortical areas that induced by acupuncture-stimulating the Zhongzhu (TE 3) of the meridian of Hand-Shaoyang and Yanglingquan (GB 34) of the meridian of Foot-Shaoyang, and investigate the central neural mechanism on the effect of meridians and acupoints.\n\n\nMETHODS\nForty-two right handed healthy volunteers were randomly divided into Zhongzhu (TE 3) group and Yanglingquan (GB 34) group. The functional cortical changes during acupuncture-stimulating the Zhongzhu (TE 3) and Yanglingquan (GB 34) were successively scanned with fMRI, and the effected areas were determined through analysing the obtained data with SPM2 software.\n\n\nRESULTS\nThe main excited areas were bilateral frontal lobes, temporal lobes, cerebellum and occipital lobes successively in Zhongzhu (TE 3) group, and bilateral occipital lobes, cerebellum, frontal lobes and temporal lobes in Yanglingquan (GB 34) group in contrast.\n\n\nCONCLUSION\nAcupuncture-stimulating both Zhongzhu (TE 3) and Yanglingquan (GB 34) can excite bilateral acoustic, visual and somatomotor cortices, which might be the central neural basis for clinical treatment on related diseases.","cites":"0","conferencePercentile":"34.84848485"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"dcd899ebb887b7cc812151c06babc4570d67033b","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2015","title":"[Mechanism progress on enteric nervous system of acupuncture for slow transit constipation].","authors":"Yuqin Li, Zhi Yu, Bin Xu","author_ids":"7771942, 2125223, 3448332","abstract":"In recent years, according to the etiology and pathology researches of slow transit constipation (STC) STC is considered as a kind of \"enteric neuropathy\", indicating it is a kind of disease caused by abnormity of the enteric nervous system (ENS). Through reviewing the mechanism of acupuncture to regulate STC, it is found out that there is a close relationship between acupuncture regulating STC and ENS. Through various channels including ganglion cells, nerve plexus, neurotransmitter and TRPV1 (the primary sensory neurons receptor of the ENS) of the ENS, acupuncture is likely to make comprehensive adjustment on STC.","cites":"1","conferencePercentile":"98.88888889"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"1cbfbe8020f721014a6abfbdb85c9fabb65f8fb4","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2014","title":"[Characteristics of acupoint selection of acupuncture-moxibustion for vertigo in history: a data mining research].","authors":"Xiang Li, Yi-Xia Shou, Yu-Lan Ren, Fan-Rong Liang","author_ids":"1737850, 5545162, 7800355, 8657877","abstract":"The data mining technique is adopted to analyze characteristics and rules of acupoint and meridian selection of acupuncture-moxibustion for treatment of vertigo at different time periods in the ancient. The data is collected from literature regarding acupuncture-moxibustion from the pre-Qin period to the end of Qing Dynasty, so as to establish a clinical literature database of ancient acupuncture-moxibustion for treatment of vertigo. Data mining method is applied to analyze the commonly used meridians, acupoints and special acupoints in different dynasties, also possible rules are explored. Totally 82 pieces of prescription of acupuncture-moxibustion for treatment of vertigo are included. In the history the leading selection of acupoitns are Fengchi (GB 20), Hegu (LI 4), Shangxing (GV 23) and Jiexi (ST 41) while that of meridians are mainly three yang meridians of foot and the Governor Vessel, especially the acupoints on the Bladder Meridian of foot yangming had the highest utilization rate, accounting for 23.04%. The acupoint selection is characterized by special acupoint, accounting for 80.6%, among which the crossing points are the most common choice. Distal-proximal acupoints combination is the most frequent method. The results indicate that the ancient acupuncture-moxibustion for treatment of vertigo focused on acupoints in the yang meridians, and the specific acupoints play an essential role in prescription; also the principle of syndrome differentiation and selecting acupoints along the meridians could be seen.","cites":"1","conferencePercentile":"96.77419355"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"ce2ca39fbfac4cfd26525c3b5862de9e17153af2","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2012","title":"[Study on inter-individual variability of cerebral response to acupuncture with fMRI].","authors":"Chun-Sheng Xu, Chuan-Fu Li, Jun Yang, Feng Bao, Yi-Fang Zhu, Gao-Bo Xiang, Jian-Jun Huang, Qi Lu","author_ids":"7521432, 7431013, 1750537, 1709702, 8246868, 5896956, 3202909, 8197476","abstract":"OBJECTIVE\nEffects of inter-individual variability on fMRI of acupuncture were observed and the possible influencing factors were further analyzed.\n\n\nMETHODS\nTwenty-six healthy volunteers were selected. And acupuncture was applied at Zusanli (ST 36) on the left side with even manipulation. The same experimental designation and data collecting reference were adopted to collect functional data. Then, the same data processing method was applied for analyzing individual data. Data which did not confirm with data analyzing qualification were rejected. The 26 individual data which met the requirement were taken randomly for 5 times according to the principle of random group division. Five groups named with A, B, C, D and E were thus generated with 11 samples in each. Images were processed with the AFNI software for every group, and the activated brain areas were revealed.\n\n\nRESULTS\nActivated areas in the brain were observed in all the 5 groups, and the results vary a lot among different groups. Decreased signals of activated brain areas were observed in group C, while increased signals were seen in group D. Partial increasing and partial decreasing signals appeared in the other 3 groups. Compared with other groups, group D demonstrated totally different activated areas. The rate of difference among different groups is 46.7%-100.0%, and most of the differences were over half of the activated areas.\n\n\nCONCLUSION\nUnder the pre-requisites of strict control of experimental designation, acupuncture method, data collecting and processing, great differences have been found in the activated areas of the brain. It indicates that obvious individual differences existes in the activated areas of the brain with acupuncture. And the difference may greatly influence the researching result of fMRI as well as conclusions of those results.","cites":"0","conferencePercentile":"41.66666667"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"1d688f803b36bb861443c5ba17333a2835a2b41a","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2011","title":"[Effect of acupoints with different tissue on electroacupuncture sensation].","authors":"Xiao-Ling Wang, Ji-Liang Fang, Ke-Hua Zhou, Yin Wang, Yang Hong, Jun Liu, Lei Wang, Chao Xue, Ting Zhao, Bao-Yan Liu, Bing Zhu","author_ids":"8415409, 7295189, 7234888, 7707864, 1690765, 1843598, 1743559, 7503273, 8200837, 7648389, 1706560","abstract":"OBJECTIVE\nTo evaluate the influence on frequency, intensity and the amount of current flow produced by electroacupuncture sensation of acupoints with different distributions (meridian category, tissue type and nerve innervations).\n\n\nMETHODS\nTwenty-one healthy volunteers were enrolled. According to the different tissue of acupoints, paired acupoints were grouped: Zusanli (ST 36) vs Yanglingquan (GB 34) (different meridian categories), Neiguan (PC 6) vs Daling (PC 7) (different tissue types), Zusanli (ST 36) vs Shuidao (ST 28) (different nerve innervations), Guanyuan (CV 4) vs Zhongwan (CV 12) (different nerve innervations), and Zusanli (ST 36) vs Guanyuan (CV 4) (different meridian categories, tissue types and nerve innervations). The electric frequency was 15 Hz. The electric current was under the participant's tolerance without sharp pain; the electroacupuncture was applied for three times with interval, 90 seconds totally. Soreness, numbness, fullness, heaviness, tingling, pressure, dull pain, warmness, coolness and amount of current flow were recorded, and the frequency, intensity and current amount between the paired acupoints were compared.\n\n\nRESULTS\nThere were no significant differences in frequency of needling sensations between paired points (all P > 0.05). In the 9 electroacupuncture sensations, fullness, numbness and soreness were most commonly seen and obvious, heaviness, pressure and tingling came second, and dull pain, warmness, and coolness occurred at lower frequency. There were differences in the intensity of acupuncture sensation between paired acupoints in part of them, the soreness, fullness and heaviness at Zusanli (ST 36) were stronger than those at Shuidao (ST 28) (all P < 0.05 ); fullness and numbness at Zusanli (ST 36) were stronger than those at Guanyuan (CV 4) (both P < 0.01); fullness at Guanyuan (CV 4) was stronger than that at Zhongwan (CV 12) (P < 0.05 ); the current flow of electroacupuncture was similar between paired acupoints (all P > 0.05).\n\n\nCONCLUSION\nIn the situation that there is no obvious difference in amount of current flow caused by electroacu puncture sensation, the obvious correlations between frequency of electroacupuncture sensation and tissue properties of acupoints are not appeared, and the difference of sensation intensity between paired acupoints may be associated with different nerve innervations. The frequency and intensity of electroacupuncture sensation at one acupoint are stable at different times.","cites":"0","conferencePercentile":"30.64516129"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"4fd3458e33d4f7c6e6e4da207b29521c5342a670","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2016","title":"[Discussion on different methods of painless needle insertion based on positions].","authors":"Chao Chen, Xuemin Shi","author_ids":"2067320, 3293981","abstract":"Based on multiple painless needle insertion skills in clinic combined with own experience, the authors propose the opinion that different painless needle insertion methods need to be used according to the positions where acupoints are. The appropriate needle insertion mean must be selected in accord with the anatomical characteristic of acupoint position, namely, tapping insertion is applied in scalp part, skin-pinching up needle insertion is used in forehead and superficial nerve trunk, fingernail-pressure needle insertion in ocular region and positions where large blood vessels distribute, flying acupuncture insertion in face and finger tip, vibrating needle in occipitonuchal region, quivering insertion in abdomen, quick pricking by single hand in the four limbs and back, and chop acupuncture in palm and pelma. The insertion methods are systematically discussed in terms of preparation, acupoint position, manipulation and attention, etc, so that to provide the reference for painless needle insertion.","cites":"0","conferencePercentile":"53.125"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"834eaf66e2b01d537e02edebec539cf254c44e0c","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2015","title":"[Clinical research of post-stroke motor aphasia treated with acupoint application of jieyu plaster combined with acupuncture].","authors":"Aihua Fei, Shengchao Cai, Bin Xu","author_ids":"7789643, 6879305, 3448332","abstract":"OBJECTIVE\nTo compare the difference in clinical efficacy on post-stroke motor aphasia among the combined therapy of acupoint application of jieyu plaster and acupuncture, simple acupuncture and simple acupoint application of jieyu plaster.\n\n\nMETHODS\nEighty-six patients of post-stroke motor aphasia were randomized into an acupuncture group (28 cases) , an acupoint application gruop (29 cases) and the combined therapy group (29 cases). In the acupuncture group, acupuncture was applied at the Speech No. 1 area and three-tongue needling points, once a day, 6 times a week. In the acupoint application group, jieyue plaster was applied to Yongquan (KI 1) and Laogong (PC 8), once a day, and the bilateral acupoints were selected alternatively. In the combined therapy group, the therapeutic methods of the first two groups were used in combination. The treatment lasted for 4 weeks in the three groups. The speech function score was observed and compared before and after treatment in the three groups and the efficacy was compared among the three groups.\n\n\nRESULTS\nThe total effective rate was 86.2% (25/29) in the combined therapy group, which was better than 67.9% (19/28) in the acupuncture group and 69.0% (20/29) in the acupoint application group (both P < 0.05). After treatment, the scores of spontaneous conversation, restatement and nomenclature in the speech function were all improved as compared with those before treatment in the three groups (all P < 0.01). The results in the combined therapy group were apparently better than those in the acupuncture group and the acupoint application group (all P < 0.01).\n\n\nCONCLUSION\nThe combined therapy of acupoint application of jieyu plaster and acupuncture apparently improves the speech function in the treatment of post-stroke motor aphasia and the efficacy is better than that of simple acupuncture or simple acupoint application.","cites":"0","conferencePercentile":"48.88888889"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"4f7e2cef2e1e2b7204f5a9c17a0309ef2b10c277","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2006","title":"[SHENG Xie-sun's experiences in application of the four important points of the Governor Vessel].","authors":"Feng Chen","author_ids":"1692998","abstract":"SHENG Xie-sun has unique experiences in location and needling methods of Baihui (GV 20), Dazhui (GV 14), Lingtai (GV 10) and Mingmen (GV 4) on the Governor Vessel. He holds that these are four important points on the Governor Vessel. Especially, he has own unique method in location of Baihui (GV 20) and Dazhui (GV 14). After correct location of Baihui (GV 20), the various points on all sides can be located according to the different distance; for location of Dazhui (GV 14), firstly Jugu (LI 16) on the bilateral shoulders are located accurately, and then Dazhui (GV 14) is located below the spinous process on the horizontal line between the two points. Point-through-point needling method and needle tip qi-inducing method are used. And he is good at application of moxibustion for treatment of difficult and complicated diseases and visceral diseases, and attains obvious clinical therapeutic effect.","cites":"0","conferencePercentile":"32.14285714"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"c8971cb59ec4c0b117a76ad4e522c20f87fe3e40","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2011","title":"[Deviation index of eye and mouth on peripheral facial paralysis].","authors":"Xue Li, Pin-Dong Liao, Min Luo, Bin-Ye Zhu","author_ids":"6990205, 3705845, 1681297, 4088922","abstract":"Differences of some points, levels and angles of the healthy and affected sides of patients with peripheral facial paralysis were picked out according to photographs. Through analysis of the index between the healthy and affected side of the patients and the difference between healthy people and patients, it is approved that those special points, levels and angles, which are called as deviation index of eye and mouth, can evaluate peripheral facial paralysis objectively and judge the degree of deviation. Therefore, it provides references for the diagnosis of facial paralysis and its degree judgement.","cites":"0","conferencePercentile":"30.64516129"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"f15f97eedce2053b2cb601c08cf3a23cda97fe38","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2011","title":"[Xie's articular needling and four pain-relieving points].","authors":"Jun Liu","author_ids":"1843598","abstract":"Xie's articular needling is handed down from the older generations of the family of Mr. XIE Jiguang, which is approved to have extensive indications and capable to treat various pain syndromes and Bi syndromes. Articular needling is a technique of puncturing the area at the junction of the joints, tendons and muscles. Local points and distal points are often combined in the application. The four pain-relieving points are held as distal points in articular needling, which refers to Sanjian (LI 3), Houxi (SI 3), Taibai (SP 3) and Shugu (BL 65). If pain occurs at one side of the body, the four points are supposed to be selected on the opposite side the affected area. While if pain occurs on both sides or for chronic cases, all the 8 points on both sides should be applied. For treatment of local and chronic pain, local points must be combined. Reinforcing manipulations with superficial insertion should be applied for deficient syndrome at the healthy side in most of the situations. Moreover, points around the umbilicus should be selected for tonifying the primary qi.","cites":"0","conferencePercentile":"30.64516129"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"9383cdb5c581d501c21e5d6eb1a9aad821396deb","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2015","title":"[Neurological protection effects of \"paraplegia-triple-needling method\" on rats with incomplete spinal cord injury].","authors":"Xiaohua Ke, Yu Wang, Anren Zhang, Yue Jiang, Chao Dong, Qian Wang, Shanshan Zhang, Shasha Chen, Binyang Huang, Sihui Gong","author_ids":"2503887, 2243979, 6409121, 2129713, 8062023, 1729612, 5114390, 7160385, 6993478, 6136009","abstract":"OBJECTIVE\nTo observe the neurological protection effects of \"paraplegia-triple-needling method\" on rats with incomplete spinal cord injury (SCI), so as to make a preliminary exploration on its mechanism.\n\n\nMETHODS\nA total of 45 SD rats were randomly divided into a paraplegia-triple-needling method group (group A), a regular acupuncture group (group B) and a model group (group C), 15 rats in each one. The rats model of incomplete spinal cord injury was established by modified Allen's method. The acupoints of governor vessel and back-shu points next to the vertebras of upper end and lower end of injured segment as well as motor points in key muscle of lower extremities were treated with acupuncture in the group A; the acupoints of governor vessel and back-shu points next to the vertebras of upper end and lower end of injured segment as well as \"Huantiao\" (GB 30), \"Housanli\" (ST 36), \"Yanglingquan\" (GB 34) and \"Genduan\"(Extra) were treated with acupuncture in the group B; rats in the group C received no treatment after model establishment but grabbing and immobilization. The needles were retained for 15 min in the group A and group B, once a day for 14 times. 1 d, 7 d and 14 d after model establishment, Basso Beattie Bresnahan (BBB) scores were observed in each group; the morphologic change of injured spinal cord and expression of positive cells of calcitonin gene-related peptide (CGRP) were observed. Results (1) One day after SCI, there was no significant difference of BBB scores among three groups (P> 0. 05); 7 days and 14 days after SCI, BBB scores in the group A and group B were significantly superior to those in the group C (all P<0. 05), and the BBB scores in the group A were superior to those in the group B ( both P<0. 05). (2) There was expression of CGRP positive cells in all three groups, and that in the group A and group B was significantly higher than that in group C (both P<0. 05); 14 days after treatment, the expression in the group A was higher than that in the group B (P<0. 05).\n\n\nCONCLUSION\nThe \"paraplegia-triple-needling method\" could obviously! improve the motor function of rats with SCI, especially the expression of neuroprotective factor CGRP, which is likely to be one of the mechanisms of neurological protection effect.","cites":"0","conferencePercentile":"48.88888889"},{"venue":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","id":"7bd72ed60596f78087184d0bacdde0332bb6d321","venue_1":"Zhongguo zhen jiu = Chinese acupuncture & moxibustion","year":"2013","title":"[Discussion on the regular of acupoint selection of acupuncture and moxibustion for lumbar disc herniation during recent 10 years].","authors":"Ju-Bao Li, Qi-Liang Xiong, Shang-Ke Qu, Feng Qi, Lei Zhang, Qi Wang, Ke Bao, Fan-Bing Li","author_ids":"5567435, 4198417, 5866406, 6041707, 1684635, 4849112, 1759090, 7279993","abstract":"By taking \"lumbar disc herniation\", Chinese medicine\", \"acupuncture and moxibustion\" as key words Chinese articles about acupuncture for lumbar disc herniation in recent 10 years were searched in three major Chinese databases of Wan fang database, VIP database and CNKI. Totally 546 relative articles were retrieved. After the elimination of invalid articles, 173 were included as valid articles with 49 main acupoints. The hierarchical clustering statistical method was used to analyze the possible rules among the former 20 acupoints. It turned out that there were 10 most common used acupoints on Bladder Meridian [Geshu (BL 17), Xiaochangshu (BL 27), Shenshu (BL 23), Dachangshu (BL 25), Pangguangshu (BL 28), Guanyuanshu (BL 26), Weizbong (BL 40), Zhibian (BL 54), Chengshan (BL 57), Kunlun (BL 60)], 2 on Gallbladder Meridian [Huantiao (GB 30), Yanglingquan (GB 34)], 2 on Governor Vessel [Yaoyangguan (GV 3), Shuigou (GV 26)], 2 on Stomach Meridian [Zusanli (ST 36), Juliao (ST 3)], 2 on Spleen Meridian [Sanyinjiao (SP 6), Xuehai (SP 10)], and the rest were extra points (Huatuo Jiaji) and Ashi points, so a conclusion could be drawn that the most common used acupoints were Bladder Meridian acupoints and supplemented by Gallbladder Meridian, Governor Vessel, Stomach Meridian, Spleen Meridian, extra points and Ashi points. The selected acupoints were most located on the lumbosacral region, leg and fewer located on the face, back and local part.","cites":"2","conferencePercentile":"94.82758621"}]}