{"Zhongguo_yi_liao_qi_xie_za_zhi_":[{"venue":"Zhongguo yi liao qi xie za zhi = Chinese journal of medical instrumentation","id":"3aa07ab1beda1f689f533e3058532522496734c6","venue_1":"Zhongguo yi liao qi xie za zhi = Chinese journal of medical instrumentation","year":"2005","title":"[Design and research on the measure analysis and QA system of gamma knife dose field].","authors":"Sean Liu, Ji-feng Guo, Hao Luo, Qian-hu Zhang, Hong Shen, Jia-cheng Hu, Zhong-fu Yao","author_ids":"8602785, 2354163, 1681638, 5150812, 7969826, 8520548, 5908654","abstract":"The measure analysis and QA system for gamma knife dose field and its pivotal techniques are described in this paper. By using our own measuring tools and analysis software, we have made a testing analysis about the HuaYuan Gamma Knife dose field with a satisfactory result.","cites":"0","conferencePercentile":"50"},{"venue":"Zhongguo yi liao qi xie za zhi = Chinese journal of medical instrumentation","id":"9b6b125395cc9eec6bbe387aabf92ee76e82c692","venue_1":"Zhongguo yi liao qi xie za zhi = Chinese journal of medical instrumentation","year":"2014","title":"[A method for impedance measurements based on EEG acquisition system].","authors":"Jilun Ye, Lanlan Wei, Fan Wang, Yantao Song, Xu Zhang","author_ids":"5563775, 7563734, 6701355, 2665274, 4174993","abstract":"In the bioelectric measurement, the electrode impedance detection is an important index to the signal quality evaluation and sensor electrode contact condition. In this paper, a method of accurately measuring the electrode impedance based on EEG measurement system was put forward, the method is based on the constant current source excitation signals which are added to the human body, by monitoring the human voltage to measure the electrode impedance. And different reference resistor calibration calculation in different sections was used to reduce the effect of constant current source on the precision of measurement results to improve the measurement accuracy.","cites":"0","conferencePercentile":"56.25"},{"venue":"Zhongguo yi liao qi xie za zhi = Chinese journal of medical instrumentation","id":"aa68cb6ad37eb0e0b938e4313bfffe490ddae4d7","venue_1":"Zhongguo yi liao qi xie za zhi = Chinese journal of medical instrumentation","year":"2015","title":"[Method to Calculate the Yield Load of Bone Plate in Four-point Bending Test].","authors":"Xiaohang Jia, Jun Zhou, Jun Ma, Yan Wen","author_ids":"3896354, 1728391, 8555835, 7507150","abstract":"This paper developed a calculation method to acquire the yield load P of bone plate during four-point bending test. This method is based on the displacement--force (δ-F) curve function f(M)(δ) obtained from the test, each slope of the curve was calculated using piecewise smooth function and the line segment in f(M)(δ) elastic deformation area was searched by setting the minimum slope T. Slope S was obtained through linear fit so as to build parallel displacement function f(L)(δ). Then, approximating intersection point of f(M)(δ) and f(L)(δ) was obtained through linear interpolation. Thus, yield load P was acquired. The method in the paper was loyal to YY/T 0342-2002 regulation and was liable to program calculation. The calculating process was nothing to do with whether the initial point during the test was preloaded or unloaded, and there was no need to correct the original point. In addition, T was set in an ideal fitting level guaranteed by the fitting coefficient of determination R2, and thus S was very close to the real value, and P was with a high accuracy.","cites":"0","conferencePercentile":"55.55555556"},{"venue":"Zhongguo yi liao qi xie za zhi = Chinese journal of medical instrumentation","id":"c589d78602a70ea6823b1db9000525746abb7dae","venue_1":"Zhongguo yi liao qi xie za zhi = Chinese journal of medical instrumentation","year":"2006","title":"[Research on the progress of neuroprosthesis for the limb motor system].","authors":"Bai-kun Wan, Jia Li, Dong Ming","author_ids":"1803102, 1687366, 1804383","abstract":"This paper reviews the current developing situation of neuroprostheses which are based on the functional electrical stimulation (FES) technique and are used to provide limb movements. It also discusses the major challenges of neuroprostheses, which will be faced in the future development and in the clinical applications for the rehabilitation of spinal cord injury and stroke.","cites":"0","conferencePercentile":"50"},{"venue":"Zhongguo yi liao qi xie za zhi = Chinese journal of medical instrumentation","id":"a9ee50f8abcd131691de4f7b86ae0d7e2e5b77a9","venue_1":"Zhongguo yi liao qi xie za zhi = Chinese journal of medical instrumentation","year":"2011","title":"[The research in a foot pressure measuring system based on LabVIEW].","authors":"Wei Li, Hong Qiu, Jiang Xu, Jiping He","author_ids":"2254858, 8131002, 1687961, 1806373","abstract":"This paper presents a system of foot pressure measuring system based on LabVIEW. The designs of hardware and software system are figured out. LabVIEW is used to design the application interface for displaying plantar pressure. The system can realize the plantar pressure data acquisition, data storage, waveform display, and waveform playback. It was also shown that the testing results of the system were in line with the changing trend of normal gait, which conformed to human system engineering theory. It leads to the demonstration of system reliability. The system gives vivid and visual results, and provides a new method of how to measure foot-pressure and some references for the design of Insole System.","cites":"0","conferencePercentile":"50"},{"venue":"Zhongguo yi liao qi xie za zhi = Chinese journal of medical instrumentation","id":"3cf28ffefc3d7504fd1b82c5ca8a1820fb4566ef","venue_1":"Zhongguo yi liao qi xie za zhi = Chinese journal of medical instrumentation","year":"2009","title":"[The laboratorial study about relation of balance between trestle and cervical spine of cervical type spondylosis patients].","authors":"Xi-jing Min, Rui-xin Cheng, Yong-xiang Tong, Liu Yang, Yi-wen Jin, Hua-ling Song, Song-hua Zhan","author_ids":"6367435, 6274390, 4088742, 1745614, 4609390, 6184334, 3426601","abstract":"When 85 cervical type spondylosis patients randomly lay on one's back and on one's right side the 8 different tresles and pillows. We survey indexes of the cervical spine anatomy, for example cervical arcs and angles of cervical spine and level line. We appraise relation of balance between different trestle or pillow and cervical spine. liquid needle-free injection, jet power, stagnation pressure","cites":"0","conferencePercentile":"55"}]}