{"Zhonghua_kou_qiang_yi_xue_za_zh":[{"venue":"Zhonghua kou qiang yi xue za zhi = Zhonghua kouqiang yixue zazhi = Chinese journal of stomatology","id":"8317ce19b7d83a218a35464a3b516401f36f025d","venue_1":"Zhonghua kou qiang yi xue za zhi = Zhonghua kouqiang yixue zazhi = Chinese journal of stomatology","year":"2016","title":"[Imaging analysis of temporomandibular joint anatomy changes after intraoral condylectomy combined with orthognathic surgery].","authors":"N J Luo, Z L Li, B Yi, C Liang, X Wang, X X Wang","author_ids":"7800635, 7719244, 5100828, 2536274, 1678690, 8681207","abstract":"OBJECTIVE\nTo quantitatively analyze the changes of facial symmetry and temporomandibular joint structure at different periods after intraoral condylectomy combined with orthognathic surgery, and to evaluate the long-term stability after the operation.\n\n\nMETHODS\nSpiral CT data of 10 cases treated by intraoral condylectomy combined with orthognathic surgery were collected, and then reconstructed by ProPlan software. Mark points were drawn on the 3D-images reconstructed immediately after the operation, and 6 months and 12 months after the operation. The measurements parameters included condylar axis angle in three dimensions, condylar-glenoid relative position and condylar facial morphology related indicators. The results were statistically analyzed by the consistency test and the variance of repeated measurement data.\n\n\nRESULTS\nThe facial asymmetry of the patients was corrected after operation, the height of the affected mandibular ascending ramus(T1: [67.81±6.95]mm, T2: [64.49±6.24]mm, T3: [63.05±7.07]mm)as well as the degree of pogonion deviation decreased(T1: [2.79±4.93]mm, T2: [0.37±4.20]mm, T3: [0.33 ± 3.97]mm)(P<0.05). But the tilt angle of the occlusion plane and the degree of mandibular height asymmetry had no significant difference between all the post-operative periods(P>0.05). The post-operative 3D changes of the position and shape of the resected and its contralateral condylar showed that the bilateral condylar axis angle in the horizontal plane gradually grew after operation(affected condyle: 71.95° ± 7.47°, 74.73°±8.44°, 76.56°±5.22°; control condyle: 72.60°±5.56°, 76.00°±5.30°, 77.19°±6.20° and had significant difference between all the post-operative periods)(P<0.05), the condyle moved slowly upward on both sides(superior space on the affected side: [8.78±4.38]mm, [4.11±2.49]mm, [3.27±1.96]mm; on the control side: [3.63±1.49]mm, [2.52±1.19]mm, [2.38±1.11]mm)(P<0.05), and moved inward only on the affected side(P< 0.05). All the above changes slowed down over time, and the disc-condyle-fossa relative position tended to be stable over time as well. The condyle diameter on the inside-outside direction gradually decreased on the affected side(T1: [14.98±2.39]mm, T2: [14.04±2.68]mm, T3: [13.74±2.89]mm)(P<0.05), and the surface morphology of the resected condyle was similar to the normal side. There were also some condylar surface morphological changes on the control side, but no statistical significance was found between different periods after the peration(P>0.05).\n\n\nCONCLUSIONS\nThe intraoral condylectomy combined with orthognathic surgery can eliminate condylar lesions effectively and correct the facial asymmetry caused by condylar benign tumor and hyperplasia. The facial symmetry can be maintained well after the operation, and the post-operative condylar morphology changes tended to be stable six months after the operation.","cites":"0","conferencePercentile":"56.25"},{"venue":"Zhonghua kou qiang yi xue za zhi = Zhonghua kouqiang yixue zazhi = Chinese journal of stomatology","id":"e42b089688195c541d8f845ea9c3830b8a9e4be5","venue_1":"Zhonghua kou qiang yi xue za zhi = Zhonghua kouqiang yixue zazhi = Chinese journal of stomatology","year":"2014","title":"[Quantitative evaluation of three-dimensional reconstruction accuracy of edentulous models in centric relation].","authors":"Yuchun Sun, Hong Li, Yong Wang, Yongbo Wang, Peijun Lyu","author_ids":"2194949, 4117903, 7134629, 7708707, 7597640","abstract":"OBJECTIVE\nTo reconstruct the centric relation of upper and lower edentulous dental models with two methods, to compare the reconstruction accuracy of the vertical and horizontal distance, and to provide some references to computer aided design and computer aided manufacture for complete denture.\n\n\nMETHODS\nDental models and rims made from five edentulous patients in clinical were obtained.Each model was stocked with 10 identical size positioning cylinders (20 cylinders on each pair models) on 5 side-surfaces of basement. Twelve center point pairs were paired between upper and lower models from 20 cylinder bottoms. The vertical and horizontal distances of 12 center point pairs were regarded as the evaluation items. Firstly, upper and lower models and rims were scanned separately. Then, models and rims (fixed in centric relation respectively with positioning articulator and rubber banding) were scanned.In software, all the data were registered to reconstruct centric relation based on common region. Digital models were measured with software tools, and real models were measured with a contact measurement arm. The differences of the homologous items between two methods were analyzed with paired-t test.\n\n\nRESULTS\nThe vertical distance errors for dental articulator positioning method was (0.356 ± 0.200) mm and that of the rubber band method was (0.382 ± 0.299) mm, and paired-t test between the two methods showed no significant differences (P > 0.05). The horizontal errors were (0.010 ± 0.411) mm and (0.104 ± 0.476) mm, and paired-t test showed significant differences (P < 0.05).\n\n\nCONCLUSIONS\nComparing with rubber band method, dental articulator positioning can significantly increases three-dimensional reconstruction accuracy of edentulous jaw gypsum models' horizontal relation.","cites":"0","conferencePercentile":"56.25"},{"venue":"Zhonghua kou qiang yi xue za zhi = Zhonghua kouqiang yixue zazhi = Chinese journal of stomatology","id":"b2fe1ff8c9679af15f8aed3c12bc3c52c760ec4b","venue_1":"Zhonghua kou qiang yi xue za zhi = Zhonghua kouqiang yixue zazhi = Chinese journal of stomatology","year":"2007","title":"[Effect of chewing-side preference on activation of parahippocampal gyrus during clenching task].","authors":"Hua Jiang, Hong-chen Liu, Zhen Jin, Gang Liu, Ke Li, Ya-wei Zeng","author_ids":"2459735, 8424949, 6253281, 1697913, 7031641, 8507109","abstract":"OBJECTIVE\nTo explore effects of chewing-side preference (CSP) on cerebral cortical response during clenching task with functional magnetic resonance imaging (fMRI).\n\n\nMETHODS\nSeven patients with left CSP and 7 patients with right CSP were selected to perform the maximum voluntary clenching in intercuspal position, and block designed blood oxygenation level-dependent (BOLD) fMRI scan covering the whole brain was carried out.\n\n\nRESULTS\nThere was activation in the parahippocampal gyrus in the four patients among seven with left CSP. But there was no activation in the parahippocampal gyrus among the patients with right CSP.\n\n\nCONCLUSIONS\nThis research shows that the parahippocampal gyrus, which is associated with human memory and study, is activated during clenching task in the patients with left CSP.","cites":"0","conferencePercentile":"75"},{"venue":"Zhonghua kou qiang yi xue za zhi = Zhonghua kouqiang yixue zazhi = Chinese journal of stomatology","id":"c7484f5b139eab1431d3986a16d1b9ff43133cc0","venue_1":"Zhonghua kou qiang yi xue za zhi = Zhonghua kouqiang yixue zazhi = Chinese journal of stomatology","year":"2009","title":"[Neuroplasticity in patients with implant supported full dentures].","authors":"Yan Chen, Ye Lin, Ke Li, Jian-hui Li, Ping DI, Zhen Jin","author_ids":"1700696, 2734767, 7031641, 8549402, 5479511, 6253281","abstract":"OBJECTIVE\nTo investigate the potential mechanism of \"osseoperception\" which is the sensory and motor experience associated with dental implants.\n\n\nMETHODS\nTwenty patients with implant supported full dentures or traditional full dentures were recruited in this study. Functional MRI (fMRI) scan covering the whole brain was carried out in these patients in clenching. The fMRI data were analyzed with SPM 99 software.\n\n\nRESULTS\nIn implant supported removable denture group, increased blood oxygen level dependent (BOLD) signals during clenching were found in prefrontal cortex, premotor cortex, superior parietal cortex, basal ganglion and thalamus. In implant supported fixed denture group, main activations were found in prefrontal cortex, primary sensory and motor cortex, Broca's area, premotor cortex, superior temporal cortex, insular, basal ganglion, thalamus and hippocampus. In traditional full denture group, significant activations were mainly found in prefrontal cortex, premotor cortex. Their activation maps showed the greatest individually dependent diversity.\n\n\nCONCLUSIONS\nSensory and motor feedback of central nervous system in patients with implant support fixed dentures is close to that of natural dentition. Mastication with traditional full dentures is more likely a process of task learning, memory and adaptation, which might be a more individually dependent restoration.","cites":"2","conferencePercentile":"100"},{"venue":"Zhonghua kou qiang yi xue za zhi = Zhonghua kouqiang yixue zazhi = Chinese journal of stomatology","id":"39cc6f72c75ea4c0e085e0090a30a6c2298c3f34","venue_1":"Zhonghua kou qiang yi xue za zhi = Zhonghua kouqiang yixue zazhi = Chinese journal of stomatology","year":"2010","title":"[Measurement of tactile threshold of natural teeth and its clinical significance].","authors":"Na Li, Qiu-fei Xie, Ye Lin, Qi Zheng","author_ids":"1748656, 7246624, 2734767, 3838610","abstract":"OBJECTIVE\nTo measure passive tactile threshold of natural teeth in six orthogonal orientations, to analyze impact factors, and to guide the occlusal adjustment in a personalized manner.\n\n\nMETHODS\nThe passive tactile thresholds of 218 natural teeth from 20 healthy subjects were measured in six orthogonal orientations using a digital test system for tactile function of teeth. The subjects were composed of 10 males and 10 females, with a mean age of 25 years. The natural teeth were tested from central incisors to first molars in maxilla and mandible. The passive tactile thresholds of teeth were measured respectively in the four horizontal orientations of labial (buccal), lingual, mesial and distal, and the two axial orientations of apical and coronal. The multilevel modeling (MLM) was used to analyze impact factors.\n\n\nRESULTS\nThe passive tactile thresholds of anterior teeth, premolars and molars were 16 (18), 38(57) and 105 (115) mN respectively. The difference between subjects was of statistical significance (P < 0.05). The three factors of tooth, gender and orthogonal orientation were disclosed to influence the passive tactile threshold of natural teeth (P < 0.01). The influence level of the factors was tooth > gender > orthogonal orientation.\n\n\nCONCLUSIONS\nA force level of 10 mN could be detected by natural teeth. There was statistical difference in the passive tactile threshold between subjects. The passive tactile threshold was affected with tooth, gender and orthogonal orientation.","cites":"0","conferencePercentile":"62.5"},{"venue":"Zhonghua kou qiang yi xue za zhi = Zhonghua kouqiang yixue zazhi = Chinese journal of stomatology","id":"2b6cc91a23e44d40aa27a7228cc12cce118749a3","venue_1":"Zhonghua kou qiang yi xue za zhi = Zhonghua kouqiang yixue zazhi = Chinese journal of stomatology","year":"2013","title":"[Three-dimensional finite element analysis of different reactive force direction of maxillary protraction on temporomandibular joint].","authors":"Rui Dong, Xu-xia Wang, Wen-juan Zhang, Jing Li, De-hua Zheng, Jun Zhang","author_ids":"2737566, 5368631, 8030735, 1742253, 4227790, 2156611","abstract":"OBJECTIVE\nTo analyze the influence of different reactive force direction of protractions on temporomandibular joint (TMJ) by establishing a three-dimensional finite element model (FEM) of craniomaxillofacial complex.\n\n\nMETHODS\nThe CT image of the head of a healthy young male volunteer was obtained.With the help of Mimics software, we established a three-dimensional finite element model of craniomaxillofacial complex which included TMJ. The force pattern of maxillary protraction appliance was imitated. The force (5 N) was applied on the chin and the direction of force was from 22° to 49° relative to the occlusal plane. The displacement and stress distribution of TMJ were analyzed.\n\n\nRESULTS\nThe contact stress on the maxilla decreased with the angle of the force direction increased from 22° to 40°, and increased with the angle increased from 40° to 49°. The stress on the condyle decreased with the angle of the force direction increased. The stress on the condylar neck decreased initially and then increased with the angle of the force direction increased. Comprehensively, the stress was the smallest when the angle of the force direction was 40°. The clockwise rotation of the mandible was found when the angle of the force direction was smaller than 40°. The displacement value was relatively small when the angle was 40°.\n\n\nCONCLUSIONS\nStress and displacement were relatively small when the angle of the force direction was 40° relative to the occlusal plane.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua kou qiang yi xue za zhi = Zhonghua kouqiang yixue zazhi = Chinese journal of stomatology","id":"f3aeebdd9dcdd4802c05a2115e5d5d1d40c74264","venue_1":"Zhonghua kou qiang yi xue za zhi = Zhonghua kouqiang yixue zazhi = Chinese journal of stomatology","year":"2005","title":"[Neuronal activities related to right-sided mastication detected with functional magnetic resonance imaging].","authors":"Qing-shi Zhang, Hong-chen Liu, Zhen Jin, Yan Chen, Ke Li","author_ids":"8326236, 8424949, 6253281, 1700696, 7031641","abstract":"OBJECTIVE\nTo observe neuronal activities related to right-sided mastication in cortex and to explore the effect of mastication on brain function.\n\n\nMETHODS\nNeuronal activities related to right-sided mastication were detected with functional magnetic resonance imaging in 10 healthy volunteers. Image data was analyzed by SPM99 software with the use of t test.\n\n\nRESULTS\nLocalization of activation in brain was different among subjects. Brain activation during mastication included left basal ganglion, Broca's area, angular gyrus and right supramarginal gyrus.\n\n\nCONCLUSIONS\nThe functional areas related to right-sided mastication and speech were closely connected, which indicated close relationship between mastication and speech. The central control of mastication might share part of common neural mechanism with that of speech. The roles of activated brain regions in mastication still remained to be elucidated.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua kou qiang yi xue za zhi = Zhonghua kouqiang yixue zazhi = Chinese journal of stomatology","id":"2aeec37c7414b842df9018a5d30bef731a229cee","venue_1":"Zhonghua kou qiang yi xue za zhi = Zhonghua kouqiang yixue zazhi = Chinese journal of stomatology","year":"2013","title":"[Preliminary study on tactile function of implant-supported single crowns].","authors":"Na Li, Qiu-fei Xie, Ye Lin","author_ids":"1748656, 7246624, 2734767","abstract":"OBJECTIVE\nTo measure passive tactile threshold of implant-supported single crowns (ISSC) in six orthogonal orientations, to analyze impact factors, and to guide the occlusal adjustment in a personalized manner.\n\n\nMETHODS\nThe passive tactile thresholds of 24 implant-supported single crowns (5 maxillary anterior teeth, 7 maxillary posterior teeth and 12 mandibular posterior teeth) from 19 ISSC patients (8 men and 11 women, from 25 years old to 56 years old) were measured in six orthogonal orientations (four horizontal orientations of labial or buccal, lingual, mesial and distal, and two axial orientations of apical and coronal) using a digital test system for tactile function of teeth.SPSS 19.0 for windows was used to analyze impact factors, using double-sided test, with a significance level of 0.05. Paired-samples t test was used to test the difference between implant-supported single crowns and the controlled natural teeth, and between different time points. One-way ANOVA was used to test the difference between different orientations, maxilla-mandibular anterior-posterior, and men-women.\n\n\nRESULTS\nThe passive tactile thresholds of ISSC and control teeth were (1282 ± 709) and (40 ± 40) mN respectively. The difference was of statistical significance (P < 0.001). The passive tactile thresholds of buccal-lingual, mesial-distal and axial of ISSC were (1334 ± 696), (1102 ± 605) and (1412 ± 791) mN respectively, of which, the difference between mesial-distal and axial was of statistical significance (P < 0.05). The passive tactile thresholds of ISSC of maxillary anterior teeth, posterior teeth and mandibular posterior teeth were (1003 ± 616), (1302 ± 620) and (1386 ± 769) mN respectively, of which, the difference between maxillary anterior teeth and posterior teeth was of statistical significance (P < 0.05). The passive tactile thresholds of ISSC of men and women were (1751 ± 784) and (946 ± 393) mN respectively, the difference was of statistical significance (P < 0.001). The passive tactile thresholds of ISSC of one-week and one-month after wearing the teeth were (1421 ± 826) and (1411 ± 814) mN respectively, the difference was of no statistical significance (P > 0.05).\n\n\nCONCLUSIONS\nThe passive tactile threshold of ISSC was more than 65 times as much as that of the natural teeth. There was statistical significance between different orientations, between maxillary anterior and posterior teeth, and between men and women. No statistical significance was found between maxillary and madibular posterior teeth and between one-week and one-month after wearing the teeth.","cites":"0","conferencePercentile":"50"}]}