{"Zhonghua_yi_xue_za_zhi.csv":[{"venue":"Zhonghua yi xue za zhi","id":"4dfb82576f70105ceb13fca1e7d0dc5ee2ad0cd1","venue_1":"Zhonghua yi xue za zhi","year":"2007","title":"[Executive function impairment in patients with temporal lobe epilepsy: neuropsychological and diffusion-tensor imaging study].","authors":"Xiang-qing Wang, Sen-yang Iang, Hong Lu, Lin Ma, Yan-ling Mao, Fei Yang","author_ids":"2273047, 4255985, 3655082, 1688132, 8070792, 1684164","abstract":"OBJECTIVE\nTo explore the cognitive changes and the relation with the parameters of DTI in the brain areas in patients with temporal lobe epilepsy by neuropsychological test and DTI study.\n\n\nMETHODS\nThirty-two patients with temporal lobe epilepsy, 11 males and 8 females, aged 32 +/- 12, with the education year of 8.6 +/- 1.2, and 42 sex, age, and education level-matched healthy controls underwent and a comprehensive test battery test including verbal fluency (VI), digit span (DSp), digit symbol (DSy), Stroop color-word test, trail making test, and so as to evaluate the intelligence level. Nineteen patients and twenty-one control subjects underwent diffusion tensor imaging (DTI) of the head. The correlation between the results of DTI and cognitive function tests of the patients was analyzed.\n\n\nRESULTS\nVI test showed that the number of word spoken in 1 min by the healthy control group was (16 +/- 4), significantly more than that of the patient group [(11 +/- 4), P = 0.00]. The DSp score of the control group was (14.6 +/- 3.1) points, significantly more than that of the patient group [(11.1 +/- 2.8), P = 0.00]. The number of DSy filled by the patient group was (47 +/- 17), significantly less than that of the control group [(60 +/- 16), P = 0.00]. The time needed to make trail of the patients was (56 +/- 20) s, significantly longer than that of the control group [(37 +/- 11) s, P = 0.01]. The Stroop reaction time of the patient group was (6.1 +/- 4.5) s, significantly longer than that of the control group [(30 +/- 5) s, P = 0.00]. The Stroop error number of the patient group was (6.1 +/- 4.5), significantly more than that of the control group [(1.4 +/- 1.2), P = 0.00]. The fractional anisotropy (FA) values of the posterior limb of left internal capsule and of the bilateral thalami of the patient group were significantly lower than those of the control group (P = 0.01 or P = 0.00). VI was negatively correlated with the mean diffusivity (MD) in left caudamen (r = -0.56, P = 0.04), right putamen (r = -0.58, P = 0.04), left putamen (r = -0.58, P = 0.04), and right thalamus (r = -0.64, P = 0.02), and was positively correlated with the FA in white matter of left frontal lobe (r = 0.43, P = 0.04)and left occipital lobe (r = 0.47, P = 0.02). DSp was negatively correlated with the MD in splenium of corpus callosum (r = 0.58, P = 0.04) and left putamen (r = -0.59, P = 0.04). TMT was positively correlated with the MD in the posterior limb of right internal capsule (r = 0.65, P = 0.02) and posterior limb of left internal capsule (r = 0.59, P = 0.03).\n\n\nCONCLUSION\nThe prefrontal cortex is a vital component of the circuitry subserving executive function. But the corresponding damaged area in patients with impaired executive function was not limited to frontal lobe,more areas beyond frontal lobe may be involved in executive function.","cites":"3","conferencePercentile":"97.05882353"},{"venue":"Zhonghua yi xue za zhi","id":"69d38b1a133232948e44c2d24f5bf378db485e8f","venue_1":"Zhonghua yi xue za zhi","year":"2014","title":"[Altered anatomical asymmetry in children with attention deficit/hyperactivity disorder: a pilot optimized voxel-based morphometric study].","authors":"Qingjiu Cao, Jue Wang, Li Sun, Peng Wang, Zhaomin Wu, Yufeng Wang","author_ids":"8124462, 1718812, 1703686, 1722767, 7806946, 7137816","abstract":"OBJECTIVE\nMounting evidence suggests that attention deficit/hyperactivity disorder (ADHD) is related with abnormal anatomical asymmetry in some brain regions, such as basal ganglia.However, few cross-sectional studies have examined the abnormalities of anatomical asymmetry in whole brain of ADHD. Thus this cross-sectional study was to explore the anatomical asymmetry in whole brain of ADHD with optimized voxel-based morphometry (OVBM).\n\n\nMETHODS\nTwenty-five boys with ADHD and 27 age and gender-matched controls were recruited. All participants were right-handed. The grey matter concentration of each voxel was calculated with OVBM. A statistical evaluation of grey matter asymmetry was then conducted on normalized grey matter images and their flipped counterparts.\n\n\nRESULTS\nOne-sample t-test revealed that the whole-brain anatomical asymmetry pattern was similar in two groups. Through group comparisons, ADHD showed reversed left-greater-than-right asymmetry in superior and middle frontal gyri versus controls.\n\n\nCONCLUSION\nAnatomical asymmetry of prefrontal cortex is abnormal in children with ADHD. And abnormal anatomical asymmetry may play an important role in the pathophysiology of ADHD.","cites":"0","conferencePercentile":"47.36842105"},{"venue":"Zhonghua yi xue za zhi","id":"1a0a1413ad2628bd460388f7cb45a0efab78d644","venue_1":"Zhonghua yi xue za zhi","year":"2014","title":"[Optimizing scan protocol in whole-brain vessel one-stop examination with 640-multislice computed tomography].","authors":"Guoquan Cao, Xiaojun Zhou, Huazhi Xu, Kehua Pan, Weijian Chen, Rui Li","author_ids":"4515798, 8453917, 5083903, 4597108, 3796277, 1704992","abstract":"OBJECTIVE\nTo explore the feasibility of optimized scan protocol in whole-brain vessel one-stop examination with 640-multislice computed tomography (640-MSCT) scanner.\n\n\nMETHODS\nA total of 28 patients undergoing whole-brain vessel examination but showing no obvious cerebral disease with 640-MSCT scanner between September 2012 and May 2013 were collected and divided into two groups of A (n = 14) and B (n = 14) . The recommended scan protocol (protocol 1: collecting 19 volumes) was applied in A group while the optimized scan protocol (protocol 2: collecting 15 volumes) formulated by reducing scanning phases reasonably and changing collection intervals in B group. The dose length product (DLP) was recorded automatically and effective dose (E) measured. The CT perfusion (CTP) values and computed tomographic angiography (CTA) images were analyzed for both groups. The regions of interest (ROI) of CTP images with area (20 ± 2) mm² were located in bilateral frontal white matter, parietal white matter, centrum semiovate, basal ganglia, occipital lobe and cerebellum. The image quality of CTA was evaluated by two experienced radiologists using double-blind method. The results were analyzed by statistics.\n\n\nRESULTS\nDose length product (DLP) in B group decreased 19.23% versus A group (3 419.40 vs 4 233.50 mGy·cm) .Every relative perfusion value of both sides from both groups were not statistically significant (P > 0.05) .Every relative perfusion parameter from individual territory in both groups showed no significant differences (P > 0.05) . The quality of CTA images between groups A and B were not statistically significant (P > 0.05) .\n\n\nCONCLUSION\nOn the premise that the accuracy of perfusion parameters and the quality of CTA images, the optimized scan protocol in whole-brain vessel one-stop examination can obviously reduce radiation dose and it has important clinical significance.","cites":"0","conferencePercentile":"47.36842105"},{"venue":"Zhonghua yi xue za zhi","id":"af747d11aa2d05ad49f9b79112aaa2b33ffd21f7","venue_1":"Zhonghua yi xue za zhi","year":"2009","title":"[Memory monitoring in mild cognitive impairment].","authors":"Xiao-San Wu, Huai-Dong Cheng, Kai Wang","author_ids":"7916771, 7915444, 3751236","abstract":"OBJECTIVE\nTo explore the profile of changes of memory monitoring in patients with mild cognitive impairment (MCI).\n\n\nMETHODS\nRey- auditory verbal learning test (AVLT) and feeling-of-knowing (FOK) test in episodic memory (EM) and semantic memory (SM) were conducted on 30 MCI patients, 17 males and 13 females, aged (66 +/- 9), and 30 age, education level, word fluency test, and digit span-matched healthy persons as healthy control (HC) group.\n\n\nRESULTS\nThe EM impairment of the MCI group was (13.7 +/- 2.8), significantly higher than that of the HC group [(8.1 +/- 2.0), P < 0.01], but the SM impairment of the MCI group was (5.4 +/- 1.4), not significantly different from that of the HC group [(5.0 +/- 1.4), P > 0.05]. The EM-FOK of the MCI patients with correct judgment and false recognition was (41.8 +/- 13.2)%, significantly higher than that of the HC group [(28.1 +/- 11.6)%, P < 0.01], however, the SM-FOK levels of the MCI patients with different judgment and recognition were all not significantly different from those of the HC group (all P > 0.05).\n\n\nCONCLUSION\nThe MCI patients overestimate their memory performance on episodic FOK, but their SM monitoring is not impaired. The deficit of memory monitoring in MCI may be the foundation of subjective memory complaints and is useful for diagnosis of MCI. EM and SM monitoring may depend on different neural mechanisms.","cites":"0","conferencePercentile":"47.5"},{"venue":"Zhonghua yi xue za zhi","id":"aeb6a69ac8a5879b18d481c8490e7e478cb4cc5d","venue_1":"Zhonghua yi xue za zhi","year":"2016","title":"[Effects of GABAB receptor expression level on cognitive impairment and Arc/Arg3.1 expression in induced epileptic rats model].","authors":"Yanping Lan, Tao Sun, Chun Zhang, Congcong Yuan, Zheng Yang, Feng Wang","author_ids":"5223419, 1710245, 7923471, 8675040, 1785641, 3279491","abstract":"OBJECTIVE\nTo investigate the effects of GABAB receptor on cognitive impairment by using pilocarpine induced kindled rats model and also to check early gene (Arc/Arg3.1) expression.\n\n\nMETHODS\nPilocarpine induced kindled rats were divided into four groups (Group normal, Baclofen, CGP and Kindled) randomly, and every group included 20 rats.We checked their cognitive impairment by using passive avoidance test and water maze test.The expression of GABAB receptor (GB1, GB2) and Arc/Arg3.1 was tested by immunohistochemical staining, RT-PCR and Western blot.\n\n\nRESULTS\nPassive avoidance test showed four Group rats shuttle times were 6.8±0.6, 1.2±0.2, 5.4±0.5, 3.6±0.3, incubation period were 26.1±3.9, 152.2±12.9, 65.8±7.0, 91.2±9.1, and water maze test had the same trend, with values in epilepsy groups significantly lower than the normal group of rats, which meant cognitive dysfunction.The above results also showed Baclofen further inhibited the learning and memory ability of the rats and CGP35348 promoted the learning and memory ability.The results of the Arc/Arg3.1 and GB1, GB2 level detection showed that epilepsy groups had significantly higher expression levels of Arc/Arg3.1 and GB1, GB2 than the normal group.Comparison among epilepsy groups showed that Baclofen group expressed lower levels of Arc/Arg3.1 and expressed higher levels of GB1, GB2, however CGP35348 group expressed higher levels of Arc/Arg3.1 and expressed lower levels of GB1, GB2.\n\n\nCONCLUSIONS\nGABAB receptor can affect the ability of spatial learning and memory of epileptic rats by regulating Arc/Arg3.1.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua yi xue za zhi","id":"b47481df217831accccb2c2185468115ef1c7625","venue_1":"Zhonghua yi xue za zhi","year":"2008","title":"[Functional magnetic resonance imaging-integrated neuronavigation and protection of brain function].","authors":"Yan Zhang, Shuo Wang, Yan Zhuo, Ming-Qi Yang, Yuan-Li Zhao, Dong Zhang, Rong Wang, Long Xu, Bo Wang, Lin Chen, Ji-Zong Zhao","author_ids":"3397757, 5994097, 2497070, 8724128, 7637266, 4944112, 1698066, 1690940, 1693029, 1726575, 7817852","abstract":"OBJECTIVE\nTo investigate the reliability and clinical value of functional magnetic resonance imaging (fMRI)-integrated neuronavigation in minimally invasive neurosurgery and protection of brain function. We demonstrate the correlation between the lesion-to-fMRI activation distance and occurrence of new postoperative deficit.\n\n\nMETHODS\nfMRI-integrated neuronavigation was used for minimally invasive neurosurgery in 20 patients with intracranial lesions located in or near eloquent brain areas. During standardized paradigms for hand, foot, and tongue movement, language and visual activation, echo-planar imaging T2 blood oxygen level dependent sequences were acquired by Siemens Medical Systems Trio 3.0 T and processed with SPM2. Neuronavigation was performed with Stealth station.\n\n\nRESULTS\nfMRI data was integrated into neuronavigation successfully in all cases, functional neuronavigation with integration of fMRI allowed easy and precise identification of the eloquent brain areas and lesions except for 1 case for brain shift because of tumor stroke just before the operation. The localization of the tumor was corrected by intraoperative ultrasonography. Gross total resection was achieved in 18 patients, 2 patients had a subtotal resection. Neurological deterioration was seen in 4 patients, tumors all located in eloquent brain areas, 2 patients were recovered in 3 months the morbidity was 10.0%. The distance of a lesion to fMRI activation was more than 10 mm in 14 cases. The functional maps were located in left Brodmann's 9, 46, 17, 18 and 19 areas in 11 cases when the patients reading and understanding the Chinese words.\n\n\nCONCLUSIONS\nFunctional neuronavigation with integration of fMRI allows precise identification of the eloquent brain areas protects the brain function and decreases the morbidity especially for Chinese patients because of our special functional area of language. Our data suggest that the distance of a lesion to fMRI activation was more than 10 mm, complete resection can be achieved safely.","cites":"1","conferencePercentile":"90.625"},{"venue":"Zhonghua yi xue za zhi","id":"5d8c1ba61f8d6aedfd07d3954f60c18ccfdb2967","venue_1":"Zhonghua yi xue za zhi","year":"2006","title":"[Anterior cingulate cortex involving in pain modulation-an functional magnetic resonance imaging study].","authors":"Ming Zhang, Yuan Wang, Hai Liu, Shi-zheng Zhang, Bo-lang Yu","author_ids":"3032572, 1724874, 1691690, 2076341, 4092798","abstract":"OBJECTIVE\nTo investigate the functional activation patterns of the subregions of anterior cingulate cortex (ACC) in human to electrical stimulation of different intensity with functional Magnetic Resonance Imaging (fMRI) and probe the contribution of this area in pain modulation network.\n\n\nMETHODS\n10 healthy right-handed volunteers were studied with different electrical intensity stimulation of 1-, 2-, or 3-time pain threshold. The fMRI data were collected by GE signa 1.5T MRI system and postprocessed with software of Analysis of Functional Neuroimages (AFNI) to generate the regional activation maps of ACC, furthermore, the distinctive characteristics of stimulation-BOLD signal in ACC subregions were analyzed according to the fMRI maps from the average of the 10 subjects.\n\n\nRESULTS\nThe anterior portion of ACC (aACC) showed moderate pain-attention-related activation but not statistically related to the strength of stimulation (average activated pixels of P1, P2, P3 amounted to 324, 429, 562 respectively). The BOLD signal showed a positive linear relation with the increasing stimulation at the dorsal-posterior portion of ACC (average activated pixels of P1, P2, P3 were 311, 964, 1414), which indicated stimulus intensity-dependent responses. The ventral-posterior area of ACC (vpACC) demonstrated pain intensity encoding because the BOLD signal had no significant difference during innocuous condition but displayed remarkable distinction during noxious stimulation in this area (average activated pixels of P1, P2, P3 were 324, 429, 562).\n\n\nCONCLUSION\nSubregions in ACC may play a varied role in the network of pain modulation. Each area of ACC displays segregated activation patterns in response to electrical stimulation with different strength.","cites":"0","conferencePercentile":"42.10526316"},{"venue":"Zhonghua yi xue za zhi","id":"d1e9cef7e7b5ef1b8c008239b9f6d9da8f61c7e7","venue_1":"Zhonghua yi xue za zhi","year":"2004","title":"[Therapeutic study of autologous Schwann cells' bridge graft into the brain of hemiparkinsonian monkey].","authors":"Bin Xu, Cheng-chuan Jiang, Li Zhang, Bao-ming Li, Zheng-ping Chen, Yi-hui Guan, Xing-dang Liu, Fu-lin Zhang","author_ids":"3448332, 4185343, 3047393, 7480624, 8157513, 7266872, 4958054, 6029170","abstract":"OBJECTIVE\nTo evaluate the therapeutic effect of autologous transplantation of Schwann cells as \"bridge\" between the medial forebrain bundle (MFB) and caudate nucleus, into the brain of hemiparkinsonian monkey.\n\n\nMETHODS\nSix monkeys were used following 6-OHDA-induced hemiparkinsonism. Three of them were autologous transplanted using Schwann cells as \"bridges\" between MFB and caudate nucleus. The Schwann cells were pre-treated using Hoechst33342. The other three monkeys received sham operation as controls. All the monkeys received behavioral assessment. The metabolism of dopamine was measured by SPECT using (99)Tcm-TRODAT-1 and PET using 18F-FP-beta-CIT. After a 4-month follow-up, the monkeys' brain were removed from the skull, fixed in 4% paraformaldehyde and cut into serial sections. A fluorescence microscope examination and a tyroxine hydroxylase (TH) immunohistochemistry study were made on the sections. Cell types were determined by double staining. The level of TH protein around the needle track was determined by Western blotting.\n\n\nRESULTS\nAll three monkeys, which had undergone Schwann cells autologous bridge graft showed a decrease in the disability score and two of them had an increase in motor activity. The apomorphine evoked rotation was also decreased. The symptoms of the monkeys, which received sham operation, had not amelioration. In SPECT examination, the radioactivity count was greatly increased in the grafted monkeys. The dopamine levels were significantly increased in the caudate nucleus from 61% (before graft) to 79% (after graft) while there's no change in control group. In histological examination, autologous Schwann cells could survive and migrate in the brain. Around the Schwann cells \"bridge\", there were numerous TH positive short fibers in the MFB area. Around the whole length of the \"bridge\", there were a lot of TH positive reactive astrocytes, especially in thalamus. TH protein around the needle track of the graft group was 243% compared with that of control group.\n\n\nCONCLUSION\nAutologous Schwann cells bridge graft is a feasible technique with therapeutic effects on parkinson disease monkeys. The Schwann cells play an important role in dopaminergic axonal elongation and in inducing the TH positive phenotype of reactive astroglia cell around it.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua yi xue za zhi","id":"68da67d7234586f3853e537de3242e3a05d4955c","venue_1":"Zhonghua yi xue za zhi","year":"2007","title":"[Repair of facial nerve with bioactive artificial nerve conduit: experiment with rats].","authors":"Huai-Dong Du, Liang Zhou, Hong-Bin Tian, Jie Tian","author_ids":"8593644, 4298828, 6463382, 8369505","abstract":"OBJECTIVE\nTo evaluate the effect of bioactive artificial nerve conduits in the repair of facial nerve defects.\n\n\nMETHODS\nSchwann cells (SC) were collected from the sciatic nerve and brachial plexus of a newborn SD rat, cultured, transfected with the plasmid pcDNA3. 1 (+)/GDNF containing glial cell line-derived neurotrophic factor gene, digested by pancreatin to make mixture of cell suspension to be injected into poly (L-lactic-co-glycolic acid) conduits. After injected with SCs, the conduits were cultured in for 2 weeks. Thirty female SD rat underwent buccal branch of facial nerve and then were randomly divided into 3 groups: Group A, undergoing direct anastomosis of the amputated dextral nerve; Group B, in which the 2 sides of amputated nerve were put into the PLGA conduit without transfected GDNF; and Group C in which the 2 sides of amputated nerve were put into the PLGA conduit with transfected GDNF. The motion of the facial muscles and whisker was observed. Two weeks, and 1, 2, and 3 months after the operation electrophysiological study was conducted to measure the action potential of the facial nerve. Then the rata were killed with their bilateral facial nerve and pontes were taken out to undergo histological examination.\n\n\nRESULTS\nCompound action potential could be detected in all groups at any time points except in Groups A and B 2 weeks after the operation. The values of compound action potential of Group C at different time points were all significantly higher than those of Groups A and B (all P < 0.01). However, there were not significant differences in the compound action potential values at any time point between Groups A and B (all P > 0.05). The mean number of myelinated nerve fibers, thickness of myelin sheath, and number of motor neuron of Group C were all significantly higher than those of Groups A and B (all P < 0.05).\n\n\nCONCLUSION\nConduit with SCs transfected with GDNF gene + PLGA is superior to that with SCs + PLGA and direct anastomosis in repair of facial nerve.","cites":"0","conferencePercentile":"38.23529412"},{"venue":"Zhonghua yi xue za zhi","id":"8835db063193a2dbbfe8b351ba161e5921234f7b","venue_1":"Zhonghua yi xue za zhi","year":"2005","title":"[Analgesic effect of intrathecal transplant of immortalized rat astrocyte strain genetically modified by human preproenkephalin gene on rat chronic neuropathic pain].","authors":"Ke An, Yu-ke Tian, Hui Yang, Xian-yu Wang, Xiao-gao Jin, Feng Gao, Ying Xu, Xue-bi Tian, Peng Wang","author_ids":"8413477, 5341998, 1682456, 8417465, 2026090, 1710132, 1851995, 7410211, 2157422","abstract":"OBJECTIVE\nTo observe the analgesic effect of intrathecal transplant of immortalized rat astrocyte genetically modified by human preproenkephalin gene (IAST/hPPE) on chronic neuropathic pain.\n\n\nMETHODS\n40 adult male Sprague-Dawley rats were randomly divided into four groups, 10 rats for each group. Naive group, SNI group, SNI + IAST group and SNI + IAST/hPPE group. The immortalized rat astrocyte (IAST) or IAST/hPPE co-incubated with bromodeoxyuridine (BrdU) in vitro were transplanted in the lumbar 4 to 6 subarachnoid space near the spinal cord 1 week after right side spared nerve injury (SNI). All animals were tested for bilateral 50% hindpaw withdrawal threshold (PWT) to a graded series of Von Frey hairs stimulation once a week from one week before SNI to six weeks after transplant, the difference value for right 50% PWT minus left 50% PWT was calculated and the effect of intraperitoneal naloxone on the analgesic efficacies was also observed. The content of L-EK in the spinal cord of L4 - 6 and was determined using immunohistochemistry and radioimmunoassay, and the expression of BrdU in grafts was determined using immunohistochemistry.\n\n\nRESULTS\nAllodynia-like behaviour after 1 week following SNI was observed. As compared with Naive group, the difference value for the right 50% PWT minus left 50% PWT in the other three groups was higher significantly (P < 0.01). The tactile allodynia induced by SNI was significantly alleviated during the 1 to 6 week period after transplantation of IAST/hPPE cells, but transplants of IAST cells had no effect on the allodynia-like behaviour. The difference value for the right 50% PWT minus left 50% PWT in SNI + IAST/hPPE group was lower significantly than that in the SNI and SNI +I AST group (P < 0.01), but there was no significant difference between SNI and SNI + IAST group (P > 0.05). The efficacies were reversed by intraperitoneal naloxone in SNI + IAST/hPPE group. The content of L-EK in the lumbar spinal cord in IAST/hPPE group (108.1 pg/mg +/- 12.5 pg/mg) was significantly higher than that in other three groups (P < 0.01), but there was no significant difference between SNI and SNI + IAST group (25.4 pg/mg +/- 1.9 pg/mg vs 28.0 pg/mg +/- 2.1 pg/mg, P > 0.05). Furthermore, The grafts in the surface of dorsal horn were still stained positively for BrdU, they survived greater than 6 weeks on the pia mater around the spinal cord.\n\n\nCONCLUSION\nIntrathecal transplant of IAST/hPPE cells could alleviate the allodynia-like behaviour after chronic neuropathic pain, which is associated with enkephalin secreted continuously from the grafts and conducted via opiate receptors.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua yi xue za zhi","id":"b67caee43418c40f2657f5461095104dd62f9a8b","venue_1":"Zhonghua yi xue za zhi","year":"2006","title":"[Deficit in risk-taking decision-making of patients with lesions of prefrontal cortex].","authors":"Chun-hua Xi, Xian-ming Fu, Kai Wang, Chao-shi Niu, Tatia M C Lee, Yu Meng, Chun-yan Zhu, Jing Du","author_ids":"3918313, 2823906, 3751236, 5334821, 8450760, 4626730, 4128146, 2727012","abstract":"OBJECTIVE\nTo investigate the influence of injury of prefrontal cortex on the risk-taking decision-making and to test the hypothesis that the orbitofrontal area is involved in the special network of risk-taking decision-making.\n\n\nMETHODS\n47 patients with lesions in the prefrontal lobe, 21 in the orbitofrontal area (OBF) and 19 in the dorsolateral prefrontal cortex (DLF), and 40 healthy controls (HC group) were administered with a risk-taking task.\n\n\nRESULTS\nThe risky response rate after punishment of the HC group was 0.54 +/- 0.23, significantly fewer than before punishment (t = -3.82, P < 0.01), and the risky response rate after punishment of the DLF injury group was 0.68 +/- 0.16, significantly fewer than before punishment too (t = -2.32, P < 0.05). The risky response rate after reward of the patients with lesions in OBF areas was 0.79 +/- 0.19, significantly higher than that of the HC group (0.68 +/- 0.16, P < 0.05), and the risky response rate after punishment of the patients with lesions in OBF areas was 0.82 +/- 0.18, significantly higher than that of the HC group (0.54 +/- 0.23, P < 0.05). The risky response rates after reward and after punishment of the DLP group were 0.72 +/- 0.22 and 0.63 +/- 0.25 respectively, both not significantly different from those of the HC group (both P > 0.05).\n\n\nCONCLUSION\nThe patients with lesions in the orbitofrontal area, not in the dorsolateral prefrontal cortex, have a specific deficit in risk-taking decision-making, i.e. an inhibition effect of punishment, reduced sensitivity to punishment but increased sensitivity to reward. The orbitofrontal areas play an important role in risk-taking decision-making processes.","cites":"0","conferencePercentile":"42.10526316"},{"venue":"Zhonghua yi xue za zhi","id":"cf2d6b3be205b501333fe5f61af030be7298b2d2","venue_1":"Zhonghua yi xue za zhi","year":"2013","title":"[Decision-making under ambiguity condition in epileptics].","authors":"Fei Xie, Yu-bao Jiang, Li-li Yuan, Kai Wang","author_ids":"2242247, 4595993, 8072761, 3751236","abstract":"OBJECTIVE\nTo investigate the ability of decision making under ambiguity condition in epileptics.\n\n\nMETHODS\nTwenty-five epileptics (EP) at our hospital during June 2011 to March 2012 and 25 healthy controls (HC) were surveyed by Iowa Gambling Task (IGT) with ambiguous probability. Statistical analyses were performed with analysis of variance (ANOVA) and independent sample t test. And α = 0.05 denoted the level of significant differences.\n\n\nRESULTS\nAs compared with HC, the epileptics were impaired in decision-making under ambiguity and scored lower in IGT (EP: -4.56 ± 10.26; HC: 4.32 ± 24.14; t = -2.23, P = 0.029). A comparison between the scores of subjects on 5 blocks suggested: HC subjects scored higher on block 3 (HC: 2.40 ± 7.07; EP: -1.44 ± 3.98) and block 5 (HC: 4.00 ± 7.46; EP: 0.00 ± 4.51) than the scores of EP subjects (block 3, F = 3.950, P = 0.022, block 5, F = 6.416, P = 0.027).\n\n\nCONCLUSION\nThe EP patients have significant impairment in decision-making under ambiguity.","cites":"24","conferencePercentile":"100"},{"venue":"Zhonghua yi xue za zhi","id":"874064e117a6fae809d7366ef343002fd968974d","venue_1":"Zhonghua yi xue za zhi","year":"2007","title":"[Relationship between TWIK-related acid-sensitive K+ channel-1 and TWIK-related acid-sensitive K+ channel-3 expression and the occurrence of central sleep apnea: experiment with rats].","authors":"Cheng Zhang, Jing Wang, Guang-fa Wang, Yao Wang, Li Su","author_ids":"3585347, 3282575, 8349785, 5017622, 1772994","abstract":"OBJECTIVE\nTo investigate the role of the TWIK-related acid-sensitive K(+) channel-1 (TASK-1) in the occurrence of sleep apnea.\n\n\nMETHODS\nBrain and muscle electrodes were put on 27 SD rats to monitor the apneic episodes. Then the rats were killed with their brains taken out. Western blotting was used to examine the expression of TASK-1 as well as its family member TASK-3 in the brainstem. Another 32 rats were randomly divided into 3 groups: intermittent hypercapnic hypoxia (IHH) group (n = 14, undergoing IHH 2 hours a day for 14 days), continuous hypoxia (CH) group (n = 6, undergoing CH for 2 hours everyday for 14 days), and normal control group (n = 10). On the day 15 the rats were killed with venous blood samples collected to undergo blood routine examination and brainstem samples collected to undergo Western blotting to measure the expression of TASK-1 and TASK-3. The relationship between TASK-1 and TASK-3 expression and the occurrence of central sleep apnea was analyzed.\n\n\nRESULTS\nIn the normal rats the spontaneous apnea index (SPAI) was positively correlated with the protein expression of TASK-in the brainstem and the ratio of the TASK-1 protein expression to the TASK-3 protein expression (r = 0.547 and 0.406 respectively, both P < 0.05). However, the post-sign apnea index (PSAI) was not correlated with the TASK-1 protein expression (P = 0.986), and both the SPAI and PSAI were not correlated with the TASK-3 protein expression (P = 0.986 and 0.916 respectively). Only the SPAI in the non-rapid eye movement. stage was positively correlated with the TASK-1 protein expression and the ratio of TASK-1 protein expression to TASK-3 protein expression (r = 0.601, 0.523 respectively, both P < 0.01). The TASK-1 protein expression of the IHH group was significantly higher than those of the CH group and normal control group (P = 0.032 and 0.004 respectively). The TASK-3 protein expression of the IHH group was significantly higher than that of the CH group (P = 0.005). There were no significant differences in the TASK-1 protein expression and that of TASK-3 between the CH group and the normal control group (both P > 0.05).\n\n\nCONCLUSION\nTASK-1 may play an important role in spontaneous sleep apnea.","cites":"0","conferencePercentile":"38.23529412"},{"venue":"Zhonghua yi xue za zhi","id":"98b24250225d4873ebb733945dceb045f3e32f8a","venue_1":"Zhonghua yi xue za zhi","year":"2014","title":"[Memory characteristic in boys with attention deficit/hyperactivity disorder comorbid learning disability].","authors":"Zhaomin Wu, Na Wang, Qiujin Qian, Li Yang, Ying Qian, Lu Liu, Yuxin Liu, Jia Cheng, Li Sun, Qingjiu Cao, Yufeng Wang","author_ids":"7806946, 1806730, 6587492, 5151236, 8677156, 1700049, 7894654, 2731172, 1703686, 8124462, 7137816","abstract":"OBJECTIVE\nTo explore the memory characteristic in boys with attention-deficit/hyperactivity disorder (ADHD) plus learning disability (LD).\n\n\nMETHODS\nA total of 97 ADHD boys with comorbid LD (ADHD+LD), 97 ADHD boys without comorbid LD (ADHD-LD) and 97 healthy controls (based on the criteria of DSM-IV) were recruited from the outpatient clinic of Peking University Sixth Hospital from December 2003 to September 2012. Individuals across three groups were matched by ages, intelligence quotient (IQ) and ADHD subtypes. The Wechsler Memory Scale (WMS) was used to access the characteristics of several memory domains.\n\n\nRESULTS\nADHD +LD group performed the worst and control group the best in memory quotient (MQ) (90 ± 15 vs 98 ± 14 & 104 ± 14) and long-term memory domain ((36.0 ± 10.2) vs (42.1 ± 7.8) & (45.6 ± 6.7) score, all P < 0.05) . ADHD+LD group scored significantly lower than the control group in short-term memory ( (53.0 ± 9.2) vs (58.0 ± 9.7) score, P < 0.05) and immediate memory domains ((10.0 ± 3.3) vs (11.3 ± 3.5) score, P < 0.05). However, ADHD+LD group scored slightly but not significantly lower than the ADHD-LD group ((54.9 ± 10.7),(10.8 ± 3.2) score, P > 0.05). In most subscales of WMS, ADHD+LD group scored significantly lower than both ADHD-LD and control group in current information and orientation, mental control (1→100) , mental control (100→1) and associate learning subscales ( (8.8 ± 3.1) vs (10.0 ± 3.0) & (9.9 ± 2.3) score, (8.7 ± 4.1) vs (10.0 ± 3.9) & (11.1 ± 3.6) score, (10.7 ± 3.9) vs (12.9 ± 2.8) & (13.7 ± 2.2) score, (9.8 ± 3.1) vs (10.8 ± 2.6) & (11.1 ± 2.1) score, all P < 0.05) . In mental control (accumulation) subscale, all pairwise comparisons were statistically significant (all P < 0.05) . In subscales of figure memory, visual reproduction and digit span, ADHD+LD scored significantly lower than the control group (all P < 0.05), but not the ADHD-LD group (all P > 0.05).\n\n\nCONCLUSIONS\nBoys with ADHD comorbid LD show deficits in overall memory function and long-term memory while short-term memory is partially damaged. Impairment in immediate memory is not detected.","cites":"0","conferencePercentile":"47.36842105"},{"venue":"Zhonghua yi xue za zhi","id":"f51db28dc1d209b342bac807ac375ccabac8d4a0","venue_1":"Zhonghua yi xue za zhi","year":"2013","title":"[Study of resting state functional connectivity of the red nucleus and substantia nigra were in normal adult].","authors":"Ning Wang, Jing-tao Wu, Wen-xin Chen, Yao Xu, Jing Ye, Yi-Li Yin, Hong-ying Zhang","author_ids":"1692369, 7162338, 7307752, 7870558, 2408310, 1957767, 7214890","abstract":"OBJECTIVE\nTo detect the functional networks of the red nucleus and substantia nigra during the resting state in normal subjects with functional magnetic resonance imaging (fMRI).\n\n\nMETHODS\nSixteen normal subjects were performed resting state fMRI scanning and susceptibility weighted imaging. The function connectivity networks base on seed regions of the red nucleus and substantia nigra were extracted from low frequency fluctuation signal in fMRI data by using a temporal correlation method. Individual functional maps were entered two-tailed one-sample t test to determine brain regions with significant positive correlation to the seeds. The statistic threshold was set at P < 0.001, cluster size>42 (336 mm(3)), cluster connectivity criterion 5 min with Alphasim correction.\n\n\nRESULTS\nBrain regions involved in the functional connectivity network of the red nucleus include: dorsal anterior cingutate, supramarginal gyrus, the ventrolateral and the ventromedial nucleus of the thalamus, globus pallidus, dorsal thalamus, hippocampus, substantia nigra, red nucleus, pons, dentate nucleus, vermis; Brain regions involved in the functional connectivity network of the substantia nigra include: anterior cingutate, supramarginal gyrus, globus pallidus, dorsal thalamus, hippocampus, lobus insularis, substantia nigra, red nucleus, pons, dentate nucleus. The distribution of the networks of the red nucleus and substantia nigra presented symmetrical. Although the functional networks of the red nucleus and substantia nigra over lapped largely with each other, the rubral network was slightly different with the nigral network, witch showed strong correlations with more wide-spread striatum and thalamus areas.\n\n\nCONCLUSION\nThe functional networks of the red nucleus and substantia nigra reflected strong interplay within the extrapyramidal subcortical system, as well as correlations between some limited cerebral cortices; Functional magnetic resonance imaging is a potential powerful tool to explore the extrapyramidal system.","cites":"0","conferencePercentile":"41.66666667"},{"venue":"Zhonghua yi xue za zhi","id":"d8e8595b976001f5409a523fb7979fd4b2cd73c1","venue_1":"Zhonghua yi xue za zhi","year":"2011","title":"[A study of microPET for assessing regional cerebral glucose metabolism and the expression of dopamine receptor type 2 in a rat model of Parkinson's disease].","authors":"Tian-lang Li, Jian-Fei Xu, Jing Wang, Hong Zhang, Shan-ying Mao, Shu-qun Wen, Yan Zhou","author_ids":"5939783, 7169572, 8708232, 1734058, 7301069, 8222153, 3626280","abstract":"OBJECTIVE\nTo employ (18)F-fluoro-2-deoxyglucose ((18)F-FDG) and (3-N-[(11)C] methylspiperone)(11)C-NMSP microPET to assess the changes of regional cerebral glucose metabolism and the expression of dopamine receptor type 2 (DRD(2)) in a rat model of Parkinson's disease (PD).\n\n\nMETHODS\nA hemiparkinsonian model was established in rats by unilateral pretreatment with 6-hydroxydopamine (6-OHDA). At 2 weeks after 6-OHDA insult, (18)F-FDG and (11)C-NMSP microPET scan were performed to compare the differences of regional cerebral glucose metabolism and the expression of DRD(2) between the PD and control groups respectively. The immunohistochemical staining was used to detect the expression of tyrosine hydroxylase in two groups.\n\n\nRESULTS\nIn the PD model, the glucose metabolism rates were 88.2% ± 2.2%, 94.5% ± 4.5% and 96.2% ± 5.8% respectively, in right striatum, hippocampus and sensorimotor cortex. And they were significantly lower than those in the control group [92.7% ± 2.8% (P < 0.01), 98.9% ± 3.9% (P < 0.01) & 102.8% ± 2.1% (P < 0.01)]. The expression of DRD(2) in right striatum was significantly higher in the PD group than that in the control group (112.9% ± 9.0% vs 102.3% ± 1.4%, P < 0.01).\n\n\nCONCLUSION\nIn the PD rats, glucose metabolism decreases in injured side striatum, hippocampus and sensorimotor cortex while and the expression of DRD(2) increases in injured side striatum.(18)F-FDG and (11)C-NMSP microPET can effectively assess the regional cerebral glucose metabolism and the expression of DRD(2) in PD. They may serve as effective molecular imaging tools for an early diagnosis of PD.","cites":"0","conferencePercentile":"41.42857143"},{"venue":"Zhonghua yi xue za zhi","id":"265d41e37eea0c64eb96a80c76b02e1312f13e42","venue_1":"Zhonghua yi xue za zhi","year":"2013","title":"[Assessment of cognitive function, emotions and activities of daily living in patients with multiple system atrophy].","authors":"Dong-dong Song, Ying-xin Yu, Qing-wen Dong, Hai-ling Zhang, Jian-guo Liu, Qi Liu, Jian Yu, Xiao-kun Qi","author_ids":"8065684, 7877120, 7278605, 7215072, 8190386, 1728293, 1740321, 7865149","abstract":"OBJECTIVE\nTo explore the cognitive function, emotional status and activities of daily living in patients with multiple system atrophy (MSA).\n\n\nMETHODS\nThirty-two MSA patients and 38 healthy controls from October 2009 to November 2012 were recruited from our hospital. Their cognitive function, emotional status and activities of daily living were assessed. Cognitive function was assessed by Montreal cognitive assessment (MoCA) and mini-mental state examination (MMSE); emotional status by self-rating depression scale (SDS) and self-rating anxiety scale (SAS); daily living and activities by activities of daily living scale (ADL). Data analysis was performed with SPSS 19.0. And the results were presented as the mean ± standard deviation. Comparison of means was performed with independent sample t test. And Pearson's correlation test was used for correlation analysis. A P-value <0.05 was considered significant.\n\n\nRESULTS\nMild or moderate cognitive impairment was documented in 71.9% of MSA patients. The scores of MoCA and MMSE in the MSA group were significantly lower than those in the control group. And the scores of ADL, SDS and SAS in the MSA group were significantly higher than those in the control group (P < 0.05). MoCA subitems such as space/executive function, attention, abstraction, language and delayed memory of the MSA group were significantly lower than those of the control group (P < 0.05). A negative correlation existed between the scores of MoCA and MMSE with disease duration (P < 0.01). There was a positive correlation between the scores of SDS and SAS with ADL and disease duration (P < 0.05). And the relationship was significant between the scores of SDS and SAS (P < 0.01). A positive correlation existed between scores of ADL with disease duration (P < 0.05).\n\n\nCONCLUSION\nMSA patients have certain degrees of cognitive impairment, emotion disorders and impaired ADL. Cognitive impairment in MSA patients may be more common than previously. Furthermore, the clinical features of cognitive impairment in these patients may have some clinical values for references.","cites":"0","conferencePercentile":"41.66666667"},{"venue":"Zhonghua yi xue za zhi","id":"fe9786840b2ec1ab7e13a79d31710f3011ddb520","venue_1":"Zhonghua yi xue za zhi","year":"2010","title":"[Comparison of deficits in visual cortex between anisometropic and strabismic amblyopia by fMRI retinotopic mapping].","authors":"Chuan-hai Jia, Guang-ming Lu, Zhi-qiang Zhang, Ze Wang, Wei Huang, Fei Ma, Jie Yin, Zhen-ping Huang, Qing Shao","author_ids":"4060377, 7232877, 7969553, 1790927, 1730584, 7285081, 3978641, 6196308, 7697543","abstract":"OBJECTIVE\nTo study the neural mechanism of visual cortical deficits between anisometropic and strabismic amblyopia comparatively by BOLD-fMRI retinotopic mapping.\n\n\nMETHODS\nTen anisometropic amblyopes, 10 strabismic amblyopes and 9 normal subjects underwent fMRI with retinotopic mapping and luminous spots stimuli (spatial frequency: 6 cpd, contrast: 0.5). 1.5T MRI system was used to obtain functional images of visual cortex. Responses in primary and secondary visual cortex were compared among the dominant (normal subject group), anisometropic and strabismic amblyopic eyes by one-way ANOVA, successively analyzed by paired-samples t test between amblyopic eyes and fellow fixing eyes (anisometropic and strabismic amblyopia group respectively). Their fMRI deficits of amblyopes were analyzed regressively in two amblyopia groups respectively.\n\n\nRESULTS\nThe result of one-way ANOVA showed significantly a lower activation (average T value) in V1, V2, V3, Vp and V7 visual areas (P < 0.05, P values 0.018, 0.007, 0.002, 0.000, 0.025 respectively) between anisometropic amblyopia and normal group. This was in accordance with the result of paired-samples t test between amblyopic eyes and fellow fixing eyes in anisometropic amblyopia group (P < 0.05, P values 0.035, 0.007, 0.020, 0.009, 0.023 respectively). Statistical difference was found in V1, V2 and Vp areas between strabismic amblyopia and normal group (P < 0.05, P values 0.010, 0.007 & 0.003 respectively). The paired-samples t test in strabismic amblyopia group showed statistical difference only in V2, Vp areas (P < 0.05, P values 0.026 and 0. 009 respectively. ). So the two results were discordant. Between the two amblyopic groups, there was no statistical difference (P > 0.05) except in V7 area (P < 0.05, P value = 0.048). There was no causal relation between the primary visual cortical deficits and the secondary cortex in amblyopia (P > 0.05).\n\n\nCONCLUSION\nAnisometropic amblyopia and strabismic amblyopia both have functional deficits in the primary and secondary visual cortex. The neural mechanism of secondary visual cortical deficits may be more complex than decreased cortex activation induced by the deficit of primary cortex. In the primary cortex, strabismic amblyopia and anisometropic amblyopia have neuronal deficits and/or abnormal interaction. In addition, strabismic amblyopia may also have suppressive influences of the fixing eyes upon the amblyopic eyes. Anisometropic amblyopia has the neural undersampling at a high spatial frequency in the secondary visual cortex as compared to amblyopic amblyopia.","cites":"0","conferencePercentile":"29.54545455"},{"venue":"Zhonghua yi xue za zhi","id":"1bc4fb35c2cbf01805401d7e990a89c9234513c2","venue_1":"Zhonghua yi xue za zhi","year":"1994","title":"[Electron microscopic observation of the denervated flap reinnervation after implantation of sensory nerve].","authors":"X Y Li, H Y Li, S Z Chen","author_ids":"2617520, 2670049, 7159643","abstract":"Flap reinnervation was studied by electron microscopy in the rabbit cervico-shoulder flap with great auricular nerve implanted. After transferring the flap to the dorsal defect of the rabbit's ear and division of its pedicle, the original nerve fibers of the flap underwent a degenerative process which would persist over 2 months. The great auricular nerve implanted into the flap regenerated axons by entering into old endoneurial rube of the flap and sprouting. The development process of the regenerating nerves showed that the unmyelinated fibers appeared first in the 2nd month, and the myelinated ones in the 4th month. The regenerating nerve fibers had often accompanied by blood vessels.","cites":"1","conferencePercentile":"100"},{"venue":"Zhonghua yi xue za zhi","id":"97f0c3326dc88306c70cb3c63ec0dd8a5faa7a88","venue_1":"Zhonghua yi xue za zhi","year":"2012","title":"[Changes of glutamate and γ-aminobutyric acid of extracellular fluid in hippocampus during electrical stimulation of anterior nucleus thalamus in rats].","authors":"Ning Chen, Fan-gang Meng, Jian-guo Zhang, An-chao Yang, Huan-guang Liu, Wen-han Hu, Da-wei Meng, Xin Zhang, Chong Liu, Yan Ge","author_ids":"3524369, 7555500, 1744844, 8026754, 8424505, 7849026, 7480939, 2542917, 2002428, 5497971","abstract":"OBJECTIVE\nTo explore the changes of extracellular glutamate (Glu) and γ-aminobutyric acid (GABA) in hippocampus during the high-frequency stimulation of anterior nucleus thalamus (ANT) in epileptic rats.\n\n\nMETHODS\nA total of 30 rats were divided equally into 2 groups:epilepsy model and normal control (n = 15 each). Concentric bipolar electrodes were stereotaxically implanted in bilateral ANT. A high-frequency stimulation of 130 Hz was applied in the epilepsy group. Microdialysis probes were unilaterally lowered into hippocampus. The concentrations of Glu and GABA in dialysate samples were determined by high-performance liquid chromatography (HPLC).\n\n\nRESULTS\nElectrical stimulation of ANT induced an increase of GABA and a decrease of Glu in hippocampus.\n\n\nCONCLUSION\nAn increase of GABA and a decrease of Glu during the electrical stimulation of ANT play an important role in the therapy of epilepsy.","cites":"0","conferencePercentile":"41.66666667"},{"venue":"Zhonghua yi xue za zhi","id":"54cbd10171c8d63534177c2d545f2ed7f4db6a81","venue_1":"Zhonghua yi xue za zhi","year":"2014","title":"[Effects of low-frequency electrical stimulation of hippocampus on the expression of GABAA receptor α1 and β2 subunits in kainate-kindled rats].","authors":"Guangming Yang, Feng Wang, Yang Li, Fazheng Shen, Wu Yang, Zibiao Li, Zhen Zhang, Tao Sun","author_ids":"8250730, 3279491, 1678662, 7892007, 7536459, 7718867, 5226883, 1710245","abstract":"OBJECTIVE\nTo explore the effects of low-frequency electrical stimulation (LFS) of hippocampus on the expression of GABAA receptor α1 and β2 subunits in the kainite (KA)-kindled rats and explore its underlying rescue mechanism for temporal lobe epilepsy.\n\n\nMETHODS\nThe SD rats were divided into 4 groups (n = 10):control group:no operation; epilepsy group:KA was stereotactically injected into rat hippocampus to establish KA-kindled model; sham-LFS group:only implanting of electrodes into hippocampus without LFS; LFS group:KA-kindled model with LFS. Then hippocampal tissues were collected and their expressions of GABAA receptor α1 and β2 subunits measured by immunohistochemistry, quantitative-polymerase chain reaction (q-PCR) and Western blot.Nissl staining was performed to detect the number of damaged hippocampal neurons.\n\n\nRESULTS\nThere were significant decreases of GABAA receptor α1 and β2 subunits in kindled hippocampus (P < 0.01). LFS resulted in an effective rescue, but failed to reach normal levels. The damaged neurons could not be reversed according to Nissl staining.\n\n\nCONCLUSION\nThe hippocampal application of LFS may protect against seizures by modulating the expressions of α1 and β2 GABAA receptor subunits.","cites":"0","conferencePercentile":"47.36842105"},{"venue":"Zhonghua yi xue za zhi","id":"0fef8185375505d9e9048729714eaec29c00ff7a","venue_1":"Zhonghua yi xue za zhi","year":"2014","title":"[Altered effective connectivity of insula in nicotine addiction].","authors":"Wu Yang, Feng Wang, Zhen Zhang, Xiang Ren, Zhiyuan Zhang, Yang Li, Tao Sun","author_ids":"7536459, 3279491, 5226883, 7924994, 1949845, 1678662, 1710245","abstract":"OBJECTIVE\nTo explore the changes of effective connectivity associated with insula in different nicotine addiction sessions so as to understand its role and function.\n\n\nMETHODS\nA total of 20 smokers received the scans of resting-state functional magnetic resonance imaging in two sessions of different conditions: smoking abstinence followed by smoking satiety. Group ICA was initially adopted to obtain the independent component patterns. And paired t-test of ICA spatial patterns revealed such regions of interest as insula, parahippocampus, precuneus, dorsal anterior cingulate cortex, rostral anterior cingulate cortex, supplementary motor area and ventromedial/dorsolateral prefrontal cortex and effective connectivity from insula to other regions was examined subsequently with GCA.\n\n\nRESULTS\nIn smoking abstinence, insula showed increased effective connectivity with dorsolateral prefrontal cortex, ventromedial prefrontal cortex, dorsal anterior cingulate cortex, rostral anterior cingulate cortex, precuneus; while in smoking satiety, there was no significant changes for effective connectivity. Referring to graph theory analysis, the insula was a causal output source in smoking abstinence.\n\n\nCONCLUSION\nInsula is a signal output node in smoking abstinence, with its interoceptive function monitoring the change of physiological state of body when in smoking abstinence, and then integrating each brain activity to produce subjective consciousness so as to facilitate addiction.","cites":"1","conferencePercentile":"97.36842105"},{"venue":"Zhonghua yi xue za zhi","id":"9b570817358f0c778da4814f37fd44d1b9ad796b","venue_1":"Zhonghua yi xue za zhi","year":"2012","title":"[Study of attentional bias in neglect patients by grey discriminant test].","authors":"Wen-wen Dong, Yang-hua Tian, Ling Wei, Kai Wang","author_ids":"6441954, 3410641, 3044996, 3751236","abstract":"OBJECTIVE\nTo explore the attentional bias in unilateral spatial neglect (USN) patients.\n\n\nMETHODS\nThe grey discriminant test was conducted on 12 right-brain-damaged patients with USN (USN+), 12 right-brain-damaged patients with no evidence of USN (USN-) and 20 health controls (HC). They were matched for age, years of education, mini-mental state examination (MMSE) scores and handedness. And all patients were recruited from First Affiliated Hospital of Anhui Medical University. The attentional deviation scores were compared between three groups.\n\n\nRESULTS\nThe differences in scores of neglect tests for the USN+, USN- and HC groups were significant (Albert test: USN+ group -0.56 ± 0.39, USN- group 0.00 ± 0.00, HC group 0.00 ± 0.00, F((2, 41)) = 33.708, P < 0.001; line bisection test: USN+ group 0.28 ± 0.29, USN- group 0.03 ± 0.04, HC group -0.02 ± 0.04, F((2, 41)) = 14.527, P < 0.001; clock drawing by memory: USN+ group 3.58 ± 4.03, USN- group 0.08 ± 0.29, HC group 0.00 ± 0.00, F((2, 41)) = 12.558, P < 0.001; daisy copying: USN+ group 0.83 ± 0.65, USN- group 0.13 ± 0.23, HC group 0.00 ± 0.00, F((2, 41)) = 21.621, P < 0.001). The comparative results of lesion locations showed that USN+ patients were predominantly related to lesions in temporal-parietal junction. The attentional deviation scores for the USN+, USN- and HC groups were 0.92 ± 0.11, 0.41 ± 0.12 and -0.28 ± 0.15 respectively. The difference was significant (F((2, 41)) = 334.324, P < 0.001). There was with a small leftward bias in the HC group and a rightward bias in the USN+ and USN- groups. LSD test revealed that the USN+ group displayed a rightward bias much strongly than the USN- group (P < 0.001). And the results of grey discriminant test were consistent with the neglect symptoms.\n\n\nCONCLUSIONS\nThe USN patients show a marked attentional bias toward the right side of space. And it may be attributed to the dysfunction of temporal-parietal junction.","cites":"0","conferencePercentile":"41.66666667"},{"venue":"Zhonghua yi xue za zhi","id":"a9ca3329416a54254763de0e85b6f4f24c3726f4","venue_1":"Zhonghua yi xue za zhi","year":"2013","title":"[Altered patterns of functional connectivity of posterior cingulate cortex on resting-state magnetic resonance imaging in children with attention-deficit or hyperactivity disorder].","authors":"Shuo Yang, Xuan Dong, Su-hong Wang, Ting Wu, Yan-ling Ren, Dan-dan Wang, Wen-juan Tu, Yang Yi, Ai-bin Zheng","author_ids":"4573336, 2172137, 3114382, 1683507, 2416360, 5472658, 8709278, 1783127, 8042805","abstract":"OBJECTIVE\nTo explore the pathophysiological changes in the functional connectivity of posterior cingulate cortex (PCC) with other brain regions in children with attention-deficit or hyperactivity disorder (ADHD) on resting-state functional magnetic resonance imaging(fMRI) and explore the neural mechanisms of ADHD at the point of relationships between brain regions.\n\n\nMETHODS\nThirty children with ADHD from the Third Affiliated Hospital of Soochow University from June 2008 to April 2010 and another 30 age-and-gender-matched controls from a normal primary school over the same period underwent resting-state fMRI scans. And blood oxygenation level dependent (BOLD) signal was acquired to calculate the functional connectivity of PCC with other brain regions controls. Significant differences of connectivity between groups were analyzed with REST software.\n\n\nRESULTS\nThe pattern of functional connectivity of PCC for the ADHD group was similar to that of the control group. Significant positive functional connectivity with PCC was observed in the default mode of network (DMN) while negative functional connectivity was present in dorsolateral prefrontal cortex, anterior cingulate, parietal cortex and basal ganglia(all P < 0.05, corrected). Compared to the controls, the ADHD group exhibited decreased positive connectivity with PCC in bilateral medial prefrontal cortex (0.07 ± 0.20 vs 0.33 ± 0.23, t = -5.47), right posterior cingulate gyrus(0.25 ± 0.28 vs 0.48 ± 0.30, t = -3.44), right inferior temporal gyrus (-0.05 ± 0.19 vs 0.22 ± 0.22, t = -4.61) and cerebellar posterior lobe (-0.04 ± 0.21 vs 0.17 ± 0.16, t = -3.99), while decreased negative functional connectivity with PCC was observed in left insula (-0.10 ± 0.26 vs -0.30 ± 0.19, t = 3.71), right inferior parietal lobule (0.02 ± 0.18 vs -0.23 ± 0.17, t = 5.20), left postcentral gyrus (0.08 ± 0.26 vs -0.17 ± 0.25, t = 4.06), left superior temporal gyrus (-0.04 ± 0.25 vs -0.27 ± 0.17, t = 4.27), right superior temporal gyrus (-0.08 ± 0.25 vs -0.31 ± 0.21, t = 3.80) and left fusiform gyrus (-0.01 ± 0.25 vs -0.18 ± 0.17, t = 3.57)(all P < 0.05, corrected).\n\n\nCONCLUSIONS\nThe connectivity of DMN between brain regions is abnormal in ADHD group. And the strengthen of negative relationship between DMN and task activated network becomes reduced. It is surmised that the decreased internal synchronization of default network and disrupted balance between DMN and prefrontal-parietal attentional networks may be important neural mechanisms of ADHD.","cites":"0","conferencePercentile":"41.66666667"},{"venue":"Zhonghua yi xue za zhi","id":"080d30c2d3c8e8cd3b8154398309de5ebd8f1f01","venue_1":"Zhonghua yi xue za zhi","year":"2004","title":"[Establishment of temporal epilepsy models and its permanent epilepsy sensitivity].","authors":"Zhong-xu Yang, Guo-ming Luan, Li Yan, Ying Zhang","author_ids":"5827511, 4839846, 1736165, 1752812","abstract":"OBJECTIVE\nTo explore a better method to establish an animal model of temporal epilepsy in rat and study the pathological basis of permanent epilepsy sensitivity.\n\n\nMETHODS\nKainic acid (KA) with the dosage calculated according to the body weight was injected into 30 Wistar rats' hippocampuses by stereotactic operation. Videotape recording was used to record the seizures for 8 weeks. Two rats were randomly selected to undergo craniotomy and electroencephalography and then were killed to have their brains to be taken out to undergo slicing, staining, and histological examination 6 hours, 1 days, 3 days, 5 days, 7 days, 2 weeks, 3 weeks, 4 weeks, 5 weeks, 6 weeks, 7 weeks, and 8 weeks respectively after operation.\n\n\nRESULTS\nThirty minutes after the rats awoke from anesthesia, wet-dog shakes, lips and head self-movements, convulsion of forelimbs and hind limbs occurred successively. The seizures were paroxysmal with increased intervals during which, however, the rats still showed sluggish. Twenty-four hours after the rats' behavior recovered to normal. Then the seizure occurred 1 approximately 3 times every week. Epileptic waves were recorded in the hippocampus, striate body, cerebral cortex, and olfactory bulb from 5 hours to 2 months after the establishment of model.\n\n\nCONCLUSION\nThe seizure pattern and pathological basis of temporal epilepsy in the rat model established by stereotactic management were almost the same as those in human beings. Stereotactic method significantly decreased the needed dosage of KA and the cost in comparison with systematic injection. Loss of hippocampus neurons and hyperplasia of gliocytes are the basis of the permanent epilepsy sensitivity in the animal model.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua yi xue za zhi","id":"c6f6953dd26802f23c6dee5267ec7b6a8e3ce0eb","venue_1":"Zhonghua yi xue za zhi","year":"2014","title":"[Default mode network in childhood absence epilepsy by 3.0T magnetic resonance imaging].","authors":"Yanwei Li, Enfeng Wang, Xiong Han, Li Gao, Meiqiong Zheng, Ying Zhang, Tengfei Ren, Guinü He, Xi Yan, Hong Zheng, Zhanyou Xue","author_ids":"7771654, 8277105, 3374981, 3644655, 5538945, 1752812, 4257809, 4828864, 5816655, 1785590, 5397567","abstract":"OBJECTIVE\nTo explore the default mode network (DMN) in childhood absence epilepsy (CAE) patients and examine their correlations between functional connectivity (FC) and clinical characteristics.\n\n\nMETHODS\nFourteen CAE patients and 14 healthy volunteers were prospectively recruited from Henan Provincial People's Hospital from September 2012 to June 2014. FC in DMN of each group, between-group comparison of DMN FC and their relationships with clinical characteristics were respectively analyzed with 3.0T resting-state functional magnetic resonance imaging (fMRI) FC analysis seeding at bilateral precuneus/posterior cingulate cortex (PCC).\n\n\nRESULTS\nSeeding at bilateral precuneus/posterior cingulate cortex (PCC), positive connection was found in bilateral angular gyrus, bilateral superior parietal gyrus, bilateral superior and middle frontal gyrus, bilateral superior medial frontal gyrus, bilateral middle temporal gyrus and bilateral superior and middle occipital gyrus in controls. However, positive connection in CAE patients was observed in bilateral superior parietal gyrus and bilateral superior occipital gyrus. Between-group analysis of DMN connectivity revealed a reduction of DMN FC in bilateral medial orbitofrontal cortex, bilateral anterior cingulate cortex, bilateral superior frontal gyrus, bilateral middle frontal gyrus and left caudate in CAE patients. Moreover, increased DMN FC was present in right paracentral lobule and right middle cingulate gyrus. FC between PCC and bilateral medial orbitofrontal cortex or bilateral superior/middle frontal gyrus correlated negatively with disease duration, but there was no correlation with seizure frequency or initial age.\n\n\nCONCLUSION\nBrain's default mode network in childhood absence epilepsy is impaired, presumably, as a result of unconsciousness and cognitive impairment during absence seizure. Abnormal DMN activities may be a biomaker of disease progress in absence epilepsy.","cites":"0","conferencePercentile":"47.36842105"},{"venue":"Zhonghua yi xue za zhi","id":"93bdd86d94760dfb8b24c58c270c487b3a387412","venue_1":"Zhonghua yi xue za zhi","year":"2013","title":"[Mathematical cognitive function in children with attention deficit hyperactivity disorder: a behavior and event-related potential study].","authors":"Dan-dan Wang, Xuan Dong, Yan-ling Ren, Su-hong Wang, Shuo Yang, Wen-juan Tu, Jin-zhong Huang, Hui-juan Shen, Yang Yi, Kai-hua Jiang","author_ids":"5472658, 2172137, 2416360, 3114382, 4573336, 8709278, 4780291, 7969105, 1783127, 7502009","abstract":"OBJECTIVE\nTo explore the mathematics cognitive function of children with attention deficit hyperactivity disorder and explore neural mechanisms with event-related potential(ERP) and behaviors.\n\n\nMETHODS\nBehavior data and ERP elicited by performing mental calculation tasks were recorded in 27 children with ADHD and 29 normal controls from July to October 2012 at Third Affiliated Hospital of Soochow University.The differences of behaviors and N2 component of ERP were compared and analyzed.\n\n\nRESULTS\nThe reaction time of the children with ADHD were longer than the control group in addition, subtraction and multiplication ((949 ± 144) vs (829 ± 166) ms, (981 ± 129) vs (856 ± 170) ms, (944 ± 136) vs (825 ± 172) ms, all P < 0.05). While the correct rate were less than normal control in all three arithmetic operations (0.80% (0.72%, 0.88%) vs 0.90% (0.85%,0.96%), 0.78% (0.64%,0.85%) vs 0.90% (0.84%,0.93%), 0.86% (0.74%,0.92%) vs 0.93%(0.90%,0.98%), all P < 0.05). N2 component could be elicited by all subjects in forehead. The amplitude of N2 of children with ADHD were significantly lower than control group in all three arithmetic operations at left frontal (F3: (-3.5 ± 5.2) vs (-6.7 ± 3.5)µV, (-3.8 ± 4.0) vs (-7.4 ± 4.5)µV, -5.8 (-7.6,1.6) vs -6.4(-10.3, -4.9) µV, all P < 0.05) and Fz ((-4.3 ± 6.4) vs ( -7.4 ± 4.2) µV, (-5.0 ± 5.4) vs (-7.9 ± 4.6)µV, -5.2(-9.7, -0.6) vs -7.9 (-10.5, -5.1)µV, all P < 0.05), the latency of ADHD group were prolonger than controls in subtraction operations at right and left frontal ((328 ± 36) vs (307 ± 27)ms, 325 (307,354)vs 309 (280, 330)ms) and frontal electrodes ((331 ± 35) vs (311 ± 30) ms, all P < 0.05). In addition and multiplication operations, there was no significant difference in latency (all P > 0.05).\n\n\nCONCLUSIONS\nThe children with ADHD have weak capacities of inhibition irrelevant information and paying attention to control. Their deficits in mental arithmetics may be due to the difficulties of selecting the best strategy during cognitive tasks.","cites":"0","conferencePercentile":"41.66666667"},{"venue":"Zhonghua yi xue za zhi","id":"bf356a90f2c123403402070f45c64faf56c31b3e","venue_1":"Zhonghua yi xue za zhi","year":"2011","title":"[Neuropsychological study of false memory in patients with amnesia mild cognitive impairment].","authors":"Dan-dan Xie, Huai-dong Cheng, Chang-lin Yin, Xin-yi Lü, Kai Wang","author_ids":"7299507, 7915374, 6817619, 7012503, 3751236","abstract":"OBJECTIVE\nTo explore the profile of false memory in aMCI (amnesia mild cognitive impairment) and to elucidate the neuropsychological mechanism of false memory.\n\n\nMETHODS\nFalse memory provoked by pictures and feeling-of-knowing (FOK) test in episodic memory (EM) were conducted in 25 aMCI patients at our hospital from October 2009 to May 2010. And 25 age and education level-matched healthy patients were recruited into the healthy control (HC) group.\n\n\nRESULTS\nAs compared with HC group, the rate of false memory was higher in the aMCI group. The rate of false memory in recall stage was 26% ± 7% and that of questionnaire stage 28% ± 12%. And the difference between two group was significant (t = 14.437, 7.597, P < 0.05). The FOK-EM of correct judgment and false recognition in the aMCI group (41% ± 10%) was higher than the HC group. And the difference was significant (t = 4.207, P < 0.05). The rates of false memory in recall and questionnaire stages were positively correlated with FOK-EM in aMCI group (r = 0.563, 0.705, P < 0.01).\n\n\nCONCLUSION\nThe aMCI patients tend to have more false memory provoked by pictures. The deficit of memory monitoring in aMCI may be the foundation of false memory.","cites":"0","conferencePercentile":"41.42857143"},{"venue":"Zhonghua yi xue za zhi","id":"850f1d40d0a4e86f48197f116aed686547635b28","venue_1":"Zhonghua yi xue za zhi","year":"2006","title":"[Reliability of direct probing isthmus of axial vertebrae to defining the screw path in atlas during Magerl technique].","authors":"Ming Yan, Chao Wang, Hai-tao Zhou, Sheng-lin Wang, Geng-ting Dang","author_ids":"7890418, 6250419, 7678399, 5975605, 7847249","abstract":"OBJECTIVE\nTo evaluate the accuracy and reliability of atlantoaxial transarticular screw insertion (Magerl's technique) in atlas under lateral fluoroscopic monitoring without anteroposterior view.\n\n\nMETHOD\nSeventy-five consecutive patients with atlantoaxial instability, 48 males and 27 females, aged 35.1, were treated by Magerl's technique. The screw path in atlas was achieved by direct probing the isthmus of axial vertebrae then identifying its position through the atlantoaxial joint correlation. Postoperative transoral X ray and CT film were used for analysis of the position of the 150 screws in the mass of atlas. Three areas were delimitated in and around the lateral mass of atlas: area A (inside the joint face), area: B (outside the joint face but still in lateral mass), and area C area (outside the lateral mass) so as to analyze the location of screws.\n\n\nRESULTS\nAmong the 150 screws 139 (92.7%) were located in area A, 8 in area B(1) and 3 in area B(2) (7.3%), and none in area C. All cases got atlantoaxial union 3 months after operation.\n\n\nCONCLUSION\nThe method of \"direct probing\" is reliable for identifying the path of screw in atlas.","cites":"0","conferencePercentile":"42.10526316"},{"venue":"Zhonghua yi xue za zhi","id":"6e4f71d6abda200bf9fb5f19c13b8aabde053647","venue_1":"Zhonghua yi xue za zhi","year":"2014","title":"[Executive dysfunction in patients with temporal lobe epilepsy and its correlation with P300].","authors":"Xiaojuan Yao, Qing Yu, Erjuan Yang, Hui Ouyang, Ying Chen, Weidong Yang, Zhijuan Chen, Zengguang Wang","author_ids":"8073591, 1780535, 6062657, 2996906, 7378084, 1791630, 8157208, 8491849","abstract":"OBJECTIVE\nTo explore the changes of executive function in patients with temporal lobe epilepsy and analyze its correlation with P300 event-related potentials.\n\n\nMETHODS\nFifty patients with temporal lobe epilepsy and 30 age, gender and education-matched healthy control subjects were assessed by neuropsychological tests, including Montreal cognitive assessment (MoCA), working memory, verbal fluency, trail making, digit span, digit symbol and Stroop color-word interference to detect P300 event-related potentials.\n\n\nRESULTS\nIn temporal lobe epilepsy group, the scores in MoCA, verbal and non-verbal working memory, verbal fluency, digit span, digit symbol and Stroop test were lower than those of the normal control group. And trail making tests A and B became prolonged (P < 0.05). Comparing with normal control group, temporal lobe epilepsy patients had prolonged latency [(332 ± 33)ms] and decreased P300 amplitude [(10 ± 8)µV] (P < 0.05). Comparing epileptogenic focus group on the left and right sides, there was statistically significant difference in verbal working memory (P < 0.05). There was a negative correlation of P300 latency and MoCA, non-verbal working memory, digit span and digit symbol test scores (r = -0.29--0.45, P < 0.05). And a positive correlation of P300 amplitude and MoCA, non-verbal working memory, digit symbol conversion and Stroop scores was also found (r = 0.37-0.47, P < 0.05). P300 amplitude was more relevant to overall cognitive level and executive functions.\n\n\nCONCLUSION\nTemporal lobe is involved in the regulation of executive functions. Besides a wide range of cognitive impairment, temporal lobe epilepsy patients have a number of executive dysfunctions, including working memory, cognitive flexibility, attention and inhibitory control ability. And an impairment of verbal working memory is evident in left-sided lesion. Their manifestations include decreased latency and amplitude of P300 on executive function tests. Therefore these two objective parameters may be employed to evaluate the cognitive impairment in patients with temporal lobe epilepsy.","cites":"0","conferencePercentile":"47.36842105"},{"venue":"Zhonghua yi xue za zhi","id":"5122d88ea96d6abbce4068107249a8011af97677","venue_1":"Zhonghua yi xue za zhi","year":"2009","title":"[The deficit of decision-making in Parkinson's disease].","authors":"Chun-hua Xi, You-ling Zhu, Kai Wang, Yan-fang Mu","author_ids":"3918313, 6629345, 3751236, 7782784","abstract":"OBJECTIVE\nTo investigate the characteristics of decision-making impairment in Parkinson's disease (PD) patients.\n\n\nMETHODS\nA total of 20 individuals with idiopathic PD were compared with matched health controls on the Iowa Gambling Task, A series of battery including the assessment working memory, visual spatial ability and verbal fluency was also administered. The severity of disease was assessed based on the Hohen and Yahr scale.\n\n\nRESULTS\nThe results showed that PD group impaired on verbal fluency, working memory and decision-making task. In Iowa gambling task, the PD group selected more disadvantageous cards than health controls (51.6 +/- 5.8, 46.8 +/- 8.2 respectively), the difference between two groups is significant (t((38)) = 2.12, P = 0.04). A 2 (group) x 5 (block) ANOVA (analysis of variance) on the scores of advantageous from the gambling task revealed a significant main effect of group (F((1, 38)) = 6.16, P = 0.01). The ANOVA also revealed a significant main effect of block (F((4, 152)) = 2.43, P = 0.04). The results showed that health controls gradually shifted their selections toward the good decks as the game progresses, but the PD group did not exhibit this stable advantageous shift in decision-making. Meanwhile, the study indicated the total number of disadvantageous cards for PD was positive correlation to the degrees of severity to clinical symptom.\n\n\nCONCLUSION\nThe present study suggests that the decision-making impairment might be in early PD. The deficit of decision-making for PD might be attributed to the dysfunction of the orbito-frontal cortex.","cites":"0","conferencePercentile":"47.5"},{"venue":"Zhonghua yi xue za zhi","id":"8942b4e8c18b8e45fc7706e0f34803d2f8b790a8","venue_1":"Zhonghua yi xue za zhi","year":"2011","title":"[Significant improvement of motor symptoms by deep brain stimulation of bilateral subthalamic nucleus in patients with moderate or advanced Parkinson's disease].","authors":"Jie Chen, Jin-Long Liu, Xi Chen, Hao Qian, Wen-Biao Xian, Hong-Yan Zhou, Yan-Mei Liu, Xiao-Fan Ye, Yi-Fan Zheng, Si-le Zhang, Ling Chen, Jin-Ru Li, Zhuo-Lin Liu, Zhong Pei","author_ids":"3050530, 8190683, 1714741, 8276997, 7909271, 7678240, 7894812, 7929101, 8499765, 7671562, 1717165, 8549321, 7769366, 1764148","abstract":"OBJECTIVE\nTo study the effects of deep brain stimulation (DBS) of bilateral subthalamic nucleus (STN) on the motor and non-motor symptoms in moderate or advanced Parkinson's disease (PD) patients.\n\n\nMETHODS\nFrom August 2006 to January 2010, 21 consecutive PD patients with refractory motor fluctuations or dyskinesia underwent operations at our hospital. All patients were evaluated by unified Parkinson's disease rating scale (UPDRS), Hoehn & Yahr (H&Y) stage, Parkinson's disease questionnaire (PDQ-39), mini mental state examination (MMSE), Parkinson's disease sleep scale-Chinese vision (PDSS-CV), Pittsburgh sleep quality index (PSQI), Hamilton depression rating scale (HAMD) and Hamilton anxiety rating scale (HAMA). And the daily dosage of dopaminergic agents was recorded at 1 week pre-operation and 3, 6 and 12 months post-operation.\n\n\nRESULTS\nTen patients finished a 12-month follow-up. Their motor functions showed significant improvement. And the scores of UPDRS-motor, tremor, rigidity, bradykinesia and axial symptoms reduced significantly in the on-stimulation-off-medication condition and the on-stimulation-on-medication condition vs the on-medication condition pre-operation. And the improvement of tremor was the most pronounced (52.1% and 77.7% respectively). The H&Y stage decreased significantly from 3.2 ± 0.7 to 2.5 ± 0.4 post-operation. The activities of daily living improved while PDQ-39 declined significantly from 56 ± 9 pre-operation to 32 ± 13 at 12 months follow-up. The score changes of MMSE, PDSS-CV, PSQI, HAMA and HAMD were statistically insignificant. The levo-dopa equivalent dose of 1-year post-operation decreased significantly by 49.2% versus that of pre-operation (P < 0.05).\n\n\nCONCLUSION\nBilateral STN-DBS can significant ameliorate the motor symptoms of moderate or advanced PD patients, reduce the dosage of anti-PD medications and improve the quality of life. This procedure has the advantages of a greater safety, minor side effects and an easy controllability.","cites":"0","conferencePercentile":"41.42857143"},{"venue":"Zhonghua yi xue za zhi","id":"e1b4307e58f0a35f2082867d4a2a41ddf3f2cf30","venue_1":"Zhonghua yi xue za zhi","year":"2009","title":"[Functional MRI in normal subjects and sudden unilateral sensorineural hearing loss patients].","authors":"Ming Yang, Bin Liu, Gao-Jun Teng, Zhi-Chun Huang, Wei-Wei Gao, Hui Ji, Min Wu, Xu Feng, Hong-Ying Zhang, Jian Wang","author_ids":"5015133, 1702756, 3104439, 7945909, 8361071, 7163397, 1725931, 2173783, 2744829, 1743989","abstract":"OBJECTIVE\nBrain activities in responses to amplitude modulation (AM) was evaluated using functional MRI (fMRI) in subjects with sudden unilateral sensorineural hearing loss (SSNHL) and those with normal hearing (NH).\n\n\nMETHODS\nTotally 25 subjects with normal hearing and 30 with SSNHL were examined with fMRI in response to AM tones of 500, 2000 and 4000 Hz respectively with the modulation frequency at 8 Hz. The fMRI was examined within 12 days after the onset of SSNHL. The AM signals were presented at 96 dB SPL binaurally. An event-related design was combined with a sparse clustered volume acquisitioning paradigm in data collection in the attempt to reduce the influence of acoustic scanner noise. SPM2 software was used for offline data analyzing.\n\n\nRESULTS\nBrain activation in fMRI image was found mainly in the primary auditory cortex (PAC) in both subjects with NH and SSNHL NH subjects showed a clear lateralization to left cerebral hemisphere(11/16) and SSNHL patients showed a lateralization ipsilateral to the impaired ear(16/22). The activation voxel and intensity shown in BOLD were found to be decreased with increasing signal frequency in both groups.\n\n\nCONCLUSION\nThe difference in the lateralization between the two groups suggests that an adaptive process occurs shortly after the onset of SSNHL","cites":"0","conferencePercentile":"47.5"},{"venue":"Zhonghua yi xue za zhi","id":"458b21adfb4114b645a763dea047a58d528a69b1","venue_1":"Zhonghua yi xue za zhi","year":"2011","title":"[Clinical features and treatment of dementia with Lewy bodies].","authors":"Ling Li, Jing-tao Wang, Zhen-xin Zhang, Rui-xue Cui, Jing Yuan","author_ids":"7136898, 7897766, 7969463, 8158914, 1698556","abstract":"OBJECTIVE\nTo investigate the clinical, neuropsychological, neuroimaging features and treatment of dementia with Lewy bodies (DLB).\n\n\nMETHODS\nThe clinical, neuropsychological, neuroimaging and therapeutic features of 33 DLB patients were retrospectively analyzed.\n\n\nRESULTS\nThere were 25 males and 8 females. The mean course from onset to diagnosis was 3.3 years. Sleep disorder, depression, anxiety and constipation were present at 1 - 10 years prior to DLB onset in 10 patients. Memory impairment (52%) and parkinsonism (21%) were initial symptoms. The mean duration from memory impairment to presence of parkinsonism was 17 months. Pattern of extrapyramidal signs showed bilateral, symmetry and axial muscles bias as postural instability and facial impassivity, tremor was less in DLB. Hallucination (70%), sleep disorder (63%), apathy (56%) and delusion (52%) were the major behavioral and psychological symptoms. Hallucination occurred within a mean of 15 months after presence of initial symptoms. Cognition impairment progressed rapidly in half of patients. Neuropsychological tests of mild patients revealed visuospatial dysfunction and relatively preservation of memory. Severe impairment of all domains of cognition was noticed in moderate-severe patients. MRI (magnetic resonance imaging) revealed the preservation of hippocampal structures. And PET (positron emission tomography) showed hypometabolism of occipital lobe. Cholinesterase inhibitors could improve cognitive impairment and behavioral symptoms in a large majority of patients.\n\n\nCONCLUSION\nNeuronal dysfunction may be present at an early stage of DLB. Early presence of hallucination, a high prevalence of sleep disorders, axial rigidity and hypometabolism of occipital lobe on PET may help to distinguish DLB from other types of dementia.","cites":"0","conferencePercentile":"41.42857143"},{"venue":"Zhonghua yi xue za zhi","id":"4f87b04c98065902fc5387bc1ddba9fbe13c57b4","venue_1":"Zhonghua yi xue za zhi","year":"2011","title":"[Clinical and neuroimaging features of central nervous system impairments in acute intermittent porphyria].","authors":"Jing Yuan, Bin Peng, Hui You, Wei Zhang","author_ids":"1698556, 3063611, 4143067, 2869732","abstract":"OBJECTIVE\nTo analyze the clinical and neuroimaging features of central nervous system impairments in acute intermittent porphyria, and explore the possible mechanisms.\n\n\nMETHODS\nSix cases with intracranial lesions at our hospital from 1991 to 2011 and 13 cases reported in literatures were retrospectively reviewed.\n\n\nRESULTS\nThe clinical manifestations of central nervous system impairments included seizures, unconsciousness and cortical blindness, etc. EEG (electroencephalogram) showed slow wave or normal. CSF (cerebrospinal fluid) test indicated slightly higher or normal level of CSF protein. Neuroimaging studies showed two types of intracranial lesions. One type (n = 4) mainly affected the cortex and subcortical white matter, especially involving white matter. Another type (n = 2) affected the deep nuclei such as caudate, putamen and thalamus symmetrically. The symptoms of 13 cases reported in literature with central nervous system impairments included unconsciousness, hallucinations, seizures and cortical blindness. Their neuroimaging manifestations were similar with those of the patients at our hospital. Two additional cases showed predominantly cerebral cortex lesions with no involvement of white matter.\n\n\nCONCLUSION\nAcute intermittent porphyria can affect central nervous system, peripheral nervous system and autonomic nervous system. The neuroimaging features of brain may be lesions located in cortex, subcortical white matter and deep nuclei with different mechanisms. A correct diagnosis and a treatment decision should be made during an early stage.","cites":"0","conferencePercentile":"41.42857143"},{"venue":"Zhonghua yi xue za zhi","id":"aa419c7ee28915e9852e42492c540c52ec01a88c","venue_1":"Zhonghua yi xue za zhi","year":"2012","title":"[Small-worldness of functional networks in Alzheimer's disease].","authors":"Xiao-hu Zhao, Xiang-bin Wang, Qian Xi, Hong Jiang, Qi-hao Guo, Yong Liu, Pei-jun Wang","author_ids":"5380815, 4413017, 3196064, 3061277, 7736678, 7135550, 8120267","abstract":"OBJECTIVE\nTo construct the functional networks of human brains by resting-state functional magnetic resonance imaging (fMRI) and examine whether or not the small-world property of functional brain networks changes in patients with Alzheimer disease (AD).\n\n\nMETHODS\nA total of 33 AD patients and 20 healthy old volunteers were recruited. Their cognitive functions were evaluated by the mini-mental state examination (MMSE) and Mattis dementia rating scale (DRS). The resting-state BOLD-fMRI data were acquired and preprocessed. Then the correlation coefficient of every pair of 90 regions was calculated and correlation matrix Z (N×N, N = 90) generated by Fisher Z transformation. The small-world property of functional brain networks was tested for AD patients and normal elders according to the definition of small-worldness. The changes of relevant parameters in AD patients were examined by two sample t-tests.\n\n\nRESULTS\nBehavioral results: the MMSE scores of AD group and normal controls (NOR) were 20.60 ± 2.30 and 28.20 ± 1.80 respectively. The DRS scores of AD and NOR groups were 96.00 ± 10.82 and 123.22 ± 13.74 respectively. The MMSE and DRS scores were statistically different between two groups. Calculation of small-world parameters: Within the range of 0.1 ≤ Sparsity ≤ 0.4, both groups satisfied the small-world property. However, the clustering coefficient Cp and the average shortest path Lp of AD group were significantly higher than those of NOR group at each threshold (P < 0.05).\n\n\nCONCLUSIONS\nThe functional brain networks in AD patients still have the property of small-world. But the levels of Cp and Lp are higher in AD patients than those in normal controls. It suggests that the capacity of information transmission in functional brain networks and the ability of information integration in different brain regions in AD patients are impaired. This finding is of great importance in elucidating the pathological mechanisms of AD from the viewpoint of networks.","cites":"0","conferencePercentile":"41.66666667"},{"venue":"Zhonghua yi xue za zhi","id":"3431ab680b5fcbabe265640570d805e2a7676385","venue_1":"Zhonghua yi xue za zhi","year":"2006","title":"[Mechanism of post-stroke reflex sympathetic dystrophy: study with needle electromyography].","authors":"Xiao-yan Wang, Tong Zhang, Jing Li","author_ids":"8416265, 1690856, 1742253","abstract":"OBJECTIVE\nTo explore the mechanism of post-stroke reflex sympathetic dystrophy (RSD) patients electromyographic abnormality and confirm its clinical value.\n\n\nMETHODS\nFifty patients with first-onset stroke, aged 33 - 78, including 30 with RSD and 20 without RSD, underwent needle electromyography (EMG) to test the nerve conduction velocity (NCV) and sensory nerve conduction velocity (SCV) of bilateral median nerves, and the number and position of spontaneous EMG activity of bilateral short abductor muscles of thumb and abductor muscles little finger.\n\n\nRESULTS\nThe median nerve compound muscle action potential (CMAP) amplitude of the affected upper extremities of the RSD group was 8.6 mV +/- 2.9 mV, significantly lower than that of the non-RSD group (13.2 mV +/- 4.6 mV, P < 0.01). The incidence of spontaneous electrical potential of the RSD group was 100%; significantly higher than hat of the non-RSD group (65%, P < 0.001). The quantity of spontaneous EMG activity on the short abductor muscles of thumb and abductor muscles little finger was increased in the RSD group (P < 0.01). The motor nerve conduction velocity and electrophysiological presentation of sensory nerve of these 2 groups were all normal and without significant differences between them.\n\n\nCONCLUSION\nPartial axonal degeneration occurs on the distal motor never fibers of the affected upper extremity of the RSD patients, which may be related to subsequent peripheral nerve injury after central nerve system impairment.","cites":"0","conferencePercentile":"42.10526316"},{"venue":"Zhonghua yi xue za zhi","id":"83e96b78200eec0057cb4f94545cc1db96cf5395","venue_1":"Zhonghua yi xue za zhi","year":"2008","title":"[Dominant hemisphere and tonotopic organization of auditory functional MRI in Chinese].","authors":"Ming Yang, Bin Liu, Gao-Jun Teng, Zhi-Chun Huang, Wei-Wei Gao, Jian Wang","author_ids":"5015133, 1702756, 3104439, 7945909, 8361071, 1743989","abstract":"OBJECTIVE\nFunctional MRI (fMRI) was measured in responses to stimulations of different frequencies to investigate dominant hemisphere and tonotopic organization in primary and secondary auditory cortex.\n\n\nMETHODS\n25 healthy subjects with normal hearing were examined using tones of 0.5, 2 or 4 kHz that were amplitude modulated (AM) sinusoidally at 8 Hz. The AM signals were presented at 96 dB SPL Event-related design was combined with a sparse clustered volume acquisitioning paradigm for data collection in the attempt to reduce the influence of acoustic scanner noise. SPM2 software was used for offline data analyzing.\n\n\nRESULTS\nData from 9 subjects were discarded due to a large head movement during recording. In the rest of 16 subjects, activation was found mainly in the primary auditory cortex. In most of these cases, the activation area and intensity by BOLD were find to be decreased with increasing signal frequency. In a great portion of cases (6 left and 7 right hemispheres), a lateral-medial preference for low-to-high frequency response shift was clearly demonstrated in the primary auditory cortex. However, this was not clear in all other cases. No significant rule could be found in secondary auditory cortex activation.\n\n\nCONCLUSION\nThe responses to AM signals showed a clear lateralization to left cerebral hemisphere. The activated area and response intensity decreased with increasing frequency of stimulation. The activation is related to the signal frequency with high frequency AM activating more medially.","cites":"0","conferencePercentile":"42.1875"},{"venue":"Zhonghua yi xue za zhi","id":"7213b36e965b5771b7e2fdcde66d2a78bf856c07","venue_1":"Zhonghua yi xue za zhi","year":"2006","title":"[Impact of loss of sympathetic innervation on peripheral nerve regeneration: an experimental study with rats].","authors":"Ke Sha, De-song Chen, Lin Chen, Feng Peng, You-sheng Fang, Ji-hui Xie","author_ids":"3851049, 7167189, 3407460, 7402534, 5120939, 8069169","abstract":"OBJECTIVE\nTo investigate the impact of loss of sympathetic innervation on peripheral nerve regeneration.\n\n\nMETHODS\nThirty-two SD rats underwent resection of the right middle cervical ganglion and excision and re-anastomosis of bilateral medium nerve, and then were randomly divided into 4 equal groups to undergo the following experiments. One, 2, 3, and 4 weeks later the sensory nerve action potentials (SNAPs) of bilateral medium nerves 5 mm from the anastomotic stoma and the compound muscle action potentials (CMAPs) of bilateral superficial digital flexor muscles were measured with stimulating and recording electrodes. Specimens of the distal part of bilateral medium nerves 5 mm from the anastomotic stoma were collected to calculate the number of modulated fibers by electron microscopy. The tendons of bilateral superior digital flexor muscles were cut ant the wrist, isolated to the terminal points, ligated, and connected to a sensor so as to record the maximum contraction power. The superior digital flexor muscle was completely resected to be weighted.\n\n\nRESULTS\nCMAP failed to be recorded 1 week later. The wave amplitude of the nerve at the affected side increased along with time, however, the CMAP wave amplitudes of the affected side were all significantly lower than those of the healthy side (all P < 0.05). The SNAP wave amplitudes of the medium nerve of both sides increased along with the time. The SNAP levels 4 and 8 weeks later of the affected side were both lower than those of the healthy side (both P < 0.05). The number of modulated fibers of the medium nerve increased along with the time, however, the number of the affected side were significantly lower than those of the healthy side (all P < 0.05). Electron microscopy showed degeneration of medulla in bilateral medium nerves 1 week later, and newborn modulated fibers began to be seen since 2 weeks later. However, there were a greater number and more complete structure in the healthy side in comparison with the affected side. The wet weights of bilateral superior digital flexor muscles decreased 2 weeks later and then began to increase gradually. However, the wet weight 4 and 8 weeks later were significantly greater in the healthy side then in the affected side (both P < 0.05).\n\n\nCONCLUSION\nResection of sympathetic nerve is advantageous on nerve regeneration.","cites":"0","conferencePercentile":"42.10526316"},{"venue":"Zhonghua yi xue za zhi","id":"7e55550fcd9b81ba35ccba22d194f73bb9d5fcea","venue_1":"Zhonghua yi xue za zhi","year":"2007","title":"[Recombinant adeno-associated virus conducted NgR(DN) enhances axonal regeneration of optic nerve after trauma: experiment with rats].","authors":"Feng Wang, Ji-qun Wang, Ying Su, Yan-chun Shan, Shi-guang Zhao, Yan Teng","author_ids":"1745827, 7898220, 1738289, 8004917, 7420235, 7339536","abstract":"OBJECTIVE\nTo investigate the effect of recombinant adeno-associated virus conducted NgRDN on the axonal regeneration of optic nerve after trauma.\n\n\nMETHODS\nTwo kinds of adeno-associated virus (AAV), AAV-NgRDN-EGFP containing dominant negative form of Nogo receptor and enhanced green fluorescent protein (EGFP) and rAAV-NgR-EGFP containing Nogo-66 receptor (NgR) and EGFP, were constructed. 45 adult Wistar male rats were randomly divided into three equal groups, all with both eyes as experimental eyes: Groups A, B, and C to undergo injection of rAAV-EGFP, rAAV-NgR-EGFP, and rAAV-NgRDN-EGFP respectively into the vitreous; and each group was subdivided into 3 equal subgroups: subgroups 1 underwent injection of rAAV only, subgroups 2 underwent injection of rAAV and lens trauma, and subgroups 3 underwent injection of rAAV and zymosan. The rats in the Subgroups A2, B2, and C2 underwent. Crush of the optic nerve 2 mm behind the eyeball with optic nerve forceps 3 weeks after the injection. Four days after the crush the right eyes were taken out and the retinal explants were cultured in 2 kinds of culture fluid: with or without myelin. The growth of axons at the edge of retinal explants was observed by immunofluorescent staining with betaIII tubulin. Two weeks after the crush the other eyes were taken out to isolate the optic nerves. Immunofluorescence assay was used to detect the expression of growth associated protein-43 (GAP-43) of optic nerve. The axonal regeneration of optic nerve was observed.\n\n\nRESULTS\nbetaIII tubulin staining showed that on the condition of culture fluid without myelin both rAAV-NgR-EGFP and rAAV-NgRDN-EGFP showed no effects on the axonal regeneration of retinal ganglion cells (RGCs). However, on the condition of culture fluid with myelin the count of axonal regeneration and the length of regenerated axons of Group B were (13+/-4) and (36 microm+/-4 microm), both significantly lower than those of Group A [(21+/-4) and (83 microm+/-11 microm) respectively, both P<0.01]. There were not significant differences in count of axonal regeneration and length of regenerated axons between Subgroups C1 and A1. The count of axonal regeneration and length of regenerated axons of Subgroups C2 were (317+/-45) and (508 microm+/-44 microm), both significantly higher than those of Subgroup C3 [(238+/-30) and (365 microm+/-48 microm) respectively, both P<0.01], and the values of both Subgroups C2 and C3 were significantly higher than those of Subgroups A2 and A3. The GAP43-positive area in the optic nerve of Group C was significantly larger than that of Group A (P<0.01), and that of Group B was significantly smaller than that of Group A (P<0.01). The GAP43-positive area in the optic nerve of Subgroup A2 was (18.71+/-1.72)x100 microm2, significantly larger than that of Subgroup A3 [(12.75+/-1.02)x100 microm2, P<0.01], and that of Subgroup A3 was significantly larger than that of Subgroup A1 (P<0.01). There were not significant differences in the GAP43-positive area among the subgroups in Group B.\n\n\nCONCLUSION\nTransfection of rAAV-NgRDN-EGFP into RGC in an activated status enhances axonal regeneration of optic nerve. NgRDN AAV can inhibit effectively the role of NgR.","cites":"0","conferencePercentile":"38.23529412"},{"venue":"Zhonghua yi xue za zhi","id":"726429f7ddda48ec532aad7ef671b9f751548b81","venue_1":"Zhonghua yi xue za zhi","year":"2012","title":"[Functional magnetic resonance imaging in patients with long-term unilateral hearing loss].","authors":"Bin Liu, Ming Yang, Gao-jun Teng, Zhi-chun Huang, Hui Ji, Shi-jie Wang, Qiu-rong Liu, Xu Feng, Jian Wang","author_ids":"1702756, 5015133, 3601535, 7945596, 7163397, 7489203, 7360417, 2173783, 1743989","abstract":"OBJECTIVE\nTo evaluate the potential functional reorganization by functional magnetic resonance imaging (MRI) to measure the brain activation in responses to stimulation to healthy ears in patients with long-term unilateral hearing loss (UHL).\n\n\nMETHODS\nFrom June 1998 to December 2009, 23 patients with serious UHL (15 left, 8 right) were recruited along with 15 matched normal hearing subjects. Laterality index (LI) for activated voxel in primary auditory cortex (PAC) was calculated. And the activations outside auditory cortex were also evaluated.\n\n\nRESULTS\nThe data were discarded in 3 patients with left-ear UHL and 1 normal subject because of head motion. All control subjects showed contralateral dominant activation of PAC in group analysis. However, the group data of UHL patients showed that the activation was more symmetrical and the contralateral dominance diminished versus the control group. As compared with normal subjects outside PAC, heightened activation in left prefrontal cortex, bilateral inferior parietal lobule and left occipital/precuneus was found in UHL patients while reduced activation in left superior temporal gyrus was also found.\n\n\nCONCLUSIONS\nThe diminished contralateral dominance in PAC and heightened activation in non-auditory region suggest the reduction of interhemispheral inhibition and general increase in brain excitation in long-term UHL patients potentially occur as a result of functional reorganization adaptive to UHL. However, the reduced activation in superior temporal gyrus may be correlated with the deterioration of speech perception in these patients.","cites":"0","conferencePercentile":"41.66666667"},{"venue":"Zhonghua yi xue za zhi","id":"9d1e7f266b96e60164e9f7b843596dee32c53590","venue_1":"Zhonghua yi xue za zhi","year":"2015","title":"[Aberrant topological properties of whole-brain functional network in chronic right-sided sensorineural hearing loss: a resting-state functional MRI study].","authors":"Lingling Zhang, Bin Liu, Yangwen Xu, Ming Yang, Yuan Feng, Yaqing Huang, Zhichun Huan, Zhaorui Hou","author_ids":"7559555, 1702756, 2242450, 5015133, 2089810, 2814194, 4721338, 5196192","abstract":"OBJECTIVE\nTo investigate the topological properties of the functional brain network in unilateral sensorineural hearing loss patients.\n\n\nMETHODS\nIn this study, we acquired resting-state BOLD- fMRI data from 19 right-sided SNHL patients and 31 healthy controls with normal hearing and constructed their whole brain functional networks. Two-sample two-tailed t-tests were performed to investigate group differences in topological parameters between the USNHL patients and the controls. Partial correlation analysis was conducted to determine the relationships between the network metrics and USNHL-related variables.\n\n\nRESULTS\nBoth USNHL patients and controls exhibited small-word architecture in their brain functional networks within the range 0. 1 - 0. 2 of sparsity. Compared to the controls, USNHL patients showed significant increase in characteristic path length and normalized characteristic path length, but significant decrease in global efficiency. Clustering coefficient, local efficiency and normalized clustering coefficient demonstrated no significant difference. Furthermore, USNHL patients exhibited no significant association between the altered network metrics and the duration of USNHL or the severity of hearing loss.\n\n\nCONCLUSION\nOur results indicated the altered topological properties of whole brain functional networks in USNHL patients, which may help us to understand pathophysiologic mechanism of USNHL patients.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua yi xue za zhi","id":"9948de7eef36b9778a87c3b71e1095b4eef85eb8","venue_1":"Zhonghua yi xue za zhi","year":"2009","title":"[Spatial nature of mental number line in neglect patients].","authors":"Qin Yang, Yang-hua Tian, Kai Wang","author_ids":"1787446, 3410641, 3751236","abstract":"OBJECTIVE\nTo investigate the spatial nature of mental number line.\n\n\nMETHODS\nNumber bisection test was conducted on 8 right-brain-damaged patients with persistent left neglect, 8 right-brain-damaged patients without spatial neglect, and 8 healthy control subjects, all aged- and education-level-matched and right-handed.\n\n\nRESULTS\nThe error rate in subjective midpoint of the 8 neglect patients was (44.63+/-12.49)% (forward direction) and (46.00+/-12.10)% (reverse direction), both significantly higher than those of the right brain damage control group [(3.34+/-4.32)% and (5.21+/-5.21)% respectively] and healthy control group [(0.00+/-0.00)% and (0.00+/-0.00)% respectively] (all P<0.01). The longer the interval between the numbers, the higher right-shift error rate: corresponding to the interval sizes as 3, 5, 7, and 9, the mean deviation rates of anthrone presentation were (-4.25+/-7.87)%, (12.63+/-19.06)%, (58.38+/-24.30)%, and (111.50+/-53.54)% respectively, and the mean deviation rates of reverse presentation were (-18.40+/-25.35)%, (-1.60+/-21.4)%, (56.80+/-27.04)%, and (108.20+/-55.10)% respectively. Analysis of variance of the anthrone presentation and reverse presentation showed the result: F=1.705 and P=0.262. Correlation analysis of the mental number bisection task and line bisection task showed the result: r=0.887 and P=0.045. The control subjects made very few errors in subjective midpoint and their performance was not affected by interval sizes. The magnitude of numbers used did not influence the performance in any group.\n\n\nCONCLUSION\nThe performance of neglect patients in bisecting mental number line closely mirrors their difficulty in bisecting physical lines. This demonstrates the spatial nature of the mental number line isomorphism to physical lines. The mental number line is orientated in a left-to-right manner. Disorder exists at the characterization level in neglect patients.","cites":"1","conferencePercentile":"97.5"},{"venue":"Zhonghua yi xue za zhi","id":"7190fb73c2456cb180a228ff529ce72bb8a3d1bf","venue_1":"Zhonghua yi xue za zhi","year":"2006","title":"[Axonal regeneration of retinal ganglion cells after optic nerve crush: experiment of Nogo-A knockout mice].","authors":"Ying Su, Feng Wang, Shi-guang Zhao, Ping Liu, Hao Cui, Yan Teng","author_ids":"1738289, 1745827, 7420235, 1733854, 7854947, 7339536","abstract":"OBJECTIVE\nTo investigate the role Nogo-A gene plays in the axonal regeneration of retinal ganglion cells (RGCs) after optic nerve crush.\n\n\nMETHODS\nTwenty Nogo-A knockout C57BL mice and 20 normal C57BL/6 mice underwent clipping at the optic nerve 2 mm behind the eyeball by specially designed clip so as to cause partial optic nerve injury. Then the mice in each group were subdivided into subgroups of day 1 (n = 7), day 3 (n = 7), and day 7 (n = 6). The optical nerves of different groups were taken out to detect the mRNA expression of Nogo-A gene by in situ hybridization. Frozen sections of optical nerve were immunostained to investigate the expression of GAP-43, a protein showing axonal regeneration, by immunofluorescence assay. RGCs were cultured and immunostained with Thy1.1 antibody and GAP-43 antibody. The axonal growth of the RGCs was calculated with a computerized image analyzer.\n\n\nRESULTS\nNogo-A expression could be seen in the optical nerves of the control mice, however, not in the Nogo-A knockout mice. The expression levels of GAP-43 at different time points of the Nogo-A knockout mice were all significantly higher than those of the control mice (t = 2.12, 3.56, 2.63, P < 0.01). Staining of GAP-43 antibody could be seen in the axons of the cultured RGCs. The neurite growth of the Nogo-A knockout mice was significantly longer than that of the control mice at different time points (F = 41.36, 31.23, P < 0.01).\n\n\nCONCLUSION\nNogo-A gene plays an important role in inhibition of axonal regeneration of optic nerve after injury.","cites":"0","conferencePercentile":"42.10526316"},{"venue":"Zhonghua yi xue za zhi","id":"4aefb02a909f8449f8f6a0126765c0ceb70ff399","venue_1":"Zhonghua yi xue za zhi","year":"2008","title":"[Effects of epimedium flavonoids on synapse related protein in brains of dementia transgenic mice].","authors":"Jin Chu, Lan Zhang, Cui-Fei Ye, Ling Zhao, Bai-Liu Ya, Lin Li","author_ids":"3833224, 4514211, 4574761, 1742329, 3875794, 1686030","abstract":"OBJECTIVE\nTo investigate changes of synapse related protein, such as synaptophysin (SYP) and postsynaptic dense material 95 (PSD-95), in brains of 10 months old transgenic mice, and the effects of Epimedium flavonoids (EF) on expression of SYP and PSD-95 in brain of 10 months old of APP transgenic mice.\n\n\nMETHODS\nThe mice of drug treated group were administered intragastrically by EF (at low doses of 0.03 and high dose of 0.1 g.kg(-1).d(-1)) from 4 to 10 months old. The mice of normal group and negative transgene group were administered of distilled water by the same way. The expression of SYP in CA1, CA3, and dentate gyrus (DG) areas of hippocampus and cortex, and PSD-95 in hippocampus and cortex were detected by immunohistochemistry and Western blot respectively.\n\n\nRESULTS\nCompared to negative transgenic mice, the expression of SYP in cortex was decreased by 51.3% (P < 0.01). The IOD value of SYP immuno-reactivity cell in CA1, CA3 and DG areas of hippocampus in 10 months old transgenic mice were significantly decreased (the suppression rates were 59.1%, 57.7% and 56.5% in CA1, CA3 and DG respectively, all P < 0.01). The expression of PSD-95 in cortex decreased by 36.4% (P < 0.01). The count of PSD-95 immuno-reactivity cell in CA1 area of hippocampus decreased with the suppression rate of 18.5% (P < 0.05). After being administered intragastrically by EF for 6 months, the expression of SYP in cortex of EF low doses and high dose group mice increased by 40.0% (P < 0.05) and 106.4% (P < 0.01) respectively in comparison with that of the control group. The IOD value of SYP immuno-reactivity cell in hippocampal CA1, CA3 and DG areas of EF low and high dose group mice were all significantly increased (all P < 0.01). The expression of PSD-95 in cortex of EF low and high dose group mice increased by 57.3% (P < 0.05) and 84.3% (P < 0.01) respectively when compare to the control group. The count of PSD-95 immuno-reactivity cell in CA1 area of hippocampus of mice in EF high dose group increased by 22.5% (P < 0.05).\n\n\nCONCLUSION\nEpimedium flavonoids could protect the synaptic structure and function by promoting the expression of synaptophysin and postsynaptic dense material 95, which suggest that Epimedium Flavonoids may have a promising application prospect in improving the synaptic impairment of AD.","cites":"0","conferencePercentile":"42.1875"},{"venue":"Zhonghua yi xue za zhi","id":"ed618184f3a3a96e404d235b7a125603ece95846","venue_1":"Zhonghua yi xue za zhi","year":"2015","title":"[Investigating the descending motor tracts in patients with chronic ischemic stroke with diffusion tensor imaging].","authors":"Yaru Yang, Ming Yang, Huijun Li, Ting Chen, Yuting Liu, Bin Liu","author_ids":"2418532, 5015133, 7178587, 1696970, 7895625, 1702756","abstract":"OBJECTIVE\nTo evaluate the relationship between structural integrity of descending motor tracts and motor status in patients with chronic ischemic stroke using diffusion tensor imaging (DTI).\n\n\nMETHODS\nFrom April 2012 to December 2013, 47 patients with chronic ischemic strok were recruited along with 20 matched normal controls. The DTI data was acquired and preprocessed. Bilateral descending motor tracts includingcorticospinal tract (CST) and alternate motor fibers (aMF) were constructed. The descending motor tracts numberswere acquired and the relationships between laterality indices(LI) of descending motor tracts numbers and FMA were assessed. The patients were grouped into (CST + aMF) group (group1), no (CST + aMF) group (group2), CST group (group3) and aMF group (group4) according to the damage morphology of descending motor tracts. Observing the changes of each group.\n\n\nRESULTS\nIpsilesional CST and theentiredescending motor tracts numbers (aMF + CST) were lower in the patient group as compared to the control group (P < 0.01, CST: 26 ± 30, CST + aMF: 37 ± 37). The FMA were statistically different between group 1, 2, 3 (55 ± 12, 16 ± 10, 34 ± 15, F = 24.2, P < 0.01). The LI of CST and (CST + aMF) significantly diagnosed motor impairment (P < 0.01, r = -0.653; r = -0.692). Meanwhile, it is a stronger parameter when entire descending motor tracts were combined comparing to using the CST only.\n\n\nCONCLUSIONS\nThe integrity of entire descending motor tracts, not merely the CST, appears to account for stroke recovery. Our results highlight the role of aMFin compensatory function, which may be used as a target in future rehabilitative treatmentsto promoting motor function recovery at the most extent.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua yi xue za zhi","id":"219d117c7754b60fba918ef26216d02a6358b6a6","venue_1":"Zhonghua yi xue za zhi","year":"2014","title":"[Resting-state functional MRI research of the auditory cortex in patients with long-term unilateral hearing loss].","authors":"Jing Li, Ming Yang, Bin Liu, Guangyu Zhang, Nong Qian","author_ids":"1742253, 5015133, 1702756, 2385976, 7200298","abstract":"OBJECTIVE\nTo evaluate functional connectivity in patients with unilateral sensorineural hearing loss(USNHL) using resting-state fMRI.\n\n\nMETHODS\nFunctional connectivity MRI were employed in 29 patients with SNHL (15 left, 14 right) with averaged hearing level above 70 dB HL for the deaf ear, and matched 15 and 14 normal hearing subjects, respectively, were recruited. Functional connectivity mappings between the SNHL patients and normal hearing subjects were evaluated and the differences were contrasted.\n\n\nRESULTS\nThe positive functional connectivity of auditory cortex with whole brain in USNHL patients is weaker than that in normal subjects both in volume and intensity. Using the affected side AIas a seed, left and right Laterality index(LI)of auditory cortex was 30.14, -31.25, respectively. Using the healthy side as a seed, the LI of auditory cortex was 0.1, 19.37, respectively. Compared to normal subjects, increased activation in bilateral precentral gyrus, left middle frontal gyrus, left superior frontal gyrus and posterior cingulate cortex/precuneus were found in left USNHL patients. Contrasted with normal subjects, no significant difference was found between the normal subjects and right SNHL patients, except the right caudate nucleus using left AIas a seed.\n\n\nCONCLUSION\nThe reduced functional connectivity among the affected side and healthy side auditory cortex as well as associated auditory cortex may suggest a result of functional reorganization adaptive to the SNHL.","cites":"0","conferencePercentile":"47.36842105"},{"venue":"Zhonghua yi xue za zhi","id":"8345e8ba3994bc4637eb0d06a7cb040bd204d35f","venue_1":"Zhonghua yi xue za zhi","year":"2005","title":"[Transcallosal interforniceal approach for removing the medial type of thalamic gliomas].","authors":"Jian Gong, Zhen-yu Ma, Yu-qi Zhang, Ge Jia, Jian Xie","author_ids":"4513457, 7724241, 7550883, 4386361, 8069362","abstract":"OBJECTIVE\nTo report an approach for removing the medial type of thalamic gliomas.\n\n\nMETHODS\nEight cases of medial type of thalamic gliomas, 4 males and 4 females, aged 22 (14 approximately 53), underwent resection of the tumor by transcallosal interforniceal approach: right frontal craniotomy, along the cerebral midline natural cleft to reach the third ventricle.\n\n\nRESULTS\nBy using microsurgical skill, subtotal removal of the tumors was achieved in 5 cases and partial removal was achieved in 3 cases with satisfactory postoperative effects.\n\n\nCONCLUSIONS\nKeeping the fornix, thalamus, midbrain, and internal cerebral vein intact with few complication and good outcome, transcallosal interforniceal approach is an ideal way to resect the medial type of thalamic gliomas.","cites":"1","conferencePercentile":"100"},{"venue":"Zhonghua yi xue za zhi","id":"445d0ecfccae7bc46749f2bef359e06e35a3d2ad","venue_1":"Zhonghua yi xue za zhi","year":"2008","title":"[Effect of Chinese medicine Huishen granule on cognitive outcome following diffuse axonal injury: experiment with rats].","authors":"Zhang-jie Su, Da-dong Han, Tao Zhang, Bao-gui Chen, Zhuo Yang","author_ids":"7776651, 4287660, 1743147, 6383053, 1860503","abstract":"OBJECTIVE\nTo investigate the influence of Chinese medicine Huishen granule (HG) containing ginseng, grassleaved sweet flag rhizome, pilose deer antler, etc, on learning and memory functions in diffuse axonal injury (DAI) and the mechanisms thereof.\n\n\nMETHODS\nImpact acceleration method was used to establish DAI Wistar rat models. Twenty model rats were randomly divided into 2 equal groups, the DAI+HG group treated with gastric perfusion of HG 3 times a day since 24 h after the establishment of model for 14 days, and the DAI group without treatment. Ten rats underwent sham operation as controls. Fourteen days after the injury, Morris water maze (MWM) test was used to detect the rat's abilities of learning and memory for continuous 5 days. The changes of escape latency in acquisition of the task, the percentage of time spent in target quadrant, and the number of crossing the point of original platform in probe test were recorded. At day 20 after the-operation, the rats were subjected to long-term potentiation (LTP) recording in hippocampus to measure the percentage of slope and baseline of excitatory post-synaptic potential (EPSP). Two rats from each group were killed 24 h, 14 d, and 20 d after the operation with their brains taken out, HE and immunohistochemical staining were employed to exam the brain lesion at 24 h, day 14 and 20 post-injury.\n\n\nRESULTS\nThe escape latency of the DAI group was (32.8+/-4.6) s, significantly longer than those of the DAI+HG and sham operation groups [(20.3+/-0.7) and (16.8+/-0.8) s respectively, both P<0.05]. The target quadrant staying time percentage and number of platform location crossings of the DAI group were (36.4+/-3.2)% and 4.5+/-0.6 respectively, both significantly less than those of the DAI+HG and sham operation groups [(46.0+/-2.4)% and 6.8+/-0.8, and (46.9+/-2.1)% and 8.1+/-0.8 respectively, all P<0.05]. The LTP level of the DAI group was (101.4+/-3.3)%, significantly lower than those of the DAI+HG and sham operation groups [(116.3+/-6.7)% and (117.9+/-2.8)% respectively, both P<0.05]. No significant differences in the parameters were found between the DAI+HG and sham operation groups (all P>0.05). Classical pathological changes of DAI occurred in the brains of the DAI and DAI+HG groups at the time point of 24 h, and mitigated partly at the time points of day 14 and 20.\n\n\nCONCLUSION\nThe learning and memory impairment of DAI was ameliorated significantly with the treatment of Chinese medicine HG, owing to the recuperation of synaptic plasticity in hippocampal area.","cites":"1","conferencePercentile":"90.625"},{"venue":"Zhonghua yi xue za zhi","id":"04324d11608d8abd1c5fc58336bebe209a314e43","venue_1":"Zhonghua yi xue za zhi","year":"2014","title":"[Curcumin improves the impaired working memory in cerebral ischemia-reperfusion rats by inhibiting proinflammatory cytokines].","authors":"Bin Ji, Yuan Han, Qixing Liu, Xuhua Liu, Fanghua Yang, Rui Zhou, Qingquan Lian, Hong Cao, Jun Li","author_ids":"7464644, 8361644, 2915686, 1716339, 5171762, 1755347, 6621541, 1686517, 3306969","abstract":"OBJECTIVE\nTo investigate the ameliorative effect of curcumin pretreatment against impaired spatial working memory on global cerebral ischemia-reperfusion rats and to explore its mechanism.\n\n\nMETHODS\nAfter trained on a modified T-maze, 120 adult SD rats were randomly divided into 5 groups: sham group (S group), cerebral ischemia-reperfusion group (IR group), curcumin group (C group), LPS group (L group) and curcumin+LPS group (C+L group). Rats were treated with drugs or vehicles 1 h before 10 min global cerebral ischemia. Six rats in each group 7 days after reperfusion were tested in T-maze. Six rats in each group were sacrificed at 2 h, 1, 3 and 7 d after reperfusion and their serum or brains were harvested. Brain sections were stained with HE or toluidine blue and neuronal damage was quantified by the average neuronal density of CA1 area. Immunohistochemical staining for hippocampal IL-1β and TNF-α was carried out, levels of serum IL-1β and TNF-α was detected using ELISA procedure.\n\n\nRESULTS\nCompared with S group, percentage of T-maze correct responses was decreased (88% ± 12% vs 69% ± 8%, P < 0.05), an extensive pyramidal neurons loss in CA1 area was observed, level of IL-1β (0.26 ± 0.04 vs 0.53 ± 0.06, P < 0.05;48 ± 13 vs 161 ± 31, P < 0.05) and TNF-α (40.244 ± 0.025 vs 0.418 ± 0.036, P < 0.05; 33 ± 4 vs 85 ± 15, P < 0.05) in hippocampi or serum was increased in IR group. Compared with IR group, percentage of T-maze correct responses was increased (78% ± 13%) and average pyramidal neuronal density in CA1 area was increased with an decrease in hippocampi or serum IL-1β (0.44 ± 0.09, 72 ± 19) and TNF-α (0.307 ± 0.047, 57 ± 14) in C group(P < 0.05). Compared with IR group, percentage of T-maze correct responses (61% ± 6%) was decreased with IL-1β (0.86 ± 0.13, 331 ± 51), TNF-α (0.735 ± 0.059, 185 ± 20) in hippocampi and serum was increased in L group (P < 0.05). Compared with L group, percentage of T-maze correct responses (69% ± 12%) and average pyramidal neuronal density in CA1 area was increased with IL-1β (0.69 ± 0.09, 246 ± 24), TNF-α(0.586 ± 0.047, 105 ± 25) in hippocampi and serum was decreased in C+L group (P < 0.05).\n\n\nCONCLUSION\nCurcumin pretreatment improves the impaired spatial working memory in global cerebral ischemia-reperfusion rats by inhibiting proinflammatory cytokines.","cites":"0","conferencePercentile":"47.36842105"},{"venue":"Zhonghua yi xue za zhi","id":"3f503444ce763767ab8722c3a20a1371d4df9e70","venue_1":"Zhonghua yi xue za zhi","year":"2011","title":"[The application of functional magnetic resonance imaging integrated neuronavigation in localization and lingual function protection].","authors":"Ming-qi Yang, Shuo Wang, Yan Zhang, Rong Wang, Yuan-li Zhao, Dong Zhang, Long Xu, Ji-zong Zhao, Bo Wang, Yan Zhuo, Lin Chen","author_ids":"7170165, 5994097, 3397757, 1698066, 7637640, 4944112, 1690940, 7817891, 1693029, 2497070, 1726575","abstract":"OBJECTIVE\nTo evaluate the clinical practicability of integration of functional magnetic resonance imaging (fMRI) data into neuronavigation as a tool to localize the language area and their relationship with the lesion for the preoperative planning, intraoperative guidance and postoperative follow-up study of brain functions during minimally invasive surgeries in or adjacent to functional areas.\n\n\nMETHODS\nEighty eight patients with intracranial lesions located in or adjacent to the functional language area underwent fMRI (including examinations of lingual and visual function, and motor functions of the limbs and tongue). fMRI data was entered into a neuronavigation system for image fusion and preoperative registration and correction; minimally invasive neurosurgery was performed with fMRI navigation.\n\n\nRESULTS\nThe shortest distance between the lesion and the functional cortex was less than 5 mm in 6 patients and was more than 5 mm but less than 10 mm in another 10 patients, respectively. 10 patients were recovered and improved in another 6 between 3 - 6 months after surgery, The follow-up time was between 3 months and 1 year. The morbidity rate was 6.8% (6/88). There was no postoperative mortality. Various brain areas were widely activated when the patients were reading and understanding the Chinese words. The unilateral speech functional maps were located in left Brodmann's 9, 46, 17, 18 and 19 areas.\n\n\nCONCLUSION\nfMRI-integrated neuronavigation can locate functional language areas and played an important role in intraoperative protection of functional lingual areas, execution of individualized therapeutic regimens, minimization of surgical complications and determination of prognosis. Total surgical resection was safe for lesions > 10 mm from functional lingual areas.","cites":"0","conferencePercentile":"41.42857143"},{"venue":"Zhonghua yi xue za zhi","id":"de6201ce322fd29fa9edc68d3b17688301c2eea8","venue_1":"Zhonghua yi xue za zhi","year":"2016","title":"[Regional homogeneity changes in patients with obstructive sleep apnea-hypopnea syndrome: resting-state functional MRI study].","authors":"Ting Chen, Ming Yang, Bin Liu, Yuting Liu, Chuanchuan Liu, Huixin Zhang, Zhichun Huang","author_ids":"1696970, 5015133, 1702756, 7895625, 7531417, 7215008, 7945482","abstract":"OBJECTIVE\nTo investigate the change of regional homogeneity (ReHo) in patients with obstructive sleep apnea-hypopnea syndrome (OSAHS) using resting-state functional magnetic resonance imaging(fMRI).\n\n\nMETHODS\nResting-state fMRI data were collected from 15 patients with OSAHS and 15 normal controls. Patients were enrolled from the Sleep Laboratory of the Otolaryngology-Head and Neck Surgery Department of Zhongda Hospital, Southeast University, Nanjing from November 2014 to June 2015. The data were analyzed with the ReHo method and compared between OSAHS and controls.\n\n\nRESULTS\nThe ReHo showed a significant increase in the posterior lobe of right cerebellum (t=4.292 1, P<0.01), posterior lobe of left cerebellum (t=4.350 6, P<0.01), right brainstem (t=5.276 6, P<0.01), right occipital lobe (t=3.620 9, P= 0.001), left basal ganglia (t=3.385 6, P=0.002) and left temporal lobe (t=4.781 2, P<0.01) and a decrease in the right middle frontal gyrus (t=-3.564 4, P= 0.001), right inferior parietal lobe (t=-4.123 7, P<0.01) and bilateral superior frontal gyrus (t=-3.500 9, P=0.002) in patients with OSAHS. Furthermore, the average ReHo values of the posterior lobe of bilateral cerebellum was positively correlated with the MMSE scores (r=0.682, P=0.012), the LMT scores (r=0.623, P=0.013) and the LMT-delayed recall scores (r=0.577, P=0.024), while negatively correlated with the TMT-A scores (r=-0.723, P=0.002); the average ReHo values of the right middle frontal gyrus (r=0.661, P=0.007) was positively correlated with the TMT-A scores.\n\n\nCONCLUSION\nThe current findings indicate that significant changes of ReHo in the global brain regions have been detected in OSAHS patients and the compensatory change of brain function occur. Abnormal ReHo values in the posterior lobe of bilateral cerebellum and right middle frontal gyrus could serve as potential biomarkers for assessment of neuronal damage and further provides insights into the biological mechanism of the disease.","cites":"0","conferencePercentile":"50"}]}