{"Zhongguo_Zhong_xi_yi_jie_he_za_":[{"venue":"Zhongguo Zhong xi yi jie he za zhi Zhongguo Zhongxiyi jiehe zazhi = Chinese journal of integrated traditional and Western medicine","id":"0f002d3d98b3c2f31e48b2c23651d7214373b835","venue_1":"Zhongguo Zhong xi yi jie he za zhi Zhongguo Zhongxiyi jiehe zazhi = Chinese journal of integrated traditional and Western medicine","year":"2015","title":"[Effect of acupuncture at different acupoints on electric activities of rat cerebellar fastigial nuclear].","authors":"Chao Liang, Yuan Wang, Bin Xu, Zhi Yu","author_ids":"8046608, 1724874, 3448332, 2125223","abstract":"OJECTIVE\nTo explore whether different acupuncture signals were afferent to the cerebellar fastigial nucleus (FN) neuron and to find out their corresponding effect features through observing the effect of spontaneous discharge of cerebellar FN neuron by needling at different acupoints.\n\n\nMETHODS\nTotally 120 male SD rats were anesthetized by 20% urethane and their right cerebellar FN were positioned (AP 11. 6 mm, RL 1. 0 mm, H 5. 6 mm). Extracelluar discharge was recorded by glass microelectrode (AP: -11. 6 mm, R: 1. 0 mm, H: 5.7 -7. 0 mm), using extracellular microelectrode recording method, recording the spontaneous discharge of cerebellar FN neurons as a baseline. Random order of needling at zusanli (ST36), quchi (Lil1), weishu (BL21), and zhongwan (CV12) were compared with the baseline before each acupuncture. Their effects on the discharge of cerebellar FN neurons were observed and compared with baselines.\n\n\nRESULTS\nThe frequency of FN neuronal discharge could be elevated by needling at zusanli (ST36), quchi (LiI), weishu (BL21), and zhongwan (CV12) (P <0. 01, P <0. 05). The response rate of needling at Zhongwan (CV12, 56. 00%) was higher than that of needling at Zusanli (ST36), Quchi (Ll1), and Weishu (BL21) (35. 00%, 34. 62%, 36. 63%, respectively) with statistical difference (P <0. 05). The response rate of needling at zhongwan (CV12) was obviously higher than that of needing at other points (F = 2. 101, P < 0. 05).\n\n\nCONCLUSIONS\nNeedling at zusanli (ST36 ), quchi (Lil), weishu (BL21), and zhongwan (CV12) could elevate the spontaneous discharge frequency of cerebellar FN neurons. Needling at Zhongwan (CV12) had advantageous roles in regulating cerebellar FN.","cites":"0","conferencePercentile":"60"},{"venue":"Zhongguo Zhong xi yi jie he za zhi Zhongguo Zhongxiyi jiehe zazhi = Chinese journal of integrated traditional and Western medicine","id":"97ff4ad9f811377e5b5883097d0f04a35a2a9d14","venue_1":"Zhongguo Zhong xi yi jie he za zhi Zhongguo Zhongxiyi jiehe zazhi = Chinese journal of integrated traditional and Western medicine","year":"2007","title":"[Effect of ligustrazine on migration of neuronal precursors after focal cerebral ischemia in adult rats].","authors":"Fen Qiu, Yong Liu, Yi-Hua Qian","author_ids":"3826433, 7135550, 6099132","abstract":"OBJECTIVE\nTo study the effect of ligustrazine on the migration of neuronal precursors (NPs) after focal cerebral ischemia in adult rats and explore its acting mechanism on recovery of function.\n\n\nMETHODS\nRat model of left middle cerebral artery occlusion (MCAO) was established by thread ligation. Ligustrazine 40 mg/kg was injected peritoneally once a day 2 h after modeling. On the 3rd, 7th, 14th and 21st day after operation, the migration of Doublecortin (DCX, the marker of NPs) in subventricular zone (SVZ) and the rostral migratory stream (RMS) were observed with immunohistochemistry.\n\n\nRESULTS\nThe migration of DCX-positive cells in SVZ (abbrev. as migration below) through RMS into the olfactory bulb started from the 3rd day after ischemia, and lasted to the 21st day; the migration directly or through RMS into the ischemic penumbra of the adjacent striatum started on the 7th day, and increased significantly on the 14th day; and a few of DCX positive cells migrated through corpus callosum into the ischemic cortex on the 21st day. The migration was similar in the two groups in its pathway, but the extent in the ligustrazine group was more intensive.\n\n\nCONCLUSION\nLigustrazine could promote direct migration of NPs into the ischemic cerebral cortex and striatum, suggesting that it might play an important role in promoting self-recovery of brain function after ischemia through accelerating the migration of NPs.","cites":"1","conferencePercentile":"58.33333333"},{"venue":"Zhongguo Zhong xi yi jie he za zhi Zhongguo Zhongxiyi jiehe zazhi = Chinese journal of integrated traditional and Western medicine","id":"b97414220158a85b3846db8d2f853ac4b34defc4","venue_1":"Zhongguo Zhong xi yi jie he za zhi Zhongguo Zhongxiyi jiehe zazhi = Chinese journal of integrated traditional and Western medicine","year":"2016","title":"[Effect of Yangxue Qingnao Granule on the Expression of CD11b in CA1 Region of Hippocampus of Vascular Dementia Rats].","authors":"Jing Li, Yuan-yuan Ma, Bin Liu, Wen-jing Mao, Jin-xia Zhang, Shi-ying Li","author_ids":"1742253, 4142536, 1750971, 8305858, 8215468, 8663326","abstract":"OBJECTIVE\nTo observe the effect of Yangxue Qingnao Granule (YQG) on the expression of CD11b in CA1 region of hippocampus of vascular dementia rats, and to explore its regulation on microglias.\n\n\nMETHODS\nTotally 144 SD rats were randomly divided into the sham-operation group, the vascular dementia model group (model), and the YQG treated group (treated). The vascular dementia rat model was prepared by modified Pulsinelli's four-vessel occlusion. Rats in the sham-operation group and the model group were administered with normal saline -(at the daily dose of 10 mL/kg) by gastrogavage, while those in the treated group were administered with YQG (0.32 g/mL, at the daily dose of 10 mL/kg) by gastrogavage. All administration was performed once per day for 8 successive weeks. The expression of CD11b in CA1 region of hippocampus of vascular dementia rats was detected at week 1, 2, 4, and 8, respectively.\n\n\nRESULTS\nCompared with the sham-operation group, the expression of CD11b in CA1 region of hippocampus of vascular dementia rats were significantly enhanced in the model group at each time point (P < 0.01). Compared with the model group, the expression of CD11b in CA1 region of hippocampus of vascular dementia rats significantly decreased in the treated group at each time point (P < 0.01), especially at week 2.\n\n\nCONCLUSION\nObvious activation and proliferation of microglias could be seen in CA1 region of hippocampus of vascular dementia rats, and YQG could inhibit activation and proliferation of microglias.","cites":"0","conferencePercentile":"55"},{"venue":"Zhongguo Zhong xi yi jie he za zhi Zhongguo Zhongxiyi jiehe zazhi = Chinese journal of integrated traditional and Western medicine","id":"8b4d01e1c988cd5dc9b57d740a26932beb100c5e","venue_1":"Zhongguo Zhong xi yi jie he za zhi Zhongguo Zhongxiyi jiehe zazhi = Chinese journal of integrated traditional and Western medicine","year":"2006","title":"[Effect of GETO on expression of protein in postsynaptic dense zone of Alzheimer's disease model rats].","authors":"Yi Xu, Jin-Zhou Tian, Shu-Li Sheng","author_ids":"1734114, 8369498, 7976376","abstract":"OBJECTIVE\nTo observe the effect of GETO on expression of PSD-95 and Shank-1 protein in postsynaptic dense zone in Alzheimer disease (AD) model rats.\n\n\nMETHODS\nThe AD model rats were established by beta-amyloid protein (Abeta(1-42)) injection into hippocampus CA1 zone. They were assigned into the model group, the donepezil treated group and the GETO treated group, besides, a normal group was set for control. Four weeks after modeling, Morris water maze test was applied to determine the learning and memory function of the AD rats, the number of PSD-95 and Shank-1 protein positive neuron as well as the optical density (OD) in post-synaptic dense zone of hippocampus CA1 area were determined by using immuno-histochemical stain and computerized graphic analysis techniques.\n\n\nRESULTS\nMorris water maze test showed that the mean escape latent period (MELP) of the model rats obviously prolonged than that of the normal rats, and the times of traversing flat roof obviously decreased (P < 0.01), while in the model rats after being treated by GETO, the two parameters were significantly shortened and increased respectively (P < 0.01), reaching the level insignificantly different to those in the donepezil group and the normal group. Immunohistochemical test showed that the number of positive stained neuron of PSD-95 and Shank-1 in hippocampus CA1 zone in the model group was significantly different to those in the normal group (P < 0.01), while in the GETO group those indexes were insignificantly different to those in the donepezil group and the normal group (P > 0.05), but showed a significant difference when compared with those in the model group (P < 0.05).\n\n\nCONCLUSION\nGETO can obviously improve the function of learning and memory of AD rats induced by Abeta(1-42), and the mechanism may be associated with its actions in improving expressions of PSD-95 and Shank-1 protein in hippocampus CA1 zone, and recovering the structure and function of synapse and enhancing its plasticity.","cites":"0","conferencePercentile":"31.25"},{"venue":"Zhongguo Zhong xi yi jie he za zhi Zhongguo Zhongxiyi jiehe zazhi = Chinese journal of integrated traditional and Western medicine","id":"12538e8e46ff9b83ec7d7247245d14f88861e234","venue_1":"Zhongguo Zhong xi yi jie he za zhi Zhongguo Zhongxiyi jiehe zazhi = Chinese journal of integrated traditional and Western medicine","year":"2006","title":"[Effects of acupuncture at Weizhong (BL40) on brain function with PET/CT].","authors":"Guang-rui Shapo, Lei Ma, Cheng Liu","author_ids":"5828800, 6432837, 3548443","abstract":"OBJECTIVE\nTo observe the effect of needling at Weizhong (BL 40) acupoint in inducing metabolic changes in brain with positron emission tomography and dynamic contrast (PET/CT) imaging for exploring the mechanism of central regulation of acupuncture.\n\n\nMETHODS\nPET/CT was performed before and during needling Weizhong acupoint of right leg by electro-acupuncture in 8 healthy volunteers, and also in other 8 subjects without any acupoint stimulation for control. Difference of brain functional images between the two groups before and during needling was analyzed by pairing t-test with statistical parametric mapping.\n\n\nRESULTS\nThe needling evoked mean activated cerebral functional regions were: left Broadmann area (BA) 10, 11, 22, 38, 39, 40, 44-46, right BA10, bilateral BA18, 19, and left cerebellar cortex, claustrum and insula (t > 3.36, P < 0.01, k >30 voxels); its mean inhibited brain functional regions were: bilateral BA24, left BA7, 8, 19, 40, right BA 1, 3, 6, 20, 44, and left substantia nigra.\n\n\nCONCLUSION\nThere is a certain connection between Weizhong acupoint and the brain. Needling this acupoint could exert effects through activating or inhibiting brain function in specific regions and neurohumoral regulation. One of the central regulation mechanisms of acupuncture was functional activation in superior, middle, and inferior frontal gyrus, insula and cerebellum and functional inhibition in callosal gyrus, lobi parietalis and substantia nigra. This study further demonstrated PET/CT is useful in revealing TCM meridian theory and could provide objective proof of central regulation for acupuncture treatment.","cites":"1","conferencePercentile":"75"},{"venue":"Zhongguo Zhong xi yi jie he za zhi Zhongguo Zhongxiyi jiehe zazhi = Chinese journal of integrated traditional and Western medicine","id":"e1c26998482ebf9ae1a306a8eabca8c5813a6309","venue_1":"Zhongguo Zhong xi yi jie he za zhi Zhongguo Zhongxiyi jiehe zazhi = Chinese journal of integrated traditional and Western medicine","year":"2015","title":"[Effect of Yinao Jieyu Recipe on Brain Derived Neurotrophic Factor of the Limbic System in Post-Stroke Model Rats].","authors":"Dong-mei Li, Qi-sheng Tang, Rui-zhen Zhao, Xiao-li Li, Ge Wang, Xin-ke Yang","author_ids":"4067878, 3544932, 8122536, 2617520, 6624472, 6832707","abstract":"OBJECTIVE\nTo observe the evolutionary tendency of brain derived neurotrophic factor (BDNF) of the limbic system in post-stroke model rats and the intervention effect of Yinao Jieyu Recipe (YJR).\n\n\nMETHODS\nMale Wistar rats were randomly divided into the normal control group (n =6), the sham-operation group (n =7), the multiple cerebral infarction (MCI) group (n =10), the post-stroke depression (PSD) group (n =10), the Chinese medicine (CM) treatment group (n =10), and the Western medicine (WM) treatment group (n =10) according to random digit table after open-field testing. Rats in the normal control group were routinely fed. 0. 3 mL normal saline was intravenously pushing from the external carotid artery to rats in the sham-operation group, and distilled water administered to them by gastrogavage. Each dose allogenic microthrombi were in vitro pushed to rats in the rest groups from the external carotid artery. The PSD model was duplicated by 21-day chronic unpredictable mild stress (CUMS) and single cage feeding in the PSD group 7 days after surgery. After preparing models rats in the CM group and the WM group were administered with YJR and Nimodipine respectively for 4 successive weeks. Changes of BDNF and the intervention effect of YJR were observed at week 1, 2, and 4 after intervention.\n\n\nRESULTS\nImmunohistochemical results of BDNF showed, compared with the normal control group, expression levels of BDNF in the hippocampus, hypothalamus, and amygdala decreased in the MCI group at week 2 and 4 (P <0. 01 , P <0. 05) ; expression levels of BDNF in each part decreased in the PSD group at week 1-4 (P <0.01). Compared with the MCI group, expression levels of BDNF in each part decreased in the PSD group at week 1-4 (P <0. 01). Compared with the PSD group, expression levels of BDNF in each part increased in the CM group at week 1-4 (P <0. 01).\n\n\nCONCLUSION\nBDNF changes existed in post-stroke model rats, and YJR could slow down this progress.","cites":"0","conferencePercentile":"60"}]}