{"Zhonghua_er_bi_yan_hou_ke_za_zh":[{"venue":"Zhonghua er bi yan hou ke za zhi","id":"09ee1ce09fce8de76ca50dd93f2611e4feef2d9d","venue_1":"Zhonghua er bi yan hou ke za zhi","year":"2002","title":"[Comparison of neural response telemetry thresholds with behavioral T/C levels].","authors":"Xueqing Chen, Demin Han, Xiaotian Zhao, Shuo Wang, Ying Kong, Sha Liu, Lingyan Mo, Bo Liu, Yanjun Wu","author_ids":"2409440, 3186099, 8343789, 5994097, 7218957, 1777681, 8456606, 1724237, 7860923","abstract":"OBJECTIVE\nTo provide an objective method to estimate T-levels and C-levels using neural response telemetry (NRT) thresholds for children, from whom we can not get accurate responses because they are very young or have other disabilities, by comparing NRT thresholds and T/C levels.\n\n\nMETHODS\nSeventy patients implanted with the nucleus CI24M multiple cochlear implant system participated in this study. 329 electrodes were tested. The software used in this study was NRT 2.04. Monopolar stimulation mode was used during NRT threshold measurement. No. 3, 5, 10, 15, 20 electrodes were tested for each patient. The T-levels and C-levels were obtained at the same visit.\n\n\nRESULTS\n92.7% of all the tested electrodes recorded NRT responses. There were variations in the amplitudes and thresholds of NRT responses across subjects and electrodes. NRT thresholds fell within the different points of the MAP dynamic range. The mean of NRT thresholds was shown to fall between the mean of T-levels and C-levels. The NRT thresholds and T/C levels reduced from basal to apical ends of the cochlear.\n\n\nCONCLUSIONS\nConsiderable variability across subjects was noted. So it is difficult to estimate T-levels and C-levels accurately by testing only NRT thresholds only. NRT technology provides a new objective method for estimating T-levels and C-levels for children who are unable to cooperate with audiologists during mapping after operation. The new NRT technology should be improved in the future.","cites":"0","conferencePercentile":"45.83333333"},{"venue":"Zhonghua er bi yan hou ke za zhi","id":"c2448a3a7ca9eae66699f5748e3528e23c7aa583","venue_1":"Zhonghua er bi yan hou ke za zhi","year":"2003","title":"[Cochlear implants in children with enlargement of vestibular aqueduct].","authors":"De-min Han, Xiao-tian Zhao, Yong-xin Li, Ying Kong, Jun Zheng, Xue-qing Chen, Sha Liu, Bo Liu, Ling-yan Mo","author_ids":"7883221, 5827256, 7771033, 7218957, 1737694, 2409440, 1777681, 1724237, 8456950","abstract":"OBJECTIVE\nTo describe the clinical experiences with multi-channel cochlear implantation in the children with enlargement of vestibular aqueduct.\n\n\nMETHOD\nFifteen patients were diagnosed with enlargement of vestibular aqueduct and received multi-channel cochlear implantation at Beijing Tongren Hospital. A cochleostomy was performed for all patients by a standard facial recess approach to anterior inferior to the round window niche.\n\n\nRESULTS\n(1) Most of the electrodes were totally inserted in the cochlear, and gusher appeared in 6 implantations. (2) No serious complications occurred after implantation. (3) All patients have auditory sensations after implantations. (4) The hearing threshold in this series were similar to that of the normal cochlear implantation (the average threshold was 30 dB). (5) The rehabilitation concept was developed by Rehabilitation Research Center for Deaf Children in Beijing and Beijing Tongren Hospital. The training sessions included sound detection, word discrimination, auditory comprehension and spoken language skill development. The abilities of speech discrimination and spoken language were improved comparing with that of pre-operation. Two of the patients could go to the normal school after implantations.\n\n\nCONCLUSION\nThe outcome of hearing rehabilitation for children with enlargement of vestibular aqueduct were similar to those children with \"normal\" cochlear structure followed the multi-channel cochlear implantation.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua er bi yan hou ke za zhi","id":"96a664dd6d16382d722da6200397cb92198e687e","venue_1":"Zhonghua er bi yan hou ke za zhi","year":"2002","title":"[Audiological characteristics of auditory neuropathy].","authors":"Jibao Wang, Jiade Duan, Qingtian Li, Xiang Huang, Haihua Chen, Jing Jin, Shusheng Gong, Weijia Kong","author_ids":"3747319, 5785201, 8194322, 1752825, 4393254, 1691569, 3853493, 3062927","abstract":"OBJECTIVE\nTo study the auditory electrophysiological characteristics of the auditory neuropathy.\n\n\nMETHODS\nTen patients were diagnosed as auditory neuropathy. The history, pure tone audiometry, stapedial reflex, auditory brainstem response, electrocochleogram, distortion product otoacoustic emission and his contralateral suppression of white noise, middle latency response and slow cortical response were assessed. Five patients were investigated with brain CT or MRI.\n\n\nRESULTS\nThe patients were of both genders. The average age was 20.3 years old and most of them were teenagers. Nine patients complained of bilaterally hearing impairment, while one patient who did not complain of hearing loss had a tinnitus of both ears. The pure tone audiogram showed a middle or moderate sensorineural hearing loss at low frequencies 0.5 kHz and/or 0.25 kHz in nineteen ears but a normal audiogram in one ear. Stapedial reflex was absent in nineteen ears, and threshold elevated in one ear while his pure tone audiogram revealed an ascending curve. Auditory brainstem response cannot be recorded or only wave V or/and wave I presented. All of the patients were evoked a distortion product OAE, which cannot be suppressed by contralateral white noise. Electrocochleogram demonstrated AP absent or very small amplitude in most ear and the--SP amplitude were 0.595 microV, while they had a normal slow cortical response but except one patient presented normal middle latency response. The findings of CT or MRI were normal.\n\n\nCONCLUSION\nThe pure tone audiogram could preserve unchanged at early stage of auditory neuropathy, but their stapedial reflex and auditory brainstem response are absent or threshold elevated. The precise pathologic site of this disorder is yet to be defined, but it may locate in the auditory system below brainstem.","cites":"1","conferencePercentile":"95.83333333"},{"venue":"Zhonghua er bi yan hou ke za zhi","id":"6b3682592dc3dd579d8c8dbf9a87a7ea4038d9d3","venue_1":"Zhonghua er bi yan hou ke za zhi","year":"2002","title":"[Reinnervation of the posterior cricoarytenoid muscle by the phrenic nerve for bilateral vocal cord paralysis in humans].","authors":"Hongliang Zheng, Shuimiao Zhou, Zhaoji Li, Shicai Chen, Suqin Zhang, Yideng Huang, Wu Wen, Xiaohua Shen, Hao Wu, Rongjue Zhou, Yi Cui, Liping Geng","author_ids":"2270946, 6344529, 2745003, 6008732, 2802381, 7524831, 7738430, 7260217, 1739602, 3796557, 7332198, 4042344","abstract":"OBJECTIVE\nTo reestablish the respiratory abduction of the paralyzed vocal cord through reinnervation of the posterior cricoarytenoid(PCA) muscle by the phrenic nerve in humans.\n\n\nMETHODS\nIn six cases with bilateral recurrent laryngeal nerve paralysis, the phrenic nerve was anastomosed to the anterior branch of recurrent laryngeal nerve, while the adductor branch of recurrent laryngeal nerve was severed and its proximal end was implanted into the PCA muscle belly in one side, for the other side nerve-muscle pedicle technique was used. All cases had been subjected to preoperative and postoperative video laryngoscopy, stroboscopy, electromyography, voice recording and acoustic analysis.\n\n\nRESULTS\nAmong the 6 patients, it is observed in five cases' phrenic nerve reinnervation side the inspiratory abducent motion evidently recovered, and the abducent range was from 3 to 5 mm, While only slight abductent motion or no motion could be recorded on the other side reinnervated with nerve-muscle pedicle technique, and the vocal cord excursion on this side was less than 1 mm in all cases. It is because the glottis is broad enough for the patients to have daily activities without short of breath, so all of them were decannulated postoperatively. The reinnervated PCA muscle by the phrenic nerve showed typical inspiratory high frequency discharge with 100-200 ms delay as compared with the other side, indicating the phrenic motoneuron pattern. No long-term diaphragmatic paralysis and lesion of respiratory function was found. All cases' voice was not weakened, and no aspiration occurred.\n\n\nCONCLUSION\nThe phrenic reinnervation is feasible clinically for treating vocal cord paralysis, and it is found to be more effective for restoring inspiratory abducent function than the nerve-muscle pedicle technique.","cites":"1","conferencePercentile":"95.83333333"}]}