{"Zhongguo_wei_zhong_bing_ji_jiu_":[{"venue":"Zhongguo wei zhong bing ji jiu yi xue = Chinese critical care medicine = Zhongguo weizhongbing jijiuyixue","id":"49fc77cee8f5b97c5ecca09abd536312b1b5008d","venue_1":"Zhongguo wei zhong bing ji jiu yi xue = Chinese critical care medicine = Zhongguo weizhongbing jijiuyixue","year":"2003","title":"[Changes and effects of group II metabotropic glutamate receptors in the cerebral cortex of rats after diffuse brain injuries coupled with hypopiesia secondary brain insults].","authors":"Zhou Fei, Xiang Zhang, Fang-he Gong, Hong-min Bai, Xi-ling Wang, Jing-wen Liang","author_ids":"2674745, 1686870, 7281214, 5977567, 8416607, 3121858","abstract":"OBJECTIVE\nTo study the changes and effects of group II metabotropic glutamate receptors (mGluR) after diffuse brain injuries (DBI) coupled with hypopiesia secondary brain insults (SBI).\n\n\nMETHODS\nMale SD rats were randomized into four groups: normal control, sham-operated, DBI alone and DBI coupled with SBI group. The SBI model was made on the basis of Marmarou's model. The mRNAs of the mGluRs were detected at 1, 3, 6, 12, 24, 48 and 72 hours after injuries by in-situ hybridization, and the positive neurons were counted.\n\n\nRESULTS\nStatistical analysis showed no significance between normal control group and sham-operated group, DBI group in mGluR 2, 3 mRNA (all P>0.05). The number of mGluR 2, 3 positive neurons decreased at 12 hours after injury and the peak occurred at 48 hours after injury in the injured cerebral cortex in DBI alone group (both P<0.05). However, in DBI with SBI group, there was a significant decrease of the number of mGluR2, 3 positive neurons at 6 hours after injury and the peak happened at 24 hours after injury (both P<0.05).\n\n\nCONCLUSION\nmGluR2, 3, factors with the function of protecting brain, might play an important role in the path physiology of DBI and SBI.","cites":"0","conferencePercentile":"50"},{"venue":"Zhongguo wei zhong bing ji jiu yi xue = Chinese critical care medicine = Zhongguo weizhongbing jijiuyixue","id":"dc7c110f18ef0f9c18ca68db47b373e57b2916a6","venue_1":"Zhongguo wei zhong bing ji jiu yi xue = Chinese critical care medicine = Zhongguo weizhongbing jijiuyixue","year":"2003","title":"[Study on the expressions of basic fibroblast growth factor and nervous growth factor genes in rat cerebral concussion].","authors":"Rui-yun Peng, Ya-bing Gao, Xing-yi Xiao, De-wen Wang, Hao-yu Chen, Xiao-hong Wu, Jie Liu, Wen-hua Hu, Bao-ren Cai","author_ids":"5073414, 6392542, 3987705, 7496318, 6998706, 1872008, 1699746, 3099246, 3531289","abstract":"OBJECTIVE\nTo study the expressions of basic fibroblast growth factor (bFGF) and nervous growth factor(NGF) genes in rat cerebral concussion.\n\n\nMETHODS\nEighty Wistar male rats were used for animal model of cerebral concussion, which were sacrificed on 1, 3, 7, 14 and 30 days after injury and the brain tissue was taken out. The expressions of bFGF and NGF genes were studied in the course of cerebral concussion by means of immunohistochemistry and in situ hybridization.\n\n\nRESULTS\nRats in 100 g group were seen the clinical manifestation for typical cerebral concussion. The protein and mRNA of bFGF were increased on day 1, obtained at peak on day 3-7, decreased on day 14 and also increased on day 30 compared with controls. The positive area was seen in the plasma of neurons in cerebral cortex, hippocampus, thalamus and cerebellum. NGF protein and mRNA showed strong positive and increased in the plasma of neurons in cerebral cortex, hippocampus, thalamus and cerebellum on day 1, and they were continuously positive but gradually decreased within 30 days after injury.\n\n\nCONCLUSION\nThe expression of bFGF gene participates in the course of cerebral concussion, might play an important role in the nervous cells degeneration and necrosis; NGF gene expression participates in the whole course of cerebral concussion, especially in the early phase.","cites":"4","conferencePercentile":"100"}]}