{"Zhonghua_wai_ke_za_zhi_Chinese_":[{"venue":"Zhonghua wai ke za zhi [Chinese journal of surgery]","id":"544b3bab5d5f99f0245cb93bf503344038d9a232","venue_1":"Zhonghua wai ke za zhi [Chinese journal of surgery]","year":"1994","title":"[Classification of hand and its significance].","authors":"F Liu, D Shi, S Z Lu","author_ids":"1734409, 4436085, 3089486","abstract":"Measurements of normal values in hand appearance and thumb movements were done in 102 male adult volunteers with no history of previous injury to their hands. The data showed some characteristics between the appearance and function of hand, for example, no case showed the distance of adduction of thumb was 0, but the normal function of hand was still acquired. Positive correlation appeared between the indexes of appearances of hand. Correlation analysis have been done for three pairs of indexes, that is, hand length and width, length of thumb and the distance of first web, adduction of thumb and thumb-opposition. The correlation charts and their formulae have been presented. Furthermore, hands of male chinese could be classified into five types according to the correlation chart or the formula. The significance of such classification i discussed as well.","cites":"0","conferencePercentile":"60"},{"venue":"Zhonghua wai ke za zhi [Chinese journal of surgery]","id":"72b018574bb8d0bfc8385776c725066589102f6b","venue_1":"Zhonghua wai ke za zhi [Chinese journal of surgery]","year":"2008","title":"[An experimental study on outcome of ipsilateral C7 nerve root transfer to repair the root avulsion of the brachial plexus].","authors":"Jie Song, Liang Chen, Yu-Dong Gu","author_ids":"1719329, 8702312, 1790117","abstract":"OBJECTIVE\nTo experimentally compare the treatment outcome of the injured upper limb of the root avulsion of C5 and C6 of the brachial plexus repaired by ipsilateral C7 nerve root transfer and other three multiple nerve transfers.\n\n\nMETHODS\nOne hundred and twenty SD rats of simulated C5 and C6 root avulsion randomly divided into 4 groups, and 30 each underwent various combined nerve transfers. Group A: the ipsilateral C7 root transferred to the upper trunk of brachial plexus and the spinal accessory nerve to the suprascapular nerve; Group B: partial fascicles of the ulnar nerve transferred to the biceps branch (Oberlin's procedure), the spinal accessory to the suprascapular and branches to the triceps long head to the axillary nerve; Group C: the phrenic transferred to the musculocutaneous, cervical plexus motor branches to the lower trunk (axillary nerve) of brachial plexus and the spinal accessory nerve to the suprascapular nerve; Group D: the phrenic transferred to the musculocutaneous and the spinal accessory nerve to the suprascapular nerve. Neurotization outcomes were evaluated at 3, 6 and 12 weeks postoperatively by comparing changes of behavioral tests (Ochiai clinical scores, Barth Foot-fault test and Terzis grooming test), neurophysiological investigations and muscular histology.\n\n\nRESULTS\nAt 3 weeks after operation, no significant difference was found between Group A and other three control groups in the three behavioral evaluations. Neurophysiologic investigations of the axillary nerve showed that Group A was superior to the other three groups. Muscular histological outcome of the axillary nerve and deltoid muscle showed that Group A was superior to the Group C and D, while no significant difference was found between Group A and B. Except that the thruput of regenerating medullated musculocutaneous nerve fibers of Group A was superior to Group C, neurophysiological and histological outcome of the musculocutaneous nerve and biceps showed that no significant difference was found between Group A and other three groups. At 12 weeks postoperatively, nearly all the behavioral, neurophysiological and histological determination showed that Group A was superior to the other three groups.\n\n\nCONCLUSIONS\nIpsilateral C7 transfer to the upper trunk of brachial plexus combined with the spinal accessory nerve to the suprascapular nerve is found to be significantly effective on treatment of the root avulsion of C5 and C6 of the brachial plexus.","cites":"0","conferencePercentile":"60"},{"venue":"Zhonghua wai ke za zhi [Chinese journal of surgery]","id":"984fecce9efa91934d3f02ee987bac5a28091b07","venue_1":"Zhonghua wai ke za zhi [Chinese journal of surgery]","year":"2009","title":"[Vertebra morphology measurement in adolescent idiopathic scoliosis population].","authors":"Li-xiang Ding, Yong Liu, Yi-peng Wang, Jian-guo Zhang, Jian-hua Hu, Fu-hui Dong, Gui-xing Qiu","author_ids":"7885871, 7135550, 7708734, 1744844, 8520566, 6338195, 1733248","abstract":"OBJECTIVE\nTo measurement the vertebra morphology using multi-planar reformations method of multi-slice spiral CT (MSCT) in AIS girls, and To compare with age and gender-matched controls in order to affirm the morphology results of abnormal development of the anterior and posterior elements in AIS.\n\n\nMETHODS\nThoracic and lumbar spine multi-slice spiral CT was undertaken on 52 girls with AIS between the age of 10 and 18 years from June 2004 to May 2008 in Peking Union Medical College Hospital and Beijing Shijitan Hospital, and 54 age and gender-matched non-IS controls. Multiple measurements (including the anterior column and posterior column) of each thoracic and lumbar vertebra were obtained using the 3D-MPR technique. The patients and control were divided into 10-14 years old group and 15-18 years old group. The corresponding vertebral anterior height, vertebral posterior height, transverse distance, vertebra central width, vertebra anterior-posterior distance, area of pedicle, pedicle height, pedicle width, and upper-lower facet distance were compared.\n\n\nRESULTS\nCompared with the controls, the 10-14 years old group girls' spine had longer anterior column height, relative shorter posterior column (there are difference from thoracic 2-11 and lumbar 1-3, P < 0.05), relative longer anterior-posterior vertebral distance, vertebral wedging changes in vertebral, distinct vertebral and pedicle asymmetry on the concave and convex side, and upper-lower facet distance asymmetry on the concave and convex side. The difference between the anterior and the posterior column ratio was significantly different from that in the controls (P < 0.01). But there hadn't the same difference in 15 - 18 years old group.\n\n\nCONCLUSIONS\nThere are differences in coronal plane vertebra wedging changes in AIS patient. There are high vertebra height, relative shorter posterior column, relative longer anterior-posterior vertebral distance, and relative slender vertebra in 10 - 14 years old AIS patients. This may lead to the initial and progression of scoliosis.","cites":"0","conferencePercentile":"40"},{"venue":"Zhonghua wai ke za zhi [Chinese journal of surgery]","id":"1dfd3b4b353b0438a43d2bcd2c78da983e4e3dcc","venue_1":"Zhonghua wai ke za zhi [Chinese journal of surgery]","year":"2007","title":"[Accuracy and related affecting factors of somatosensory evoked potential monitoring in cervical and thoracic surgery].","authors":"Zong-Hua Qi, Yong-Ming Xi, Yong Liu, De-Chun Wang","author_ids":"5867158, 7867187, 7135550, 7496253","abstract":"OBJECTIVE\nTo evaluate the accuracy and related affecting factors of the intra-operative somatosensory evoked potential monitoring in cervical and thoracic surgery.\n\n\nMETHODS\nCortical somatosensory evoked potential (CSEP) monitoring and sub cortical somatosensory evoked potential (Sub-CSEP) monitoring were performed in cervical and thoracic surgery. Somatosensory evoked potential (SEP) changes were recorded during anaesthesia and operation and postoperative, which could be used to evaluate accuracy of SEP.\n\n\nRESULTS\nBilateral CSEP wave abnormalities were related to anaesthesia, decreasing wave amplitudes did not reach the alarming standard. Intra-operative manipulation to affect spinal cord would influence iso-lateral wave abnormality of CSEP and sub-CSEP, decreasing amplitudes reached the alarming standard. Local hypothermia such as cold water irrigating spinal cord would be to prolong the latent period. Low mean arterial pressure (MAP) mostly influenced amplitudes. Changes of SEP in local hypothermia and MAP did not reach the alarming standard.\n\n\nCONCLUSIONS\nCSEP and Sub CSEP can reflex physiopathological condition of spinal cord, it is useful in evaluating spinal cord function and providing the safety for cervical and thoracic surgery.","cites":"0","conferencePercentile":"50"},{"venue":"Zhonghua wai ke za zhi [Chinese journal of surgery]","id":"934ab44877094453c517e9fdeacf4979a599414a","venue_1":"Zhonghua wai ke za zhi [Chinese journal of surgery]","year":"2008","title":"[Resting functional MRI with default mode-based functional connectivity analysis for localization of epileptic activity].","authors":"Zhi-qiang Zhang, Guang-ming Lu, Qi-fu Tan, Yuan Zhong, Lei Tian, Jian-guo Zhu, Shi-jie Wang, Kang-jian Sun, Wei Huang, Yi-jun Liu","author_ids":"7969553, 7232877, 7705603, 2189447, 4959895, 8535588, 7489203, 4564665, 1730584, 3108088","abstract":"OBJECTIVE\nUsing the functional connectivity analysis based on the underlying neurophysiological characteristic that epileptic discharges can induce change of brain default mode, to develop a technique for epileptogenic localization using functional MRI (fMRI) without simultaneous electroencephalography (EEG).\n\n\nMETHODS\nA data-driven method that jointly employed independent component analysis and functional connectivity analysis was used for the resting functional MRI data analysis of 12 focal epileptic patients. The independent components were ranged according to the coefficients of the negative correlation between independent component time course and the signal temporal course in the region of posterior cingulate cortex. The results were comparatively studied with simultaneous EEG-fMRI.\n\n\nRESULTS\nIn the 10 successful results from 12 patients underwent EEG-fMRI examination, the outcomes of eight subjects were concordant with pathological foci. While the results of all 10 patients processed by data-driven method were concordant with pathological foci, besides the other patients who failed to perform EEG-fMRI examination. Meanwhile, the default mode was well mapped in all patients.\n\n\nCONCLUSIONS\nThe default mode-based functional connectivity analysis can localize the epileptogenic foci effectively without simultaneous EEG, besides to detect the default mode of epileptic patients.","cites":"0","conferencePercentile":"60"},{"venue":"Zhonghua wai ke za zhi [Chinese journal of surgery]","id":"c079c6aeddd0f29ba303be6ff6d29a03bd2205f8","venue_1":"Zhonghua wai ke za zhi [Chinese journal of surgery]","year":"1999","title":"[Biomechanical evaluation of five fixation techniques for the lower cervical spine].","authors":"D Wang, T Tang, S Huang, H Yang, Q Zhu, J Oyang","author_ids":"1715538, 8425606, 2763481, 2340817, 7004299, 3188832","abstract":"OBJECTIVE\nThis study biomechanically investigated the three-dimensional motion stability of five reconstruction methods in the cervical spine, in order to provide the biomechanical basis for the clinical selection of fixation methods.\n\n\nMETHODS\nWith eight adult cervical spine fresh specimens, the three-column injury was produced at C(4 - 5) level. The spinal constructs, reconstructed by various techniques including anterior titanium locking screw plate (TLSP), posterior interspinous wiring (IW), combined fixation with the TLSP and IW (TLSP + IW), Roy-Camille plate (RP), and transpedicular screw plate (TP), were tested under six loading modes-flexion, extension, right/left lateral bending, and right/left axial rotation.\n\n\nRESULTS\nThe three-dimensional motion stability of either TLSP or IW was less than that of intact cervical spine. The TLSP + IW and RP provided increased stability compared with the intact spine. The stabilizing capabilities of transpedicular screw plate fixation was the best in all loading modes.\n\n\nCONCLUSIONS\nIn three-column instability of cervical spine injury, exclusive use of the anterior plate or the posterior interspinous wiring was not supported by the results. The stabilizing capabilities provided by combined anterior and posterior instrumentation and posterior plate were good. The three-column fixation for the cervical spine using transpedicular screw plate fixation offers increased stability significantly over that of other conventional cervical fixation systems.","cites":"0","conferencePercentile":"75"},{"venue":"Zhonghua wai ke za zhi [Chinese journal of surgery]","id":"ff2fcd0d89cf8c6d90c9e9f9dea66836819c33f8","venue_1":"Zhonghua wai ke za zhi [Chinese journal of surgery]","year":"2008","title":"[A finite element investigation of bilateral atlantoaxial trans-articular screws and atlas laminar hooks instrumentation].","authors":"Zhong-Wu Ren, Bin Ni, Hai-Tao Song, Mei-Chao Zhang, Xiang Guo, Ming-Fei Wang, Jian Wang, Song-Kai Li, Feng Zhang, Chun-Sheng Tao, Yu Wang","author_ids":"5727533, 7494664, 3020624, 7979457, 3255489, 1902415, 1743989, 5366757, 1801216, 8652491, 1682675","abstract":"OBJECTIVES\nTo investigate the mechanical properties of bilateral atlantoaxial trans-articular screws and atlas laminar hooks instrumentation with finite element method.\n\n\nMETHODS\nThere was a volunteer with age of 28 years old, body height 172 cm, body weight of 60 kg and without cervical deformity by X rays. The ligamentous, nonlinear, three-dimensional finite element models of normal upper cervical spine (C0-3) was developed and validated. The destabilized model with bilateral atlantoaxial trans-articular screws and atlas laminar hooks was evaluated for quasistatic loading.\n\n\nRESULTS\nThe finite element model of upper cervical spine consists of 229,047 nodes and 152,475 elements, and correlated well with experimental data for all load cases and could be used for experiment. The finite model with bilateral atlantoaxial trans-articular screws and atlas-laminar hooks predicted that the maximum Von Mises Stress was in the region in which screws penetrated the atlantoaxial articular facet. The novel instrumentation resulted in sufficient stability.\n\n\nCONCLUSION\nThe bilateral atlantoaxial trans-articular screws and atlas laminar hooks instrumentation is useful and effective for atlantoaxial arthrodesis.","cites":"0","conferencePercentile":"60"},{"venue":"Zhonghua wai ke za zhi [Chinese journal of surgery]","id":"a3085a439ff6adf8f5a27bdaba84a68a9182661e","venue_1":"Zhonghua wai ke za zhi [Chinese journal of surgery]","year":"2013","title":"[Discectomy and discectomy plus Coflex fixation for lumbar disc herniation, a clinical comparison study].","authors":"Ding Xu, Hua-zi Xu, Yi-heng Chen, Yong-long Chi, Wen-fei Ni, Qi-shan Huang, Xiang-yang Wang, Yan Lin, Fang-min Mao","author_ids":"3171253, 2729477, 7377695, 7236578, 7896524, 8304937, 3415680, 1918596, 4575676","abstract":"OBJECTIVE\nTo compare clinical efficacy between discectomy and discectomy plus Coflex fixation for lumbar disc herniation.\n\n\nMETHODS\nFrom December 2007 to August 2008, 50 patients (31 males and 19 females) were treated by surgery of discectomy and discectomy plus Coflex fixation. The average age was 52.5 years (range, 30 - 72 years). There were 24 cases in the group of discectomy plus Coflex fixation and 26 cases in the group of discectomy. Preoperative and postoperative visual analogue scales (VAS), Japanese Orthopadic Association (JOA) and Oswestry disability index (ODI) were recorded, as well as radiological index. And use a paired t-test and one-way analysis of variance (one-way ANOVA) statistical method to evaluate the Coflex dynamic stabilization system in value in the treatment of lumbar disc herniation.\n\n\nRESULTS\nBoth groups received significant improvement of JOA, ODI and VAS (t = -33.2 - 64.5, P < 0.01), but the group of discectomy was found with deterioration of ODI at last follow-up, 12 months after surgery 6.7 ± 1.5 to 10.2 ± 2.3 (t = -19.3, P < 0.05). The group of discectomy plus Coflex fixation was found with significant increase of height of dorsal intervertebral discs (HD), distance across the two adjacent spinous processes (DS), distance of intervertebral foramina (DIF) and spinal canal area(SA) (t = -34.4 - 4.5, P < 0.05). In contrast, the group of discectomy was found with significant decrease of HD, DS, DIF and SA (t = 3.4 - 52.8, P < 0.05). Coflex fixed group in HD, DIF, DS significant difference with simple discectomy group, with a statistically significant (F = 14.1 - 25.6, P < 0.05).\n\n\nCONCLUSIONS\nBoth discectomy and discectomy plus Coflex fixation are apparently effective when treating lumbar disc herniation. Coflex can significantly increase the HD and DIF when used for lumbar disc herniation, and it has positive influence for keeping height of lumbar vertebral space and treating the nerve root symptom of lumbar disc herniation. Discectomy plus Coflex is better than pure discectomy in preventing lumbar degeneration.","cites":"0","conferencePercentile":"66.66666667"}]}