{"ZiF_Workshop.csv":[{"venue":"ZiF Workshop","id":"12d8d4a6fcd1739cdf6da18ba1c31fc7de65c589","venue_1":"ZiF Workshop","year":"2006","title":"Listening Heads","authors":"Dirk Heylen","author_ids":"1678537","abstract":"In [1] we discussed functions of head movements and gaze. In this paper, we will go into more depth in the classification of various head movements: how they are distinguished in both formal and functional terms. We look at the distribution of a selection of primitive head movements and their related meanings and the way they are composed out of smaller units. This catalogue is not intended to be exhaustive and does not take into account the component items from other modalities such as speech, facial expressions, gestures and posture. The research is motivated by our desire to build systems that can interpret and mimick expressive human behaviour.","cites":"0","conferencePercentile":"8.333333333"},{"venue":"ZiF Workshop","id":"69a146419824a1f1bfd7f852ed6b7f82c0fd1be2","venue_1":"ZiF Workshop","year":"2006","title":"True Emotion vs. Social Intentions in Nonverbal Communication: Towards a Synthesis for Embodied Conversational Agents","authors":"Jonathan Gratch","author_ids":"1730824","abstract":"Does a facial expression convey privileged information about a per-son's mental state or is it a communicative act, divorced from \" true \" beliefs, desires and intentions? This question is often cast as a dichotomy between competing theoretical perspectives. Theorists like Ekman argue for the primacy of emotion as a determinant of nonverbal behavior: emotions \" leak \" and only indirectly serve social ends. In contrast, theorists such as Fridlund argue for the primacy of social ends in determining nonverbal displays. This dichotomy has worked to divide virtual character research. Whereas there have been advances in modeling emotion, this work is often seen as irrelevant to the generation of communicative behavior. In this chapter, I review current findings on the inter-personal function of emotion. I'll discuss recent developments in Social Appraisal theory as a way to bridge this dichotomy and our attempts to model these functions within the context of embodied conversational agents.","cites":"3","conferencePercentile":"25"},{"venue":"ZiF Workshop","id":"02d4f7b476e2e4f2055505e0efed4f665bb42df2","venue_1":"ZiF Workshop","year":"2006","title":"From Annotated Multimodal Corpora to Simulated Human-Like Behaviors","authors":"Matthias Rehm, Elisabeth André","author_ids":"2402397, 4843293","abstract":"Multimodal corpora prove useful at different stages of the development process of embodied conversational agents. Insights into human-human communicative behaviors can be drawn from such corpora. Rules for planning and generating such behavior in agents can be derived from this information. And even the evaluation of human-agent interactions can rely on corpus data from human-human communication. In this paper, we exemplify how corpora can be exploited at the different development steps, starting with the question of how corpora are annotated and on what level of granularity. The corpus data can be used either directly for imitating the human behavior recorded in the corpus or rules can be derived from the data which govern the behavior planning process. Corpora can even play a vital role in the evaluation of agent systems. Several studies are presented that make use of corpora for the evaluation task.","cites":"9","conferencePercentile":"70.83333333"},{"venue":"ZiF Workshop","id":"0870e0d4378496548e4b9f19911053072d5300c6","venue_1":"ZiF Workshop","year":"2006","title":"Modeling Multimodal Communication as a Complex System","authors":"Kristinn R. Thórisson","author_ids":"1727838","abstract":"The overall behavior and nature of complex natural systems is in large part determined by the number and variety of the mechanisms involved – and the complexity of their interactions. Embodied natural communication belongs to this class of systems, encompassing many cognitive mechanisms that interact in highly complex ways, both within and between communicating individuals, constituting a heterogeneous, large, densely-coupled system (HeLD). HeLDs call for finer model granularity than other types of systems, lest we risk them to be not only incomplete but likely incorrect. Consequently, models of communication must encompass a large subset of the functions and couplings that make up the real system, calling for a powerful methodology for integrating information from multiple fields and for producing runnable models. In this paper I propose such an approach, abstract module hierarchies, that leverages the benefits of modular construction without forcing modularity on the phenomena being modeled.","cites":"9","conferencePercentile":"70.83333333"}]}