{"ZooKeys.csv":[{"venue":"ZooKeys","id":"4e0add50a619c8f7d38e58b1cd7fc556c42d8c19","venue_1":"ZooKeys","year":"2013","title":"First description of the female of Sinopoda serrata (Wang, 1990) (Araneae, Sparassidae)","authors":"Dan Quan, Jian Chen, Jie Liu","author_ids":"8014935, 7035007, 1699746","abstract":"The female of Sinopoda serrata (Wang, 1990) is described for the first time from Tiantangzhai National Forest Park, Hubei province, China. This species has been recorded from the region of Central China. Morphological descriptions and illustrations of this species are given.","cites":"0","conferencePercentile":"26.62473795"},{"venue":"ZooKeys","id":"2a4e773a7c3e7b4e1955eff1344e15e730b70a02","venue_1":"ZooKeys","year":"2016","title":"A new species of Metopiinae (Hymenoptera, Ichneumonidae) parasitizing lepidopteran larvae in China","authors":"Ying Zhang, Mao-Ling Sheng, Zi-Cheng Xiong","author_ids":"1752812, 2389227, 8508678","abstract":"A new species of Metopiinae, Trieces etuokensis Sheng, sp. n., is described and illustrated. Specimens were reared from two species of Lepidoptera: Bazaria turensis (Ragonot, 1887) (Pyralidae) from Balong, Dulan, Qinghai Province, and an unidentified psychid (Psychidae) from Mukainor, Etuoke, Inner Mongolia Autonomous Region, China. The new species is characterized by a yellow face and clypeus, fore and middle femora and hind tibia mainly black, antennae slightly longer than head and mesosoma combined, with 17 flagellomeres, occipital carina entirely absent, and the hind femur being compressed, 2.5 times as its long as maximum width.","cites":"0","conferencePercentile":"44.35146444"},{"venue":"ZooKeys","id":"75a1d7d4f86e4b45af484d041aee5ae1150aae5e","venue_1":"ZooKeys","year":"2016","title":"A new species of the genus Falsoibidion Pic (Coleoptera, Cerambycidae) from Korea","authors":"Seunghyun Lee, Seunghwan Lee","author_ids":"2713644, 2934977","abstract":"A new species of the genus Falsoibidion Pic, 1922 (Coleoptera, Cerambycidae, Cerambycinae, Callidiopini) from Korea is described. Habitus and genitalia of male and female of the new species are illustrated.","cites":"0","conferencePercentile":"44.35146444"},{"venue":"ZooKeys","id":"49453e57edc49b8ab25a387048d55a5f880468c9","venue_1":"ZooKeys","year":"2012","title":"Species of the genus\nLamachus Förster (Hymenoptera, Ichneumonidae) parasitizing diprionid sawflies (Hymenoptera, Diprionidae) with descriptions of two new species and a key to Chinese species\n","authors":"Tao Li, Mao-Ling Sheng, Shu-Ping Sun","author_ids":"1726351, 2389227, 7393139","abstract":"Four species of the genus Lamachus Förster 1869 belonging to the tribe Mesoleiini of the subfamily Ctenopelmatinae (Hymenoptera, Ichneumonidae) are reported from China. Two of them are new to science, Lamachus nigrus Li, Sheng & Sun, sp. n. and Lamachus rufiabdominalis Li, Sheng & Sun, sp. n. were reared from Neodiprion huizeensis Xiao & Zhou, in Guizhou Province of the Oriental part of China. The biology of Lamachus rufiabdominalis is described. A key to the species of Lamachus known from China is provided.","cites":"1","conferencePercentile":"55.98591549"},{"venue":"ZooKeys","id":"0857bf85449f5b337c95b2cce3f39ca0fefe3203","venue_1":"ZooKeys","year":"2015","title":"First record of the plant bug genus Paramiridius Miyamoto & Yasunaga (Heteroptera, Miridae, Mirinae) from Indochina, with descriptions of two new species from Laos","authors":"Minsuk Oh, Tomohide Yasunaga, Seunghwan Lee","author_ids":"8417569, 6530049, 2934977","abstract":"The mirine plant bug genus Paramiridius, previously known only from a single Taiwanese species, is reported from Indochinese Laos for the first time and redefined. Two additional species, Paramiridius indochinensis and Paramiridius laomontanus, are described as new to science. The female genitalic structures of the genus are documented for the first time. Habitus illustrations, figures of male genitalia, and key are provided for all three known Paramiridius species.","cites":"1","conferencePercentile":"80.86419753"},{"venue":"ZooKeys","id":"a83cdd5075b4d8c435ba3890d70fe4116777df23","venue_1":"ZooKeys","year":"2016","title":"Two new species of Prolyda from the Middle Jurassic of China (Hymenoptera, Pamphilioidea).","authors":"Chen Wang, Chungkun Shih, Alexandr P Rasnitsyn, Mei Wang","author_ids":"1710899, 8548300, 5284457, 3793143","abstract":"Two new species of the genus Prolyda Rasnitsyn, 1968, Prolyda dimidia sp. n. and Prolyda elegantula sp. n., are described and illustrated. Both specimens were well-preserved and collected from the latest Middle Jurassic Jiulongshan Formation of Daohugou Village in Inner Mongolia, China. Based on the new morphological data, a key to the five known species of Prolyda is provided. In addition, Prolyda has an enlarged first antennal flagellomere, which means it might have revert to the elongate plesiomorphic state for the antennal configuration as previously documented.","cites":"0","conferencePercentile":"44.35146444"},{"venue":"ZooKeys","id":"ddd5237b8d504524bd4a2a364b7fa5fc7b0db76c","venue_1":"ZooKeys","year":"2013","title":"Chinese species of the genus\nAptesis Förster (Hymenoptera, Ichneumonidae) parasitizing sawflies, with descriptions of three new species and a key to species\n","authors":"Tao Li, Mao-Ling Sheng, Shu-Ping Sun","author_ids":"1726351, 2389227, 7393139","abstract":"Six species of the genus Aptesis Förster 1850 belonging to the tribe Hemigastrini of the subfamily Cryptinae (Hymenoptera, Ichneumonidae) are reported from China. Three of them, Aptesis elongata Li & Sheng, sp. n., Aptesis melana Li & Sheng, sp. n. and Aptesis nigricoxa Li & Sheng, sp. n. reared from sawflies in China, are new to science. The biology of Aptesis melana is described. A key to the species of Aptesis known from China is provided.","cites":"0","conferencePercentile":"26.62473795"},{"venue":"ZooKeys","id":"17c7f7e6110c443638b9b653a17ecf011101117a","venue_1":"ZooKeys","year":"2016","title":"Morphometric and molecular characterization of populations of Pratylenchus\nkumamotoensis and P.\npseudocoffeae (Nematoda, Pratylenchidae) newly recorded in Korea","authors":"Dongwoo Kim, Jae-Yong Chun, Kyeong-Yeoll Lee","author_ids":"6067868, 6822051, 8035860","abstract":"At least 70 species of root-lesion nematodes, Pratylenchus spp., have been identified worldwide, many of which are serious pests of various agricultural crop plants. In Korea, only 14 species have been recorded in vegetable and fruit fields. Here, we report two new records of root-lesion nematode species in Korea based on morphometric and molecular methods. Soil samples were collected from chrysanthemum cultivars in various regions. Morphometric diagnosis showed that two new records for Korea: Pratylenchus kumamotoensis in Chilgok County and Pratylenchus pseudocoffeae in Geumsan County. In addition, molecular diagnosis using the two sequences of the internal transcribed spacer (ITS) and the D2-D3 region of ribosomal DNA showed that these two species were most similar with those from Japan, Costa Rica and USA. The similarities of the ITS and D2-D3 sequences were 99.85 and 99.74%, respectively, for Pratylenchus kumamotoensis and 99.99 with Costa Rica populations and 99.86% with USA populations, respectively, for Pratylenchus pseudocoffeae. To our knowledge, this is the first report of two species in Korea.","cites":"0","conferencePercentile":"44.35146444"},{"venue":"ZooKeys","id":"3385d4ef05c39093016a2e0d54a5e32f6ceb0aa1","venue_1":"ZooKeys","year":"2015","title":"A review of the genus Toxorhina Loew from China, with descriptions of three new species (Diptera, Limoniidae, Limoniinae)","authors":"Xiao Zhang, Yan Li, Ding Yang","author_ids":"1695042, 2264709, 1817531","abstract":"The genus Toxorhina Loew from China is reviewed. Seven species belonging to the subgenus Ceratocheilus Wesche are recognized, of which three species, Toxorhina (Ceratocheilus) huanglicasp. n., Toxorhina (Ceratocheilus) omnifuscasp. n. and Toxorhina (Ceratocheilus) univirgatasp. n., are described as new to science, Toxorhina (Ceratocheilus) fuscolimbata Alexander is recorded from China for the first time, and three known species are redescribed and illustrated.","cites":"0","conferencePercentile":"36.11111111"},{"venue":"ZooKeys","id":"3da0d492593e467f194d04a72da8b7be6aa7412f","venue_1":"ZooKeys","year":"2015","title":"Five new Platocoelotes species (Araneae, Agelenidae) from caves in southern China","authors":"Lu Chen, Shuqiang Li, Zhe Zhao","author_ids":"1745299, 8087046, 2750850","abstract":"Five new Platocoelotes species are described based on both sexes collected from caves in southern China. They are: Platocoelotesluoi sp. n. from Jiangxi, Platocoelotesqinglinensis sp. n. from Yunnan, Platocoelotesshuiensis sp. n. from Guizhou, Platocoelotestianyangensis sp. n. from Sichuan and Platocoelotesxianwuensis sp. n. from Hubei.","cites":"4","conferencePercentile":"98.35390947"},{"venue":"ZooKeys","id":"368f62cdd9d2b0c8cab95e78295efbf2c10b620a","venue_1":"ZooKeys","year":"2015","title":"A new genus of Coelotinae (Araneae, Agelenidae) from southern China","authors":"Lu Chen, Shuqiang Li, Zhe Zhao","author_ids":"1745299, 8087046, 2750850","abstract":"One new genus of the spider subfamily Coelotinae, Flexicoelotes gen. n., with five new species is described from southern China: Flexicoelotes huyunensis sp. n. (female), Flexicoelotes jiaohanyanensis sp. n. (male and female), Flexicoelotes jinlongyanensis sp. n. (male and female), Flexicoelotes pingzhaiensis sp. n. (female), Flexicoelotes xingwangensis sp. n. (male and female).","cites":"1","conferencePercentile":"80.86419753"},{"venue":"ZooKeys","id":"076d9dd06019c50409fd402d80a74c33cc7674ad","venue_1":"ZooKeys","year":"2016","title":"Sinocoelotes gen. n., a new genus of the subfamily Coelotinae (Araneae, Agelenidae) from Southeast Asia","authors":"Lu Chen, Zhe Zhao, Shuqiang Li","author_ids":"1745299, 2750850, 8087046","abstract":"A new genus of the spider subfamily Coelotinae, Sinocoelotes gen. n., with nine new species, is described from Yunnan and Sichuan Provinces in southern China. The new species are: Sinocoelotes cangshanensis sp. n. (♀), Sinocoelotes hehuaensis sp. n. (♂♀), Sinocoelotes luoshuiensis sp. n. (♀), Sinocoelotes mangbangensis sp. n. (♀) from Yunnan; Sinocoelotes kangdingensis sp. n. (♀), Sinocoelotes ludingensis sp. n. (♂♀), Sinocoelotes mahuanggouensis sp. n. (♀), Sinocoelotes muliensis sp. n. (♀), and Sinocoelotes yanyuanensis sp. n. (♂) from Sichuan. In addition, six Coelotes species are transferred to the new genus: Sinocoelotes acicularis (Wang, Griswold & Ubick, 2009), comb. n. (♂♀), Sinocoelotes forficatus (Liu & Li, 2010), comb. n. (♂♀), Sinocoelotes guangxian (Zhang, Yang, Zhu & Song, 2003), comb. n. (♂♀), Sinocoelotes pseudoterrestris (Schenkel, 1963), comb. n. (♂♀), Sinocoelotes pseudoyunnanensis (Wang, Griswold & Ubick, 2009), comb. n. (♂♀) and Sinocoelotes thailandensis (Dankittipakul & Wang, 2003), comb. n. (♂♀). DNA barcodes of all the species were documented for future use.","cites":"0","conferencePercentile":"44.35146444"},{"venue":"ZooKeys","id":"7297f496b6664c3737950b2c7ef70a4ad8e22695","venue_1":"ZooKeys","year":"2011","title":"Biodiversity information platforms: From standards to interoperability","authors":"W. G. Berendsohn, A. Güntsch, N. Hoffmann, A. Kohlbecker, K. Luther, A. Müller","author_ids":"2814814, 2190273, 7704554, 8607895, 2427623, 8091935","abstract":"One of the most serious bottlenecks in the scientific workflows of biodiversity sciences is the need to integrate data from different sources, software applications, and services for analysis, visualisation and publication. For more than a quarter of a century the TDWG Biodiversity Information Standards organisation has a central role in defining and promoting data standards and protocols supporting interoperability between disparate and locally distributed systems.Although often not sufficiently recognized, TDWG standards are the foundation of many popular Biodiversity Informatics applications and infrastructures ranging from small desktop software solutions to large scale international data networks. However, individual scientists and groups of collaborating scientist have difficulties in fully exploiting the potential of standards that are often notoriously complex, lack non-technical documentations, and use different representations and underlying technologies. In the last few years, a series of initiatives such as Scratchpads, the EDIT Platform for Cybertaxonomy, and biowikifarm have started to implement and set up virtual work platforms for biodiversity sciences which shield their users from the complexity of the underlying standards. Apart from being practical work-horses for numerous working processes related to biodiversity sciences, they can be seen as information brokers mediating information between multiple data standards and protocols.The ViBRANT project will further strengthen the flexibility and power of virtual biodiversity working platforms by building software interfaces between them, thus facilitating essential information flows needed for comprehensive data exchange, data indexing, web-publication, and versioning. This work will make an important contribution to the shaping of an international, interoperable, and user-oriented biodiversity information infrastructure.","cites":"6","conferencePercentile":"96.28820961"},{"venue":"ZooKeys","id":"d80626d96907643aa432e949e833768fd307f6df","venue_1":"ZooKeys","year":"2015","title":"A new species of Pseudomegischus van Achterberg from China, with a key to the species (Hymenoptera, Stephanidae)","authors":"Jiang-Li Tan, Xu-Lei Fan, Cornelis van Achterberg, Tao Li","author_ids":"4167755, 4887718, 5049533, 1726351","abstract":"The genus Pseudomegischus van Achterberg, 2002, is newly reported from China. A new species, Pseudomegischus notiochinensis sp. n., is described and illustrated from southern China. A key to the species of Pseudomegischus is included.","cites":"0","conferencePercentile":"36.11111111"},{"venue":"ZooKeys","id":"46d3e3c768b5e9a5b2504aa0306dc3d7d197e4af","venue_1":"ZooKeys","year":"2014","title":"A taxonomic revision of Limnobaris Bedel in the strict sense (Coleoptera, Curculionidae, Baridinae), with particular emphasis on the species found in China","authors":"Jens Prena, Boris Korotyaev, Zhiliang Wang, Li Ren, Ning Liu, Runzhi Zhang","author_ids":"8342870, 6975140, 1735991, 3207163, 1680152, 6714580","abstract":"The genus name Limnobaris Bedel is applied in a restricted sense to baridine weevils with a covered pygidium and non-prominent, decussate mandibles which occur on sedges in the Palaearctic Region and immediately adjacent parts of tropical Southeast Asia. Calyptopygus Marshall and Pertorcus Voss are syn. n. of Limnobaris. Some species from Africa and the Americas are maintained provisionally in Limnobaris in the widest sense but will need to be transferred to other genera in future studies. A total of eleven species is recognized in Asia, two of which are widespread and occur also in the Western Palaearctic Region. Limnobaris martensi Korotyaev sp. n. is described from Nepal. Pertorcus tibialis basalis Voss is raised to species rank, as L. basalis (stat. prom.). New or reestablished synonyms are L. dolorosa (Goeze) (= L. jucunda Reitter, = L. koltzei Reitter), L. tibialis (Voss) (= Pertorcus tibialis pilifer Voss) and L. t-album (Linnaeus) (= L. bedeli Reitter, = Baridius crocopelmus Gyllenhal, = L. sahlbergi Reitter, = L. scutellaris Reitter, = Baris t-album sculpturata Faust). Calandra uniseriata Dufour is considered a junior synonym of Sitophilus oryzae (L.) (syn. n.). A key for identification and a distribution map are provided.","cites":"0","conferencePercentile":"31.57389635"},{"venue":"ZooKeys","id":"8661dd105bda9971cc1e2836a4492f34573991ef","venue_1":"ZooKeys","year":"2016","title":"Fangumellus\nflavobadius: a new genus and species of plant bug from Laos (Heteroptera, Miridae, Mirinae, Mirini)","authors":"Tomohide Yasunaga, Minsuk Oh, Seunghwan Lee","author_ids":"6530049, 8417569, 2934977","abstract":"A new species of the plant bug tribe Mirini representing a new genus, Fangumellus flavobadius, is described from Laos. This genus is characterized primarily by the medium-sized, ovoid, tumid body, less shiny, roughened, almost impunctate dorsal surface, short antenna and labium, short pygophore, and atypical shape of parameres and endosoma. The phylogenetic relationship to other known mirine genera is also discussed.","cites":"0","conferencePercentile":"44.35146444"},{"venue":"ZooKeys","id":"244a0583d793152cc8635b1002d6266334deb5f2","venue_1":"ZooKeys","year":"2016","title":"Six new species of the spider genus Spiricoelotes species (Araneae, Agelenidae) from caves in Jiangxi, China","authors":"Lu Chen, Zhe Zhao, Shuqiang Li","author_ids":"1745299, 2750850, 8087046","abstract":"Six new species of the spider genus Spiricoelotes Wang, 2002 are described, Spiricoelotes anshiensis Chen & Li, sp. n. (♂♀), Spiricoelotes chufengensis Chen & Li, sp. n. (♂♀), Spiricoelotes nansheensis Chen & Li, sp. n. (♂♀), Spiricoelotes taipingensis Chen & Li, sp. n. (♂♀), Spiricoelotes xianheensis Chen & Li, sp. n. (♂♀) and Spiricoelotes xiongxinensis Chen & Li, sp. n. (♀). All new species were collected from caves in Jiangxi Province, China.","cites":"2","conferencePercentile":"97.48953975"}]}