{"Zoological_science.csv":[{"venue":"Zoological science","id":"68cf13c64d30f80ff81447830f86977a3b7c42e1","venue_1":"Zoological science","year":"2004","title":"Development of gonadotropes in the chicken embryonic pituitary gland.","authors":"Yoko Maseki, Kazuaki Nakamura, Atsushi Iwasawa, Jun Zheng, Kinji Inoue, Takafumi Sakai","author_ids":"6031792, 8320737, 6415044, 1737694, 3768031, 6010750","abstract":"Although a number of immunohistochemical studies have been carried out on the differentiation of chicken gonadotropes during embryogenesis, the temporal and spatial properties of appearance of gonadotropes are not clear. In this study, we studied the appearance and morphological characteristics of gonadotropes in the embryonic and adult chicken anterior pituitary glands using RT-PCR, in situ hybridization and immunohistochemistry. For this purpose, we raised specific antisera against chicken follicle-stimulating hormone beta-subunit (cFSHbeta) and chicken luteinizing hormone beta-subunit (cLHbeta) based on each putative amino acid sequence. RT-PCR analysis revealed that cFSHbeta mRNA was expressed from embryonic day 7 (E7). Chicken FSHbeta mRNA-expressing (-ex) and -immunopositive (-ip) cells started to appear in the ventral part of the caudal lobe in the anterior pituitary gland at E8. Chicken LHbeta-ip cells were also first observed there at E8, but cLH mRNA expression was confirmed from E4 by RT-PCR analysis. The distribution of these chicken gonadotropin-ex and -ip cells spread from the ventral part to dorsal part in the caudal lobe around E10 and subsequently expanded to the cephalic lobe from E12 to E20. These cells were morphologically classified into two types (round- and club-shaped cells). It was found that the density of gonadotropin-ip cells in the caudal lobe was always higher than that in the cephalic lobe throughout the period of development. To the best of our knowledge, this is the first report focusing on the differentiation of chicken gonadotropes by assessment of both protein and mRNA of chicken gonadotropin.","cites":"5","conferencePercentile":"85"},{"venue":"Zoological science","id":"b92e46f3950babcdbcccbf3e2c6ff4e52a05807a","venue_1":"Zoological science","year":"2010","title":"Sexual size dimorphism and sex identification using morphological traits of two Aegithalidae species.","authors":"Jianqiang Li, Ning Wang, Yong Wang, Songtao Lin, Qi Li, Ying-Ying Liu, Xiangfeng Ruan, Jiagui Zhu, Bo Xi, Zheng-Wang Zhang","author_ids":"8550203, 1692369, 7134629, 8600799, 1682467, 7895807, 5954997, 6391444, 4615399, 6878898","abstract":"The black-throated tit, Aegithalos concinnus, and long-tailed tit, A. caudatus, are two widely-distributed species of Aegithalidae. They are thought to be monomorphic and thus difficult to differentiate between sexes in the field. We determined the sex of 296 black-throated tits and 129 long-tailed tits using DNA analysis, evaluated their sexual size dimorphism, and developed discriminant models to identify sex based on morphometries, including bill length, bill depth, bill-head length, maximum tarsus length, tarsus width, wing length, tail length, total body length, and body mass. Both species were sexually dimorphic in size, with males having larger measurements than females, except for bill length in black-throated tits, and both bill length and body mass in long-tailed tits. Moreover, both species showed similar sexual size dimorphism (SSD) among the morphological features, with tail length having the highest SSD value. The multivariate discriminant models for sex identification had an accuracy of 82% for both species, which was slightly higher than the best univariate discriminatory model for each species. Because of the complicated nature of the multivariate model, we recommend univariate models for sex identification using D = 0.491 × tail length - 24.498 (accuracy 80%) for black-throated tits and D = 0.807 × wing length - 45.934 (accuracy 78%) for long-tailed tits. Females in both species showed generally higher morphological variation than did males, resulting in lower accuracies in all discriminate functions regardless of univariate or multivariate approach. This could be the result of a sex-biased selective pressure in which males have higher selective pressures for these morphological features.","cites":"3","conferencePercentile":"87.5"},{"venue":"Zoological science","id":"315eb2c242b292cd9a76bd55869423b4ad7ecc14","venue_1":"Zoological science","year":"2013","title":"Morphological variation among wild populations of Chinese rare minnow (Gobiocypris rarus): deciphering the role of evolutionary processes.","authors":"Yongfeng He, Rui Li, Jianwei Wang, Simon Blanchet, Sovan Lek","author_ids":"7737758, 1704992, 7897719, 3758871, 3161338","abstract":"Gobiocypris rarus Ye et Fu ( 1983 ) is an endemic cyprinid fish in China, and is considered to be an endangered species. From a conservation perspective, its population structure is interesting. In the present study, morphological variation, including morphometric and meristic traits, was assessed among wild samples collected in the upper Yangtze River basin. There were no significant meristic differences between sexes or among populations, except for scales in lateral line (LS). However, there were significant morphometric differences not only between sexes but also among populations. In discriminant function analysis, the first four discriminant functions explained 75.5% and 78% of the among-population morphometric variation for males and females, respectively. Almost all the truss network morphometric traits significantly contributed to population discrimination. By using all of the truss network morphometric traits, overall random assignments of male and female individuals into their original population were both 73.5%. In addition, the degree of differentiation in phenotypic traits (PST) significantly exceeds that in neutral molecular markers (FST). However, no significant correlation between PST and FST was found in males or females. Overall, these results suggest that two evolutionary processes, including phenotypic plasticity and natural selection, may contribute to the morphological patterns observed in G. rarus.","cites":"0","conferencePercentile":"25.6097561"},{"venue":"Zoological science","id":"4787d6b011913343ddbf124c5cc94b2a724da95c","venue_1":"Zoological science","year":"2002","title":"Intensity of larval diapause in the bamboo borer, Omphisa fuscidentalis.","authors":"Tippawan Singtripop, Jatuporn Tungjitwitayakul, Sho Sakurai","author_ids":"5166257, 5521659, 1696545","abstract":"Larvae of the bamboo borer, Omphisa fuscidentalis, enter larval diapause in September and pupate in the following June (Singtripop et al., 1999). We examined the changes in the responses of larvae to exogenous 20-hydroxyecdysone (20E) in order to estimate the progress of diapause development. In this respect, we adopted two terms, responsiveness and sensitivity of larvae to 20E. Responsiveness was estimated by the percentage of larvae that pupated, and sensitivity was evaluated by the duration from the day of 20E injection to pupation. The responsiveness of larvae declined gradually from September to November when larvae were least responsive to 20E, and then increased markedly from January to February. This indicates that the intensity of diapause increases from September to November and terminated gradually thereafter. Thus the sequence of events as the larval responses to 20E is characterized by a V-shaped curve. Sensitivity of larvae to 20E was at the same level from September to December, and increased remarkably from December to January. The abrupt increase in the sensitivity occurred one month earlier than the bottom of the V-shaped curve of larval responsiveness, suggesting that the increases in the responsiveness and sensitivity in the latter half of diapause may be brought about by respective mechanisms.","cites":"0","conferencePercentile":"7.446808511"},{"venue":"Zoological science","id":"0295974f203ea8e03051a9712510f08833697f85","venue_1":"Zoological science","year":"2006","title":"A rapid increase in cAMP in response to 20-hydroxyecdysone in the anterior silk glands of the silkworm, Bombyx mori.","authors":"Mohamed Elmogy, Jun Terashima, Masatoshi Iga, Masafumi Iwami, Sho Sakurai","author_ids":"3614253, 5942669, 3828842, 4443043, 1696545","abstract":"In the anterior silk glands (ASGs) of the silkworm, Bombyx mori, intracellular cAMP increases transiently to a very high level shortly after the hemolymph ecdysteroid peak in the prepupal period. In cultured ASGs obtained on the day of gut-purge, cAMP levels were increased by 20-hydroxyecdysone (20E), and this increase was enhanced by an inhibitor of phosphodiesterase, but was not affected by alpha-amanitin, indicating the 20E action may not be mediated via gene expression. The increase in cAMP occurred within 30 seconds of exposure to a physiological concentration of 20E (1 microM), and also by ponasterone A. Our findings indicate a nongenomic action of ecdysteroids in insects, which may be an additional mechanism by which this steroid hormone induces acute responses in tissues and cells.","cites":"0","conferencePercentile":"16.66666667"}]}