{"Zootaxa.csv":[{"venue":"Zootaxa","id":"96a4f793850269cf0753b272e86ec0cbb44dc853","venue_1":"Zootaxa","year":"2014","title":"Rhodeus albomarginatus, a new bitterling (Teleostei: Cyprinidae: Acheilognathinae) from China.","authors":"Fan Li, Ryoichi Arai","author_ids":"1706783, 2597238","abstract":"Rhodeus albomarginatus, new species, is described from the Lvjiang River, a tributary flowing into Poyang Lake of Yangtze River basin, in Anhui Province, China. It is distinguished from all congeneric species by unique combination of characters: branched dorsal-fin rays 10; branched anal-fin rays 10-11; longest simple rays of dorsal and anal fins strong and stiff, distally segmented; pelvic fin rays i 6; longitudinal scale series 34-36; transverse scale series 11; pored scales 4-7; vertebrae 33-34; colour pattern of adult males (iris black, belly reddish-orange, central part of caudal fin red, dorsal and anal fins of males edged with white margin).","cites":"1","conferencePercentile":"81.76691729"},{"venue":"Zootaxa","id":"52797b5dea71eebdeb2d21b90f666f470ba09d94","venue_1":"Zootaxa","year":"2015","title":"Three new species of the genus Conophyma Zubovsky, 1898 (Orthoptera, Acridoidea, Catantopidae, Conophyminae) from Xinjiang, China.","authors":"Yu-Long Zhang, Qiang Xu, Dao-Chuan Zhang","author_ids":"7550604, 1693462, 4813600","abstract":"Three new species of the genus Conophyma Zobovsky, 1898 from Xinjiang, West China are described in this paper. The Conophyma xiai sp. nov. is similar to C. olive Huang, 2006, but differs from latter by: vertical diameter of eyes 1.7 times subocular furrow, minimum width of interspace of mesosternum 1.6 times length, hind tibia yellow and furculae smaller. The new species Conophyma nigrifemora sp. nov. is similar to C. xiai sp. nov., but differs from latter by: vertex of head longer, apex narrower; posterior margin of pronotum straight; minimum width 1.6 times its length in interspace of mesosternum; posterior margin of epiproct with curve projection in the middle; epiphallus almost straight on the lower margin, The new species Conophyma hejinensis sp. nov. is similar to C. rufitibia Li & Ti, 1995, but differs from latter by: anterior and posterior margin of pronotum excised in the middle, minimum width of interspace of mesosternum 1.2 times length, hind tibia yellow and posterior margin of epiproct straight, with acute projection in the middle. Type specimens are deposited in the Natural Museum of Hebei University, Baoding, Hebei, China.","cites":"0","conferencePercentile":"42.39130435"},{"venue":"Zootaxa","id":"2e231b010404d19305474106445087e1ec807829","venue_1":"Zootaxa","year":"2016","title":"The advertisement calls of <i>Quasipaa</i> <i>shini</i> (Ahl, 1930) (Anura: Dicroglossidae).","authors":"Shen Shen Kong, Rong Quan Zheng, Qi Peng Zhang","author_ids":"8468316, 3647337, 1731122","abstract":"The genus Quasipaa (Family Dicroglossidae) is currently composed of 11 species distributed in China and Southeast Asia: Quasipaa acanthophora (Dubois & Ohler 2009), Q. boulengeri (Günther 1889), Q. courtoisi (Angel 1922), Q. delacouri (Angel 1928), Q. exilispinosa (Liu & Hu, 1975), Q. fasciculispina (Inger 1970), Q. jiulongensis (Huang & Liu, 1985), Q. shini (Ahl 1930), Q. spinosa (David 1875), Q. verrucospinosa (Bourret 1937), Q. yei (Chen, Qu & Jiang 2002) (Frost 2016). These species are morphologically similar, and their taxonomy is subject to controversy (Che et al. 2009). Analyses of nuclear and mitochondrial genes suggest the genus likely encompass additional cryptic species (Ye et al. 2013). Bioacoustics has contributed to studies on the taxonomy of the genus (Ye et al. 2013; Shen et al. 2015), however, to date, only the advertisement calls of Q. spinosa are known (Yu & Zheng 2009; Chen et al. 2012; Shen et al. 2015). Here, we describe the advertisement calls of Q. shini, which inhabits streams in the southern part of central China(Guizhou, Hunan, Guangxi and Jiangxi) and is characterized by the presence of keratinized skin spines on the lateral surfaces of the body.","cites":"0","conferencePercentile":"48.85245902"},{"venue":"Zootaxa","id":"fcd4373fb366441ccfa9e5838fe720141776ced5","venue_1":"Zootaxa","year":"2013","title":"A new oviraptorid (Dinosauria: Theropoda) from the Upper Cretaceous of southern China.","authors":"Shuo Wang, Chengkai Sun, Corwin Sullivan, Xing Xu","author_ids":"5994097, 3700177, 6880728, 1776453","abstract":"This paper describes a new oviraptorid dinosaur taxon, Ganzhousaurus nankangensis gen. et sp. nov., based on a specimen collected from the Upper Cretaceous Nanxiong Formation of Nankang County, Ganzhou City, Jiangxi Province, southern China. This new taxon is distinguishable from other oviraptorids based on the following unique combination of primitive and derived features: relatively shallow dentary; absence of fossa or pneumatopore on lateral surface of dentary; weakly downturned anterior mandibular end; shallow depression immediately surrounding anterior margin of external mandibular fenestra; external mandibular fenestra subdivided by anterior process of surangular; dentary posteroventral process slightly twisted and positioned on mandibular ventrolateral surface; shallow longitudinal groove along medial surface of dentary posteroventral process; angular anterior process wider transversely than deep dorsoventrally; sharp groove along ventrolateral surface of angular anterior process; ventral border of external mandibular fenestra formed mainly by angular; ventral flange along distal half of metatarsal II; and arctometatarsal condition absent. Phylogenetic analysis places Ganzhousaurus nankangensis gen. et sp. nov. in the clade Oviraptoridae, together with Oviraptor, Citipati, Rinchenia and the unnamed Zamyn Khondt oviraptorid.","cites":"6","conferencePercentile":"99.32795699"},{"venue":"Zootaxa","id":"89fefa88d54e2502a110bed83e751378c5bb9cb5","venue_1":"Zootaxa","year":"2014","title":"Four Pseudopoda species (Araneae: Sparassidae) from Southern China.","authors":"Dan Quan, Yang Zhong, Jie Liu","author_ids":"8014935, 1684539, 1699746","abstract":"Four species of the genus Pseudopoda are recorded from southern China. Three new species are described: Pseudopoda bicruris sp. nov. (male, female; Hainan Province), Pseudopoda mediana sp. nov. (male, female; Hainan Province), Pseudopoda tiantangensis sp. nov. (male, female; Hubei Province). The female of Pseudopoda lushanensis (Wang, 1990) from Jiangxi Province is described for the first time.","cites":"1","conferencePercentile":"81.76691729"}]}