{"Zygote.csv":[{"venue":"Zygote","id":"88be6e9835595526b06287c3361a4eb7dd181047","venue_1":"Zygote","year":"2016","title":"ING2 (inhibitor of growth protein-2) plays a crucial role in preimplantation development","authors":"Lin Zhou, Pei Wang, Juanjuan Zhang, Boon Chin Heng, Guo Qing Tong","author_ids":"2684534, 1701285, 1750386, 6797325, 4689818","abstract":"ING2 (inhibitor of growth protein-2) is a member of the ING-gene family and participates in diverse cellular processes involving tumor suppression, DNA repair, cell cycle regulation, and cellular senescence. As a subunit of the Sin3 histone deacetylase complex co-repressor complex, ING2 binds to H3K4me3 to regulate chromatin modification and gene expression. Additionally, ING2 recruits histone methyltransferase (HMT) activity for gene repression, which is independent of the HDAC class I or II pathway. However, the physiological function of ING2 in mouse preimplantation embryo development has not yet been characterized previously. The expression, localization and function of ING2 during preimplantation development were investigated in this study. We showed increasing expression of ING2 within the nucleus from the 4-cell embryo stage onwards; and that down-regulation of ING2 expression by endoribonuclease-prepared small interfering RNA (esiRNA) microinjection results in developmental arrest during the morula to blastocyst transition. Embryonic cells microinjected with ING2-specific esiRNA exhibited decreased blastulation rate compared to the negative control. Further investigation of the underlying mechanism indicated that down-regulation of ING2 significantly increased expression of p21, whilst decreasing expression of HDAC1. These results suggest that ING2 may play a crucial role in the process of preimplantation embryo development through chromatin regulation.","cites":"0","conferencePercentile":"60"},{"venue":"Zygote","id":"ecf7dfbbd89a898c065f501883b47db0e9940ef8","venue_1":"Zygote","year":"2012","title":"Effect of age, GV transfer and modified nucleocytoplasmic ratio on PKCα in mouse oocytes and early embryos.","authors":"Long-Bo Cui, Zhen-Jun Zhao, Xue-Ying Zhou, Qian Li, Xiu-Ying Huang, Fang-Zhen Sun","author_ids":"6584284, 8420097, 8454169, 7137586, 5764255, 7447871","abstract":"Protein kinase C (PKC) is a family of Ser/Thr protein kinases that can be activated by Ca2+, phospholipid and diacylglycerol. There is evidence that PKC plays key roles in the meiotic maturation and activation of mammalian oocytes. The present study aimed to monitor the effect of age, germinal vesicle (GV) transfer and modified nucleoplasmic ratio on the subcellular distribution profile of PKCα, an important isozyme of PKC, in mouse oocytes undergoing meiotic maturation and following egg activation. Germinal vesicle oocytes were collected from 6-8-week-old and 12-month-old mice. Germinal vesicle-reconstructed oocytes and GV oocytes with one-half or one-third of the original oocyte volume were created using micromanipulation and electrofusion. The subcellular localization of PKCα was detected by immunocytochemistry and laser confocal microscopy. Our study showed that PKCα had a similar location pattern in oocytes and early embryos from young and old mice. PKCα was localized evenly in ooplasm, with weak staining in GV at the GV stage, and present in the entire meiosis II (MII) spindle at the MII stage. In pronuclear and 2-cell embryos, PKCα was concentrated in the nucleus except for the nucleolus. After the GV oocytes were reconstructed, the resultant MII oocytes and embryos showed a similar distribution of PKCα between reconstructed and unreconstructed controls. After one-half or two-thirds of the cytoplasm was removed from the GV oocytes, PKCα still had a similar location pattern in MII oocytes and early embryos from the GV oocytes with modified nucleoplasmic ratio. Our study showed that age, GV transfer and modified nucleocytoplasmic ratio does not affect distribution of PKCα during mouse oocyte maturation, activation, and early embryonic mitosis.","cites":"0","conferencePercentile":"66.66666667"}]}